[{"text": "Hi Bold Bakers! It&#39;s time to make a souffle with confidence! Get the written recipe here: <a href=\"http://bit.ly/SimpleChocolateSouffle\">http://bit.ly/SimpleChocolateSouffle</a>"}, {"text": "Can&#39;t we use baking powder instead of cream of tartar?"}, {"text": "I want to make it but I don&#39;t have beater 😢..love it as usual,.. blessings from Pakistan"}, {"text": "that so yummy 🤤❤ u should also try to make mochi ice cream u are da best   gemma!!😚❤"}, {"text": "Thank you for this!! I suddenly feel like I can do a chocolate souffle thanks to you and this video. I am giving this a try soon. Thanks for the encouragement and the all the tips you gave us for a successful souffle! :)"}, {"text": "A posh dessert 🍮 well explained. <br />Great Job"}, {"text": "ياريد ترجمة يوجد عرب يتابع الطبخ"}, {"text": "You need to make more microwave recipes! There amazing I still make them after 4 years! Please make more!"}, {"text": "Gemma, I&#39;ve been watching Bigger Bolder Baking for over three years now. You and your videos have inspired me to finally pursue my dream and study baking and pastry making."}, {"text": "Could you also mention the gas mark   grade for your recipes?"}, {"text": "I have a question ... I always thought that using a whisk would incorporate the egg whites a lot better ... since whisks naturally have gaps in them which should allow easy movement of egg whites and wont exactly knock out the air in the meringue .... or it may even add more air <br /><br />Is they concept wrong? And if so can someone tell me why? :0"}, {"text": "What can I use instead  of ramekins ?"}, {"text": "Can a souffle be made without eggs..?? And baked..??"}, {"text": "can i substitute the cream of tartar with baking powder as it too contains cream of tartar and it will help my souffle rise"}, {"text": "Chocolate soufflé is my FAVORITE dessert!!! 😍I&#39;m totally gonna try to make it💛💛💛"}, {"text": "Totally mind blowing <br />Hats off Gemma"}, {"text": "I&#39;ve not tried a souffle recipe. I will now! Thank you, Gemma!"}, {"text": "Is Eggless soufle possible?"}, {"text": "Would love to see you make a solid flourless chocolate cake :)"}, {"text": "Gemma you made everything so magical .... Girlll just tell me the secret .. love your recipes Plz Make starbuck unicorn frappucino and make Oreo Choco frappucino bcz you make everything solo magically"}, {"text": "Hi Gemma Stafford!!! Sorry I&#39;m late! I am 12 years old. My name is Mandy. I have recently discovered that baking is my passion!! You have inspired me so much!! I have decided I want to go to culinary school when I am older. I know I already said this but you have inspired me sooo much. I am so incredibly grateful! Thank you so much!!"}, {"text": "Souffle is one of my favourite things."}, {"text": "This is definitely a recipe that needs a video to help. Thanks!"}, {"text": "I really like your hair Gemma!"}, {"text": "More mug meals please...."}, {"text": "I tried souffle 4 times but never came out perfectly but next time I am gonna nail it with your recipe."}, {"text": "Wauuuu, it looks so fluffy and delicious, thank You for recipe. 😊😊😊"}, {"text": "I love it when you do the edge cleaning with your fingers... natural 👍🏼"}, {"text": "Can easilynotice the pregnancy glow on your face! Hope everythings great !"}, {"text": "Thank you Gemma!!!!!!"}, {"text": "Hey gemma ...🙂"}, {"text": "Is it possible to make souffle in microwave?"}, {"text": "When I want to make chocolate soufflès few weeks ago, I searched the recipe on your youtube channel and there&#39;s none so I haven&#39;t been making it cause I just cannot trust someone else&#39;s recipe. When I make any dessert I need more explanation and science behind it and TADA! You uploaded the video today! I&#39;m so happy! Thank you Gemma and congrats to you and your husband, both of you will be parents to your beautiful child😍"}, {"text": "i haven’t watched in a while i gotta catch up😂✨"}, {"text": "thank you for sharing I&#39;m going to try this one soon"}, {"text": "Hi Gemma, first of all congratulations on your pregnancy I can’t wait to meet the little bold baker sue chef 😍 I love these soufflés, they can be intimidating to make but they’re not that hard. thank you they look amazing 💖"}, {"text": "Hi Gemma, is it possible to double this recipe and bake in one larger dish?"}, {"text": "Hi Gemma I am an Egyptian YouTuber and I big fan I have tried many recipes for you and the results every time is amazing so I wanna to thank you for that and finally I am for a country called dammita it&#39;s a pupler with oriantel dessert and I&#39;d love to share some of our oriantel dessert recipes like basbousa our kounfa"}, {"text": "Can I use semi sweet chocolate chip from ghirardelli or it has to be a block and be chopped and for the meringue I know you said cream of tartar can’t be replace but my question is it like a meringue that you will fold to your chocolate I do my meringue with drops of lemon will it work the same or it’s not like a meringeu"}, {"text": "It&#39;s much like the recipe I use for french mousse, only this is baked and has more ingredients.  Going to have to give it a shot sometime soon. =)"}, {"text": "Hi gemma, have tried all of your eggless recipes,  what can be substituted for eggs in this one? Please make some more eggless recipes ... love from Australia"}, {"text": "I have been looking for a soufflé recipe.. thank you..<br />Could you also do a plain one or with other combinations..<br />Loved it"}, {"text": "What are different ways to butter a Ramekin?"}, {"text": "Thank you! Finally a souffle recipe! I am going to try this weekend."}, {"text": "That’s some delicious recipe. I’m a chocolate lover and it’s really good"}, {"text": "This souffle looks like  chocolate heaven  Gemma :) Beautiful job♡"}, {"text": "woow very nice keep going sister🌹🌹🌹👍👍👍👍👍😂😎💃💃💃"}, {"text": "You have a way of making everything look easy. Thank you for sharing."}, {"text": "Hey gemma, thanks for sharing such great recipes and tips with us. Can you make more dessert recipes for two?? The thing is I live with just my husband and he isn&#39;t much of a desserts person and usually diving the recipe doesn&#39;t work or it still is too much. so I need to make desserts for EXACTLY two people. <br />Appreciate the effort, thanks you so much❤❤"}, {"text": "You can squeeze a bit of lemon or put some vinegar instead of using cream of tartar because you our cream or tartar because it is a type of acid and acids help stabilise egg whites and vinegar and lemon juice are trees of acids. Unlike what she said you could also just skip it."}, {"text": "Your way of explanation is amazing. Love your video"}, {"text": "I don&#39;t even eggs and I watched the whole video cz you are amazing ❣️"}, {"text": "Omg!!!! I felt so tensed watching this &quot;SIMPLIFIED&quot; recipe.... which nothing&#39;s simple yet everything&#39;s important.... 😰😰😰"}, {"text": "can we make it in a microwave? and if can so for how long we have to cook it?"}, {"text": "ΤΈΛΕΙΟ γλυκό!!!!!!!!.👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍♥️♥️♥️🇬🇷🇬🇷🇬🇷"}, {"text": "Lookss soooo yummy 😋"}, {"text": "Gemma could you show us how to make a basic vanilla mousse? It is surprisingly difficult to find a good basic recipe, please and thank you!"}, {"text": "Gemma, You totally read my mind, I was just thinking I would like to make a souffle and I opened youtube and voila! Your video popped up before I even had to type anything....Thanks so much for posting this recipe :)"}, {"text": "Looks so delicious definitely going to try this!!!"}, {"text": "Hi Gemma! I had this idea that I think might be pretty cool!<br />What if you make a Frankendessert!<br />Like you mix a lot of desserts together <br />For example mix icecream cake and sweet pastry! <br />I&#39;d love to see how it turns out and then you could figure out some good names for the desserts !<br />Hope you&#39;ll try it love ya ♥️"}, {"text": "I want to eat souffle someday❤"}, {"text": "can i melt the chocolate first  and then throw it in the micture"}, {"text": "Hi Gemma thankyou for these yummy souffles will definitely make em . Can you make some low carb healty desserts with stevia . Thanks in advance love you."}, {"text": "It looks so amazing Gemma!! Do you have a video for Chocolate Lava cake? Always wanted to try it out."}, {"text": "Hi, Gemma, I know in this video you mention that the soufflés can be prepared up to an hour before baking; I am wondering what would happen if they were prepared and then immediately frozen?  I realize they would need to be defrosted to room temperature before baking.  Thank you for your wonderful recipes.  Even though I am an adventurous home cook and baker for more than 40 years, I still learn great tips and tricks from your videos!"}, {"text": "Great. Thank you gemma."}, {"text": "Can you make a simplified drip or mirror glaze cake?"}, {"text": "<b>PREGNANT GEMMA</b>"}, {"text": "I never tasted soufflé before"}, {"text": "It looks amazing. Will try this soon"}, {"text": "My gourmet chef-mother was a wizard with classic French souffles. Her carrot souffles were near-legends. However, there was so much fuss surrounding them that I ended up hating the things. <br /><br />While her delicate souffles were baking, no one could move in the house and risk them collapsing. Anyone who slammed a door or drawer or dropped heavy items was dead. I prefer an easy chocolate mousse."}, {"text": "❤️❤️❤️"}, {"text": "I always thought that lemon juice and vinegar , are suitable substitutes for cream of tartar !"}, {"text": "Looks beautiful, Gemma!!"}, {"text": "Soo easy 👏👏👏"}, {"text": "I never make a souffle! Yours the looks so yummy and tasty! Thak you Gemma! Have a nice day! 👍👏🍫🍫🍫"}, {"text": "Dear Gemma:  thanks for sharing this recipe, looks great!  One quick question, can this dessert be make with white chocolate?"}, {"text": "I never tried to make a chocolate soufflé, but only a cheese soufflé. Yours is not difficult to do and il looks amazing. 👍😉<br />Bravissima Gemma 😘😍👏👏👏🍼👶"}, {"text": "Hi Gemma, you have done it again!🤗 you have taken something I thought I would never even attempt to bake and made me feel as if I could achieve it! These souffles look so lovely. I think I could Dazzle family and friends at any dinner if I served these for dessert. Thank you so much Gemma👩‍🍳💕💕. I hope you are feeling well🙋‍♀️🤰💕💕"}, {"text": "Can you please tell me pineapple souffle recipe? I will tell you my recipe but I want you to check it. Is there any better recipe or any change in this recipe to make a perfect pineapple souffle?<br />whip cream    2 sachets<br />kiri cheese     6 cubes<br />sugar             2 tablespoons<br />pineapple jelly 1 packet dissolved in one cup of water<br />milk          1 cup<br />pineapple can   567gm with syrup<br />Mix all the ingredients and refrigerate until firm."}, {"text": "Excellent recipe.  I will try."}, {"text": "Hey Gemma.<br />Love ur recipes, wud u mind putting measurements, especially wen it comes to da salt n sugar ratio."}, {"text": "Ma&#39;am what the alternative of cream of tartar??  Please reply"}, {"text": "Hi Gemma.  Lovely recipe. This was uploaded at the right time as I just had a souffle fiasco 2 days ago.  Just a doubt, can we use cocoa powder instead of chocolate? Thank you."}, {"text": "Thanks 🙏"}, {"text": "Wowww looking very very delicious ..your are amazing 👍"}, {"text": "you are the best baker because you make all the food amazing. Thankyou!"}, {"text": "Congratulations on the new addition"}, {"text": "this one rocks too like all of your other recipes. Brilliant job😄"}, {"text": "hi, the idea behind the souffle, as far as i know, is that in the inside it is like a lava. i didnt see it in your souffle.... now i am confused..."}, {"text": "Great video as usual..😍😍"}, {"text": "Link for ramekins?  Thanks !!"}, {"text": "Can I coat the ramekins with cocoa powder or flour instead of sugar?"}, {"text": "Hi Gemma ☺️👍 Lovely n Yummy ☺️👍 Your Minor Tips  Makes Souffle to Next Level 👍 Have a Lovely Day ☺️"}, {"text": "Hi Gemma !!"}, {"text": "Oh wow. Now I willt try these with my mom. I love souffle! It&#39;s my fav sweet dish. Thanks a lot!"}, {"text": "Amazing !!!"}, {"text": "Hey Gemma I think you remember mee <b>little bolder backer🤗🤗</b> all the way from India🇮🇳🇮🇳🇮🇳.SHRISHTI. YOUR RECIPE IS SOOOOO AWESOMEEEEEE.<br />LOVE FROM INDIA🇮🇳🇮🇳🇮🇳💖💖💖💖"}, {"text": "Wow! I think is just like making lava cake. I love lava cakes too. Taste sweet n fluffy souffle. Great recipe. See u next time."}, {"text": "Any substitute for eggs plz?"}, {"text": "Chocolate souffle<br />Would you be so kind is to tell me the ingredients for this recipe"}, {"text": "I love your simplifying certain recipes. I made your chocolate cake it was gone quickly!!!!"}, {"text": "Hi Gemma!!<br />I had ordered your cookbook and it got delivered yesterday and I already love it!! I can&#39;t wait to try recipes from the book as well as this souffle!!"}, {"text": "I&#39;m first for the first time in my life.....😊😊"}, {"text": "The video I have been waiting for!!! I can finally try it."}, {"text": "Never tried! Will do for sure because if there is anyone i trust with anything food, its you😂"}, {"text": "I&#39;m going to try this recipe today itself 😍"}, {"text": "Hi beautiful Gemma!! ❤️❤️❤️"}, {"text": "Hi, Gemma. Your souffle looks beautiful, just like you, my dear friend. You look like Judy Garland mixed with Lori Loughlin a little bit. What did you enjoy about making souffle? I love you so much, sweetie. &lt;3"}, {"text": "FIRST! Love you, Gemma!"}]