[{"text": "Yummerssss..thanks for sharing love , just in time for Christmas....May God bless"}, {"text": "Looks so yumyum"}, {"text": "You bla bla bla waoo"}, {"text": "Please slowdown!! No only for people English lenguaje?? Gracias 😊"}, {"text": "😮omg you Tolkien to faster"}, {"text": "Mam for this recipe can i use homemade cream cheese which u had posted a video  ?"}, {"text": "The prophecy was true,2 of the best cakes mixed together but what about ice cream on top,it will truly become the best cake in history"}, {"text": "Is there a substite for the Cream? As I dont have it on hand at the moment"}, {"text": "I was considering making this for a party, but I fear that I’d eat it all on my own so I’m reconsidering 😜😜😜"}, {"text": "love the videos and recipes! so addicting to watch. currently binge watching them! 🧁🎂🤪"}, {"text": "Hi Gemma<br />Could we use nestle caramel sauce for this &amp; are you aware if it would ruin the taste? Thanks"}, {"text": "Gemma please please show us how to transfer a cheesecake from the springform base to a plate. I&#39;m afraid it might break!"}, {"text": "I bashed up crispy egg rolls and I added in a splash of fruit juice and it worked as a pie or cheesecake crust.<br />Consistency: PERFECT<br />TASTE: PERFECT"}, {"text": "Gemma were the almonds toasted and  salted"}, {"text": "Caramel is my all-time favourites."}, {"text": "Love!!!!!! I tried this with a little cinammon in the crust and it is amazing!!!!!!"}, {"text": "I copied the recipe and used 130g butter to 145g digestives as stated. My mixture came out soggy. Can you tell me is that what is meant to happen? As it looked nothing like yours on the video so now I’m confused :(("}, {"text": "😍😍😍😍😍😍😍😍😍😍"}, {"text": "Looks yummy"}, {"text": "Gemma, all your recipes work like magic! I&#39;m obsessed :0) You&#39;re amazing!"}, {"text": "Awww!!! It looks gorgeous! 😍 yummmyyy!!!!! 😋😋 thanks for the recipe 😀😀"}, {"text": "Love you gemma you&#39;re the best 😍"}, {"text": "Gemma i have made condensed milk today with your recipe n evaporated milk also both r awesome. condensed milk is soooo yummy i can&#39;t believe that i,have made it."}, {"text": "sooooo delicious really i must try it."}, {"text": "I made this two days ago and it is delicious. A small note - because I don&#39;t like cream cheese, I put 100 gr. less cream cheese (and replaced half of the other with mascarpone). I ended putting the whole 150 gr dulce de leche to make the cheese cake sweet enough. Which is to say that with the whole quantity of cream cheese, the cake probably would lack sweetness. Of course, I was too lazy to make the almond thing so I just used chopped walnuts for the crunchiness. So just saying, people, check the sweetness of your filling before pouring it in. Also, in my case, it ended up being a bit liquid, due to the missing cream cheese. But still it made for a spectacular desert and my bf loved it."}, {"text": "Hi Gemma.. just wanted to know if we can use Paneer or cottage cheese as an alternative to cream cheese?"}, {"text": "Hi Gemma. Which kind of heavy cream should I use. Whipped cream or cooking cream. I&#39;m from Suriname south America and I love watching ur episodes en try them"}, {"text": "Hi Gemma<br />When I was making the brittle on very low heat it was starting to form its shape but it was like the sugar would not get disolved and turned brown a I gave it so much stir but before it gets creamy I had to turn it off to not let it burn"}, {"text": "Can i replace half of the cookie crumbs with bread crumbs?"}, {"text": "Gemma i would b grateful to you If you make a video showing how to store a cheesecake for a week while preparing for a party in advance. Pls do help"}, {"text": "Gemma, I’m a big fan of your magical baking skills! I wanted to try this no-bake dulce de leche cheesecake recipe of yours but need an important advice regarding how can i store it if i make it ahead of an occasion?"}, {"text": "Gosh heaven"}, {"text": "I love your measuring spoons! Where did you find them? They are gorgeous!"}, {"text": "I love the simplicity. Thank you for sharing!"}, {"text": "If you have a nut allergy, use pretzles instead of nuts for the toffee center. It works out great!"}, {"text": "Would I be able to add gelatine to this? And if yes then how much? As I tried to make this cheesecake but the filling didn&#39;t set well and I left it in the fridge overnight"}, {"text": "My Peruvian mom is ashamed I don’t like dulce de Leche 😂 but I do enjoy a classic Peruvian style alfajores"}, {"text": "The cream you are using is whipping cream?<br />Thanks you!"}, {"text": "Which nozzle did u use?"}, {"text": "😍😋 this looks amazing! I wonder if a 1/4 tsp of xanthan gum would keep the texture? It would still be vegan"}, {"text": "Would the Carnation caramel in the tin work for this?"}, {"text": "Oooooo yummy would be fantastic with an Almond meal &amp; gluten free pretzel base!! Might try that :D"}, {"text": "You&#39;re videos are always amazing...I really like ur channel"}, {"text": "`wooooooow 😻😻👏!!!"}, {"text": "Hii !! Can you please make  No- bake honey biscuit cheese cake"}, {"text": "yummie yummie, i love the recipe!!!"}, {"text": "Please make no bake diabetic desserts"}, {"text": "Hi,I had a doubt regarding cream,u mentioned double cream rgt???is it k if I use fresh cream r shud I go for whipping cream???eagerly waiting for a reply to start off"}, {"text": "So delicious!!what can use instead of almond because my kids are allergic to all nuts...Thanks"}, {"text": "Hi. If I wish to add gelatine, at what stage do I add it?"}, {"text": "I&#39;d like to make this for a dinner party, but I need suggestions on what the OTHER people there could eat.  This one is alllllll mine!   Haha!"}, {"text": "+Gemma Stafford. I saw your videos in the past. They are absolutely amazing Gemma. Well done, and keep up the awesome videos. Happy new year from New Zealand. 👍"}, {"text": "Can you make a Red Velvet Cheesecake? ☺☺"}, {"text": "omg looks so amazing.  gemma can u substitute the cream for anything else? x"}, {"text": "Delicious yummy 👍🏻"}, {"text": "Make fruitcake for xmas pls"}, {"text": "Gemma hi can I make home made ice cream using food processor"}, {"text": "Yummy."}, {"text": "Amazing!!! I love your channel and all your ideas!! Greetings from Germany 😍😘"}, {"text": "I really wish you put measurements on your videos. I&#39;d make all our stuff if I didn&#39;t have to go to your website to get the info. It feels like you leave them out to drive up your website traffic."}, {"text": "best dulce de leche ive ever watched.thumbs up for this recipe"}, {"text": "Excellent mam"}, {"text": "Freeze it or refrigerate it?"}, {"text": "You are such an inspiration. definitely making this. Just wanted to know if the heavy cream in essential or I can skip it?"}, {"text": "U r magic"}, {"text": "I love this recipes, I made this caramel cheese cake twice my husband and I loves it, thank you so much for the video"}, {"text": "Whats Dulce de Lece?"}, {"text": "Hi Gemma. I made this yesterday. And today when l pull the tray out it was kind of set but not 100%. And after 5 mins off the fridge, everything melts off. Why is this happening. Can you help me? Why is it not setting? I used salted caramel sauce but it is thick like yours. :(("}, {"text": "I&#39;m currently making this with macadamia nuts😄"}, {"text": "NO more no bake cakes for me. it melted 10 min after I removed it from the fridge and looked awful"}, {"text": "wow! .....that is so yummy! thanks for sharing : )"}, {"text": "hi gemma! can you make a recipe with hershey&#39;s cookies and cream in it?"}, {"text": "hi gemma <br />this luks delicious 😏<br />but the thickness after u blended the cream mixtures wasnt thick as in the previous cheesecake videos... so will it set properly without gelatin?"}, {"text": "hey can i use homemade cream cheese"}, {"text": "I made this for a family gathering and IT WAS GONE IN A SECOND!!, my family loved it so much and they always ask me to make to again!!👍🏼💜 thank you Gemma for your AMAZING, OVER THE TOP, <b>BOLD</b> recipes!💯💜🙌🏼"}, {"text": "Can vanilla powder be used instead of extract?"}, {"text": "Why is gelatin used in cheesecakes?"}, {"text": "Looks good but really hard &gt;.&lt;"}, {"text": "Thank you so much Gemma for all the tips and idea&#39;s in baking😊 I always watching your video and I love it so much! thank you for inspiring us God bless👏💞"}, {"text": "I have a question; where does all the food go after you make it? You can&#39;t possibly eat everything all at once...(?) also how do you stay in shape with all that yummy food?"}, {"text": "do you think honeycomb would be good in the centre instead of the britle ??"}, {"text": "The brittle came out all grainy, like lumps of sugar on almonds..I&#39;ve tried 3 times already, even took the sugar butter off the stove earlier. :( love brittle as well. Gonna put honeycomb in the middle instead"}, {"text": "best best best...nom...nom"}, {"text": "Gemma I   loved all  your recipes😋 But  I request you to make a veg cake please"}, {"text": "Do we have to add salt?"}, {"text": "your recipes are amazing. Thank you for sharing them.💜"}, {"text": "hi did u use your homemade  cream cheese recipe can i use it in this cake ......"}, {"text": "hi did u use your homemade  cream cheese recipe can i use it in this cake ......"}, {"text": "hi is this the same ur homemade cream cheese plz need feed back <br />thanks u r wonderfull ..."}, {"text": "hi is this the same ur homemade cream cheese plz need feed back <br />thanks u r wonderfull ..."}, {"text": "please make pretzel"}, {"text": "please make pretzel"}, {"text": "Which brand of cream cheese have you used here? Is it spreadable kind?"}, {"text": "Is it possible to make a few recipes of baked cheesecake recipes?"}, {"text": "mmm i bet crispy bacon chopped would be a nice addition to the brittle layer!"}, {"text": "Hi chef, can you make a cake using rice cooker? 😄"}, {"text": "Hi. If i want it bake, what should i put in? just egg? thank you"}, {"text": "hey Gemma...will u male a snicker doodle ice cream that will be great"}, {"text": "i m surely gonna make this!!"}, {"text": "shud we put cheesecake in freezer overnight or in refrigerator?"}, {"text": "But you have not provided the exact quantity of all the ingredients"}, {"text": "Can I double this recipe to make a bigger cheesecake?"}, {"text": "hey gemma, i don&#39;t have access to cream cheese, what can i do? is fresh cheese or swiss cheese fine ?"}, {"text": "I made this with cheap caramel sauce and it was still delicious! I can&#39;t wait to try it again with dulce de leche because the flavor will be even better! I made it in three mini springform pans :) I stuggled with the almond brittle, I burnt it three times. The practice was good for me, but next time I plan to buy it so I don&#39;t waste so much ingredients, lol! Love you Gemma."}, {"text": "Make a mille feuille recipe please!"}, {"text": "gr8 recipe. Well Done (as always)!!!!! :p btw is dulce de leche different from caramel sauce"}, {"text": "can u plz make a red velvet cheesecake"}, {"text": "nice ur all videos or well done specially mugs meal"}, {"text": "I NEED TO MAKE THIS"}, {"text": "Hi Gemma, <br />I&#39;ve been watching your series of no bake cheesecakes videos 😋<br />May I ask if you are you using regular sugar or icing sugar? Also are you using regular cream or whipping cream?<br />Will there be any difference in result if I replace it to either of both?<br /><br />Thanks <br />Cherry"}, {"text": "once again your recipes have saved me! my baby sister asked me for a Carmel cheesecake for her birthday tomorrow, and I completely forgot to make it. so, panicking, I looked through YouTube for a no bake alternative, and of course you had me covered! this recipe is easy and looks fantastic, so basically you&#39;ve saved my head and have ensured my sister has her cake when she turns 20 ^-^ thank you and keep it up!!!"}, {"text": "I&#39;d love for u to make coconut custard pie"}, {"text": "i dont like brittle.Can i leave it out?"}, {"text": "any advice for a first time baker???????? let me know"}, {"text": "where can i find all your recipes?"}, {"text": "how did you get the caramel sauce?"}, {"text": "this could be a more prefect cheesecake"}, {"text": "this looks so AMAZING for sure this is good amazing for a girl who is craving sweets"}, {"text": "yet agai another amazing yummy cool outstanding cheesecake"}, {"text": "its look very deliciouse."}, {"text": "I love your measuring spoons!!! where can I find them?"}, {"text": "Can I add gelatin on it? 😊"}, {"text": "I&#39;m making this tomorrow. I&#39;m so excited!"}, {"text": "any chance I can use a reg baking dish than the one you recommend to use"}, {"text": "When I saw the thumbnail I thought &#39;um...Gemma I know you love thick bases but you&#39;ve gone too far"}, {"text": "I did this but instead I made your chocolate chip cookie base and instead of the brittle I used a layer of crushed up Oreos"}, {"text": "does it tast like dulce de leche?"}, {"text": "instead of pretzels can we put Oreo cookies"}, {"text": "I always have a doubt in it, the cream you poured in the cream cheese mix and the cream you topped the cake with, are they the same? If no then whats the recipe of the cream you put in the  cream chese mix. Pls answer gemma!"}, {"text": "So I would like to make pumpkin cheese cake, I was wondering if i substituted the pumpkin puree for the dulce de leche would it work the same?"}, {"text": "finally a recipe for veg"}, {"text": "can u make No Bake Red velvet cake"}, {"text": "one of my favorite cheesecake"}, {"text": "here in Mexico we call &quot;dulce de leche&quot; &quot;CAJETA&quot; it&#39;s so delicious and there is also cinnamon and liquor favored. I&#39;ll go to the store to get some... yummy"}, {"text": "It&#39;s butter not bosher"}, {"text": "i love you"}, {"text": "I think I must try that cheesecake. Very easy, and looks delicious! But I&#39;m already thinking about an ice cream cheese cake instead of a normal cake. Dulce de leche is the same as condensed milk, so I think I will make an ice cream base using whipping cream and dulce de leche, and add the cream cheese as a flavoring agent. So it will be a cream cheese dulce de leche ice cream. And then follow your recipe and instead of popping it in the fridge, I will pop it in the freezer. I want to make some more ice cream after the first try of your perfect no-machine ice cream recipe.<br /><br />And dulce de leche is way cheaper than sweetened condensed milk in Norway. We can buy plain dulce de leche as a bread spread, named HaPå, for half the price of a can of sweetened condensed milk. Maybe only HaPå and whipped cream can make a fabulous ice cream on it&#39;s own."}, {"text": "this is my favorite recipe~~ I love all of your baking videos so much!!"}, {"text": "Too good Gemma..ur the best,..awesome idea for my newly bought cheesecake tin and my hubby upcoming bday!!! Will make and post u the pic..thanks..yummy"}, {"text": "Can you make cake with a mirror glaze?"}, {"text": "But i dont like Cheese Cake X("}, {"text": "doesdulce de leche tasts like caramel"}, {"text": "Do we put the cheesecake in the freezer or fridge?"}, {"text": "So is the cheesecake tin just a regular cake tin?"}, {"text": "but you did not tell the quantity of the things you used.."}, {"text": "hi my birthday is in this month and i want to know how to make a chocolate cake. can u  make a video please"}, {"text": "Oh my!!!! delicioso se ve!!!!"}, {"text": "Is Dulce De Leche the same thing as Carmel or chocolate? Or is both wrong? Somebody please reply!"}, {"text": "Instead of a cheesecake tin can you use a cake tin?"}, {"text": "When I see you I remember LP!!! &lt;3"}, {"text": "What if I don&#39;t have a food processor? Can u substitute the cheesecake filling instead of food processor a hand mixer??"}, {"text": "What if we don&#39;t have a food procceser?"}, {"text": "hey gemma !! I am from India ...would love you to try some Indian sweet dish"}, {"text": "Thanks"}, {"text": "I&#39;m going to make this today! will tag you the result tomorrow. (there will be a few tweak here and there for my dulce de leche cheesecake) can&#39;t wait to see how it turns out!"}, {"text": "I want to make this so bad...... yummy."}, {"text": "Is she Irish..sorry first time here."}, {"text": "Gemma you should make pumpkin recipes with actual fresh pumkins!! :D"}, {"text": "22k left for 1M OMG!"}, {"text": "hey gemma😊😊<br />did the dulce de leche is in room temperature or cold??"}, {"text": "gemma can you make some dark chocolate cupcake..."}, {"text": "please make a no bake cake because tomorrow i my father&#39;s birthday!!!"}, {"text": "Could you please post the recipe in the description as well please?"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23brittleinthemiddle\">#brittleinthemiddle</a>"}, {"text": "I bake for a living and I still wait for your videos with BAITED breath.....you are just so wonderful."}, {"text": "hi Gemma, I made this cheesecake and it was awesome only the pretzels in the crust got stale/soggy once the mixture was added :( not sure how it happened as they were fresh before. Could it be maybe I added the butter too warm to the crust? That&#39;s the only thing I can think of...help please! haha"}, {"text": "Do a tiramisu recipe"}, {"text": "I love your channel easy to try and delicious"}, {"text": "you are very fast speak;)"}, {"text": "This is by far the most decadent dessert everrrrrrrrrrrrrrrrrrrrrrrr !!! Cant wait to try it !!! Thanks Gemma :)"}, {"text": "I like your baking bcoz their is no extra small things to add in your recipes. love frm Pakistan😘"}, {"text": "você é incrível"}, {"text": "that&#39;s perfect ..... I really like your channel even my brother always make your microwave recipes 😄😄😄"}, {"text": "that&#39;s perfect ..... I really like your channel even my brother always make your microwave recipes 😄😄😄"}, {"text": "ok thx"}, {"text": "ok thx"}, {"text": "hi there gemma; you know cold weather is here . can you make some delecious hot and cozy drinks for fall and christmas? with nice and delecat decoration ?"}, {"text": "Could you please make a brownie cheese cake"}, {"text": "oooooohhhhhh looks yummy"}, {"text": "Gemma, you are the best youtuber! I looked at the title and felt like I knew what you were going to do, but I didn&#39;t expect the pretzels in the base or the secret layer! So different from just making a simple cheesecake! I love it. Well done!!"}, {"text": "could you do a tiramisu ice cream video"}, {"text": "could you do a tiramisu ice cream video"}, {"text": "hhaahahahah lets get no baking :D"}, {"text": "Can&#39;t wait to make!! Love it"}, {"text": "what is a digestive biscuit?"}, {"text": "Gemma, why wouldn&#39;t my sugar dissolve when making the brittle? Thx."}, {"text": "I&#39;m definitely going to try this recipe out...Looks delicious😍...Mmmmm"}, {"text": "can you make more mug meals like the thanksgiving one plus mashed potatoe in a mug"}, {"text": "Super"}, {"text": "Can you do a video,how to make cake without oven?"}, {"text": "Could you do a homemade saltwater taffy or pecan log video? Their two of my Grandfather&#39;s favorites and I would like to make one for him, Love the channel keep up the great work!"}, {"text": "plzz more milkshakes"}, {"text": "wow I love it and I will try it for sure!! thank you :)"}, {"text": "Pls show that how to make icing sugar??"}, {"text": "Damn that cheesecake lookin&#39; FIIINNEEE"}, {"text": "Hi!! I love baking!! I was wondering if you can do anything Harry Potter themed??! I love Harry Potter!"}, {"text": "I am going to have to try this recipe thanks"}, {"text": "for the first time i have all the ingridents of the recipe"}, {"text": "I love your videos! Can you make homemade butter? I usually don&#39;t have butter when I need it, so that would be helpful. Thanks!"}, {"text": "Gemma i loves all of your recipe and my family and friends too.Yours cheesecake always so beautiful and i bet is going to be so tasty.I going to try some of your recipe in my new baking channel.Thx gemma😂😘❤"}, {"text": "hi ms Gemma! do you have any android application for all of your recipes? i kept looking on your name and i also tried the chanels title but nothing shows.. :("}, {"text": "You should try making fall flavored ice cream with flavors like pumpkin, or apple cinnamon"}, {"text": "Please do a video on how to make graham crackers please 🙏🙏🙏 We can&#39;t get any here in France"}, {"text": "you look just like my aunt"}, {"text": "yummy! looks absolutely delicious"}, {"text": "Yummy to the 3rd power!"}, {"text": "Gemma,Can you make Dark chocolate sponge cake? My Dad birthday is coming and my dad like dark chocolate"}, {"text": "How to make a crem"}, {"text": "I just had lunch a few minutes ago I&#39;m hungry again lol this looks Delish!!!!"}, {"text": "Gemma plz you make cheese at home"}, {"text": "Looks incredible as always, Gemma!"}, {"text": "omg!!! yasssssss!!! Gemma, can you make Arroz  con leche or rice with milk (in english)"}, {"text": "Can you please make something from Apple, cinnamon or punk in spice"}, {"text": "Can you pls do a video on how to make 🌈 candy sprinkles in various shapes?"}, {"text": "Please make ube ice cream pls."}, {"text": "Gemma, absolutely delicious. I love the brittle part. It´s amazing how the butter and sugar turns into a dark caramel!<br /><br />Happy saturday in L.A.<br /><br />Patricia."}, {"text": "It&#39;s so thick and creamy!"}, {"text": "your pretty could you  do  ceremel Popsicles please please please please please please please please please please ♥ ♥ ♥ ♡ ★"}, {"text": "Whenever I make cheesecakes, I find that my crust is SUPER hard to cut 😕"}, {"text": "amazing as always Gemma. I was always wanting to know how to make a no bake dulce de leche cheesecake and now you have provided us with a wonderful recipe. thank you for that. will try this at home as soon as I can."}, {"text": "She is amazing!! I love this recipe! &lt;3 Saludos desde Costa Rica!!"}, {"text": "Looks delicious and sure it will be wonderful.  I love sweet and  salty desserts.  Which piping tip for you use?"}, {"text": "Looks sooo yummy!! I&#39;m gonna try it. 😘😘 from Argentina"}, {"text": "Is it possible to make a no bake cheesecake that has the same texture as a baked one? My mom doesn&#39;t like how no bakes are so mushy and not cake-y"}, {"text": "hi gemma!! my birthday is in like 4 weeks (5 oktober) and i really would like to know how to make an oreo cheese cake bcs i tasted on ones and i was in heaven😍😍 thank you  so much! ps. please do an easy version because i am not an expert haha"}, {"text": "Hi Gemma ..Iam Habiba from Egypt maybe you forgot me .. i made the Cheesecake it&#39;s realy delicious ..i call my friends to came to my home they eat the cheesecake they loved it so much realy thank you Gemma                                                                                            From:Habiba                                                                                                                                                                                                                         To : Gemma"}, {"text": "Also, does anybody know why my cheesecake hasn&#39;t set?"}, {"text": "please make more mug meals they&#39;re awesome"}, {"text": "Gemma Staford can you also tell me how to make frosting"}, {"text": "Gemma Staford can you please tell me how to make fondant"}, {"text": "I bet this tastes heavenly :)"}, {"text": "I love DULCE de LECHE and that&#39;s why is definitely love this!!!"}, {"text": "This looks delicious. Love the words &quot;bits and bobs&quot; you used....perfect words for ingredients and such. Thanks...a great fall dessert."}, {"text": "Hi Gemma! I&#39;ve watched your ice cream episode and I&#39;d like to ask how to mix blended-cucumber(just like juice) to my ice cream base. I&#39;ve tried making cucumber homemade ice cream several times but the texture turns out to be just like ice. I think this is because the mixture turns into very liquid. How do I do it right? By the way, I use all-purpose cream for my whipped cream because its cheaper. :) I love your recipes Gemma &lt;3 and love from the Philippines! :D"}, {"text": "I want this but Im too lazy to cook"}, {"text": "Mam what is cheese cream and from where I got cheese cream ? pls guide me...."}, {"text": "Creamy and delicious!!! 😀🍰"}, {"text": "I got a little heart attack when the crust slightly cracked when she took the cheesecake out of the pan 😂 But I love cheesecake and dulce de leche so.. I wanna try this! 💕"}, {"text": "What&#39;s the difference with dulce de leche and caramel?"}, {"text": "This looks divine! &lt;3"}, {"text": "I once had a walnut and date bread/cake and ever since then I&#39;ve wanted to recreate it but can&#39;t find a good recipe online, I was wondering if you could make one? It was so good sliced up with a tiny bit of butter 😍"}, {"text": "Its ok to make this recipe with a blender right ?"}, {"text": "yay!  gemma finally said &quot;no baking&quot; in a no bake video hahah btw love the video"}, {"text": "make a baked cheesecake."}, {"text": "make a baked cheesecake."}, {"text": "please make taco bell cinnabon delights!! thank you"}, {"text": "Gemma I just realised you&#39;ve made so many over the top cheesecakes but no originals! I love it! 🙃"}, {"text": "Can you do a Q&amp;A?"}, {"text": "Looks so delicious!"}, {"text": "I have literally been waiting like forever for a recipe as good as this one! Thankyou. I will definitely try this soon."}, {"text": "Gemma, I absolutely love your work !!! Helped me and others a lot . Much love :) :)"}, {"text": "What is u r fav cheesecake ?<br />"}, {"text": "This looks amazing! I really want to Try it. However I can&#39;t eat cream. I have an alternative for cream cheese, however do you have to put the added cream in? Or is there an alternative?"}, {"text": "hello...gemma...i would like to know if a stainless steel utensil can be used in microwave convection mode for baking?.plz reply..m in so much fix"}, {"text": "I shouldn&#39;t be watching this while I&#39;m hungry 😣"}, {"text": "I could probably eat this whole haha - looks amazing Gemma! :)"}, {"text": "Yum i want a slice so bad"}, {"text": "xoxo"}, {"text": "Love it. &lt;3 . You&#39;re love Gemma. :)"}, {"text": "Gemma! You&#39;re so close to 1,000,000 subscribers! Can&#39;t wait for the videos and recipes that will be posted in celebration of your upcoming milestone. Congrats in advance!"}, {"text": "+Gemma Stanfford please make NYC cheesecake please"}, {"text": "Ugggghhhh the minute I saw it on Instagram yesterday I was craving this!"}, {"text": "&quot;So let&#39;s get no-baking&quot; - haha, so much fun to watch and the cheesecake looks delicious!"}, {"text": "you should make more cooking videos with your husband! You guys are lovely together :-)"}, {"text": "you should make homemade graham crackers too!! sores are not the same without them and I&#39;ve seen other channels that doesn&#39;t get the chance to try them properly."}, {"text": "gemma madam,you are a true show stopper.☺👏"}, {"text": "Ferraro Rocher ice cream please..my mom is a fan of Ferraro Rocher...her birthday is coming so I wanted to surprise her... please do make one"}, {"text": "I love the last part. :)"}, {"text": "Please make some secret menu Starbucks desserts"}, {"text": "your measuring cups are so cute!"}, {"text": "Hey Gemma aka the baking gemstone"}, {"text": "yum yumm"}, {"text": "O-M-GOOOODNESSSS this is one recipe I&#39;ve definitely gotta try just watching the video has me craving it lol"}, {"text": "I love the way you make cheese cakes in food processor, thank you for giving me another chance to learn, Gemma... Happy day!"}, {"text": "Omg this looks soooooo good!!!!😋 Can you please do something Galaxy themed for your next episode?"}, {"text": "Can you do a baked cheesecake"}, {"text": "That looks and sounds really good."}, {"text": "you should make a salted caramel and pretzel ice cream"}, {"text": "you have the same measuring spoons as me! and I&#39;m eleven"}, {"text": "More toaster oven desserts pls"}, {"text": "i wonder if this freezes well. I really shouldn&#39;t eat a whole cheesecake and I&#39;m not good at sharing 😃"}, {"text": "Wow looks so delicious Gemma 💕"}, {"text": "I love to watch you bake, but it&#39;s also awesome when you make no-bake desserts!"}, {"text": "Oh Gemma how do come up with such yummy ideas..every time u keep improvising ur cheesecakes...with the kinda recipes u come up with u shud celebrate a cheesecake party....don forget to invite me😉😉"}, {"text": "Substitution for cream? I&#39;m definitely making this!"}, {"text": "A perfect cheesecake for the fall season! Looks super yummy! 😍"}, {"text": "Gemma! Can you please make more ice cream? I vote for ice cream cake! (If that&#39;s possible.)"}, {"text": "Use a mesuring cup to pack the base. It is easier and it has a better finish."}, {"text": "Hi Gemma, great recipe, well, it looks like I&#39;II have to make it over the school holidays, my family is going to really enjoy it. I want to thank you for not using eggs &amp; gelatin, it makes my tummy feel a whole lot better. Cheers"}, {"text": "yum"}, {"text": "yum"}, {"text": "can u do a collab with Yolanda Gampp"}, {"text": "Awesome!!!"}, {"text": "Can you please do a no bake chocolate mousse cheescake"}, {"text": "Hahaha that concentration level at the end though 👍"}, {"text": "shes so close to 1 million subbies!! &lt;3"}, {"text": "And there I was the other day telling you how I love to mix the dulce de leche with cream cheese, but cheesecake never occurred to me! I will definitely make this!"}, {"text": "Amazing looking cheesecake! Also, I loved the behind the scenes at the end, such concentration! :)"}, {"text": "This woman always reminds me of Honey from Eastenders."}, {"text": "THIS LOOKS DELICIOUS! I LOVE YOUR VIDEOS!"}, {"text": "I will make this for the Holidays! :D"}, {"text": "Can I make the cheesecake filling in the standing mixer?"}, {"text": "Looks amazing Gemma! 😍"}, {"text": "This cheesecake is stunning and delicious!! You have an excellent pallet for desserts and I am so thankful you are sharing these recipes with us."}, {"text": "I&#39;m making this for tomorrow! I just finished making the brittle ( my first time! Thank you Gemma for the super easy recipe!) I used hazelnuts instead of almonds :) And the dulche du leche has another hour :)"}, {"text": "Love your creations Gemma, this looks fab. I love how cheesecake is so versatile, there are SO many delicious cheesecakes that can be made :)"}, {"text": "My God it looks incredible, I actually want to make it, I only need to get some almonds and that&#39;s it, omg Gemma you&#39;re so close to 1 million subbies, you totally deserve it 😘💗💗💗"}, {"text": "Can we use a stand mixer instead of the blender for the cheese cake filling?"}, {"text": "Hey Gemma, I think you should tell us what the measurements are plz"}, {"text": "heavenly!😍  also I love you new profile picture ☺😊"}, {"text": "dulce de leche is also manjar?"}, {"text": "the 2 things i love into 1"}, {"text": "I just finished marking this right now, it turned out great:) thx gemma🙂"}, {"text": "That almond brittle would be good on cereal, ice cream or just in my hand."}, {"text": "&quot;So let&#39;s get no-baking!&quot;#oxymoron Made my day :D"}, {"text": "Gemma always has the best and most unique recipes!😍"}, {"text": "heavenly just heavenly"}, {"text": "What a gorgeous cheesecake Gemma, that looks fabulous."}, {"text": "Yum! Could u make a tres leches cake?"}, {"text": "Yesss Gemma YESSS!!!!! Keep the No- Bake Cheesecakes coming! ❤👏👏"}, {"text": "Why is that not in my tummy yet?!?!?"}, {"text": "Thanks a lot"}, {"text": "well done.I will try this"}, {"text": "Oh, Love. I wanted to tell you how fabulous this recipe sounds, but I&#39;m all a twitter after seeing that beautiful Almond brittle! You have some of the best ideas! :-)"}, {"text": "This cheesecake looks amazing Gemma! It&#39;s weird because I also did cheesecake this week. haha. Awesome work as always!"}, {"text": "That looks SINFUL!!"}, {"text": "We learned how to make Almond brittle and the cheese cake😏 2-in-1"}, {"text": "that looks yummy !!!!!!!!!!!!!!!!!!!!!!!!!"}, {"text": "gemma tu video es super amo tus videos saludos desde mexico😻"}, {"text": "pls make marshmellow fluff whit out corn syrup im macedoia we dont have corn syrup pls pls pls pls pls"}, {"text": "Do you have to use almonds or. Can you use other nuts?"}, {"text": "Can we use any foil , or do we have to use tin foil"}, {"text": "why do I see this while I&#39;m dieting? 😣😣 great recipe either way!!"}, {"text": "Holy cow! That looks delicious."}, {"text": "LOVE IT :D!... Would it work if instead of dulce de leche, I used biscoff spread? and biscoff cookies as the &#39;surprise&#39; centre? (As you can tell I love biscoff;)"}, {"text": "you&#39;ve out done yourself this time, so simple to make and look  like it came from a high-end bakery. wow have to make it this weekend. thank you sensei"}, {"text": "looks soo good"}, {"text": "Can you make a no-bake Greek yogurt cheesecake?"}, {"text": "Can I use a stand mixer with a whisk attachment to make the cream cheese layer?"}, {"text": "I was wondering what I should make for my brother for his birthday next week and this would be perfect! 😸"}, {"text": "Yum! All it needs is peppermint crisp chocolate and it&#39;s my kind of cheesecake!"}, {"text": "I&#39;m allergic to nuts... What else could I use instead of the brittle?"}, {"text": "Looks so good!!!!!!!"}, {"text": "secret center"}, {"text": "Can you please make the best ever dark chocolate salted caramel cookies? I&#39;d prefer an egg-free recipe but it&#39;s your channel lol!"}, {"text": "I have been waiting for this! Yay! (Also, I see that new display picture- you look lovely :))"}, {"text": "Gemma. You are the best 👍👍👍👍👍👍🌹"}, {"text": "(And also love YOU)"}, {"text": "Gemma I love your tutorials, your recipes are a no fail, but I just want to tell you dulce de leche and caramel sauce are two diferent things... They mighl look alike because the color but they taste totaly different.. But equally delicous!!"}, {"text": "From: LEMONADE BARS 3"}, {"text": "In México it is called &quot;Cajeta&quot;, although in other countries Cajeta means something bad lol"}, {"text": "Triple chocolate cheesecake?"}, {"text": "❤️🍴❤️😘😍 Love tour desserts!!! 😍😘❤️🍴❤️"}, {"text": "Do you want another taster - just to make sure? lol! Looks absolutely scrummy!"}, {"text": "this cheesecake and you both are amazing!!!"}, {"text": "OMG Gemma!!!!!! This is eye bulging, Mouth watering, out of this world amazing!!!!! 💗💗💗"}, {"text": "can you make a chocolate cheesecake?"}, {"text": "this is awesome Gemma! i love your cheesecake recipes!"}, {"text": "Yummy... Love watching your videos 😊"}, {"text": "Will we ever get a chance to see you bake with one or more of your siblings?"}, {"text": "Gemma please make a coffee walnut cake!"}, {"text": "Can you add recipes that are low in calories. Actually, whatever you cook or bake is gorgeous but I would feel so guilty to try them. Best"}, {"text": "oh Gemma! you&#39;re killing me! :D it looks so incredible I&#39;ll spend all day tomorrow to make my own lacto-free cream cheese and dulche de leche just to make this amazing cheesecake! ohh and I have to make some cookies for base too! :D poor me... but I can&#39;t resist!"}, {"text": "Can you use pecans insed Of almonds"}, {"text": "2 of my favorite things combined :D Can&#39;t wait to make this!"}, {"text": "gemma as always you make great recipes that never have failed me so far!i will try this one asap.I have one little request ,if you can make banoffee pavlova?i want to try to make it so badly but i know that if you give the recipe in your channel it will be a foolproof one and it will never fail me.Please consider it .best wishes from Albania :)"}, {"text": "Hi Gemma! Can you please make a healthy snacks recipes video (mugcakes, bars...) ? I&#39;m on a diet but i love your recipes. Thank you ❤"}, {"text": "Here in South africa dulce de leche is a favourite! can&#39;t wait to try this recipe it looks delicious! thanks Gemma for your awesome recipes u rock😎"}, {"text": "can you please do a dairy free cheesecake without using cashews. I find all the recipes have cashews 😕"}, {"text": "whipping cream is not available in our country so   can we use full fat milk"}, {"text": "Gemma please make a pie with chocolate ganache or chocolate truffel filling.  And also a delecious formula one cake for a person who actually isnt that much in to cake. Probably because he buys cake. And at last homemade Daim! A fave here in Denmark!"}, {"text": "As Dulce de leche is  from Uruguay and Argentina <br />You should teach how to do rogel cake o alfajor cake 😉"}, {"text": "I love your recipe😘😘😃😃can u show how to make a classic cheesecake recipe??"}, {"text": "Another awesome cheesecake from Gemma! I have a challenge for you, could you make a savory cheesecake? Sorted Food tried to make a nacho cheesecake once."}, {"text": "omg my mouth is watering now.."}, {"text": "Can you make a video of homade jam/jelly? Peach ,blueberry, strawberry etc"}, {"text": "that looks so good i can&#39;t wait to give it a try, thank you much."}, {"text": "Yummy.. You have sense for sweets 👍👍👍"}, {"text": "this appears to be delicious"}, {"text": "I made an icecream with the dulce de leche, whipped cream and the almond praline.. It was awesome..There&#39;s very little left now.. You upload a recipe and I&#39;m all set to do it.. Couldn&#39;t wait for cheesecake recipe.. I&#39;ll try this one too..You are such an inspiration.. Thank you.. Love from India..."}, {"text": "amazing"}, {"text": "Wouldn&#39;t work in a bake sale out here in Dubai. it would melt in 5 minutes. 😂 but definitely wanna try this for Christmas!"}, {"text": "What video editor do you use"}, {"text": "wow yummy cheesecake gemma as you always make yummy desserts😄☺"}, {"text": "can you make this in a standing mixer? If so, which attachment would you use?"}, {"text": "Love this!!"}, {"text": "I love your all no bake and egg less recipes"}, {"text": "I love it"}, {"text": "you cheesecake recipe was great"}, {"text": "Lecker 😊"}, {"text": "so delicious😍"}, {"text": "omg!!it looks gorgeous..tastes gorgeous and is often made by a gorgeous woman....u have a god gifted talent gemma😙"}, {"text": "This is soooo good!!"}, {"text": "Seeing the 1 million subscribers coming!!!! 🎉🎉"}, {"text": "Gemma when are you gonna make the iced tea you said you will make"}, {"text": "ur recipes are beautiful as you are...thq ♥"}, {"text": "could you use mascarpone cheese instead of cream cheese? What type of cream cheese do you use? Im in Ireland so i dont know. Thanks"}, {"text": "Kevin&#39;s face at the end lol 😂😂😂"}, {"text": "Gemma How Many Times Do U Try Out Recipes Before They Work"}, {"text": "AMAZING! Can&#39;t wait to try this. Your recipes NEVER fail!"}, {"text": "I have been following your channel since the time you started. You never fail to make my mouth water! 😜 Love your recipes!😊👍"}, {"text": "Maaaan Daehyun would love this"}, {"text": "The best thing about this show is that <br />that she always replay our comments and her RESIPE are very very nice and easy"}, {"text": "thank you Gemma!! I love your recipes~ especially the vegan ones"}, {"text": "I&#39;m going to make this for my husbands Birthday! Such a great recipe Gemma, thank you! I was wondering what nuts I can use instead of almonds? I&#39;m allergic to them but other nuts are fine :) I was thinking peanuts?"}, {"text": "I made a no bake cheesecake in June and I&#39;m still not ready for another. lol. they are so rich and tasty"}, {"text": "wow! this looks so delicious!!! <br />I want to make it, but we dont eat sugar at our home and I usually use substitutes, I have sugar free  Dulce De Leche, but what sub would you recommend to use instead of sugar in the surprise filling?"}, {"text": "I would love to see another single serving cookie recipes video! Maybe even a single serving Nutella cookie!!!!"}, {"text": "Oh I think that is a great idea with the salted pretzels along with the graham crackers. Since this is using Dulce de Leche or like a caramel sauce, the salted pretzels along with the caramel will make a great combination. It is almost like a salted caramel cheesecake. Looks and sounds delicious. Thank you for sharing. :-) Christine"}, {"text": "Looks really delicious, definitely gonna try them out.<br />Thanks for sharing😍<br />I love that you always suggest an alternitive way of doing something for people who don&#39;t have all of the professional devices or cannot buy some special ingredients in their country."}, {"text": "any particular reason why you made the caramel with butter instead of water? :O either way, looks yummy!"}, {"text": "omg this is....ah-may-zing<br />love it love it love it😍😍👍I&#39;ll try to share this one😆😆"}, {"text": "OHHHH... YUM.....  So gorgeous and delicious looking!!!"}, {"text": "it&#39;s awesome"}, {"text": "is it nessesary to use whipping cream"}, {"text": "that ending"}, {"text": "thanks! glad to finally have a gelatin free cheesecake"}, {"text": "is there any way that we can replace the cream cheese if we wanna make it vegan? it looks soo yummy, gemma! i love it!"}, {"text": "This looks Soo good. Well done Gemma"}, {"text": "could you please make a &quot;how to make Glucose Sirup&quot; Video? I can&#39;t buy it in my country ..."}, {"text": "Gemma you are just awesome😊💞💕👍"}, {"text": "Perfect as always ❤LY"}, {"text": "Can we keep the cheesecake in the fridge for a week ?"}, {"text": "What a nice touch with the pretzels, Gemma! Bold cooking or no cooking :) Love from Kosova."}, {"text": "This looks soooo yummy I would poke through the screen"}, {"text": "Nothing like having a day off and waking up to a Gemma video! Looks excellent!"}, {"text": "I need this in my life"}, {"text": "Dulce de leche - amazing , dulce de leche cheesecake - amazinger. Better called dulce de cheesecake"}, {"text": "Good recipe, as always, Gemma! You should make more vegan recipes! They are great."}, {"text": "my gosh girl, you have my favorite cheese cake and caramel, never had the both. Will definitely try this"}, {"text": "yummmmmmo"}, {"text": "wow cake"}, {"text": "This looks sooo yummy!!!! Can&#39;t wait to try and pls do more behind the scenes!!!"}, {"text": "This recipe looks delicious! I was wondering if I could leave the brittle our substitute the almonds with something else because I really don&#39;t like nuts, other than that it looks delicious!"}, {"text": "I bet the crust would be lovely with some of that homemade almond brittle worked into it. OM NOM NOM. XD"}, {"text": "Ooh! Looks amazing 😊"}, {"text": "yummmy"}, {"text": "Wow Gemma!!!!!it looks so lovely....:* :*"}, {"text": "This looks fab !!! AMAZING😍"}, {"text": "OMG...THIS IS EVERYTHING😊😊"}, {"text": "You should try and make a 100% homemade desert, on camera!"}, {"text": "this looks sooo yummy...great job!"}, {"text": "can we substitute low fat 25% cream for this"}, {"text": "Who else loves Gemma"}, {"text": "can i be your neighbour??? 😂"}, {"text": "Omg ur almost at 1m that&#39;s amazing ❤️ and plz keep up with the good work"}, {"text": "Gemma do you know what that music is called right at the beginning? It&#39;s really nice"}, {"text": "Your recipes get greater and greater with every new recipe you make. Thanks so much, Gemma! 😄"}, {"text": "Every time you moved you finger over the caramel I had a mini-heart attack fearing you&#39;d burn yourself any moment. Other than that this looks delicious :-)"}, {"text": "what can we add except from pretzels gemma?"}, {"text": "This is wonderful!  👏🏼"}, {"text": "I love your cheesecake recipes! HAVE to try this out!"}, {"text": "Gemma, will you be my mom? :D"}, {"text": "This looks so delicious. Thank you for sharing. Hitting  1 million soon eh...😆"}, {"text": "Awesome!!!!💕💖💗I&#39;m gonna try making this!"}, {"text": "who are these haters who always give you a thumbs down and what do they have against cheese?"}, {"text": "Oh God! This is mouthwatering Gemma!"}, {"text": "Next pls a themed cake"}, {"text": "hi gemma, can i use a blender on the cheese mixture?"}, {"text": "Wonderlicous video! I saw that you made bread by any chance was it the sourdough I requested?"}, {"text": "so early"}, {"text": "wow‼‼ this is an irresistible, extraordinary n easy recipe. I don&#39;t know how to thank u for sharing ur splendid ideas with us. simply u &#39;ll b always the best.⭐⭐⭐⭐⭐👍👍👍"}, {"text": "You should try walnuts instead of almonds. In Chile one of our popular cakes is &quot;Manjar Nuez&quot; (dulce de leche an Walnuts) so this can be the cheese cake version of it"}, {"text": "mmmmm delicious"}, {"text": "Dangerously delicious😍 I loved that it has different textures, Yummo!!!😋"}, {"text": "So close to 1 mil subs ;)"}, {"text": "Beautiful cheesecake Gemma!"}, {"text": "love it so much!!! ❤❤"}, {"text": "we say chikki instead of brittle - Maheen Mirza"}, {"text": "can I use oreo&#39;s for the base"}, {"text": "Love dis"}, {"text": "I like  your voice ❤"}, {"text": "Oh! Looks so good! I&#39;m at school and now I&#39;m hungry!"}, {"text": "as usual u r always surprising us...very nice Gemma ❤❤"}, {"text": "LOVE YOU SOO MUCH"}, {"text": "Is it just me or everyone finds her today speaking like shes on 2X forward!?"}, {"text": "GREAT recipe Gemma.  My mouth was watering so much, I&#39;m suprised my keyboard is still functioning."}, {"text": "😋😋😋😋"}, {"text": "You and Kevin look so cute together 😍"}, {"text": "yeah, yummy"}, {"text": "Hey Mrs. Gemma! I hope you got my message on Instagram! :D This Idea Is The Bomb!!! My Cousins would die for this! lots of crazy stuff happens when you introduce to caramel desserts to them! hahaha! i Have to try this out! It&#39;s 2016! I still can&#39;t believe we don&#39;t have some Bluetooth option or something or maybe a link that can be added to the description box that helps supply people with a sample of the food..cause trust me Mrs. Gemma i would definitely take a gazillion of those samples! i just can&#39;t seem to stop being amazed! it&#39;s always like this! :D Every recipe is just so unique! I just LOVE this channel sooo much!!! You should so get a Best Channel Award for like the baking category!  <a href=\"http://www.youtube.com/results?search_query=%23MrsGemmasTheBest\">#MrsGemmasTheBest</a>! <a href=\"http://www.youtube.com/results?search_query=%23LoveBiggerBolderBaking\">#LoveBiggerBolderBaking</a> <a href=\"http://www.youtube.com/results?search_query=%23BestChannelAwarfGoesToMrs\">#BestChannelAwarfGoesToMrs</a>.Gemma!"}, {"text": "perfect cake for autumn!!! &lt;3"}, {"text": "your new profile pic is absolutely gorgeous gemma!❤"}, {"text": "This looks delicious!! Can&#39;t wait to try it!😍"}, {"text": "Oooh I love the pretzel idea! I have to make something for a work thing and I was planning to do cheesecake bites in a mini muffin tin. Maybe I&#39;ll do a dulce de leche topping  and incorporate that idea"}, {"text": "Hi, Gemma. That cheesecake looks beautiful. I love your new profile photo, super cute. For the next Basics recipe, you should make peanut butter. What do you love about tart recipes? Have a good day, Gemma. 💖💖💖"}, {"text": "Looks amazing and so easy. Definitely going to make this during the weekend :)"}, {"text": "There goes my diet"}, {"text": "looks soo delicious…… btw omg u r getting closer to 1000k subscriber hope u&#39;ll reach that soon… i just cant wait to see ur channel with that much subscribers &#39;cause u deserve it……… u r such an inspirational personality …thnx for all ur recipes them all &lt;3 ……luv u soo much…"}, {"text": "I change my mind about not liking cheesecakes... I want a slice of this one now!"}, {"text": "Thats&#39;s amazing!!! But +Gemmastafford I saw your recipe for delce de luche and I was wondering if there is a quicker recipe. An hour&#39;s worth is a lot of time to run the stove... Not to offend you just a general concern..😊😁"}, {"text": "Amazing as always!! 😍❤️"}, {"text": "yum!!"}, {"text": "Please for me do something unicorn related <br />And do a collab with Rosanna pansino"}, {"text": "GEMMA!! Make a mug empanada!!!"}, {"text": "Get this video up to 2k likes."}, {"text": "Awesome"}, {"text": "I just made dulche de leche <br />I was wondering how to use it , and here u r wid a recipe;-)"}, {"text": "Early,and I loved this video"}, {"text": "I love you gemma"}, {"text": "love you ..&quot;lets get no baking&quot;😂"}, {"text": "LOVED THIS ONE it taste heavenly gemma"}, {"text": "your recipes get better with each video I just Love how easy but creativ they are I&#39;m so in Love with your channel! 😍💘BIG THUMBS UP!👍"}, {"text": "yummm"}, {"text": "Looks awesome I also sure it tastes awsome"}, {"text": "I love this so much Gemma! Trying this one"}, {"text": "Cheesecake...yum yum..i feel so proud of myself everytime u made a new video i catch u up really quickly...i love u forever and ever.."}, {"text": "I love your recipes!!"}, {"text": "I 💙 Cheese Cake !!"}, {"text": "first time I&#39;m this early. luv u gemma 😄"}, {"text": "so yumm"}, {"text": "love your recepies😍😍 thanks a lot, dear💜"}, {"text": "yummy😊"}, {"text": "YaYY"}, {"text": "It&#39;s amazing how easy your recipes are ❤️❤️"}, {"text": "😍👌"}, {"text": "14th"}, {"text": "CHEESECAKE!! Love it 💖:)"}, {"text": "suck a good recipe and easy way to bake.😄😄😄love your video."}, {"text": "Great recipe Gemma you never fail to impress me!!!!!!😘😘"}, {"text": "yippe kaaay yaaaay"}, {"text": "12th viewer! Love your videos Gemma!!"}, {"text": "first"}]