[{"text": "Wow! Really nice, thanks!"}, {"text": "It&#39;s hard to control the dynamics. I can play the whole song at the right tempo, but the last part is a mess because I can&#39;t play the left hand fast and soft at the same time, so the accompaniment and the melody are mingling"}, {"text": "SO HELPFUL!! Some of the music math in there in 3/4 and how the left and right line up was mystifying me-- this is wonderful. Thank you!"}, {"text": "Good job. nice song . thank you"}, {"text": "You can always count on Jane using correct transcriptions/arrangements! <br />Keep up the good work! I love your tutorials and thank you for all the hard work you put in them."}, {"text": "I know this is sort of an old video but I just Wanted to say this is really useful even though I&#39;m just a beginner and I learn piano just by using YouTube. I&#39;m sort of stuck with the part that comes after <a href=\"http://youtu.be/2K5q3Q2GbY4?t=4m10s\">4:10</a> D: i practice a lot but I have to admit that I havent been able to pass it yet. <br /><br />All what I have learnt to play from this song is thanks to you! Thank you very much. Wish me luck with this piece :P "}, {"text": "Hello! Please check my interpretation of this piece and tell me what you think! Thank you<br /><a href=\"https://www.youtube.com/watch?v=53hHf9W0axs\">https://www.youtube.com/watch?v=53hHf9W0axs</a>"}, {"text": "Thanks again. I dont even have to check who has made the video when I see those beautifull hands. Much love to you."}, {"text": "Fácil con esos dedos largos y maravillosos que tienes."}, {"text": "thank you"}, {"text": "Fome!"}, {"text": "thank you for sharing this  :D"}, {"text": "Thanks for the tutorial Jane !  /watch?v=VgVNkU304FA&amp;feature=<a href=\"http://youtu.be\">youtu.be</a>"}, {"text": "thanks very much,very useful!"}, {"text": "exceptional wonderful performance. Thank you you&#39;re simply genial! It&#39;s useful and precious! Thank"}, {"text": "nice"}, {"text": "You&#39;re welcome, Guido. Yes, use the pedal if it enhances the sound and mood. But let go before the sound gets &quot;muddy&quot;. Trial and error by listening. pedaling can come before or after a note plays."}, {"text": "Hey Jane, thanks for another great tutorial. I have a question though if you don&#39;t mind. Do you use any pedals during this song? For instance in m3 to m4. I get the feeling that if I don&#39;t sustain the A, that it ends to abrupt before I can make the switch to the BEC chord(LH). Maybe it&#39;s just because i&#39;m practicing at a really slow speed and I don&#39;t make the switch fast enough. But do you have any tips on the pedals, do you use any? Thanks for the lesson!"}, {"text": "thank you Libero :)  perhaps you would add to my &quot;goodbye&quot; video? I contacted a lawyer and am hoping he would be persuaded to help me after he reads the comments."}, {"text": "i my dear Jane! Okay? Accompany you for a long time ... I learned very great thing for you! Thank God for having a special personal like you! Teaching through your titoriais songs that we love so much and you teach us very love and affection! thank you so much love for all that your effort and dedication ...! Hugs and kisses of thy little fan that sends comments! Libero / RS.\n"}, {"text": "Hi Caroline. my level 6 is a guess that one with 6 years of serious playing (to me that means 1 hr per day), should be able to learn the piece easily. meaning okay in 1 week, good in 2. for one who has not played that long, learning the piece is not impossible, but it might take a month or 2. "}, {"text": "Hi Jane. If this beautiful melody is level 6 that means it is thought to be played by someone that has studied piano for at least 3 years? "}, {"text": "thank you"}, {"text": "excellent work\n"}, {"text": "I&#39;m so thankful for your tutorial, I&#39;m still learning it but I&#39;ve uploaded a video of how I play it so far, many mistakes, but with time I&#39;ll improve.\nThanks."}, {"text": "you&#39;re welcome :) "}, {"text": "thanks you my friends:D"}, {"text": "you&#39;re welcome. you are a good student :)"}, {"text": "Thank you for this great tutorial! Now i know how to play this :)"}, {"text": "muy buen tuto felicidades amigo espero subas del tema de la pelicula UP "}, {"text": "de todos los tutos que pude ver me quedo con este ya voy avanzando la parte dificil solo me falta la ultima parte del subidon y el final lento que es facil. "}, {"text": "you&#39;re welcome, thanks for writing."}, {"text": "Gracias a este tutorial aprendi a tocar casi perfectamente esa cancion. Muchas Gracias ."}, {"text": "thank you. distorted view though."}, {"text": "you have beautiful hands"}, {"text": "you&#39;re welcome. I played it at full speed, but I should have really practiced it first."}, {"text": "Thank you very much for this tutorial, it&#39;s a very beautiful piece. I&#39;m sure you play it wonderfully at full speed. Thank you again. "}, {"text": "unless classical, sheets must accompany requests."}, {"text": "you&#39;re welcome. try to play along with a metronome, set it slow, then gradually increase the tempo each practice. the result will sound much better at an even tempo. I checked your channel. nice. listened to your river flows piece. good job. I do not want to tell you which notes to play because you must learn to read music if you enjoy playing the piano, that&#39;s the only way to be independent. bye."}, {"text": "think so, i listened to the link, and know i made a tutorial for it."}, {"text": "Comptine d&#39;un autre ete? Is that what he means? *below*"}, {"text": "but I made a tutorial of this piece already! please use search box on my website (description link)"}, {"text": "Link: /watch?v=VFLF-gh4C2M\n:,)"}, {"text": "don&#39;t know which song you mean, so please follow request instructions (description link leads to website) "}, {"text": "Good toturial! But can you please make a video of The Piano Amazing short song? Would be awesome! :)"}, {"text": "glad to help :)"}, {"text": "Thanks, excellent tutorial, the speed is exactly what is needed to be able to learn this play without music sheet. and your cover at the right speed complete very well this tutorial. please continue."}, {"text": "that&#39;s nice  :)"}, {"text": "i love u for this thanx :) you make the impossible possible"}, {"text": "you&#39;re welcome :)"}, {"text": "hi thanks so much for these videos they really do help a lot\n"}, {"text": "yes, thank you so much, i&#39;m learning this beautyfull song with this tutorial :3"}, {"text": "A mi me gusta la banda sonora de Amélie . Merci pour tout!"}, {"text": "one with 6 yrs experience should be able to learn this easily: passable in one week, good in two weeks."}, {"text": "What does level 6 mean? I want to learn this but I&#39;m not sure what I&#39;m getting myself into."}, {"text": "I got the tempo from you! Yesterday i uploaded a cover of this on my channel :) Could you take a look if it&#39;s good?"}, {"text": "this is the best camera set up. my tutorials are for those who play by ear or follow the sheetmusic.  If you do not read music yet, i made 3 silly lessons to get you started. In the meantime, focus on my finger movement, not what&#39;s under them. good luck :)"}, {"text": "Thank you but for the next video tutorials can I suggest you to turn this less &quot;in front&quot; of the notes because It&#39;s hard to see exacly what you do ;)\nI&#39;m sorry for my bad English. Have a good day :)"}, {"text": "also, my tutorials are for those who play be ear or follow the sheetmusic."}, {"text": "if i touch my nose, you can touch yours, even though your saw neither nose. same principle. uses your mirror neurons. give them a chance."}, {"text": "Are you all kidding me?\nhow can you learn that, his hands hide everything"}, {"text": "Thank you so much! It is really clear and simple to learn from. Also, you play it beautifully. I&#39;m using both this video and the faster one. (:"}, {"text": "is there any excersice to help me play more easily the m65 part at the left hand??"}, {"text": "You are awesome man! =D"}, {"text": "If ratings hadn&#39;t been disabled for this video, I would have clicked like button."}, {"text": "thank you so much this is one of my favorite songs :)"}, {"text": "I recorded my own version of this song... If you&#39;ll be so kind and visit my channel I&#39;ll be so pleased :D"}, {"text": "where do you get that idea? :) my name is no secret"}, {"text": "Your name is Ana ?"}, {"text": "just ignore all this. a girl was rude and brainless. she commented with two usernames above. it&#39;s simple to look up where she is from, it becomes a bad reflection of her country. we all represent our countries in a way, right? so behave as good citizens."}, {"text": "omg, i love you, THANKSS!!!!"}, {"text": "I emailed piano-pal, the small company who agreed to match sheetmusic to my tutorials, to start working on this one."}, {"text": "Thats the Only thing inthis super easy song that makes it &quot;jazzy&quot; if you miss this you dont understand anything about music. "}, {"text": "This is great, thank you!!"}, {"text": "@bbdhrggl please!! is there anyway you could send me or tell me where to find the sheet of this song?"}, {"text": "rude commenter Eva4955 hails from Greece"}, {"text": "on 0:11 it should be  C E A not C E B -.-\nC E B doesnt sound good"}, {"text": "Thankssssssssss! i know play piano and i love this song,so thank you"}, {"text": "Wow, well done man! this music makes me feel good! it takes some practice, but its really cool! thumbs up ;)"}, {"text": "Again already said it BUT YOU RAWK ive had lessons when i was younger. My teacher tought me by copying i know thats bad but thats how i wanted it. Now from these vids i can take it over easy. Thank you so much again and the people that joke about your hands dunno how to play this piece propper anyway ;) keep it up! Working on ludovico einaudi - Oltremare atm very nice piece you might like it to. Should listen to it very nice! ok bb :P"}, {"text": "@bbdhrggl isn&#39;t it yet? :D"}, {"text": "@Eva4955 lol, you like writing to﻿ yourself? with young ones as you, Greece is in deep trouble."}, {"text": "@ImmaSurvive y she no shave her feet first?uhh.. i mean she&#39;s kinda like gontzila:X\n"}, {"text": "@ImmaSurvive you are kind and have great manners  :)"}, {"text": "Merci pour la vidéo !"}, {"text": "thanks"}, {"text": "@Xlay16 i never had any piano lesseon but with the clips of bbhrggl i coul learn amelie, river flows in you, harry potter and titanic... ist just a question of patience:))\r\nBig Thanks to bbdhrggl (sry for grammar errors)"}, {"text": "thanks for making this video! I think im going to tab this out then practice it a thousand times. Yea Lachry i was thinking the song sounded really nice slowed down, it sounds like a whole other song played at full speed lol"}, {"text": "@Xlay16 congrats. hard work and determination often succeeds. still, try to build a foundation by practicing easier pieces (while reading the score) and do scales,etc."}, {"text": "@bbdhrggl im learning the piano for just 4 months an im able to play half of this song.. its true that it was very hard, but i love classical music and i never gave up and never will."}, {"text": "@Frank332666 it means someone who has been playing piano for six years should be able to learn this easily"}, {"text": "What does the Level 6 means? difficult? easy ? begginer?"}, {"text": "oh my God !  Thank u  bbdhrggl  ! I learned in one week !!! i am so happy !!!  :DD"}, {"text": "am I the only one who finds the song even more beautiful slower? It sounds more sad and.. cautious.\nit&#39;s nice."}, {"text": "@zmw96 have to experiment and listen. pedal to enrich the sound, not &quot;muddy&quot; it. some classical music scores have pedaling marks, you can learn from those. look for a beginner or intermediate level book. good luck :)"}, {"text": "Hey:) Thank you for your lovely videos! They have proven very helpful! I&#39;m finding it hard to find sheet music and I know you throw away the sheet music for copyright reasons. But I was just wondering if you could tell me where you use sustain in this music? Where/ when would it be appropriate to use it? Thank you once again, and sorry for being a pest! :)"}, {"text": "@Neinir yep, spotted."}, {"text": "@thispawn you must say : D-A-D-E-F-A-F-E-D-A-DA .are you french ? :)"}, {"text": "Thank you so much for this I am absolutely in love with this song as soon as I get it all down I will post a cover of it! Thanks again :)"}, {"text": "thanks very helpful:)"}, {"text": "@zmw96 excellent  :)"}, {"text": "Thanks:) Ive learn&#39;t this now- just need to work on perfecting it! "}, {"text": "@thispawn ahem, level is a skill level and means somethin&#39;... but determination and hard work do overcome hurdles. it is always best to learn things the proper way in order to build a strong foundation. then someday soon you will not need tutorials."}, {"text": "@zmw96 learnt the first half until the ré-la-ré-mi-fa-la-fa-mi-ré-la-ré-la. I&#39;m level 0.2 ^^ so lvl does not mean anythin."}, {"text": "@zmw96 my levels (my guess) correspond to the number of years one has been playing piano. ability varies from person to person, so it is impossible to be exact. give the piece a try, if you find it too difficult, practice an easier piece and come back to this later. have fun :) "}, {"text": "Hey I was wondering if you could tell me how this piece is level 6 and how?:) I don&#39;t have a teacher and try and learn by ear- and use your vids for reference so just wondering thats all:)"}, {"text": "@klumpster11 i have no idea whether this version is &quot;real&quot;. yours actually sounds more exciting :)  does it have an arranger&#39;s name? try to stress the first beat of the 5 vs 6. i made a tutorial on how to play x notes against y notes (website &quot;scales and more&quot; in menu bar), but timing need not be precise on romantic music. perhaps a viewer will lead you to this score. good luck."}, {"text": "@klumpster11 my tutorials are requested. except for classical music, one who makes a request must send me the sheetmusic. there is a copyright issue. that is why I delete when done."}, {"text": "@klumpster11 sorry, i discard as soon as tutorial is done."}, {"text": "@SimplyNotTheBest22 wow! I&#39;m envious  :)"}, {"text": "LOL I tried playing by ear, which I never do.  Then I checked here if I was right.. I WAS!! :O "}, {"text": "That&#39;s great! Thanks a lot."}, {"text": "@atlantisforce Why the hell are we actually speaking english, while we both speak dutch? xD But okay, :P I can almost play this song perfect and at 100% speed, but.. that part where I was talking about is still hard.. :P So, I&#39;ll just keep practicing :) But now I&#39;m trying to play Le Moulin - Yann Tiersen, it&#39;s a bit easier and I think it&#39;s also very beautiful :)"}, {"text": "@atlantisforce i taught in the U.S. :)"}, {"text": "@bbdhrggl Thanks! I&#39;ll make sure to watch those! xoxo"}, {"text": "@silentscreamthroe practicing scales and arpeggios each day definitely helps. i made tutorials on those. start with C Major."}, {"text": "Thank you so much! This helped me a lot with the left hand part from 3:28 on. Know I know with which fingers to push the keys! It&#39;s still hard though, I need to practice so I stop missing the right notes -.-\nDo you have any recommenditions how to practice that part properly?"}, {"text": "@Isakmexia me lo puedes mandar tambien?por favoooor"}, {"text": "@iiingwarrr jup :)"}, {"text": "@atlantisforce The thing is, that you have to play that left-hand part without even thinking about it. But that&#39;s the problem ^^ I&#39;ll just keep practising. :) [jij bent toch een nederlander he? :P]"}, {"text": "@lggrhdbb that&#39;s true :P :)"}, {"text": "@GemuteerdeBaardaap but its sheetmusic is a universal language, that is why it is a great idea to learn to read music :)"}, {"text": "Waw, from 3.28 on it&#39;s like chinese for me.. ;o"}, {"text": "@bbdhrggl Should I use the sustain pedal when playing this song? If so, when should we push / release?\r\n\r\nYour a really good pianist! I really like your videos."}, {"text": "@EKGRW10 did he do it yet? "}, {"text": "great tuto. \nu really ve pianist hands ! \n"}, {"text": "porfavor me podrian pasar la partituraa\r\n"}, {"text": "@matejmuzatko have no idea"}, {"text": "Do you know where is middle C?"}, {"text": "@drhouse6 no, sorry."}, {"text": "@roxanneleonard no foul language accepted"}, {"text": "Hey all, I will make a Full Tut as soon as possible, Im a lil busy with school mid April it will be on my channel! Please be patiënt!"}, {"text": "Thank you my Lady ! =)"}, {"text": "thank you very much!!!!"}, {"text": "@Nosensev57 what does &quot;clue on my message&quot; mean? sorry to disappoint, but i did not feel &quot;attacked&quot; in any way.\n\nit is unrealistic to think one can be always better than others. I do not want to be better than others, but I want to do my best.\n\nPost sheets? Forget it.  YT cites my tutorials with copyright infringements. I have to file disputes often to keep my channel going."}, {"text": "@bbdhrggl well, yes that makes sense but.... I use everything that is supposed to use, and ofc... I put a nice Sheet in the discription, which you didnt... but probably after I told you this you will do it.. everyone does cause they want to be better than the others. thats how the humans are.. and I think you are not diffrent from the others.\nand why do you clue on my message? do you feel yourself attacked by me? "}, {"text": "@Nosensev57 why wait? just do it. :)\n\nbut, telling the notes is abetting a bad habit. those of us who read music should encourage others to learn, makes sense?"}, {"text": "@Hofmy10 my hands are not scared. you mean you are scared? better go hide under the bed. :)"}, {"text": "Your hands are scared !!!"}, {"text": "Finally a simple clear tutorial with no talking and repeating! \n\nthank you!!!!"}, {"text": "@bbdhrggl I totally agree with you"}, {"text": "Thank you, I love this, And your hands aren&#39;t ugly !!"}, {"text": "@bbdhrggl I follow Yann Tiersen&#39;s recommendations in his book religiously !!"}, {"text": "@empiresands   fingering varies from person to person. different editors use different fingering. one must choose what is most comfortable for their hands. "}, {"text": "Thanks for this. \nOnly one little thing I&#39;d say is you could have improved your fingering slighlty so that it&#39;s easier to play each note, and also some notes need to be held down a little longer. \nBut I understna it&#39;s a tutoraial video.. I recommend Yann Tiersen&#39;s book Vol2 which has the score for this in it for everyone who wants to learn this piece."}, {"text": "exacly that it just was an accident :( but finding your video is a best accident (i founded looking for the other one XD)"}, {"text": "good playing anyway thanks for answer :) but sad for your accident you said it to cruel:("}, {"text": "@recontrapachu your manners!! :S :S"}, {"text": "@nindocomic clicked the thumbs up by accident. Anyway, I avoid the pedal on tutorials so the sound of each note is clearer. :)"}, {"text": "love this song but you could use the pedal its sound better"}, {"text": "It is not an easy song, but I think I can play it with the slow version...thank you so much for the tutorial... !!"}, {"text": "merci encore et toujours, vous êtes la meilleure..."}, {"text": "When I saw this video, the first thing i thought was: &quot;i have seen these fingers in any other place&quot; That´s true :) thanks to teach me play &quot;Nothing else matters&quot; from metallica and now this song ^^"}, {"text": "thanks a lot! hope I can learn it soon"}, {"text": "very good tutorial!!! thanx so much!!!"}, {"text": "this is tough stuff."}, {"text": "wow thank you soo much :33"}, {"text": "Thank you so much your are an amazing player !"}]