[{"text": "Won’t the butter melt when we add warm milk?"}, {"text": "Decadent!!!"}, {"text": "Roll out to a quarter of a mm??"}, {"text": "Ma can we add egg or its not needed"}, {"text": "Can you activate the yeast with the warm milk instead of doing it this method"}, {"text": "Hi Gemma,<br /><br />Can I make this plain, without chocolate.Does the recipe remain the same."}, {"text": "Hello maam watching from qatar"}, {"text": "Can I use normal flour instead of bread flour?"}, {"text": "Bless you my love. I&#39;ve been looking for a proper croissant recipe. Thank you so much"}, {"text": "Guys sorry for asking so many questions but I am struggling with my croissant dough...it&#39;s breaking apart .. although I  fridgated the dough for the whole day. Any idea what would I have done wrong"}, {"text": "Your way is so much easier and faster than the others. I can&#39;t wait to make my one croissant."}, {"text": "I wanna make this for Christmas"}, {"text": "can we use the same method and dough for danish pastry?"}, {"text": "can we make this in a microwave?"}, {"text": "Hello Gemma, i am from Mauritius island, yesterday i tried your recipe for the first time, it was very very good. My children and husband were very happy it taste so nice and moist, thank you so much 😊. May God always bless you and your family, thank you for your love ❤️ of baking."}, {"text": "Can we use white flour instead of strong bread flour and can we increase the number of times we do the book fold?"}, {"text": "Thank you Gemma you are brilliant baker, thank you for the tip on how to store and bake when needed."}, {"text": "What about OTGs (Oven Toaster Grill)? Would the temperature and time differ?"}, {"text": "You are a great teacher<br />Thanks for sharing some tricks and tips of making in the microwave"}, {"text": "Do we need to keep the dough in fridge or freezer"}, {"text": "Thank you for such a wonderful recipe. I wanted to know if how could make it without an oven?"}, {"text": "I love all your  recipes 😋😋"}, {"text": "Tell us the quantities tho?"}, {"text": "please do tell where i can buy that oven"}, {"text": "This is pure genius! Most recipes take about 4-5 days to make croissants, but not in bigger bolder baking! Nah ah!! TFS"}, {"text": "I love croissant 🥐, i really want theseee"}, {"text": "nice👍🏻"}, {"text": "Wowwwwowwwoowwwwwww!!!! Hello Gemma I&#39;m a young aspiring baker and have learnt baking just from you. This recipie is a bockbuster. Me, my friends, and my family loves it..Love, Rohtash."}, {"text": "can you use Nutella for chocolate"}, {"text": "Very nice 👍👍"}, {"text": "Amazing ! Can&#39;t wait to try it out. Thank you for this great recipe :)"}, {"text": "U r a great cook 🤝"}, {"text": "Dear chef Gemma, Is it possible to substitute yeast with baking powder?"}, {"text": "Awesome 👍"}, {"text": "I want to die, I have just spend the last days baking croissants and just now I find this video which looks so simple 🙈😱😁, oh well, I have just subscribed and next week will follow this recipe 😂😂"}, {"text": "Nice"}, {"text": "Don&#39;t we have to activate the yeast?"}, {"text": "anyone watching it 2019 <a href=\"http://www.youtube.com/results?search_query=%23Bye\">#Bye</a> 2018"}, {"text": "1/4 of a mm thick?"}, {"text": "hey I made these for the first time from scratch... I didn&#39;t grate the butter but it turned out great the dough was nice and elastic followed the written recipe"}, {"text": "thanks a lot Gemma for the recipe! btw, how do I proof the dough? my oven doesn&#39;t have proof program.."}, {"text": "How many times should we repeat the process?"}, {"text": "Wrong look on the inside for croissants."}, {"text": "You didn’t mention the quantities 😏"}, {"text": "Yum! I was watching a comedian who said, “It’s easier to make a human than a croissant. Croissant makers are planners. You could go in that bathroom over there and make a human in 20 minutes.” This looks easy. Maybe not as easy as making a human, but it looks easy and fun."}, {"text": "you know there is a big red subscribe button right?"}, {"text": "I made these with almond milk, (my mother is allergic to dairy) and they were AMAZING!"}, {"text": "Gorgeous croissants....👍👍👍👍👍👍"}, {"text": "Hi, Gemma!  Do you have a recipe for &quot;chocolate cigars&quot;? (very popular in NYC) Thank you; LOOOOOOOOVVVVVVE your videos!"}, {"text": "𝘊𝘢𝘳𝘭 𝘞𝘩𝘦𝘦𝘻𝘦𝘳 𝘩𝘢𝘴 𝘫𝘰𝘪𝘯𝘦𝘥 𝘵𝘩𝘦 𝘤𝘩𝘢𝘵"}, {"text": "Ok this is just wrong....lol. i cannot afford all of these  ingredients to make all of these wondeful recipes im watching. Im making tiramisu first then the smores pie then probably the chocolaty croissants. Then take a break for a few days and run for 2 weeks straight. Sheesh. Thank you Gemma you are certainly a wonderful pastry chef. Im curious.....do you have children?"}, {"text": "always failed to make croissant and puff pastry 😢"}, {"text": "Gemma, I&#39;m going to try this croissant recipe but bake them plain because I&#39;ll stuff them after with cream cheese and lemon marmalade!"}, {"text": "Excellent recipe, but can i use white butter instead of yellow butter? I mean the butter comes from  buffalo"}, {"text": "Can i use all purpose flour instead of strong bread flour?"}, {"text": "Never imagined making croissants will be so easy.....I tried this method and the result was superb. Thanks Gemma 😊"}, {"text": "how to make it without yeast?"}, {"text": "Can I use almond flour and self raising yeast ..?"}, {"text": "You taught me the ice cream and since I feel happy when I watch your videos. Straight to the point with informative talking <br />Love it :) <br />This croissant recipe will cause a heart attack to a french baker 👨🏽‍🍳 BUT he should know that we can do anything we want right :) <br /><br />I prefer to go the easy way you showed cause it will be more tender like brioche and less layered. I loooove brioche too. <br />Would you tell if I can do it with 100% whole wheat ?"}, {"text": "oooooohhh, mmmm 😋😋🦄🍒🍒🍓🍓🍓❤❤❤❤❤❤❤❤❤💖💖💖💖💖💖💖💖💖💖💖💖💖💖"}, {"text": "Hey there... Fantabulous as always dear."}, {"text": "Gemma can change butter with margarine? Please answer coz I want to try to make croissant thank you"}, {"text": "Pls subscribe nahrin farhana pls pls i love your videos alot pls"}, {"text": "Mine dont get cooked from inner side. What should i do?"}, {"text": "It would be a wonderful idea if you show the measurements in the video."}, {"text": "Instead of egg can we use butter for the final wash step"}, {"text": "Can I use whole wheat flour"}, {"text": "Wow"}, {"text": "Plz tell quantity"}, {"text": "Waooooooo"}, {"text": "You&#39;re the best"}, {"text": "Baking temperature pls"}, {"text": "I made the dough. But the yeast is not melted and looks still as balls. I rolled, folded and kept in fridge. Pls advise whether it will be Ok for tomorrow or pls advise what to overcome this issue and bake good croissant"}, {"text": "What is easier to make chocolate croissant or cinnamon rolls?"}, {"text": "Dis someone tried to make this croissant?  How is it?"}, {"text": "❤️❤️"}, {"text": "Off subject, why do all your videos have front shots where you’re looking at us and others where you’re looking to the side? Great videos and amazing recipes though ☺️ thank you"}, {"text": "Don&#39;t we need to keep the dough out for the yeast to do its job? Also the yeast that I am using is made up of big granules. I followed your donuts recipe and it turned out amazingly well but a few of the yeast granules were still there in the dough. Should i dissolve it in warm water and add it to the mixture?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=xpmoYGmNbBk&amp;t=5m57s\">5:57</a> A quater of a milimetre? You mean centimetre?"}, {"text": "Hi... can v use brewers yeast instead of dry yeast... if yes what’s the proportion.  plzzzzzzzzz do reply"}, {"text": "Please send me your croissants recipe with the method I love your recipes"}, {"text": "U rock gemma"}, {"text": "i like your recipes .  i am egg allergic, can you please tell me alternative to egg wash in your recipes so that i could enjoy these too without getting sick."}, {"text": "You know what I love about u Gemma <br /><br /><br /><br /><br /><br /><br />Everything ❤️💕❤️"}, {"text": "Mam i saw u have written add egg in website.. But u dis not add here...pls help me"}, {"text": "You used your hand while your ring was still on"}, {"text": "Do you put it on the top rack or bottom?"}, {"text": "hi Gemma!! I have a doubt about the bread flour you mentioned in the recipe, does the wheat bread flour also work for it ? or should i use any other type of flour cos we have too many flours here,and its difficult to understand which one suits best..."}, {"text": "can you show the recipes in here rather than have to click the link, that way can view your video also recipes handy🙏"}, {"text": "please do with chocolate base😐too"}, {"text": "aaaam how many times we have to fold it"}, {"text": "Made these.  Delicious"}, {"text": "Yo cook very good and please show how to make cheesecake"}, {"text": "I really like your videos.. <br />I hope some day  i can study pastry and baking because it makes me feel happy.. And i love baking it is one pf my dream..  To be a chef"}, {"text": "Looks fantastic. Piece of art"}, {"text": "👍👌 Thank u 😚"}, {"text": "Maybe activate the yeast first?"}, {"text": "Hi man, ur&#39;s way of learning is very good fast nd <a href=\"http://easy.now/\">easy.now</a> I m also became a good baker to see ur&#39;s recipes . thnx"}, {"text": "I&#39;m coming here after watching Tasty try to make croissants."}, {"text": "Hey gemma... My dough was quite runny?? Didn&#39;t understand why"}, {"text": "I think your croissants look adorable and delicious....going to bake some soon..."}, {"text": "I&#39;m all for easier techniques. Who cares about methods as long as it all tastes the same in the end."}, {"text": "You did not mention the quantities of ingredients"}, {"text": "I can’t understanding one thing after giving them a shape (croissant) we can refrigerate them but whenever we want to make we have to wait for 2-3 hours for the rising of croissants ? They rise where in refrigerator or out from it ? Please explain  and one thing more 😬for how many days we freeze them ?"}, {"text": "Looks delicious.. Please can you tell how to make these with dry yeast ."}, {"text": "I have all the ingredients at home.. ur method is so simple..now i can finally make croissants"}, {"text": "<a href=\"https://www.youtube.com/watch?v=xpmoYGmNbBk&amp;t=5m56s\">5:56</a> quarter of a millimetre thick 🙄🙄🙄 what?"}, {"text": "wow these croissants look soo good, you are a master chef"}, {"text": "Oh Gemma! What would I do without you? From condensed milk to cream cheese to easy croissants, you&quot;re a gem Gemma!"}, {"text": "There is no measurement"}, {"text": "so yummy"}, {"text": "This is my first video I watched from ur channel. Really good,like ur style on baking. Good Luck!"}, {"text": "Gonna try these. I like that its a quick method. Still going to try old school method but this is a good first step."}, {"text": "Waaao u r so talented my dear I m gonna try this very soon Nd now I m trying ur cinnamon roll by this evening today 😊"}, {"text": "I followed your instructions exactly like u said with the exact measurements and all but my dough was too wet. So I added all-purpose flour until the dough looked like yours and was easy to work with. The croissants in the end tasted amazing. Your recipes usually work well for me but I don’t know what went wrong this time. I made it again and the same thing happened. Could it be cuz my butter is softening by the time I’m mixing the dough? Or do I have to use bread flour? Is that why mines not coming right?"}, {"text": "What do u mean by proof??  What if I don&#39;t have oven like urs??? Please guide"}, {"text": "hi from india....hav u used  instant yeast....thanks ."}, {"text": "I don&#39;t have cling wrap ....can I refirigerate with a zip lock cover ?"}, {"text": "I don’t know how much you take things"}, {"text": "Please share quantity too"}, {"text": "Hey Gemma! This recipe seems simplified enough  for me to try :). Though, if I don&#39;t have a &#39;proof&#39; button, do I leave the croissants outside at room temperature covered with a kitchen towel? And for how long?"}, {"text": "I love u  thanks"}, {"text": "I rather just get it from Tim Hortons"}, {"text": "What if while folding, the dough keeps breaking..?what am I doing wrong.. please help"}, {"text": "Can we use nutella instead of chocolate chunks?"}, {"text": "your foods look so tasty!"}, {"text": "Can this be made with your crazy dough recipe?"}, {"text": "Hi gemma i made this recipe before and it came out slightly underbaked in the centre. I just wanted to know is it necessary to use strong bread flour or not."}, {"text": "Hey gemma<br />If we use instant yeast instead of dry yeast do we have to use the same amount of quantity?"}, {"text": "Can I use wheat flour half &amp; half plain flour"}, {"text": "لوسمحتى كنت عايزةالمكونات<br />Please<br />thanks Gemma"}, {"text": "From India 🇮🇳 with Love 💕"}, {"text": "Very delicious recipes...thnk u mam"}, {"text": "Which flour should I use"}, {"text": "Can you make it without yeast pls"}, {"text": "HI GEMMA , Is it OK to just give the croissants a milk wash instead of egg wash .. ??"}, {"text": "Gemma plz tell about your tv appearance on 5 may 2018..was it on living foods <a href=\"https://www.youtube.com/watch?v=xpmoYGmNbBk&amp;t=9m00s\">9:00</a> p.m."}, {"text": "This recipe and method is encouraging me to make croissants, thank you Gemma"}, {"text": "love your channel ..it really made me inspired to do baking with all your videos..😊❤keep it up!"}, {"text": "Who’s watching this 2018 lol 😂"}, {"text": "Very nice yummy mouthwatering recipe 😊 👍 👍"}, {"text": "Looks awesome Gemma !!"}, {"text": "Thank you...I made Croissants with your recipe and they turned amazingly delicious!"}, {"text": "I am from India and I have tried many of your recipes they are good  pls do keep sharing"}, {"text": "Shame on whoever disliked this! Nice video!"}, {"text": "hi<br />loved this recipe<br />wanted to know that is there any substitute of yeast"}, {"text": "Plz give tips and tricks on how to freeze them...can i make a night before ?"}, {"text": "I have active dry yeast so do I need to activate the yeast before mixing?"}, {"text": "Written recipe site is not opening"}, {"text": "Hey, Gemma. I followed your recipe and freeze the dough for 1 1/2 hour as taught. Then, when I took it out, place it on my countertop, rolled it out to the measurements you’d stated in <a href=\"http://biggerbolderbaking.com/\">BiggerBolderBaking.com</a> to fold, I found that it’s really hard to fold the dough. The dough keep sticking to my countertop which makes it impossible for me to fold the dough like a book. I did scatter some flour on the countertop and the dough like you said, but the dough still sticks to my countertop. Any idea why this happens and any way to overcome this? By the way, I did tried a few other of your recipes (Best Ever Brownies, Best Ever Banana Bread......) and they’re the best!!!👍👍 Not only do they taste amazing, your recipes are easy to follow and include precautions that bakers should take note of. I really love your recipes and will always be anticipating for your other new recipes. 🤓🤓🤓"}, {"text": "Gemma from where do you get your awesome recipes?"}, {"text": "Thank you Gemma, for this lovely recipie!"}, {"text": "What is proof ?"}, {"text": "oh!...please!!!GEMMA can u tell me that can i use simple flour than a bread flour...it is not available<br />plz/...tell hurry!1"}, {"text": "I tried it today i made it but it ws bit hard from inside can u tell me why? I think its bcox of yeast i put little more!! Plz tell me how to make it soft from inside?"}, {"text": "Butter salted or unsalted?"}, {"text": "Can I do this with wheat flour"}, {"text": "Girl I love you!  I am a new subscriber and I love your baking! I am totally addicted. I can&#39;t stop watching."}, {"text": "Who&#39;s seeing this in 2018"}, {"text": "Crazy donuts"}, {"text": "Hi Gemma, this croissant is looking so good but is it ok if i don&#39;t add sugar to the dough?  thank you"}, {"text": "Please say &quot;butter&quot; again :)"}, {"text": "Don&#39;t brush your croissants with too much egg wash like she did because they can burn but the grating butter idea was smart"}, {"text": "Can you please teach us how to bake without oven?"}, {"text": "Is it possible to prepare them in a regular oven (not a convection one)?<br /><br />Also, when you place the dough in the fridge the first time (for 90 minutes to cool off the butter) is it possible to leave it there for more time? Will it spoil it in some way? I&#39;m asking since I might not have much time in one evening to make the whole first step of the recipe, hence I&#39;m looking for break points where I can leave the dough and continue on the following evening.<br /><br />Thanks in advance, Can&#39;t wait to make them :)"}, {"text": "I am drooling right now so GOOD!"}, {"text": "I love croissant but it takes time to make it. So I decided just keep buying it from the store. But now I will definitely make so simple procedure. Yum! Thanks Gemma. More power and God bless you."}, {"text": "can i replace butter with vegitable oil ????"}, {"text": "Can you use all purpose flour if you don’t have bread flour"}, {"text": "Hello ma&#39;am <br />Can we make this with wheat flour?"}, {"text": "On your blog you have 1 1/4 cups of flour but i had to use 2 1/4. Did i go wrong somewhere?"}, {"text": "Haajra is Mama’s sweetheart"}, {"text": "👌"}, {"text": "I tried them.... tasted sinfully amazing..... but butter leaks out during baking..... any suggestions please ?"}, {"text": "Butt-her..."}, {"text": "love u so much gemma n also for u easy recipes"}, {"text": "Very good and thanks ."}, {"text": "Gemma, you used your hands while mixing  the dough, and your rings were on!!!!"}, {"text": "I wont see this video anymore, the way she says butter is driving me crazy"}, {"text": "Amazing!!!"}, {"text": "I get lost in your recipe world when ever I step into it ,love your recipes very much,will try as much as possible."}, {"text": "Hi Gemma Should I keep the dough in the freezer rather than the fridge? I kept the dough (after the first stage of mixing everything) in the fridge for more than 90 mins but it was still very bouncy and soft, not the firm and flat shape shown in your video. Plus, is 7g of yeast a bit too much for 250g of flour? My dough felt like a puffy sponge throughout the process...Still proving the doughs now. Will see how they turn out. Thanks so much! &gt;_&lt;"}, {"text": "Hi Gemma<br />I have only just discovered your  web. <br />I love it....but there  is a problem...<br />I seem to be missing the  ingredient quanties..<br />which makes it a little difficult....to perfect  your....recipes.<br />plse help .<br />many thanks <br />Carol K"}, {"text": "Gemma, I have a question about proving them at room temperature for 2+ hours. Wouldn&#39;t this cause the butter to melt? I&#39;m a novice, but I was under the impression that the butter needed to stay solid until going in the oven. This is what allows for the layers to form. I&#39;ve tried this method  twice now. The first I followed the instructions exactly and I believe the butter melted and  sank to the center. They were still delicious just not flaky. In my second attempt, I only grated a little butter into the dough and then  used frozen butter  in the traditional folding technique. My thoughts being I wouldn&#39;t have to chill between folds. This batch is at the proving stage and  this Is why I thought I&#39;d ask you about the 2+ hours at room temperature."}, {"text": "Heaven absolute heaven<br />You are adorable<br />Thanks you 😇"}, {"text": "I opened your website but still I didn&#39;t find substitute for egg"}, {"text": "😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋"}, {"text": "wait can u use all purpose flour??"}, {"text": "Hey Gemma. Here, can we use your home made butter recipe for making the dough?"}, {"text": "&quot;Little pieces of BOUTTHER&quot;"}, {"text": "I love the way u instruct !"}, {"text": "Wow these are beautiful! My little brother loves croissants and your recipe makes it look easy compared to normal, I will definitely give these a go sometime! I need to get me a ruler 😄"}, {"text": "Can we bake donuts in donut baking tray?"}, {"text": "I tried these today and i must say i was impressed how perfect they turned out!Everyone loved them and they were so tastyy thank youuuu😃😃"}, {"text": "Hello<br />Thank you<br />If I want to give someone or sell unbaked ones, can you plz tell me how to proceed?<br />Do I have to proof them before freezing.them?"}, {"text": "I&#39;ll be damned If I actually manage to pull these off @.@"}, {"text": "If we dont want chocolate in the middle do we have to cut the slit at the end of the triangle???"}, {"text": "Instead of grating the butter can we cut the butter in flour using food processor<br />Will it work?"}, {"text": "ingredients  quantity ?????? help me i want to make this cookies??"}, {"text": "This is surely a technique fir true bakers"}, {"text": "You doesn&#39;t love a chocolate croissant. BIG THUMBS UP"}, {"text": "If i dont have proof function what I can do for this step?"}, {"text": "Veg croissant"}, {"text": "I love cooking"}, {"text": "If you have it on your website bigger bolder baking please reply"}, {"text": "Can you please show the recipe of veg croissant"}, {"text": "for how long can i freeze the croissant?"}, {"text": "Gemma please.. i hope you read and reply to my comment.. after i made a beautiful croissant dough cooled it overnight and all , i made a catastrophic mistakes .. first i totally forgot and let it proof in a warm place so the butter started to melt and the croissants started to crack and deform.. so i gathered them in one big dough again and folded it many times all over again and kept it in the fridge but after a couple of hours i checked it and tried to spread it but it wasn&#39;t elastic and it also went sort of oily... please tell me it is still can be fixed .. i do hope you or any one would help me before i lose hope and just throw it away 🙁🙁"}, {"text": "And how many sticks of butter will that be?"}, {"text": "Oh my goodness I tried making croissants and this is the only recipe that works for me anyway"}, {"text": "Please help me Gemma, I cant even make a yeast alive! :( can you please give me some tips? Would really appreciate if you replied.."}, {"text": "can use only butter or must be use pastry margarine ?"}, {"text": "Can we use all purpose flour instead of the strong flour?"}, {"text": "I m Indian...  I love your all recipes...  Love from India 😘😘😘"}, {"text": "I&#39;m wondering what recipe on your channel won&#39;t be fantastic !! You are truly fascinating . I&#39;ve  started to love baking thanks to you."}, {"text": "hello Gemma i always watch your videos i am a big fan of you i tried your recipes and it gives me lots of happiness i can&#39;t tell you how much i love to make different foods  i am using halogen oven i also tried this recipe too but i used margarine rather then butter and my croissants was not made fluffy  and crispy and layer are not over there i want to know did i use margarine thts why all happened wrong to me in ths recipe?"}, {"text": "+gemma stafford can i use all purpose flour instead of bread flour please help bcz in india i am not getting the bread flour"}, {"text": "What else can I fill the croissant with except chocolate?"}, {"text": "how are you supposed to make it she doesn&#39;t tell you any of the measurements"}, {"text": "This is the fourth recipe I tried to follow from Gemma and all four turned out so good! My family loves all of them, thank you for the wonderful written recipes Gemma! I even have a file just to collect all the recipes printed from your website! :D"}, {"text": "What is Strong Bread Flour? In Canada we have Bread Flour and All-Purpose Flour. What&#39;s the difference and which one does this recipe use?"}, {"text": "hi gemma.love your recipes.subscribed to your channel.just one question which butter you use salted or unsalted? can&#39;t wait to try your recipes."}, {"text": "Can you use all purpose flour instead of bread flour"}, {"text": "How many croissants did that batch of dough make?"}, {"text": "Why was that dough different then the actual crazy dough?"}, {"text": "what is strong flour"}, {"text": "Gemma can u use Nutella for this recipe"}, {"text": "hi Gemma, can I use dry yeast and leave it in milk with sugar and then add to the flour? I do not have active dry yeast with me now. do they work the same? I&#39;ve made this twice with active dry yeast and they&#39;ve turned out amaaazing!!! I&#39;m not getting active dry yeast here for a while now."}, {"text": "if I want to make cheese croissants can I just put a piece of cheese instead of choc and bake at same temperature?"}, {"text": "Hi I am from Malaysia, here weather humidity is high so during the preparation is the butter will melt easily, do you have any advice how to solve this issue? Tq"}, {"text": "This was actually the very first recipe I learned from Gemma I told her that I will make them then the other day she replied and I was so happy because non of the chefs ever replied to me😅"}, {"text": "Ma&#39;am I simply loved this recipe and surely gonna try it , I just wanted to ask if we can do the book fold more than three times?  Good day 💕"}, {"text": "Wow! Yummy! <br />Wanted to know whether i can use margarine instead of butter? Will it give me same results in terms of texture and taste?"}, {"text": "Amazing! Love your videos. My daughter who is 5 loves watching your videos . Last night she saw your popsicle video and said &quot;mum I love her&quot;."}, {"text": "Wonderful croissants . Actually i like your  channel a lot &quot; though i am a new one here :-) &quot;  , i love the way you make your recipes : you are always smiling ,  working with ease and love which encourages anyone to try the wondeful things you make . thank you  . Meryem from Morocco .."}, {"text": "Hello Gemma! How can I make this recipe with fresh yeast?"}, {"text": "Can I use oil instead"}, {"text": "You are awesome...just skills are excellent...!"}, {"text": "you are the best"}, {"text": "hey Gemma, can you make a fathers day snack and can you make it before father&#39;s day please and I love your videos😋❤👌"}, {"text": "I love all your recipes.. can you please tell how to make yeast..I&#39;m from India.. and I do not find yeast here please"}, {"text": "make pizza"}, {"text": "Where is she from"}, {"text": "What are the measurements?"}, {"text": "Other than chocolate what filling can we put to make it savoury?"}, {"text": "Do we have to have yeast because I&#39;m struggling to find any video showing how to make croissants without yeast but none of them do!!😖😖😖😖😖help me!"}, {"text": "butter is nice and chill😎"}, {"text": "try to make a three milks cake.(aka tres leches cake)please😉"}, {"text": "its so satisfying when u roll the crossaint"}, {"text": "hey gemma! another wonderful recipe like always.<br />but how do I proof without an oven like that? what does proofing really mean?"}, {"text": "Does the yeast have to be dried? Thanks 😉"}, {"text": "penge<br />\\"}, {"text": "I think the idea of grating the frozen butter is really cool. Otherwise, it would just be too much hassle to make them at home. I also think the French put a little too much butter in theirs so this allows me to adjust it to my taste. You&#39;re my favorite baking instructor on Youtube."}, {"text": "Thanks for the easy recipe! im a poor student and i proudly was able to make these decently using my extremely poorly equipped kitchen.. using a wine bottle as a rolling pin was even a bit helpful after i got the idea of filling it with ice water to stop the butter from melting lol"}, {"text": "Unfortunately I try it more than 5times and it didn&#39;t work.."}, {"text": "Can I use a food processor?"}, {"text": "Hi Gemma. I tried your recipe and it turned out delicious. I wanted to ask you this...for how long can I save the puff pastry in the refrigerator?"}, {"text": "Can I get layers as your one with All Purpose Flour?"}, {"text": "hi can I use plain flour  instead of strong flour is that fine? please"}, {"text": "What is the vegetarian substitute for egg wash?"}, {"text": "Thank u Gemma! Can u please come up with a recipe for Almond croissants?"}, {"text": "delicious do some croissants of strawberry greetings for Mexico"}, {"text": "very nice👅"}, {"text": "Hello, could you please tell me your oven&#39;s type and name, I would like to buy one of that."}, {"text": "i&#39;ve tried it and it tastes amazing..thanks alot for the recipe 💜"}, {"text": "I tried this recipe and it comes out perfect...thank you  for this awesome recipe..😊"}, {"text": "hey Gemma it&#39;s  an amazing  recipe ...u all recipes are delicious  thank you for such recipes 😘😘😘😘"}, {"text": "Which flour do u use for the recipes."}, {"text": "Hi Gemma! I found your channel and I&#39;ve already done five recipes. This one included. Loving and learning a lot with you. Now I&#39;ve been requested to adjust this dough with a hot dog. I&#39;ve checked one comment where you suggested to low or leave out the sugar. So, I will probably do that but I was wondering if instead you could suggest to pick another of your recipes to have a nice wrapped hot dog? Help me please. Greetings from Ecuador."}, {"text": "yo you really are big and bold,we Love you Gemma"}, {"text": "lovely....."}, {"text": "I tried the recipe but they didnt proof here 1 sachet means 11 grm yeast .though they taste  good but smaller in size."}, {"text": "plz gamma post hot cross buns recipe"}, {"text": "plz gamma post hot cross buns recipe"}, {"text": "hi gemma i always use home made butter so i cant grate it like u did so what should i do"}, {"text": "I impressed myself today. the crossiants turned out beautiful. thanks to ur easy peasy recipe..😘"}, {"text": "Superrrr recipe as usual Gemma! But just on a side note, your nail polish is da BOMB! ;)  I see it in many of your videos and i think, now that&#39;s the fairy floss spirit &lt;3"}, {"text": "Baked these babies yesterday and they were an absolute hit!! Thanks Gemma xx"}, {"text": "What if there&#39;s still some spots of yeast in the dough after you refrigerate it?"}, {"text": "lovely"}, {"text": "Beautiful and delicious "}, {"text": "can margarine replace butter?"}, {"text": "I finished making these today, I impressed my friends and family as it was my first time baking! They were sooo good, thank ya!"}, {"text": "you are the BEST👍"}, {"text": "What can you use instead of egg wash?"}, {"text": "can you help me out ? why yeast?"}, {"text": "first of all you have to use the bread flour to get the maximum volume. Second of all folding is only meaningful when the butter and dough is laminated seperately. if youre mixing the butter into the dough its more like brioche not croissant. However many people try to avoid this step. The reason why gemmas croissant didnt have the distinctive layers that we find in parisienne croissants is because of what I have explained. when they are baked the dough and the butter will eventually fuse. I bet if you made her recipe without failure you could go try and make the authentic croissant recipe. Check out his recipe too ! bruno albouze on youtube. Makez sure your dough snd butter chilled firm to the touch but still workable"}, {"text": "&quot;I m gonna add some chocolate disks, but if u don&#39;t like chocolate u can leave it out&quot; <br />Gemma this is some serious injury how can someone not like chocolate. I mea &quot;CHOCOLATE CHOCOLATE CHOCOLATEEEEEE&quot;"}, {"text": "why do we need to roll it our again and again y can&#39;t we just roll it out once and then proceed??????"}, {"text": "can i use this recipe for Cronut ?"}, {"text": "can you use a food processor to grate the butter??"}, {"text": "you r so sweet mam and your videos are fab and very helping thankyou"}, {"text": "gemma,can i use all pupose flour for it?does it will gave same results?"}, {"text": "I&#39;ve just made these today... Delicious! My family ate them in a couple of minutes. All that work for an instant of yumminess... :) but totally worth it!"}, {"text": "hello gemma ,its love to watch your recipes,i wanted to know if we can keep this dough in freezer for later use or un baked croissants ? can we thaw and bake them"}, {"text": "What does she say in the beginning? &quot;Hibol Bakers&quot; What does that mean?"}, {"text": "dear Gemma, long story short there was not enough flour in your recipe... I had laid out all the dry ingredients and double checked the amounts but needed to add 1 whole other cup of flour before the dough even came together instead of being a gooey mess. still have yet cook them. Keep you posted."}, {"text": "What is proofing??  Could you please explain"}, {"text": "I did them and they didn&#39;t turn out very well. on the inside it was like dough ,even when I put it in the oven for longer😕. it also tasted like dough..."}, {"text": "please give the quantity of ingredients"}, {"text": "Hi genius Gemma can u give as the exactly quantity of ingredients in ur recipes"}, {"text": "It is not a chocolate croissant, it is pain au chocolat. 😑"}, {"text": "your so clever!!!!!!"}, {"text": "give recepie by gramms slowly and clearly  please."}, {"text": "If I don&#39;t want to leave the dough overnight, how many hours would you recommend to leave it in the fridge instead?"}, {"text": "When you are making croissant cut a circle then cut like pizza 🍕 and roll it as normal"}, {"text": "<a href=\"http://www.youtube.com/watch?v=xpmoYGmNbBk&amp;t=1m05s\">1:05</a> though..."}, {"text": "<a href=\"http://www.youtube.com/watch?v=xpmoYGmNbBk&amp;t=5m56s\">5:56</a> QUARTER OF A MILLIMETER THICK!! I hope you meant a quarter of a centimeter"}, {"text": "these don&#39;t look fluffy and the chocolate barely melted"}, {"text": "hi! I tried making these croissants, the butter melted away during the proofing. how do you prevent that, because you need to need to keep it in a warm place for it to proof right?"}, {"text": "Gemma,  can I not use any sweetener or is it essential? Also could I use gluten free flour ?"}, {"text": "Hello!!!!can I leave the dough at room temperature instead of putting in the fridge?????"}, {"text": "in the microwave what would be the time span?"}, {"text": "😘 you are too good"}, {"text": "Gemma which is better? The standard rolling pin or the French rolling pin or the silicone one? Thanks Gemma.Oh one quick thing.Can I make the croissants with the puff pastry recipe without yeast?"}, {"text": "Can you spread Nutella on it before you roll it? If you can, my dreams have come true!"}, {"text": "Lovelyyy<br />Thanks for the video"}, {"text": "I like that ."}, {"text": "Gemma can we add jam instead of chocolate?"}, {"text": "um yes, r u going to finish that croissant?"}, {"text": "What kind of flour? Can I use all purpose flour?"}, {"text": "Gemmaaaa! I have trouble rolling the dough out ! The butter just melts all over my table, I refrigerated it but it didn&#39;t seem better ! The temperature here is pretty hot by the way. Please help me ! Love your videos. I&#39;ll always be your fan. ❤️❤️❤️❤️"}, {"text": "hai, yesterday I try ur recipe, I follow the recipe at ur website but for the butter I use frozen  margarines and it fails. somebody heeelp me pls.., i use the same exact amount. it melted so fast. well, in indonesia the weather just windy so I think the environment temperature doesn&#39;t affect the dough.. pls pls help me Gemma"}, {"text": "I just baked the croissants this morning, and I set my oven to &quot;bread proof&quot; and it only took about 1 hour to proof the croissants. I heated my oven to 450 degrees F but as soon as I put them in the oven half of the croissants got burnt. But then I lowered the temperature to 350 and they turned out great! I love this recipe!😊"}, {"text": "Can we use this recipe for puff pastry appetizers and as pie crust"}, {"text": "Hi, Gemma. If I wanted regular or savory croissants, would I reduce the amount of sugar in the dough or leave it as is? I&#39;m planning to fill it turkey and gruyere or some other savory combination."}, {"text": "Nice Gemma!!! This reminds me of Ariel&#39;s French Croissants 😋 😋😋<br />Check his recipe out <a href=\"https://youtu.be/-tUdXE9rJZo\">https://youtu.be/-tUdXE9rJZo</a>"}, {"text": "I&#39;ve made these twice now but I&#39;m still having problems with cooking them. The first time I burnt the outside but it was raw in the middle, then I turned the heat down to 190 degrees and they were perfect on the outside but still raw in the middle. Is it because I&#39;m using a fan oven? Am I cooking it too quickly?"}, {"text": "Going to try these soon!  After trying your incredible carrot cake recipe, I can&#39;t wait to try to master the croissant and try your recipe! Big fan."}, {"text": "is it necessary, to use bread flour? please let me know because i want to make some croissants"}, {"text": "I tried the recipe and it Worked really really well!! Thanks a lot. :) I wonder you can simply dip your croissants into nutella chocolate spread"}, {"text": "these look like little conch shells 🐚"}, {"text": "this is sooo awesome....my mum is obsessed with croissants n we watched it together n is definitely makin it tomorrow<br />tanx Gemma"}, {"text": "wer are the measurements? ????"}, {"text": "Do I use unsalted butter or salted ? I&#39;m always confused when you don&#39;t specify."}, {"text": "can we use baking powder/soda"}, {"text": "plz reply"}, {"text": "can I use butter instead of frozen butter??"}, {"text": "Looks heavenly. My mouth is watering.  Love your Irish accent❤🍀"}, {"text": "This is the only recipe so far that&#39;s is actualy so helpful and easy and doesn&#39;t require more than 3 hours thank u 👌😋"}, {"text": "wow that is lovely. I&#39;m going to try it. good job"}, {"text": "she pronounced butter like &quot;bosher&quot; oh my god her accent is fancy 😁"}, {"text": "I loved your technique on the butter!! Subscribing. ✅"}, {"text": "If I multiple the recipe does the time of chilling and rising the dough also multiply? Or do I have to make the 2 parts separate?"}, {"text": "Will thus work with gluten free flour?  I&#39;d like to make these (without chocolate haha) for thanksgiving but me and 2 other people in my family are allergic to gluten:)"}, {"text": "That&#39;s not how you make a proper croissant."}, {"text": "Can i use baking powder than yeast?"}, {"text": "Thanks :)"}, {"text": "I have a question, how did you dissolve the dry yeast? I mean I made this recipe but the yeast never dissolve or disappear :/"}, {"text": "Can you make maracon"}, {"text": "hi why book fold and not the same fold we do for Puff Pastry the three folds??? just curious."}, {"text": "can i use all purpose flour"}, {"text": "putting cheese in the middle is really delicious too! :)"}, {"text": "I have never seen that pretty croissants in my whole life :D wow"}, {"text": "thanks for the reply but no actually I mean store the dough befie baking n after proofing in the refrigerator for how long?"}, {"text": "How many does this make?"}, {"text": "how long can I store the dough in the refrigerator pls guide"}, {"text": "I tried with cooked Bacon stuffing n it tasted delicious...not so flaky like yours but I think I will get there with practice...thanks gemna"}, {"text": "A quarter of a mm or cm?"}, {"text": "hello there! i was juss lookin for a donut recipe ....n was totally impressed by urs...then it took me to this beautiful crossands...i m definitely gunna try both the recipes nxt mnth!thanx!g&#39;day! 😄 keep bakin! 😉"}, {"text": "So much love from India! Beautiful videos. All of them. Thank you so much for uploading."}, {"text": "Looks great!!! Always love your videos!looks delicious, I would definitely try it. :)"}, {"text": "thank you gemma! but can we use all purpose flour instead of bread flour?"}, {"text": "How long will the croissant dough last in the freezer after being rolled?"}, {"text": "you are my absolutely most favourite baker in the world! :)"}, {"text": "You said quarter of a millimeter but it is a centimeter."}, {"text": "Is it possible to use a butter substitute? to make them allergyfriendly, maybe shortening?"}, {"text": "can plz someone tell me how is the degree in celcius plzz"}, {"text": "i loved it!  could you make a croissant with vanilla cream inside?:)"}, {"text": "What is alternative of butter in this recipe ?"}, {"text": "will it make a difference if we  fold the dough more"}, {"text": "The fridge can&#39;t spoil the yeast ?"}, {"text": "Can I use a food processor instead of the box grater?"}, {"text": "why put your dough in the fridge?? Gemma"}, {"text": "what does proofing the dough mean?? how can it be done if my oven doesn&#39;t have that option?"}, {"text": "hi gemma, thanks for sharing this recipe! i have one question though, can i cut the butter in small chunks then incorporate it into the flour mixture with food processor? thanks!"}, {"text": "i just made these last night and your meringue rolaude !they were such a hit!my family and friends loved me ,they told me i was baking stuffs like a proffesional chef.Thank you so much for all these amazing recipes!"}, {"text": "wow u made it with such easy steps and looks so yummy and gorgeous I always thought that shaping n making croissants would be so hard but when I saw this vid , I was so shocked that making croissants r so easy thanks for sharing this vid !!!"}, {"text": "Gemma mine didn&#39;t double the size ... :( what I did wrong )"}, {"text": "I&#39;m a bit miffed on the frozen butter and adding heated milk for the yeast that will melt the butter along with bread machine that heats the liquid to get the yeast activated."}, {"text": "can you use instant yeast?"}, {"text": "what can be a substitute for yeast?"}, {"text": "Hi Gemma!Please answer can I substitute strong bread flour with all purpose flour?"}, {"text": "Hi Gemma!Please answer can I substitute strong bread flour with all purpose flour?"}, {"text": "hi gemma I love your videos they are so perfect and easy ,I was wondering can I use the machine to do the dough cuz it&#39;s really hard on my hands 😭😭😭 will it be the same results"}, {"text": "if your irish, why do you use Fahrenheit. ps do you still live in ireland?"}, {"text": "hi Gemma, I have done this wonderful recipe, my kids loved so much. thank u cause u made me a gd chef. I am greatful to u. ☺👌👌👌👍👍👍💕💕💕👏👏👏"}, {"text": "Can u show an egg free,gelatin free red velvet macarons"}, {"text": "wow it good"}, {"text": "Oh I just requested this on the puff pastry recipe video, Thank You! I haven&#39;t gone through your channel since such a long time. Love your videos!"}, {"text": "I made this but with plain flour as I did not have bread flour and it came out fine but it tasted more towards pastry and it didn&#39;t have the buttery taste even though I followed the recipe properly"}, {"text": "tried this recipe came out very well I just made plain ones thanks Gemma"}, {"text": "you could put some marshmallows in ther too but I think its also perfect just with chocolate"}, {"text": "if you knead the dough , will it work?😁"}, {"text": "How do you make egg wash?"}, {"text": "I insta subbed little while back great vid!:&#39;-)"}, {"text": "Can I use nutella or will it run out of the croissants while baking...."}, {"text": "Gemma oh could please make a pastie :) as your recipes are all helpful"}, {"text": "please help gemma my birthday is this week i want to make"}, {"text": "please gemma make patties"}, {"text": "in the recipe you mentioned bread flour how to make it?"}, {"text": "Thank you for the great instruction!  I&#39;ve always wanted to make croissant but scared it would be too difficult for my skill level.  You&#39;ve taken some of the fear out of it.  I&#39;ll have to try this recipe soon!"}, {"text": "what does it mean to proof?"}, {"text": "@gemmastafford which would suggest I buy for home baking? my budget I&#39;d around 10 thousand indian rupees. I have seen an oven with otg plus convection. will that be the not the best but okay choice?  but it doesn&#39;t have the functions that an oven used by u in this video or any other commercial bakery have. I want your opinion. help me out please."}, {"text": "i grate frozen butter for my pie crust."}, {"text": "Where is she from?"}, {"text": "How about Sausage Croissants? 😍"}, {"text": "plz make chocolate danish"}, {"text": "Amazing recepie!!"}, {"text": "more chocolate inside?"}, {"text": "Can you try it i want to see how it will come out so i could see the results"}, {"text": "Is the dough just a basic puff pastry dough?"}, {"text": "can u use butter instead of chocolate"}, {"text": "it will be pleasure if you provide the exact quantity of the ingredients too...:)<br />TIA"}, {"text": "Ok yeah this is so much easier."}, {"text": "Delicious😋😋😋😋😋"}, {"text": "I am try to get the recipe. I signed up but it keep telling me to sign up"}, {"text": "Could you freeze the dough before shaping them?"}, {"text": "Hai Gemma, can I use all purpose flour?"}, {"text": "i made it <a href=\"http://yesterday.it\">yesterday.it</a> was fantastic and super easy.<br />thank u very much,<br />love u ♡♡♥♥♥"}, {"text": "how do you use instant yeast instead of dry yeast?"}, {"text": "I made 8 croissants and 3 tiny ones with the left over dough"}, {"text": "I made it and it was so delicious and cute"}, {"text": "Hi Gema, is it without egg?"}, {"text": "hi Gemma i made the croissants today and they are incredibly beautiful."}, {"text": "Why dont you try putting your oreo cookie butter in their instead of choclate"}, {"text": "I almost likes a original crossants."}, {"text": "hello gemma how r u please tell me how can I find bread flour or if I can use any flour"}, {"text": "oh and I&#39;ve got fast acting yeast, is there a difference in mine and yours?"}, {"text": "wow I just realized I&#39;m addicted to your channel lol, if I need a desert your the first place I goand for other things too, actually I just look for what I want on your channel if I don&#39;t find it I pout and go everywhere till I find something decent lol, but still they ent you love (hugs)"}, {"text": "what can i use instead of yeast ?? plz help"}, {"text": "I love them. They&#39;re amazing and So delicious ❤❤❤ perfect"}, {"text": "You didn&#39;t let your dough to puff up bcoz after freezing it was not rised ratger it was hard and flat before prooving???"}, {"text": "Can I use all purpose flour?"}, {"text": "um Gemma can you please make macrons please😄😄😄"}, {"text": "I think the word you&#39;re looking for is perpendicular."}, {"text": "my dough had no chill ;)"}, {"text": "You love chocolate"}, {"text": "the way she pronounce butter is bussher its annoying"}, {"text": "If u don&#39;t want to make the dough your self can u still put the chocolate in a ready made crosant dough??"}, {"text": "when I was rolling it then doing the book thing , it was breaking even after few trys.. what do I do?"}, {"text": "Are you going to finish that croissant?"}, {"text": "how do u proof in a normal oven?,"}, {"text": "hi can i use this dough to make cronut"}, {"text": "I made this but I put cinnamon sugar on top of them and they turned out delicious"}, {"text": "If you can&#39;t lay the yeast on top of the salt because it will deactivate it isn&#39;t it the same thing when you mix it up together?"}, {"text": "can you make a chocolate star bread"}, {"text": "omg...love it, ,when I&#39;m continuing watching your videos, I got some more interest on baking, ,,and I wish, I  could have a machine and tools in baking like yours. ,,<br />and mostly you baked are the same with philippine taste. thank you for the recipe Ms.Gemma"}, {"text": "omg!!!!you&#39;re a god i tried it today and it turned out just AMAZING!!!and it really tasted like a heaven with a chocolate and can i use this dough as a puff pastry in recepies"}, {"text": "hey Gemma can you make nachos. there are so many nacho recipes bubi want you to maybe make the real Mexican nacho. thanks"}, {"text": "can i use a regular flour plssss"}, {"text": "thank you so much for these amazing crossants.😄  My dad didi&#39;nt want me to make these but I did and he fell in love with them."}, {"text": "can i use an all purpose flour plss"}, {"text": "what is warm proof? can we don&#39;t use it?"}, {"text": "the yeast is it necessary ?"}, {"text": "quarter of a mm or inch thick?"}, {"text": "This is wonderful :) Taking a difficult recipe, making it easier but still big and bold! Can&#39;t wait to make these &lt;3"}, {"text": "Hi Gemma! How can I make it Gluten free?"}, {"text": "THIS CROISSANT NEEDS MORE FREAKING CHOCOLATE!!!"}, {"text": "I&#39;m going to be making this tomorrow"}, {"text": "loved watching your chocolate crossiant  video. While living in Saudi I used to have crossaints for breakfast daily. Never thought it was made so beautifully. Your baking methods seems so simple and easy. I&#39;m definitely going to try making it :)"}, {"text": "how do you proof manually ?"}, {"text": "thank you for showing  a great recipes for making home made croissonts but how to you make egg wash and is all purpose flour the same as bread flour"}, {"text": "I only grad cheese"}, {"text": "I love crossaints but I eat them very raely because these cost a little bit expensive in Viet Nam.Now,I can make my own.My first homemake chocolate crossaint is super deliscous thanks to you,Gemma."}, {"text": "Looking forward to trying out the recipe.  perfect video"}, {"text": "Ho to make Indian deasit"}, {"text": "I did follow all the instructions but they burnt from out side and they were hard.I baked them in an electric oven.maybe the temperature was high.I will try again.thanks for replying."}, {"text": ":&#39;(  they are burning from outer side n raw in the middle."}, {"text": "I am trying out this recipe. I  will tell you how it turns out."}, {"text": "can we use plain flour instead of bread flour?"}, {"text": "wow! this <br /> looks easy."}, {"text": "-- A lot of people are asking if they can use margarine instead of butter.  I don&#39;t know which brand of butter Gemna uses, but if there&#39;s ever a time you want to splurge and spend little more to buy butter, it&#39;s when making croissants!  Of course, if you just want to use margarine you could, but what&#39;s the point!! It will still be bread, but it&#39;s NOT going to be the same great tasting, high quality croissant you&#39;re expecting!!!  As she said, making these is a labor of love, but definitely worth it! So if you&#39;re going to the trouble of making these, it would be better to use butter this time!"}, {"text": "i hope they won&#39;t give out the yeasty taste?"}, {"text": "😍😍😍"}, {"text": "What is proofing and how would I do it? :)"}, {"text": "hello Gemma can i use magarine??"}, {"text": "how to proof them"}, {"text": "Carl would love these croissants"}, {"text": "what is profing"}, {"text": "Hi! I was wondering if I could do some more folds on the pastry? so I could get more flaky layers"}, {"text": "I tried several of your recipes and all I can say: they are AMAZING. Especially the pizza and brioche dough, the ice cream and the frozen yogurt. You are the genius of treats, Gemma!"}, {"text": "Perfection! Great work! Smart ideas with butter bring you beautiful results!"}, {"text": "i love your baking it the best"}, {"text": "Can I make this croisants without chocolate?"}, {"text": "do we proof them in the fridge or room temperature"}, {"text": "is it ok if i make it 2 days before so i can make the dough, let it rise over night, prepare the croissants and then bake it on the 3rd day"}, {"text": "Hello Gemma, can you tell me how long would it take for the frozen croissants to defrost and proof?"}, {"text": "hi I don&#39;t have bread flour so can I use all purpose flour pls?"}, {"text": "Can you use a machine?"}, {"text": "Can you make eclairs?"}, {"text": "what exactly is proofing?"}, {"text": "My moms birthdays tomorrow and I was praying that I had all the ingredients thanks so much!"}, {"text": "quarter of a millimetre?? lol sounds like a pretty thin dough ;)"}, {"text": "Can I proof the croissants in my regular oven? If so, what temperature and how long?"}, {"text": "I&#39;m a little confused. You&#39;re not supposed to let the salt and the yeast touch but then you mix it. Won&#39;t they touch when you mix?"}, {"text": "hi gemma....u r just too gud..luv watching ur recipes n croissant recipe is amazing...I made thm n they turned out almost perfect...I always dreaded to make croissants just because of its lengthy procedures but dis recipe is just too gud...thanx alot.."}, {"text": "I know that yeast will be deactivated if you put it to the salt, but how can it be that by mixing the dry ingredients together a few seconds later it won&#39;t be deactivated anymore? What is the secret? I often wonder about it, I saw it in many many recipes... Can you help?"}, {"text": "I&#39;m French and from what i see it does not really look like croissants. Little bit more like &quot;brioche&quot; in the inside. I guess it&#39;s normal because your method is so much faster. Doesn&#39;t mean it doesn&#39;t look tasty ! It actually looks soooo good, it&#39;s <a href=\"http://www.youtube.com/watch?v=xpmoYGmNbBk&amp;t=1m19s\">1:19</a>am here in France and i hate myself for watching this video T___T"}, {"text": "how long must I leave it in the fridge if not over night?"}, {"text": "can we add more chocolate? or will it overflow?"}, {"text": "My first video that I have seen and I liked it so I subbed"}, {"text": "A quarter of a millemeter? That&#39;s like the thickness of paper!"}, {"text": "A quarter of a millimeter? Um correct me if I&#39;m wrong but those were 4mm."}, {"text": "could you make a video on how to make a cheese danish? or any other one!!(sorry this is totally unrelated)"}, {"text": "your baby-pink nail polish looks soooo good"}, {"text": "Hello Gemma! I tried these croissants out but what happened was the dough was still raw after I baked it. It was really chewy and not the flaky texture that you got. Do you have any reasons that caused the croissants to be raw after baking it?"}, {"text": "شكرا ترجمه عربي لو سمحتي"}, {"text": "my croissant not come out well.flopped"}, {"text": "can I use plain flour instead of bread flour?"}, {"text": "جميل"}, {"text": "are you Irish ?"}, {"text": "Really good Thank you"}, {"text": "what is your instagram"}, {"text": "How many folds did you do?"}, {"text": "Hi Gemma! I love your video&#39;s and especially this one! I really want to make these and I will. I&#39;m just concerned about two things. <br />First of all, can I use normal yeast instead of dry yeast?<br />Also, in the written recipe, it says bread flour. Can I use normal flour instead of bread flour?<br />Hope you reply. LOVE YOU! ♥"}, {"text": "are you going to finish that kwoossaunt"}, {"text": "very  nice"}, {"text": "my gran would have a heartattack if she saw me measuring croissants"}, {"text": "I really like your videos ☺"}, {"text": "Gemma, can I use this recipe as a hack for puff pastry?"}, {"text": "What is proof."}, {"text": "If i use normal flour.. What should i do? Should i decrease the amount of milk?  Thanks"}, {"text": "What happens if you folding it 5 times or more? &lt;3"}, {"text": "My dough is in the fridge and ready for tomorrow 😉"}, {"text": "excellent  baking wow☺😊😊👆👊✊😎💯💯🙏👏👏👏👏👏👏👏well done"}, {"text": "Bonjour  j&#39;aimerais  savoir  si  vous  donner  des cours  de pâtisserie ?"}, {"text": "J&#39;adore  vos recettes tout ce je fais   je réussi c&#39;est fantastique  bonne continuation. Merci"}, {"text": "can i use all purpose flour?"}, {"text": "+Gemma Stafford how do you say the word Butter Is it &quot;Bucher&quot;."}, {"text": "It&#39;s really more easier for me to get the layers. Thank you for the beautiful tutorial."}, {"text": "Can I use all purpose flour instead of bread flour? :)"}, {"text": "She&#39;s good thank you gem gonna try make them love crossness me"}, {"text": "These are the yummiest things ever!! Great recipe, Gemma!"}, {"text": "It was delicious thank you"}, {"text": "I love ur videos I watch them every day and I like how u respond to our comments or questions not a lot of bakers online do that so thx"}, {"text": "Do we have to proof"}, {"text": "What kind of flower is best use in this receipe?"}, {"text": "hi! Amazing video! I was wondering if you HAVE to proof them?"}, {"text": "What&#39;s the point of folding it"}, {"text": "can I use all purpous flour instead?"}, {"text": "This looks DELICIOUS 😍🙌🏼"}, {"text": "I was just asking"}, {"text": "You can roll out your dough in between two pieces of clig wrap to avoid having to use flour. Especially inexperience people tend to use too much flor which can result in the baked dough just tasting of flour and little else. The clingwrap process will take away that risk and is lmuch less messy (if a little more cumbersome, since the clingwrap should be pulled off the dugh and put o again, every time you turn it)"}, {"text": "is this your first  time  making croissants"}, {"text": "Hello Gemma! I have already made lots of your recipes and all of them was wonderful! I would like to try these croissants for Valentine&#39;s day breakfast but I don&#39;t want to wake up so early ;). So can I make the croissants totally (except baking) and let them rise at room temperature all night or I should freeze them?<br />I love your recipes!<br /><br />PS Sorry about my english I&#39;m from Hungary :)"}, {"text": "Hi, Gemma. I was wondering can I use all purpose flour instead of bread flour? Bread flour is expensive where I live. Thanks Gemma.😄😊"}, {"text": "Can i skip cutting slits in the middle of the dough if im making plain croissants?"}, {"text": "can i use self raising flour instead of bread flour?"}, {"text": "Can i use this recipe as a puff pastry? So i can use this recipe to do other pastry"}, {"text": "Thank you!!!"}, {"text": "Made this over the weekend and it was soooo good! Made the classic style using your recipe and it turned out so well I couldn&#39;t even believe I made it! I even got a request from my cousin to make her with chocolate filling and she said it was like eating magic! Thanks a lot Gemma!"}, {"text": "in india the size of dry yeast is bigger than yours. I tried your recipe my yeast remains the same and is clearly visible after letting the dough set. also my dough is very loose even though I used the same measurements that you gave on your website. please help me."}, {"text": "OMG such a great recipe!!! I&#39;m definitely trying this!! I can imagine these croissants filled with dulce de leche (caramel) and icing sugar on the top once i get them out of the oven &lt;3"}, {"text": "Good job 👏👏👏👏"}, {"text": "Can you pls make the traditional chocolate croissant? ❤️❤️❤️"}, {"text": "why dont u tell d quantity of things?"}, {"text": "OMG! that would be so great Gemma. please do, i can&#39;t wait. by the way, yesterday me and my Lil one made your homemade gummy bear sweets yesterday. I used strawberries, it tastes so good, we kept on eating it before it even reached the moulds lol. can&#39;t wait to see how they are when they set. I think I will use it as a dip for when I make fry chicken wings."}, {"text": "Please make a red velvet brownie cake"}, {"text": "hi Gemma, luv your channel! so many great ideas and I like the way you tell us about the natural alternatives too. However how do you make almond croissants? absolutely luv them."}, {"text": "OMG you&#39;re so smart! Now i don&#39;t have to make all those foldings, I actually made one pastry with the original method and it took me an hour to get all that layers!!! So now i can make more recipes with that dough! Thank you so much!!"}, {"text": "what flowers she is talking about. and what book."}, {"text": "Can i use creamed, softs meringue instead of frozen butter?"}, {"text": "Can you tell how  much do we have to put these  ingredients like if sugar is 1cup or what"}, {"text": "Can you make sourdough bread?"}, {"text": "wow this is my favorite recipe... yeah!!  I love croissants!!  I gonna make&#39; em, but I don&#39;t like the chocolate so much.  I just want the croissants!!"}, {"text": "Love this! The crust looks like a puff pastry, which means your recipe is much easier than the ones I&#39;ve seen. I wish there was more chocolate in them because I love pain au chocolat and this reminds me of that, but I figure it didn&#39;t have that much chocolate because of the size you made them. Anyhow, I can&#39;t wait to try this."}, {"text": "Thank you so much to responding xxx"}, {"text": "Thank you so much to responding xxx"}, {"text": "I like how you make your recipes seem easy, well done keep it up👍🏼👍🏼👍🏼👍🏼xxxxxxx"}, {"text": "I like baking and making pastries( vinoiseries in french ) Croissant, brioch, chausson with creme patissière or jam it&#39;s my dream to have my own coffee shop specialite pastries ( viénoiseries ) sorry about my english writing"}, {"text": "Hi Gemma, just wondering if I can use a processor instead of grating the butter?"}, {"text": "THAT IS JUST SWEATY SORRY I MEAN NAH I MEAN ITS SWEATY"}, {"text": "Hi I&#39;ve heard from many sources about the &#39;do not mix yeast and salt&#39; tip. Yes initially you separate them,but later you mix the ingredients together. Doesn&#39;t that mean you are mixing the salt and yeast together?"}, {"text": "Can I use a food processor instead of grating the butter? Will it yield the same effect?"}, {"text": "Could you make an Almond croissant?"}, {"text": "Yes!!! Finally a great croissant recipe!! I always grate my butter for my biscuit and pie crust recipes, works wonders! It&#39;s such an easier and less messy procedure if you do it that way. <br />I have tried many times to make my own croissant dough... failed! :( This one looks great.. I am gonna try it TODAY for sure!<br />Again, thanks for this great recipe! <br />Have a great day,<br />~xoxo Gemma ♡"}, {"text": "Why did you put in the yeast if you put it in the fridge.... humans"}, {"text": "Hey Gemma, i need your help :( I tried your recipe twice but they didn&#39;t turn out very well. The first time it wasn&#39;t proof at all so it became something like biscuit.... My second time is today and it  doesn&#39;t have any layers... Can you tell me what i did wrong and how to fix it ;( thank you"}, {"text": "Isn&#39;t it something with 3x3x3 = 27, which makes the perfect layers in the pastry?  Which makes that the croissant is light an lovely? <br />You fold it that way, so it is exactly 3x3x3 so it makes 27?<br />It looks amazing by the way :D"}, {"text": "How clever!"}, {"text": "Can you make a quick puff pastry😍😊"}, {"text": "The inside structure was definitely awful. The pores were small and inconsistent. The layers were messed up. I would not call this a good technique for making crossiant."}, {"text": "Im sure to try this...whoa always thank you for your fantastic recipes😘"}, {"text": "THEY WERE PERFECT I MADE THEM BUT I BURNED SOME OF ONLY ONE BECAUSE I FROZED THEM"}, {"text": "Can we use all purpose flour or is it very important that we use the strong bread flour?"}, {"text": "ive been binge watching your videos since i havent watched them in a long time and omgggg the new recipes are 👌"}, {"text": "Gemma can you please tell us how much flour , sugar and more thanks"}, {"text": "your accent and this video. I think I&#39;m in love"}, {"text": "Gemma Stafford can we use salty butter in ice cake"}, {"text": "Gemma, you have really helped me I started cooking at a young age (4) and I&#39;m still improving and you&#39;ve being making that much easier thanks!"}, {"text": "gemme stafford can you tell me home made chocolate recipe plzz and your recipes are awesome"}, {"text": "Thank"}, {"text": "gemma Stafford can we talk in whatsapp plz.?? I make many thing like you I can sent every pic of it"}, {"text": "yaay but how"}, {"text": "really nice !"}, {"text": "I really love nuttella can I just put nuttella instead of chocolate ???"}, {"text": "hi gemma I love your vidoes"}, {"text": "hello <br />Gemma I had watched all of your videos they are all awesome . I love you and your videos .and I am the cousin of Almas Abdul haq . I am also trying your recipes . they had always turned always tasty and everyone loves the taste of them"}, {"text": "this looks so good"}, {"text": "Hello, Can you share a biscuit recipe with us, please :)"}, {"text": "in my home every one taste and say it&#39;s nice"}, {"text": "very nice"}, {"text": "sa ki bon sa :))"}, {"text": "Great video Gemma! I always wanted to make croissants but I always felt they were a little time consuming to make. This is a recipe I&#39;m definitely going to try. O.o could you use this recipe to make baked cronuts? That would be awesome!"}, {"text": "oh so yummy! cant wait too try them out!!! they look amazing special ly for crosant lovers!!! your such a good cook and im a huge fan cant wsit for your next video! bye!"}, {"text": "This is pure genius! Most recipes take about 4-5 days to make croissants, but not in bigger bolder baking! Nah ah!!"}, {"text": "Yummy!!!!!!!!"}, {"text": "Can I use all purpose flour?"}, {"text": "Can I put small squares of butter instead of chocolate in the croissants"}, {"text": "of course why not I am always trying your recipes so surely I will try this also"}, {"text": "gemma,everytime i make a dough and bake it,it always turn sour and a little bit bitter.did i do something wrong?"}, {"text": "yummy"}, {"text": "wow amazing and mouth watering omg☺☺"}, {"text": "I really love croissant very much... I reckon this method is the easiest way to make. Thank you Gemma Stafford."}, {"text": "can we use salted butter in the recipe or will that affect the yeast activity love the recipe! ☺☺☺"}, {"text": "My oven doesn&#39;t have a proof setting. What should I do instead? Should I just skip this step? Thanks!"}, {"text": "43 dislikes? Who could dislike these? (Or any of your recipes, for that matter)? They look scrummy! :D"}, {"text": "Those look absolutely delicious! Well done. I am so eager to try this recipe now."}, {"text": "can we use fast action yeast in this recipe?"}, {"text": "The second u said farenheit. I rushed to ur bio. I figured u lived in the states 😂 always thought u lived in ireland"}, {"text": "made bakery style cinnamon swirls with this dough   and they were a huge hit and disappeared in second  thanks for the recipe"}, {"text": "i love this video. thanks so much for sharing it! can you add jam instead of chocolate?♥"}, {"text": "New sub here. thanks for sharing tips and how to cut pastry making time and effort in half. God bless!"}, {"text": "Hmm looks awefully much like: <a href=\"https://youtu.be/jw_yWmK6Fuo\">https://youtu.be/jw_yWmK6Fuo</a>"}, {"text": "Do you need yeast or no? Thanks"}, {"text": "hey gemma...which is better... ladles and cooking spoons made up of nylon are better or those made up of silicone?"}, {"text": "hi. i dont have that proof thingy like u... so what should i do to replace that?"}, {"text": "Great and pretty quick recipe)))))Thanks"}, {"text": "I love the music you used! Such a lovely video :) Merry Christmas!"}, {"text": "They looked so art deco when you&#39;d rolled them."}, {"text": "can you show us your chocolate brownie recipe😊☺😀!"}, {"text": "easiest croissant recipe. ..Thanks♡"}, {"text": "Thanks Gemma, I&#39;ll try some with whole wheat flour too, just to make it healthier..."}, {"text": "if using salted butter do I add the salt... won&#39;t it make it salty?"}, {"text": "I made these and they were really good! Instead of chocolate chips... I put Nutella inside! I loved it... I also put butter inside of them and just smeared it on the dough before I rolled it up.... Tasted yum! Thank u Gemma for the recipe!"}, {"text": "Hey Gemma, your recipe on <a href=\"http://biggerbolderbaking.com\">biggerbolderbaking.com</a> says &#39;Strong Bread flour&#39; is it some specific flour or can I use plain flour/Refined flour? "}, {"text": "Your method is really easier than the last video I saw that was more complicated. One day  I wanna make one but definitely for someone special! This is a time consuming recipe nonethless but the labor it takes will yield the love in the end. Yummy! Can we add fruits?"}, {"text": "I was wondering if I could use all purpose flour"}, {"text": "I love those also love your nail polish colour  😉😘"}, {"text": "do you use salted or unsalted butter??"}, {"text": "Hello Gemma, these third recipes that i have tried. First pretzerl, pop tart, and today croissants. I use margarine for croissants. So very different flavor, maybe next time i should skip salt of dough. I want to show the shape of you, what was so or approached with a croissants or even like a bread in general. I would like to know your opinion about croissants i&#39;ve made, but do not where to go?<br />Sorry my english is very messy<br />I really like recipe and your video<br />Thank you Gemma"}, {"text": "Gemma, will you make oatmeal ice cream tutorial? Thanks a lot.."}, {"text": "These look amazing! I can already taste them through the screen! Happy holidays to you and your family!"}, {"text": "hi Gemma, HAPPY HOLIDAYS!!♥"}, {"text": "NOW THATS DELICIOUS! 👍"}, {"text": "Amazing technique!! Thankssss!"}, {"text": "The chocolate wasn&#39;t melted 😏"}, {"text": "Hi Gemma!I was wondering..You said at about 6 mins that you roll it out to a quarter of a millimetre thick?Isn&#39;t that like paper thin? So I was wondering if it was actually meant to be a quarter of a centimetre thick?Thank you xxP.S: I love your channel!!"}, {"text": "These turned out way better than the ones I tried to make last year! Thanks for another awesome <b>working</b> recipe!"}, {"text": "These came out so beautifully, thank you so much ❤️"}, {"text": "Will the warmed milk not melt the frozen butter?"}, {"text": "What does it mean proof? Do I have to?"}, {"text": "this is so cool looks delicious"}, {"text": "can you put your dough in overnight instead of 1h 30"}, {"text": "Gemma i loved this video ^.^    I was wondering if you could show us watchers how to make a marble cake. My sister wants to make one but she doesnt know how ^.^;... Anyways, Thanks for the video"}, {"text": "Gemma, I love the butter grating technique; do u think it will work with pie crusts?"}, {"text": "Grate the butter ? Now that&#39;s genius!!!! Yet SO simple, how didn&#39;t I think of that ? :P"}, {"text": "I&#39;ve been watching your videos for a few weeks now, and I&#39;m completely addicted. You have a lovely smile and amazing recipes. Good day!"}, {"text": "I think u meant Quarter of a Centimetre. At least that&#39;s what the ruler measured, trust me I am an architect!"}, {"text": "Hello, Can I know what kind of butter you&#39;re using? Can I use margarine?"}, {"text": "Gemma, congrats for the wonderful recipe!!! Now i don´t have excuse, i have to make these delicious croissants. Thanks for the method, because i´ve always thought that it´s a long process.<br /><br />Merry Christmas to you and yours!!!!<br /><br />Patricia."}, {"text": "Thanks again for another phenomenal recipe"}, {"text": "please Gemma could you tell me what to use instead of bread flour?"}, {"text": "Can you substitute the chocolate for butter? :)"}, {"text": "hi Gemma your recipes never fail to amaze us, and these just look so gorgeous and yummy please can you put up a video on how to make perfect vienesse fingers would really appreciate thankyou so much."}, {"text": "Hey gemma Gemma Gemma!! I was so into these when I saw the thumbnail... These are absolutely delicious! Me and my sister Baked some and they turned out super nice! ty for such a lovely recipe i will definetly bake some for my cousins bday party!"}, {"text": "That pastry is so beautiful! And not messy at all. I love the grating the butter idea."}, {"text": "looove all your videos I really wait every Thursday to watch your amazing recipes 😘 😍 ❤ <br />@gemmastafford"}, {"text": "hey Gemma, this luks yummy anf very easy compared to wht my frnd did to make them! only we dnt get bread flour here will it turn out same with all purpose flour?"}, {"text": "Love it, Gemma. Thanks!"}, {"text": "It&#39;s  absolutely an excellent presentation, I love croissants, I &#39;d rather have it plain or with cheese, yummmy!  Thanks, Gemma."}, {"text": "I want more chocolate haha"}, {"text": "I can&#39;t believe you can make them that fast, I never attempted to make Croissants at home because they usually take a lot of time, but your way is so much time saving and the result is the same as if I spent a lot of time on them! <br />THANK YOU SO MUCH FOR SHARING. I&#39;ll definitely try them."}, {"text": "That&#39;s was so beautiful ~ I love how you make it and how it was done ~~ SO GREAT"}, {"text": "I like Gemma subscribe to her"}, {"text": "Thnx"}, {"text": "This looks absolutely delicious! I&#39;m sure that I&#39;ll be making this at some point! Just one little thing, the thickness of your dough was a quarter of a centimetre, not a millimetre :)"}, {"text": "Can I just use plain flour/all purpose flour?"}, {"text": "You are so pretty"}, {"text": "🍭🍮🍰🍫🍩🍨🍰🍸🍳🍲🍴🍵🍳🍞🍘🍛🍟🍙🍒🍔🍚🍪🍨🍜🍙🍡🍩🍨🍣🍚🍞🍜🍒🍚🍔🍘🍓🍕🍕🍕🍝🍰🍯🍭🍢🍟🍚🍥🍏🍎🍉🍋🍊🍎🍐🍝🍪🍩🍧🍤🍪🍭🍬🍮🍰🍯🍼🍲🍺🍷🍷🍶🍳🍴🍶🍲🍴🍴☕️🍷🍷🍷🍨🍨🍩🍮🍬🍭"}, {"text": "Yummy"}, {"text": "Yummy"}, {"text": "Make chocolate vanilla cheese cake candy"}, {"text": "OMG..this is much more easier to make!!!Thanks Gemma."}, {"text": "OMG..this is much more easier to make!!!Thanks Gemma."}, {"text": "OMG..this is much more easier to make!!!Thanks Gemma."}, {"text": "Hey Gemma! Me again :&#39;) just wondering, could I use your homemade Oreo cookie butter inside the croissants instead of chocolate? Just thinking about a potential last-minute present for my sister! :&#39;) thanks in advance!xx"}, {"text": "Can I use all purpose flour instead of the bread flour?"}, {"text": "Gemma you made this look so easy!  I had a yummy croissant filled with goat cheese and prosciutto at a lovely bakery in Yachats, OR. I might try and re-create that using your recipe."}, {"text": "Can we do a different shape with the dough? I love the pain au chocolat shape. (I feel like you get more chocolate lol!)"}, {"text": "Love this recipe can&#39;t wait to try them and can u plz do a baking giveaway"}, {"text": "OMG loved this recipe!"}, {"text": "Can you show us how to make Homemade Biscotti&#39;s?!🙏"}, {"text": "my only complain is that i don&#39;t know the measurments like how much flour  or how uch of sugar and so on..."}, {"text": "I have made home made croissants and they didn&#39;t come out as well and a bit scared to try again"}, {"text": "OMG😍 Those look AMAZING😍 I love your ideas💕 Thanks😙"}, {"text": "Oh Gemma, this way is so much easy than the traditional, and that croissants looks just amazing! Thanks so much for your talent!"}, {"text": "hi gemma i really like your channel your recipes? you are simply awesome? 😊<br />i have a question can we use the same method of puff pastry making for other puff pastry items?"}, {"text": "hey Gemma!<br />This looks absolutely gorgeous!<br />I just bought a new oven and this is the first thing I&#39;m going to bake in it to inaugurate my precious!<br />Love from India!"}, {"text": "This is great"}, {"text": "Thank you for the recipe I really appreciate it. I will do this tomorrow for my family because they like reading recipe from scratch thank you very much =)"}, {"text": "i literally need to wipe my drool kidding hahaha"}, {"text": "Really Yummy :) i&#39;m going to make this for my French patisserie party :)"}, {"text": "omg.. grate the frozen butter into the mixture is such a great idea, i always let my butter soften (out from the fridge) in room temperature first before i work with it, so silly -__- and im soo gonna try this recipe gemma!!"}, {"text": "Gemma, thank yoy for the recipe 😚💟...i wanna ask you is this puff pastry??? or it&#39;s different from crôissant dough ?? 😔😔 answer if you please .."}, {"text": "*1/4 of a cm :)<br />1/4 of a mm would be pretty damn thin!"}, {"text": "Hi gemma i was wondering what is proofing ?"}, {"text": "Gemma, this is just a master piece! It was a real esthetic pleasure to merely watch you baking that prettiness =)"}, {"text": "You explained this very well and clearly. Thank you!"}, {"text": "folding the dough is useless if there&#39;s no butter on it... as a french girl the &quot; pate feuilletée&quot; is part of my culture, i can&#39;t accept that!^^"}, {"text": "Love croissants Christmas morning even more so when they have chocolate in them, like the straightforwardness of this process compared to the usual layering, have seen the frozen grated butter used in rough puff and shortcrust pastries, not seen anyone develop a croissant pastry though, so pleased you have taken the time and shared it, looks like we will be eating a lot more croissants in the future, Gemma style. Thank You, have a wonderful Christmas."}, {"text": "+Gemma Stafford wowwwwwwwwwwwwww!!!💜💓💕💖💗💘💝💞💟 I loved the video"}, {"text": "I really hope I have to make these for Christmas. Thank you so much, Gemma! xoxo"}, {"text": "You said that salt will make the yeast unactivated, but if you combined all the dry ingredients including the salt and the yeast would not that be the same?"}, {"text": "Can I use Evaporated Milk?"}, {"text": "You said that it can be frozen and bake later but need to proof before bake right? If i dont have your kind of oven how can i do it?"}, {"text": "Did you dye your hair? It looks brownish to me. 😊"}, {"text": "You&#39;re oven is amazing! It has a proofing setting! I&#39;d love to have an oven like that."}, {"text": "I might make them with my cousin at Christmas"}, {"text": "same time buy premade dough put chocolate in it a boom your done"}, {"text": "These look sooo good!!!!Yum!"}, {"text": "This looks awesome Gemma! It is perfect for the holidays!"}, {"text": "can i proof these croissants  in a room temperature"}, {"text": "Why are you saying &quot;chocolash&quot; instead of &quot;chocolate&quot;? ( ͡° ͜ʖ ͡°)"}, {"text": "do you have to have yeast?"}, {"text": "Such a GENIUS!!!!! Love chocolate Croissants but they are so hard to make. but u just made it easy peezy!!!"}, {"text": "Anser my count plz"}, {"text": "This is yum"}, {"text": "Anser my comment"}, {"text": "Plz"}, {"text": "Plz make rspie easy with cake mix and dream wib"}, {"text": "I want the fastes time an you make raspie with cake mis"}, {"text": "I want the fastes time"}, {"text": "Plz"}, {"text": "Can you make a raspie with cake mix"}, {"text": "how to basic thumbnail"}, {"text": "Gemma You&#39;re A Genius 😍😍😍 These Looks Amazing."}, {"text": "I luv all ur recipes Gemma!Best YouTube Of Mine.#Personal Favourite"}, {"text": "what kind of nail polish color and brand is on ur nails? soooo prety"}, {"text": "Amazing recipe! The easiest croissant recipe I&#39;ve ever seen. I&#39;m definitely gonna try it. I have a question, is that regular butter?"}, {"text": "Yummy! I should&#39;ve had these today for my birthday!"}, {"text": "Absolutely AMAZING!  👍"}, {"text": "Hi Gemma, Love watching your videos....very high quality and easy to follow recipes.....i recently purchased bread machine, but every time the bread turns out a little different.....can u please show some good bread machine bread recipes. Thank you :-)"}, {"text": "you lost a subscriber :((((( i hate when i have to go to a website to check ingredients"}, {"text": "This is the easiest croissant recipe i ever known. I ever made this croissant but using margarine pastry or korsvet. I wonder how is the texture of your croissant without using it? :)"}, {"text": "can i use oil instead of butter...?"}, {"text": "will try this out in a bit! saw the video when it came up but was too tired to try it right away. but just a few points:<br /><br />on the recipe page you missed the step about adding the chocolates.<br /><br /> also in this video you didnt mention anything about covering croissants loosely with greased cling film and letting them rise for 2-3 hours at room temperature? so can we skip that step? i only realised when watching back that proofing meant leaving to rise, but you still didnt mention it here in detail :)"}, {"text": "gemma plz do it plz.i am first time requesting"}, {"text": "wow I love  you recipes excellent thank you"}, {"text": "Amazing as always you&#39;re my baking inspiration"}, {"text": "Oooh girrlll you got me at chocolate!"}, {"text": "Thank you Gemma,  I am going to make your recipe! They look so awesome!"}, {"text": "They all look so perfect! Loved the extra video. :)"}, {"text": "I love your videos but I hate that disgusting tray! wth?"}, {"text": "Croissants and chocolate?! What could be even better? Yummmmmmm😍😋"}, {"text": "Why do you make the little cut before rolling them?"}, {"text": "Thx for the tips. Finally know why my croissants don&#39;t stay structured😊"}, {"text": "Love your channel so much!! I look forward to all of your videos!"}, {"text": "this is the prettiest croissant that I ever see <b>-</b>"}, {"text": "Croissants! Chocolate! Christmas!"}, {"text": "I will make these for christmas morning, genious recipe! &lt;3"}, {"text": "Can we substitute chocolate for jam or butter my mum likes strawberry jam she does not like a lot of sweet"}, {"text": "Those were the most amazing croissants I have ever seen,gemma,you are the best baker ever:)))))"}, {"text": "I tried making croissants once but it didn&#39;t work D: but this makes me want to try again!! :)"}, {"text": "Can you add some pecans to the croissant."}, {"text": "What are the measurments"}, {"text": "+Gemma Stafford What was the purpose of folding the dough?"}, {"text": "Finally i can make croissant without rolling big block of butter into dough and your instrution really clear.Going tried this someday , thanks so much Gemma."}, {"text": "2 of my favorite things in one!!! YUMMMM!!!"}, {"text": "pls make french macarons!😍"}, {"text": "Her techniques are the best."}, {"text": "Do you have a thermomix? If so could you do a recipe with it? Like a brioche dough or so"}, {"text": "Your accent and recipes are just absolutely fabulous"}, {"text": "ur recipes always look so good!"}, {"text": "the cheese grater was a genius idea!"}, {"text": "Omg that croissant is perfect for dessert at dining parties.."}, {"text": "YUM!"}, {"text": "im just wondering if instead of chocolate, can i put nutella?"}, {"text": "i love your LG oven!"}, {"text": "nail polish and rings while baking..."}, {"text": "I watched this at the wrong time 😂😂<br />I&#39;m supposed to be studying my ward exam, but I&#39;m here thinking that I should start making this instead 😂😂😝"}, {"text": "WHYYYYYYY YEAST"}, {"text": "I&#39;ve always known the traditional method but not that you&#39;ve shown me the light there&#39;s no turning back! Thanks! Ill definitely try this out"}, {"text": "wow such an easy process"}, {"text": "Yay Gemma, i&#39;m so excited about this recepie!! can&#39;t wait to try it."}, {"text": "Wow they look amazing can&#39;t wait to see if they work for me!!"}, {"text": "Not everyone has a new LG oven like can you stop showing off about it"}, {"text": "I have the same stove"}, {"text": "hey Gemma just wanna say a big big thank you for helping me move up a level in food tech your pastry making skills have helped me so much so thank you"}, {"text": "oh my god..your method is so much easier, i am gonna make this for sure. I absolutely love your videos. :D"}, {"text": "Oh my!"}, {"text": "I have been waiting for someone to show how to make Chocolate Croissants! Thank yo so much Gemma! I may make this my Christmas morning treat for my family! :)"}, {"text": "Wow i never knew that&#39;s how they make it"}, {"text": "Can I use Nutella instead of the chocolate disc?"}, {"text": "Looks delicious Gemma!  Well worth the work to get all those beautiful layers."}, {"text": "can you use plain flour instead of bread flour?"}, {"text": "I don&#39;t like croissants, but I&#39;ve only ever had those mass produced store-bought ones. These homemade ones look delish!"}, {"text": "I&#39; ve never had a Croissant but they look good."}, {"text": "Oh Gemma I absolutely love this croissant recipe. So much easier than the tradition slab of butter recipe. They look amazing. Merry Christmas to you and the family."}, {"text": "Amaaaaaaazing can you make cronut please"}, {"text": "I am going to do that with a marzioan filling 😍"}, {"text": "wow, they are so beautiful! :0"}, {"text": "Can we put Nutella instead of chocolate chips?"}, {"text": "I think you mean quarter of a centimeter! Which would be 2,5 mm."}, {"text": "This looks so much easier than the traditional method. I&#39;m definitely going to give it a try. I&#39;m curious whether you developed this technique yourself and how much experimentation did it take? <br />On another note, I watched a news item on CBC this week about a butter shortage, which has followed the recent publication of research that says we should not be obsessed about avoiding fat and just eat healthy. But I think another contributing factor is that YouTubers like you are inspiring more people to try their hand at baking!  🍰😍"}, {"text": "The croissants look so good! Maybe I&#39;ll try them this week too!"}, {"text": "can i remouve the chocolate"}, {"text": "They look SOOOOOO delicious!!!!! I need to like make this for my parents on Christmas.......TNX GEMMA! :) :)"}, {"text": "please make cronuts I would love to learn from you"}, {"text": "Thank you so much for the recipe, it&#39;s awesome ! Well done 👍🏻"}, {"text": "i love how you treat the dough, like a lovely tender baby. when i bake i remember when u say &quot; hi bold bakers&quot;. ur words give me courage.Thank you gemma 😙😙😙😙"}, {"text": "It&#39;s like a rough puff pastry right? Looks amazing!"}, {"text": "AN UPLOAD ON A MONDAY 😻 thank you, gemma!!!! More videos pleaaase 😻"}, {"text": "The usual method of making croissants is so time consuming (but worth it) I will definitely try this method.  😊"}, {"text": "Gemma&#39;s incher folder baking?"}, {"text": "they looks gorgeous and amazingly delicious tfs👍💕💕"}, {"text": "How long can they stay in the freezer?"}, {"text": "how long did you go to Ballymaloe cookery school"}, {"text": "can u share a &quot;garlic butter&quot; recipe? thanks"}, {"text": "Any substitute of butter?"}, {"text": "These look so yummy! :)"}, {"text": "Merry Christmas Gemma!"}, {"text": "Gemma these looks amazing , I love croissants! thanks for sharing !!"}, {"text": "Delicious!"}, {"text": "PLEASE MAKE IT ON NEXT VIDEO.😶😶😶😶😇"}, {"text": "I didn&#39;t know croissants were so easy"}, {"text": "I love how you smile so much, makes me happy 🙈"}, {"text": "croissants just got a whole lot easier 👐"}, {"text": "OMG!! THANK YOU!! I LOVE CHOCOLATE CROISSANTS"}, {"text": "Hi Gemma! i am thinking to make these croissants today however i only have salted butter. can i still use it?"}, {"text": "but les croissants de Paris restent ls plus délicieux"}, {"text": "Oh Gemma, it&#39;s like you can read my mind.<br />Happy Christmas!"}, {"text": "I  really love all your recipes and can&#39;t wait to try this..  Thank you so much for everything..  Happy holidays for you and your family.. 😇😇"}, {"text": "who doesn t like chocolate"}, {"text": "I tired it and loved it"}, {"text": "Amazing! You&#39;ve made it look so easy, Gemma. I&#39;ve always avoided making croissants because of the dough, but I&#39;ll give it a try with your technique =)"}, {"text": "They look perfect!"}, {"text": "This is amazing gemma! Whats funny is my grandmother and i wanted a recipe for chocolate croissants this morning and i see you uploaded one!! have a good day :)"}, {"text": "Your channel is AMAIZING"}, {"text": "only one word its beautiful"}, {"text": "did you mean to say a quarter of a centimetre thick? maybe I heard wrong, but it sounded like a quarter of a millimetre. they look delicious!!"}, {"text": "wow jeema i love youuuuuu soooo much its just fun to make this with you i really love your backing"}, {"text": "Thanks a ton, Gemma!! This truly is the simplest recipe for making croissants."}, {"text": "My dreams are coming true! Thank you so much Gemma for making this recipe!"}, {"text": "what a coincidence i just finished eating a croissant    wow"}, {"text": "Gemma can you pls make your version of San srival cake.."}, {"text": "I would add more chocolate! I think k you added too little and their is too much pastry and not enough ooouueeey gouueeyyy chocolate"}, {"text": "Awesome I love anything chocolate☺"}, {"text": "omg how is it that u think of all of these amazing ideas lol"}, {"text": "is this puff pastry?"}, {"text": "&quot;If you don&#39;t like chocolate..&quot; Gemma, who doesn&#39;t like chocolate?"}, {"text": "Simply loved it,recipe is simple and easy...lil of efforts and you get yummy chocolate croissants :)"}, {"text": "those look so freaking good"}, {"text": "One of the best ways to make croissants. I will sure give it a try. Thanks Gemma"}, {"text": "the grating technique is amazing ! k gon go make some croissants now"}, {"text": "THIS IS A GOOD RECIPE, GREAT JOB!"}, {"text": "My croissants always poofed up a bit too much when they are kept in the fridge for chilling... Is that normal or is there anyway to make sure it doesn&#39;t happen? Help!"}, {"text": "♡☆☆☆☆☆شكراا انتي رائعه و  وصفاتك روعه"}, {"text": "gemma I tried ur cookie butter recipe and it was yummy thanks for the recipe<br />...and this looks absolutely stunning."}, {"text": "You&#39;re a perfectionist Gemma❤"}, {"text": "I love croissants but I&#39;ve been too afraid to try it at home. But now I want to try this recipe as it is much simpler than the others I&#39;ve seen! Thank you Gemma! (^0^)/ Instead of the chocolate in the middle could I put Nutella?!"}, {"text": "Could you please do a coconut cake?"}, {"text": "Oh my God , amazing Gemma , i love it, i will try it and share , love of love and good health <br />Good luck 😘"}, {"text": "Im ln love with your channel ❤❤ (not in the creepy way 😂)"}, {"text": "I LOVE Chocolate Croissants! I freaked when I saw this"}, {"text": "So much easier than I expected! Congratulations,  great job,  these look amazing!  I am definately gonna try these."}, {"text": "Take about hard work nice well done :)"}, {"text": "They&#39;re called un pain un chocolate"}, {"text": "These are so pretty. Love the freeze then proof method. I think I know what I want to have for Christmas morning. Never met a croissant I didn&#39;t like. Thanks for the easy recipe Gemma!"}, {"text": "I&#39;m gonna tell my mom to make this for Christmas Eve Dinner😍. And Gemma what if we don&#39;t have stick butter but the one that comes in a container? How can I grate it? 😊💕"}, {"text": "Ooooh... Finally a recipe for croissants! This looks so bloody brilliant! Thanks a lot!"}, {"text": "Another amazing recipe Gemma!"}, {"text": "Wow those croissants look amazing!! I&#39;m definitely gonna try this easy recipe out! Yum!!!"}, {"text": "Oh my goodness! Those look scrumptious!<br /><br />I will need to try that frozen butter tip!"}, {"text": "Im defiantly trying this out!"}, {"text": "I&#39;d love to see you do a baked cronuts recipe! Great recipe, as always!"}, {"text": "Just mouth watering 😭😋😋😋 my favorite treat such a guilty pleasure of mine thank you Gemma this actually looks very easy"}, {"text": "ur sooooo gud gemma!! luv ur recipes"}, {"text": "Waiting for this video all day as not at school! Amazingggg work 😊😊 Wishing you and your family a lovely Christmas and all the best for the new year🌟🌟🌟 Xx"}, {"text": "Hey gemma, I have a microwave convection oven.  And for most of the bakes I get confused on what settings I shud bake em,  especially breads.. <br />I personally love chocolate croissants,  willing to try soon,  can you please tell me what settings shud I bake em in a microwave convection oven?"}, {"text": "gemma its ausome really it is yummmy ....!! can i used spread of choclate and nutella instead of chocolate chips..?? can i bake it in microwave / toaster oven ?? i have no oven please tell me ... i love your baking... keep smiling ..😄"}, {"text": "these luk amazing. gotta try"}, {"text": "Fantastic!"}, {"text": "I can&#39;t wait to try this recipe out!!! looks delicious &lt;3"}, {"text": "@gemmastaford so is that an alternative to puff pastry or is it and what kind of butter is that salted or unsalted and lastly will normal butter work"}, {"text": "Can I use Nutella instead of chocolate ???"}, {"text": "this looks so easy compared to another video that I watched before, I&#39;m absolutely gonna make it soon!"}, {"text": "can i make them the night before and then bake them in the morning, and if i can, should i store the dough in the fridge or outside the fridge overnight? I dont want to freeze them like you sugested in the writen recipe. thinking about making these for christmas. xx from The Netherlands"}, {"text": "They look absolutely wonderful Gemma!!! I have already eaten dinner, but I could go for AT LEAST 3 of those... oh my! Yum :-D"}, {"text": "Amazing croissants Gemma!!!! You truly are amazing at baking! Can&#39;t wait to try this!"}, {"text": "your hair looks so pretty😍"}, {"text": "IM EARLY FOR ONCE"}, {"text": "pleeeeeeeeas do something delicious that is vegan &lt;3 &lt;3 &lt;3"}, {"text": "Gemma! You are my idol. Seriously. I&#39;ve been wanting to make croissant, but I always ended up running away from the butter layer, lol. Your method is wonderful. And those croissant, gosh look to die for."}, {"text": "that is an great ideal with  the  butter  <br />awsome💪 <br />thanks"}, {"text": "love this so much"}, {"text": "Hey Gemma I love the colour on your nails!"}, {"text": "no way i was just about to make these hhh i saw a video nd then u posted this"}, {"text": "I KNOW MAKE YOU WILL MAKE IT WHEN MANY PEOPLE REQUEST .BUT I AM REQUESTING TO MAKE IT IN NEXT video.😇🍮"}, {"text": "looks so good 😍"}, {"text": "can i spread a thing layre of melted chcolate or nutella on them before rolling them up so it&#39;s in all the layres."}, {"text": "ohhh... I&#39;m on diet and I m despo to eat them... they looks soooo yummy"}, {"text": "Such a easy recipe ❤️❤️❤️"}, {"text": "Are you wearing lip stick? If so, what color is it? Looks delicious!"}, {"text": "Wow this looks amazing Gemma! I love all your recipes :)"}, {"text": "I can&#39;t beleive it i had waited for long for this!"}, {"text": "saw this on Instagram and I was waiting for this video to upload! Those croissants look delicious tho!"}, {"text": "Hi, Gemma. That&#39;s a really cute bonus video. You are truly AWESOME at making wonderful content on YouTube. I can&#39;t believe Christmas is almost here. I am thankful to support an AWESOME baker like you. You are like one of THE best baking teachers on the planet. I can&#39;t wait until Christmas.with opening presents, eating a wonderful meal, and being with family. God bless and Merry Christmas, Gemma. ;-)"}, {"text": "I bet Gemma Stafford wouldnt reply this comments"}, {"text": "Gemma i like your videos plzzzz make panna cotta plzz because in new year and christmas holiday people wear red and green so i wish panna cotta is best these holidays"}, {"text": "I&#39;m the 684th viewer! Yay.. Really love you Gemma, always waiting for your video even when it&#39;s nearly midnight here in Indonesia. Keep baking! Coz the bakers gonna bake, bake, bake!"}, {"text": "my brother lover chocolate croissants so much.. i might as well make these someday😊"}, {"text": "These actually look really delicious can&#39;t wait to try them out"}, {"text": "Yes this is the perfect Christmas dessert I was hoping I would find a good recipe before Christmas thank you 😄☃"}, {"text": "would you use the same method for making puff pastry for tarts? grating frozen butter? looks like a great idea!"}, {"text": "Gemma how many croissants does this recipe make"}, {"text": "Grating the butter is such a good idea! Thanks so much! <br /><br />I always like pastries but the butter step is always a turn off. This method is so much easier!"}, {"text": "And I&#39;m here trying to go on a diet -.-"}, {"text": "So early today! Oh and the croissants looks really good👍🏼"}, {"text": "So exciting! This is what my family eats every Christmas morning! Maybe those year we can make it homemade! Thanks Gemma!! -Lizzy"}, {"text": "yaaaassss im early"}, {"text": "looks so nice"}, {"text": "i wish i could eat it!!?;-)"}, {"text": "Gemma your videos are so amazing and they help me so much. Thank you for all the effort you put in your videos. I was wondering if you could do a video on how to make homemade food die and homemade extracts. Have a merry Christmas and a happy new year<br />Love<br />Sarah😘"}, {"text": "AWESOME!! gemma!! love ur baking recipes!!"}, {"text": "omg yassss my favorite"}, {"text": "Looks good 😀"}, {"text": "can you do something minecraft related. pleaseeee<br />and i love your videos ❤"}, {"text": "Yay Gemma i love your videos"}, {"text": "I was looking for something to make for a party today thank you"}, {"text": "The preview of them at the begging looks amazing."}, {"text": "oh my gosh delicious very delicious 😊😙😋"}, {"text": "gr8"}, {"text": "hi"}]