[{"text": "Thank you for this beautiful recital in your beautiful venue. What great students. Could you please tell me the name of the Burgmüller piece? Thank you."}, {"text": "Wow la campanella👍👍"}, {"text": "What a delightful concert ! Loved just about everything. Had never listened to these sweet Beethoven Variations. Always love these Mozart A Major Variations. The Waldstein was great. It&#39;s a real challenge to stay the distance with this almost continuous velocity. And he made it.  The Campanella is a daunting assault course and he went through it with flying colors. Had never known about  Libermann. This Gargoyles has a nice Prokofiev feel. In a word it was great and congratulations to Ruo Huang !"}, {"text": "Hi Jane I was nice to be able to see you for once, as opposed to just your hands on the keyboard.  All of those kids were incredible and their talent impressive. I particularly liked Josetta&#39;s performance, she clearly had prepared herself well in terms of her appearance and had a delicacy of touch and execution that was truly professional. I am sure will continue on to do well in her musical career.  Jeffery&#39;s performance was powerful and well executed, his maturity shone through during the difficult passages It&#39;s great to see these youngsters participating and confidently engaging so well with classical music. Thank you giving them your support and encouragement. √"}, {"text": "What a wonderful recital!  Congratulations to all the participants.  I also enjoyed getting a look at your beautiful new aquarium :)   I am sure you have answered this question numerous times before, but what is the make and model of your piano?"}, {"text": "I am 14 years old and i&#39;m able to play Rondo Alla Turca the legato is bad and i&#39;m trying to be better everyday ,is amazing to see them playing almost perfectly every single note."}, {"text": "I wanted to see it but it was streamed at the same time that the fortnite event."}, {"text": "So, following up my last comment on the liebesleid video, are these songs recommended to learn for my age?"}, {"text": "Impresionante"}, {"text": "Talented kids!"}, {"text": "Does the last one have only 14 years old???"}, {"text": "Nicely done :)"}]