[{"text": "That case just reminds me of Wish. Com"}, {"text": "&quot;GAMING&quot; case"}, {"text": "I&#39;m so glad we&#39;ve moved away from this gaudy style and embraced more understated cases"}, {"text": "I think that this case is awesome and unique in every way"}, {"text": "This case gives me mid-2000s Alienware desktop vibes."}, {"text": "Seahawk colors"}, {"text": "The case is called the Syclone, which is an obvious reference to Cyclone... And there&#39;s a sticker with a shark on it....<br /><br /><br /><br /><br />This is obviously the limited edition anniversary edition of this case: The Sharknado!"}, {"text": "Oh boy throw an old FX chip In there"}, {"text": "Shocked by the removable HDD bays in 2011?<br />Dude, my old beige full tower from 1999 had two of those!<br />You kids of YouTube are funny."}, {"text": "I miss optical drive bays"}, {"text": "Menn there where so many better cases during those days. Silverstone cases where huge in those days!"}, {"text": "my HAF 932 from 2009 is still going strong, admitedly my mate has it as it but its still woking nicely, and can&#39;t say that thing is starved for air.  Admittedly I have gone, Bitfenix Prodigy, Fractal Design R4, Cosmos II and currently Corsair 570X since I got that. Mind you, no case has lasted me as long as my old Chieftec Dragon."}, {"text": "Well...my case from 2017 looks a lot shittier"}, {"text": "Hey Dimitri! About the 4 5.25&#39;&#39; bays... I remember back in the days having 2 optical drives in my system, a fan controller unit slotted in the third bay and a iomega Zip drive in the fourth one. My case was an Antec Performance Plus (1080AMG) from 2002 (the one with acrylic window) that weighted like 15Kg when empty!  The thing was so sturdy and well built that I  have been using it until 2018 as a personal file server. I remember having a mess of ketchup and mustard cables in there, so maybe I sucked at cable management or the sheer number of   drives and stuff in there made it impossible to do a good job at cable management. Maybe you could find one and review a 2002 case from the best case manufacturer of the time."}, {"text": "The Antec 900 would be a good one to revisit. That case was everywhere 10 years ago!"}, {"text": "The problem is all manufactures of pretty much every product you can think off just stick with making everything the same these days. You can see it in phones, cars, and obviously computer cases"}, {"text": "I remember back in the day Asus had a pc for sale with a case that looked like that and I wanted it so badly. Nowadays I just want tempered glass"}, {"text": "I&#39;m just getting rid of my old PC which was built into a Cooler Master Stacker 830 from 2006... - The jump from 2011 to now in comparison is NOTHING, ha!"}, {"text": "Sleek case = Modern.  Are the grommets on the back for running an external rad?"}, {"text": "Meanwhile Fractal was already offering the Define R2... in 2010."}, {"text": "why does he have to act like a whiny lil&#39; bitch,cretin mf"}, {"text": "Why would you need 4 x 5.25&quot; bays? Check out Icy Dock 4-bay cage! I still run two of those on a CM Stacker from 2006! Incredible setup! LOL"}, {"text": "That one is ok, I had the CS606BK. Google it, it was horrible. Really."}, {"text": "I remember when the zalman z11 plus was cool"}, {"text": "2011: Cosmos II (late 2011) still an awesome beast to this day but the rat-nest cables is certainly a challenge at times. <br /><br /><br /><br />To this day I can&#39;t get attached to a new case, I think the $350 price tag is what kept me from abandon it."}, {"text": "Shark fans are old school aftermarket fans. They are good. And use to be what we considered quiet back in the day. Also more drive Baus for fan controllers and 4&quot; displays. Again old school."}, {"text": "so weird to hear people say &quot;back in the days of 2011&quot; and it feels like it was yesterday"}, {"text": "Please make a video about the chieftec CS-601. This is THE iconic case from late 90s/ early 00s. Cable management? Lol :D"}, {"text": "About to finally upgrade from the Phantom 410 to the h500 from NZXT. Its weird to think that there was more of a focus on glossy bulky case where as now its all about the matte finish and a minimalist design with glass panels. Goodbye to the small acrylic windows."}, {"text": "Okay but that case actually looks sick."}, {"text": "Sometimes you need to appreciate things from the past.. U no better today if u have no past.."}, {"text": "Looks like a plastic piece of shit"}, {"text": "This would probably get a 10/10 for HardwardCanucks back in 2011. Hardware Canucks you should review the Aerocool Predator, literally took 10 years to come to the states."}, {"text": "ugh"}, {"text": "dude you need to clean that meshify C"}, {"text": "meanwhile, it&#39;s 2019 and I am still using a $50AUD case from 2010."}, {"text": "I miss those days when you can populate the drive bays with 1cd drive, 1 dvd burner, 1 fan controller with temp sensors, 1 drivebay fan/ removable hdd tray with lock.😀"}, {"text": "Roman, want to go bowling?"}, {"text": "Try a case from 2006...."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=08m43s\">08:43</a> &quot;why would you need four 5 1/2&quot; drive bays?&quot;  Well, it wasn&#39;t always just used for drives.  There used to be more accessories that you could buy that could go in 5 1/2&quot; bays - Zip drives, card readers, fan controllers, extra USB ports etc.  At one point, Creative had an extension to their sound cards that would go in there that would add midi ports and volume knobs to the front.  I think the 2011 case would be a good start for a mod project, although that gloss would make any scratches so visible."}, {"text": "i cant believe they didnt have the 4 jet engines with fans in them going through into the case"}, {"text": "Everything in the past that was supposed to look futuristic and modern was more rounded and everything now that looks modern is more square and sharper on the edges. Take for example windows. Windows 7 had a bit of a roundy theme with the logo being rounded and windows 10 is more straight lines and sharp. Thats the same with cases monitors TV remotes consoles etc. Funny thing"}, {"text": "I have an aluminium Lian Li case from about 2003 and it&#39;s shocking.  Was a premium case when I bought it.   No convenience features or cable management whatsoever."}, {"text": "Not gonma lie you look like chris pratt"}, {"text": "I thought those wore 4 small fans infront, I am so delusional"}, {"text": "&quot;Why do we need 4?&quot;<br />He doesn&#39;t know about multi-CD games and the pain of swapping CDs every 5 minutes."}, {"text": "What the hell, this shit is better than my Cooler Master K281 which has no cable management whatsoever."}, {"text": "A typical example of form over functionality. It is not a PC. It is a spaceship."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=4m45s\">4:45</a> Sharknado Teaser"}, {"text": "I would love this if it had good airflow"}, {"text": "Bruh my case looks like it&#39;s from 2011 lmao 🤣"}, {"text": "Do a 90s case"}, {"text": "Calls gloss disgusting.<br />Proceeds to do a close up to the dusty front mesh of the pc. <br />xD"}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=2m47s\">2:47</a> that&#39;s what she said"}, {"text": "Evolv X review in 2025."}, {"text": "10.5&quot; inch thats kinda puny joking a side the early 90&#39;s and before cases were so bad i don&#39;t even know how to put it in words of just how awful they were back then. Beige with no air flow, loud fans zero cable management options, zero room to work in at the back to route cables."}, {"text": "I like fan on the side of the case. It&#39;s great for cooling SLI GPUs."}, {"text": "You know what they say, History always repeats itself."}, {"text": "I would like to see side fans in cases that have no bottom fan mounts for the GPU."}, {"text": "Pretty sure this would have looked god awful in 2011 too"}, {"text": "Omg that&#39;s how i know my Case is getting old: this jet-thing case  is better then mine."}, {"text": "I am still using my HAF X case and it is great.<br />Sidepanel fans are great also, because it gives extra cooling for the GPU."}, {"text": "it sucks"}, {"text": "my case has a side fan slot"}, {"text": "The architecture of this case looks the same as the NZXT Phantom Full tower"}, {"text": "Back in the day, I remember seeing a case with swiveling drive bays and its just damn mind-blowing. Nowadays everything is just boring and plain. With liquid cooling AIO now, we should be getting more than just glass boxes IMO"}, {"text": "Dust ya dam pc dude :) ya growing tattys in that mesh."}, {"text": "I like it."}, {"text": "im using that 2018 case rn haha"}, {"text": "Anyone else notice he looks like Chris Pratt in Guardians of the Galaxy?"}, {"text": "I wanted to save money so I used a 1999 case for my pc"}, {"text": "SMH talking about old cases, l I have a inwin v500 from 2001 so far it&#39;s heavily modified so it looks like chicken wire and beige"}, {"text": "I always wanted this case tbh..."}, {"text": "Why have four 5-1/4&quot; bays? 1 - 3-1/2 A drive, 2 - CD/DVD optical D drive, 3 - slot for a removable hard drive/backup drive/storage drive, and 4 - high-end audio amplifier! Or...<br />...5-1/4&quot; FLOPPY B drive. lol"}, {"text": "What a horrible case."}, {"text": "2011: Has case named Cyclone with shark fans...2013: Sharknado <br />//MIND BLOWN//"}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=4m28s\">4:28</a> &quot;okay so for airflow&quot; <b>breaks the fucking case</b>"}, {"text": "I like different styles of pc c ases. The fan on the side type cases are cool if thats what yoy like. I&#39;m okay with gloss as well. I don&#39;t put other peoples preferences down because it is about the eye of the beholder.Saying a style is outdated is like saying electricity is oudated. Well maybe not that.I think that case is bad ass. I would mod it out some but it&#39;s cool as all fuck."}, {"text": "If your processor is hitting 95 degrees you have a lot more problems than just case flow."}, {"text": "My first pc case 😂😅"}, {"text": "other potential options to put in 5.25 external bays.....  <br />sound card control panels....<br />fan speed controllers...<br />temp lcd gauges....<br />just a few things I remember"}, {"text": "Why 4 optical drive bays?<br /><br />One for your DVD-burner.<br />One for your Blu-Ray reader.<br />One for your fan controller.<br />One for your reservoir for the water cooling. Actually it could even take up 2 drive bays.<br />Or maybe a SATA caddy.<br />Actually you could stick 4 SATA caddies in there. Be all NAS like."}, {"text": "Bah! If you&#39;re going 2011, review Bitfenix Outlaw!!!"}, {"text": "You, my man just earned a new subscriber"}, {"text": "Star Lord reviews the Star Ship... apt..."}, {"text": "You should try modding the “jet intakes” to have fans and cut the side panels so they actually work"}, {"text": "CD/ DVD reader + CD/DVD Writer, fan controller, and possibly removable hard drive enclosures."}, {"text": "I have a Cooler Master Wave case.  Thought about using it as a sleeper for my AMD Ryzen 7 2700x."}, {"text": "In 2011 I bought the CM HAFX nvidia edition... Had none of the problems that this case has"}, {"text": "clean your case"}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=9m00s\">9:00</a> Hello mexican here, using 2 or more cd/dvd units back in the day here in México, was due to piracy, there were people who dedicated to sell all kinds of CDs and DVDs (music, movies, video games, etc.) and could be copying from a disk to several units at the same time, so it took less time to make copies ( also the copying processes were not as fast as now) or people who only dedicated to make massive copys, and they sell it to resellers, they still exist but not has much has it was before."}, {"text": "you please clean that mesh fractile case."}, {"text": "i forgot about the nose case.  you should check out some old xclio cases, especially the typhoon and the windtunnel.<br /><br /><br />I&#39;ll be honest, I still like the windtunnel"}, {"text": "Why would you ever need four? xD it is simple you can put hdd, ssd there in the thing i don&#39;t know how it called. xD but with that you can easily change the drives. 😊"}, {"text": "it&#39;s look like u life from the future, how old are u  in 2011? and why u so shocked? :v"}, {"text": "That case is actually pretty cool to be honest"}, {"text": "Why does your hair always look so flawless?"}, {"text": "Please, can you tell me which tool did you use to check if your CPU was throttling? Thanks."}, {"text": "My best experience with cases is actually managing cables of pre-built systems. Whether I manage stock cables or custom-sleeved cables, it&#39;s always satisfying to make the rats nests look super sleak"}, {"text": "It’s so ugly"}, {"text": "I had the ferrari version lol"}, {"text": "Lmao I have an old case bc I still I’ll have side fans"}, {"text": "what the fuck were we thinking"}, {"text": "I want this case"}, {"text": "Sitting behind me is a PC that has a Ryzen 5 2600X, 16GB DDR4 Ram, Samsung Evo 500GB SSD, and a GTX 970 inside it. The case all of these modern components are installed in is an old Thermaltake Mid-Tower. I&#39;ve had this thing for I don&#39;t know how long, but I&#39;m almost certain that its about the same age as my daughters, who are 10 years old. It is still performing beautifully, with the exception of 1 fan that is out of commision due to a broken blade. It keeps their internals cooler than the case I just bought 8 months ago, which by just looking at it, should be much better, but it&#39;s not.<br /><br /><br />The point is, it&#39;s not the AGE of the case, but the design, and the quality of the materials it&#39;s made of. My new case has better options for wiring organization, and a very nice glass panel that lets you see all the pretty lights, but this ancient Thermaltake Black Gamer case actually outperforms it when it comes to pure cooling power."}, {"text": "I still have the asus vento"}, {"text": "My oldest case experiences involve cheap baby AT cases with wobbly plastic standoffs that you attach to the motherboard and then keyhole into the case. The whole motherboard sists kinda wobbly and you might have places where your case and motherboard disagree where the holes are supposed to be. Don&#39;t push on the motherboard with power on or you&#39;ll short something. Oh, and installing an ISA card, to say nothing of PCI or AGP, may not seat correctly because of the wobbly nature of the motherboard. The system just might not POST when you plug everything in, so do it one at a time.<br /><br />The bad old days… If any of you want to build a retrogaming MS-DOS machine, do it in a modern case. You might have to use a late 90s Pentium motherboard in ATX form factor, but … just do that if you need to. :)"}, {"text": "That case is ridiculous! It&#39;s UGLY, HIDEOUS, AWFUL, and every &quot;airflow&quot;-looking thing is completely NOT FOR AIRFLOW. I&#39;d nope out of the case for the lack of airflow even in 2011, seriously."}, {"text": "It&#39;s wasn&#39;t just about 5.25 drives. You had Sound Blaster X-FI faceplates and gauges and bay fan controllers/temp monitors back in the day."}, {"text": "7 years? feels more like 7 months... getting old..."}, {"text": "I loved the Antec 1200 back in the day don’t judge but it was great air flow if managed properly"}, {"text": "man i love that case though"}, {"text": "2011: Badass designs and details with more space than you ever need.<br />2012+: Flat card box case with minimum space.<br />Still using my 2008 case on 2016 build."}, {"text": "My last pc build (2011) uses the Xigmatek Utgard."}, {"text": "My Antec from 2010 is basically the 2018 case with a smaller window on the side, had loads of good cases back then"}, {"text": "I had this case"}, {"text": "Von wo hast du diesem Gehäuser gekauft? Amazon?"}, {"text": "I&#39;d rather have a side fan or two than a glass side panel"}, {"text": "no lie I&#39;d still use it"}, {"text": "and im still here with an old af case :D:D:D"}, {"text": "I modded my meshify c and put wood paneling on it lmaoooo why cuz noctua forced me to be ugly"}, {"text": "This is a bangin case ffs"}, {"text": "Am i the only one who dont think the world hasnt changed much from 2011? It isnt a long time either"}, {"text": "still looks good to me lol"}, {"text": "This is the case displayed in the cartoon &quot;Console Wars PC - MASTER RACE&quot;"}, {"text": "talks about the dust on the old case but has he looked at the front of his fractal lately?"}, {"text": "better than my rig"}, {"text": "god damn, that 2011 case is so tacky."}, {"text": "disgusting computer, dislike"}, {"text": "Personally I still like the gloss. But I also dont mind wiping it off after inside dusting."}, {"text": "you chris pratt knockoff."}, {"text": "Cases used to look ridiculous"}, {"text": "this case is the equivalent of a riced car. a bunch of intakes that dont have any functionality and it looks like a 7 year old stuck a bunch of vents he thought looked cool on it"}, {"text": "Dude, even in the 2010s, this Case was stupid blenders crap..."}, {"text": "Still use my case from 2009 on my main machine."}, {"text": "i for one like how that case looks. that said i do like cases like that in general, i also tried to get a hold of the Asus vento 3600."}, {"text": "You can find good or bad cases from any year including the current year."}, {"text": "this is the first case i ever built a pc in back in 2012/2013 and i thought i was the coolest kid on the block at the time"}, {"text": "Big ugly hunk of plastic"}, {"text": "Hey Starlord, stop witg this funny accesnt 😉"}, {"text": "&quot;side panel mounted fans have been dead for a while&quot;<br /><b>slowly looks to my right at my bitfenix colossus with green led side panel mounted fans</b>"}, {"text": "Lian Li V2100B is still the classiest case of them all."}, {"text": "make a 2011 era gaming pc in it!"}, {"text": "Have the case custom modified somthat the intakes work and then create a custom cooling loop using those intakes for air supply. <br /><br />Make that Case Great Again!"}, {"text": "So this case is probably still better than the one I&#39;m using today :/.<br />Also, I built my PC in 2012 and a lot of the stuff in this case is super high end. Mine was a mid range and didn&#39;t have a removable drive slot, ssd cady, or dust filters.<br /><br />... And finally, I miss that horrific blue! My old 2000&#39;s one was in that same blue, it was like pouring bleach into your eyes, but oh so good at the time."}, {"text": "That is my bro case lol with an Intel extreme or something"}, {"text": "Are you from Denmark?"}, {"text": "Honestly if the jets worked as intake fans I would consider using a case like this"}, {"text": "I still don&#39;t get it why you would pump air horizontally instead of vertically like in a chimney :( - yes there&#39;s some cases that do this, but too few IMHO :("}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=8m50s\">8:50</a> There were a lot of cool accessories for the 5,25&quot; bays like Displays or Fancy fan Controllers and Audio-Panels..."}, {"text": "Can anyone count how many times he says jet engine in this video"}, {"text": "Well, at least that thing is not quite as ugly as the Alienware cases (past and present)."}, {"text": "So... youtube... I&#39;m from Canada and watch tech videos all the time, why was this guy never recommended to me before?"}, {"text": "it looks like a transformer&#39;s head with facial tumors"}, {"text": "Side fans were pretty nice to have in a time when water cooling was in it&#39;s infancy.  You wanted front and side intake with back and top exhaust.  I usually ran 2 120mm fans on front, a 140mm fan on side, a 120mm fan on back exhaust and a 140mm fan on top.  I still had my HDD cage in place, as I run a RAID setup for my media server, but the cooling worked very well for it&#39;s time.  My case is still from 2012, a cooler master HAF 912, still works like a champ.  I&#39;m also not into this whole RGB nonsense on PC&#39;s.  It&#39;s completely frivolous to me, so there&#39;s that as well."}, {"text": "Well atleast it looks good"}, {"text": "i still have a circle blackhawk (not sure if you have heard of these) these came with with 7 <br />YES! 7 FANS (2x front, 2x top, 2x side, 1x back)<br />soo cool back in 2012<br /><br /><br /><br /><br /><br /><br />P.S having 7 fans does not work"}, {"text": "We had removable hdd cages in early 2000s bruh"}, {"text": "Wow you know nothing"}, {"text": "Just because its old doesnt mean its bad... Oh wait nvm..."}, {"text": "the extra 5.25 bays were for things like hard drive coolers (held a 3.5 hard drive with a couple fans in front), swapable hard drive caddies, fan controllers or whatever ports/plugs that the case didn&#39;t have in it could (and still can) be added in with something like a media dashboard (if you don&#39;t know what that is search for it on newegg)"}, {"text": "complains about the dust in the 2011 case while his pc&#39;s front intake looks like a spiders nest"}, {"text": "Why i prefer multiple 5 1/4 bays: <br />If you are antiquated/poor/pragmatic enough to run 3,5&quot;HDDs, those Cages are useless. They transfer vibration from the HDD to the case and makes noise. There exist rubber band vibration decouplers to fit 3,5&quot;HDDs in 5 1/4&quot;  bays"}, {"text": "i have that case no usb 3 older one, bought for 10 euro  gonna make it pretty, I love those cases"}, {"text": "Hmm I love my side panel fans... blows fresh air right onto the Mobo and Ram."}, {"text": "because 2011 was soo long ago right"}, {"text": "you asked - why the 5.25 on the front? Hot swap Sata Backplanes mainly but also fan controllers, audio controllers, extra ports etc."}, {"text": "I for the longest time had a Coolermaster HAF 932 ANd loved that thing. Unfortunately, after 8 years of wear and abuse, it was time to retire it."}, {"text": "Not gonna lie I think the case looks Suuuuuper cool"}, {"text": "Euhmm ... This case really isn&#39;t old. My first case experience, one where I replaced and upgraded stuff in, was an Olivetti M290S back in 1993 or so. The first case I ever did a full build in was a Chieftec Dragon in the early 2000&#39;s. Now those are old cases. In those days cable management wasn&#39;t even a word associated with cases. You would just tie them together with a cable tie and call it a day ..."}, {"text": "I was building my first computer in 2013 and remember almost getting this case. Didn’t because I remember the front jets wasn’t for airflow. Got the Corsair vengeance c70 which has aged nicely other then the plastic window for fans"}, {"text": "would you just look at that taskbar..."}, {"text": "Woww according to 2011 this was the best case may be available for pc building woww man it has hdd compartment a fan good wire management thing 3.0 ports and mayy other thing"}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=1m16s\">1:16</a> DIMITRI (idk how to spell your name) but also, HOW UNPROFESSIONAL OF YOU TO LOOK AWAY FROM THE CAMERA"}, {"text": "It&#39;s like the computer version of a ricer."}, {"text": "i never trust a PC without an optical DVD or Blue Ray Rom Drive lol"}, {"text": "Gloss is not a problem... Cheap ass looking plastic gloss is."}, {"text": "My case is from 2011, Its a Corsair 600T and is very good"}, {"text": "Imagine someone made a case with heaters in it instead of fans"}, {"text": "Aerocool used to make good cases back in the day. Check the Strike X ST with the 9 x 120mm fans on the side panel. One thing that was awesome was that it also had a clot for a cooler on CPU backplate."}, {"text": "straight outta the flash gitz console wars animation lol"}, {"text": "I just found this video, I have and still own this case. It was for a build in 2013. It&#39;s ridiculous that I&#39;m seeing it here but I really was a stupid 14 year old buying this in the first place."}, {"text": "do you think Dimitri has a area 41 style storage center for all the case&#39;s he&#39;s reviewed over the years? O.O"}, {"text": "The interior isn&#39;t terrible, but the front of the case is just pointless. There were better cases available, even before 2011."}, {"text": "This is a bad case, even for 2011."}, {"text": "Back then i thought those things are speakers lol"}, {"text": "You probably wouldn&#39;t believe, my first builds, case design. Computer Shopper was the Catalogue and V-Com was supposedly the great cad and design computer company. My full tower case had room enough for the outhouse with windows and a door to boot.(literally)The one thing that struck me weird, was the stupid looking big red paddle switch right on the top front, from the 30&#39;s or something. The reset and turbo buttons were nice and small, one being spst momentary and dpdt toggle. What was sad is, the case itself looked very nice. They messed up the whole picture installing archaic  junk on and inside. Great video by the way! Sorry but I really didn&#39;t dig your black transforming Oldsmobile, lol.but I&#39;ll be it kicks ass and takes names."}, {"text": "I got a case from 2007..... its the NZXT Lexa Blackline"}, {"text": "i have a 2011 old Imacc"}, {"text": "I don&#39;t really understand cases with no front intake"}, {"text": "4 x 5.25&quot; bays really isn&#39;t that overkill. A lot of times PCs like these would have some kind of control panel mounted in one of them, either to have additional IO connectors, maybe a SD card reader, or fan controls. Then we were only just getting into USB boot drives, so you probably still had a floppy drive in one of them. Then generally a Blu-ray drive and a DVD-RW drive. Media was still pretty heavy handed. Looking back it seems dumb, but at the time, USB wasn&#39;t as robust as it is today, especially for case control applications or system recover/clean installs"}, {"text": "You know why your case has shit airflow right? The stupid engineers decided to block 80% of the main intake fan by turning the hdd cage sideways which not only serves no benefit to cooling the hdd, but it also chokes the entire rest of the system...really stupid design choices back then."}, {"text": "Looks decent enough to be used today.<br />On my work computer, the case never got upgraded, since it holds fine the components and standards did not change, so it&#39;s an Antec case from 2004, with thumbscrews, topmounted PSU, 80mm fans (front back, and side panel with shroud for CPU),  front door, bays with some rails that you must install first with screws then after some clips you still need some screws to secure it. I&#39;m quite happy with it since i don&#39;t switch hardware often.. like every 5or so years the whole platform is changed, running on my 4th in the same case (temperatures are awesome, the side panel is always open.. sure it&#39;s dusty, but i vacuum it once a year or so)<br /><br />I plan to pimp up an old 486 full tower case. Plenty of room, but will need a lot of TLC/paint/fabrication/adaptations. Will see how it goes."}, {"text": "that case is better than what i use today."}, {"text": "Removable hard drive cages were a thing in 2006...You had to screw the drives in so you installed them into the cage externally then dropped the whole assembly in.."}, {"text": "My first case was a Coolermaster Elite 431 Plus. My second case was also the 431 Plus.<br /><br /><br />Honestly, the case did what I needed it to do and I was happy with it, but looking back on it, it was a pretty bad case. <br /><br /><br />No rad support, thin aluminum side panels which on both of them warped over time and are now impossible to fit on the case, no dust filters, non-removable hard drive trays and very poor cable management. My last build in a 431 Plus was an i7-6700k and a GTX 1080, so maybe I should have given those parts a little more respect and spent more than $30 on a case, lmao."}, {"text": "I thought it where like speakers lol"}, {"text": "I didn&#39;t know Chris Pratt had a channel!"}, {"text": "I have a 2010 Antec one case it is pretty similar though it breaths ALOT easier."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=8m58s\">8:58</a> you needed 4 for : 1 cd  , 1 dvd . 1 usb/memory card/audio etc..., 1 extra in case you need a floppy or something..."}, {"text": "2011 a blast from the past? Even my current pc case is older than 2011 !  (it&#39;s a fine PC btw)"}, {"text": "Your CD drive bays could be used for resevoir or also for fan controller.  It was also popular back then to add a cup holder in one of the CD bays...."}, {"text": "I had this case, I remember buying it on amazon"}, {"text": "i use this case looool"}, {"text": "Wtf? Try a case from 2000&#39;s or before."}, {"text": "we were all high on shrooms in 2011..."}, {"text": "that case is hot as hell ima buy it spraypaint the inside of it black then build in it"}, {"text": "Why is there a plant in the case??? <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=6m05s\">6:05</a>"}, {"text": "2011 wasn&#39;t that long ago :("}, {"text": "What Is the nane of the Song in the start of the video?"}, {"text": "Side panel fans need to come back."}, {"text": "Did you purposely pick the shittest case from back then? Should&#39;ve reviewed my Coolermaster Stormtrooper case from back them. I still use my Stormtrooper today and it is amazing. Recently added an Aorus Z390 Pro WiFi to it and and i5 9600k with my 2015 GTX 960 4GB. I won&#39;t change the case for many years to come."}, {"text": "Try an original NZXT Phantom"}, {"text": "Every year has terrible cases. It was a crappy case then, too."}, {"text": "with those light reflections im sold"}, {"text": "My haf x is from 2010... Works amazingly. I get much better component temperatures than the vast majority of people I see online with no expensive custom liquid cooling loop"}, {"text": "This case is a joke lmao"}, {"text": "2011 Fractal Design Define R3 is far better =) Althoug it is quite similar to R4, R5 and R6"}, {"text": "It would be so cool if those fake fans actually were functional"}, {"text": "This made me pull up my Newegg history to see the case I bought way back in 07&#39; with all of my graduation money. The NZXT Zero was a beast but terrible even compared to this."}, {"text": "I still use the Haf-X... I hate it now. I had horrible taste in 2012/2013"}, {"text": "Ricer case"}, {"text": "I&#39;ve got this case in my attic without USB3 front io. It&#39;s not bad imo. The blue wasn&#39;t part of the original as well as the harddisk cage, the disk slots had flumsy plastic clickers. The front for me does have some perforation, don&#39;t know why they removed that. And there was almost no cable management. The brackets were break-off ones."}, {"text": "Heh, now go back to something like an Antec SuperLanboy. I still have mine from 2005, recently changed to a Meshy C."}, {"text": "i usually take my 2011 jet engine pc to fly above usa mexican wall on the boarder"}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=2m30s\">2:30</a> disgusting gloss... dude... let&#39;s talk about that front cover for a minute... lolz"}, {"text": "My first case experience was the Corsair 100r. Not exactly a very old case but basic all the same :)"}, {"text": "Holy Moly, I&#39;m experiencing it right now. just updated Processor, mobo, Ram, GPU, SSD, RGB Fan, and CPU cooler, but still using my old casing (NZXT M59) with quite frustrating cable management Hahaha"}, {"text": "The front of the case looks like a speaker from an over the top designed stereo lol"}, {"text": "lmao I had this case"}, {"text": "Y do u look like Chris Pratt?"}, {"text": "the extra drive bays were for USB Hub, 6 in 1 card reader, and Temp Monitor."}, {"text": "How terrible is it? Hm? lemme tell ya, i have a sleeper Pc, i have a case from 2006 and ive done atleast 4 new builds in the same case, lmao"}, {"text": "I think it’s funny my first case was a CoolerMaster HAF and I still think that is one of the best cases I have ever used"}, {"text": "Looks like Cherno Alpha from Pacific Rim"}, {"text": "I would make a shroud to cover the psu, and cabling and run this case all day."}, {"text": "It would have done well with Windows ME."}, {"text": "Answering the question on the 4 Large drive bays, as a system builder back then, it was quite common to have a DVD Drive and then have an HDD box which would take up 3 of the large bays. You could mount the disks in vertically that way. These days most people who would of done that have NAS boxes so you don&#39;t need your computer to be on to access the storage."}, {"text": "why am i watching random case reviews"}, {"text": "first case I built in, and only, lian li pc-60 from 2001. Has all squared corners, has a huge acrylic window, 4 5 1/4 and 3 1/2 in front, remove able hdd cage with 5 slots, removeable mobo tray, top mount psu, no cable management, but it is amazing! rugged, and has 3 80mm fans. It is used for my pc which is a 50 dollar build"}, {"text": "very old style case..."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=2m33s\">2:33</a> Wow, look at that dirt in the Meshify C. You just unsold that case for me. I was going for it, but after seeing how easy dust gets in there, i&#39;m out. Going with NZXT H500!"}, {"text": "fake jet engines lol, this is Fake News, liberals will LOVE this case!"}, {"text": "This still looks fairly modern not the least there are new chassis that are very similar with the details which I will say is practical."}, {"text": "I really like the blue on the inside"}, {"text": "I don&#39;t have dust filters but I do have side fan on my thermaltake soprano from 2005. Never a spec of dust in that thing, side fans are awesome but not nice to look at it."}, {"text": "What&#39;s wrong with gloss?"}, {"text": "i still have a case from 06. it works great"}, {"text": "4 drive bays, 2 dvd for disc to disc copy, 1 for fan controller, one for a card reader, heard from a friend."}, {"text": "Gross ricer case"}, {"text": "I got one from 2003"}, {"text": "Check out Thermaltake level 10 GT. I bought it 5 years ago and I&#39;m still using it. I love the looks of it."}, {"text": "Find an Antec Lanboy Air!!!!!!!"}, {"text": "Case is actually the plot of Sy Fy&#39;s next shark crossover movie. Sharknado vs Aliems."}, {"text": "I have a case from <b>2001</b>"}, {"text": "The case looks garbage even by 2011 standards"}, {"text": "I bought the Thermaltake Armor Series VA8003BWS back in 2006. Five years before this case and it had removable HDD trays, Front air flow with filters, Acrylic side panel with fan, Ports for water cooling and radiator mount. Removable I/O bays. Quick mount accessories. Top I/O panel. Etc...  I Don&#39;t get how this is a &quot;back in the day&quot; case when it&#39;s mediocre with nothing new to offer."}, {"text": "Review Lian Li choo-choo train!"}, {"text": "give me that case! I LOVE IT"}, {"text": "I had that case! It was amazing! I sold it to a friend he still uses it today! Pretty fun"}, {"text": "i love the throwback! I wanted that case back in the day!"}, {"text": "USB 3 in 2011... WHAAAAAAAAAAAAT?"}, {"text": "I actually orefer looking at the case. Lol."}, {"text": "tbf id still use it XD"}, {"text": "first build ive seen on youtube where the graphics card cable comes over the top and helps prevent the card sagging."}, {"text": "more like hardwareCHUNGUS"}, {"text": "&quot;Back in the day&quot; - my case is from 2003, y&#39;all."}, {"text": "The case looks like a jet and probably sound like on"}, {"text": "Is there something wrong with thumbscrews?"}, {"text": "Мне кажется Дима по ночам бросит на этот старый корпус."}, {"text": "Oh. A batman computer. Bat computer. Batputer.<br />Yeah that."}, {"text": "four bay was usually one for cd drive one for dvd writer a floppy drive and expansion or 2 expansions"}, {"text": "Only 4 5.25 inch options?! 1 DVD Rom, 1 CD-R Writer, 1 exchange cage for 3.5 inch HDD, 1 fan control, 1 multicard-reader ... :D<br />... but what really strikes me is the bad airflow in this! I never thought it would be so bad that the CPU is throttling!<br /><br /><b>One question remains: Are there any old PC cases of the last 20 years which still look absolutely classic (timeless) and provide a proper airflow?!</b><br /><br />(Like the old chieftec BRAVO Series (BH1...)from 18 years ago maybe)"}, {"text": "Cooler Master HAF X from 2010. and still holds up way better than that... &quot;thing&quot;?"}, {"text": "I hate the RGB everything cases so much right now. if it was RGB changing from solid color to solid color I think that would look good. but I hate the rainbow RGB cases. I don&#39;t want my case to look like it could be in a gay pride parade."}, {"text": "who in 2019?"}, {"text": "modify the side panel and make it a tempered glass , this would be really nice."}, {"text": "whats the song at <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=0m14s\">0:14</a>?"}, {"text": "Dont u have a jurassic park movie to film or someshit"}, {"text": "Oh dear God..."}, {"text": "You guys must be really young...I was part of the first wave of &quot;case modding&quot;. This thing is an alien spaceship compared to what we were working with."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=6m10s\">6:10</a> why is there a fucking plant in there"}, {"text": "Cough desk pc"}, {"text": "used to have the controller for the fan controls and the water flow for the 5.25 drive bay."}, {"text": "i remember almost buying this case maybe 5 years ago when i built my current pc... i think I thought the vents at the front were cooling vents, so glad I got the Stormtrooper case instead, haha, at least I have ventilation and dust filters... and a bigger window to see my mobo, lol"}, {"text": "pc master race"}, {"text": "pay me and ill creat better intro for ya"}, {"text": "I like the blue"}, {"text": "This is probably the ugliest case ive ever seen."}, {"text": "90&#39;s - No form, all function<br />2010&#39;s - Awkward combination of all form and all function<br />2018 - No function, just form"}, {"text": "This case kind of reminds of Vulture from Spider-man Homecoming"}, {"text": "The airflow is crap, but think about what we had back in 2011"}, {"text": "It looks cool"}, {"text": "god that thing&#39;s fugly"}, {"text": "Antman?"}, {"text": "how about the Acer predator?"}, {"text": "In 2011 you could also get a Coolermaster HAF X. That is what I chose back then. Still have it too. It houses my old Win 7 system."}, {"text": "I have a Fractal Design R3 and It&#39;s almost 10 years old. Still holds up like a new one. It depends so much what you are after and what looks cool in your eyes when shopping. You can still buy those &quot;2011 cases&quot; today, but only a child or a teenager would buy something like that."}, {"text": "expert need know why you need that many empty slots? .......... are you for real ? :-D"}, {"text": "you&#39;d have 4 drives for different speeds of read/write.  Audio could be written at 52x, however when DVD and Blue Ray drives first came out they couldn&#39;t write, only read, and when they did, they weren&#39;t as fast for audio.  So as you would upgrade your PC with DVD or Blue Ray, you&#39;d keep the old drives as they&#39;d be more proficient at their respective tasks."}, {"text": "In 10 years RGB fad will be the joke"}, {"text": "I would so love to customize a case like this and make it airflow functional. About side fans, my experience is that you want airflow as much in one direction as possible, adding a side fan made cooling worse for me more then once (I&#39;m also very careful with top fans)."}, {"text": "I started building computers back in 1996. I decided to get a Lian Li case back then. The all aluminum one. I liked building with that case because you had a removable motherboard tray, air filter up front and removable hard drive tray. I think the cases today have a lot better air flow though, but back in &#39;96 Lian Li cases had good air flow as long as you used a good CPU cooler it wasn&#39;t bad."}, {"text": "I had this case at the time )))<br />I was blown away by cable-management grommets"}, {"text": "airplane style"}, {"text": "Isn&#39;t this case name bullet from iball?"}, {"text": "fun fact i did a cooler master ql300 build and it had an adapter to turn the standoffs into screws  so you could just use a screw driver instead of pliers.... ofc i found it after i did it the hard way.."}, {"text": "i want 5.25 bays to stick around 2 at minimum so i can stick a blue ray in there and fan controllers with satisfying knobs...heheh"}, {"text": "I would take out the LED in the front &quot;Jet engine&quot; looking thing to allow more airflow. I&#39;ve always preferred a straight through airflow design over side panel fans/vents."}, {"text": "Where can I buy this case ?"}, {"text": "I hate that 2011 is old now"}, {"text": "The four bays. 1 for dvd, 1 for a fan controller, another for display and fourth for some space"}, {"text": "whatchu mean how it performs? every cases is the same, maybe abouzt 5 degrees difference at max"}, {"text": "That is almost exactly my current case. &gt;.&gt;"}, {"text": "Ugly as fuck. XD"}, {"text": "I would go to town on that to get more airflow"}, {"text": "I want to see white/yellow cases again, even as just a nostalgia-gimmick, I always thought they looked homely."}, {"text": "Wtf??? I still have a normal case and u say this is a blast from the past?? In my opinion it doesnt improve your skill at all"}, {"text": "meh , had one . meh"}, {"text": "you need 4 back then cause DVD/BLURAY drive, Fan control, water-cool control and floppy disk or hot swappable HDD drive. now bluray and dvd is not as common so u can download or use a detachable one, fan control now can be done over software so does water cooler fan some model even let u control the pump. floppy disk had went the way of the dodo bird. drive had become so large in capacity u don&#39;t need as much drive or have alternative like 2.5 inches even the recent m.2"}, {"text": "I actually miss the side panel fan slot, as it is quite important for me (and where I live) to have side panel for extra cooling, and more specifically, extra cooling for my GPU. I live in tropical condition, and my old case has side panel fan slot which helps my GPU (HD5770) to get around 5*c cooler than without. I bought a new case along with new PC build, so I don&#39;t use my old case anymore. Good thing is, my new case has acrylic window, I can DIY a hole and fan mount on it :))"}, {"text": "I am sorry to say I&#39;ve used this case for the last 6 years, it looked great for its time.  But today&#39;s hardware just bakes in this case, sorry aero cool, upgraded to Fractal Design."}, {"text": "It even had wiring grommets.  Wow."}, {"text": "Side fans should comback"}, {"text": "Cyclone 2 awesome"}, {"text": "Nice PC case"}, {"text": "I would unscrew those LED&#39;S on the front (Jet engine) and replace those with some mini-fans :D"}, {"text": "I fucking miss the good ol&#39; heavy steel cases. yeah I get it, people like to decorate their system. but I don&#39;t want any LED on my system and I just want a durable, solid, heavy PC cases and they have bacame some high-end PC nerd thing. no way I would pay $100 for metal boxes. bring back my $200 steel case with no stupid light on, just plain square please"}, {"text": "Whoa, 7 years ago!  That is so long ago!"}, {"text": "gloss has its place."}, {"text": "4 drive bays..  id use one for thermal Nd clock speed indicators 1 for dvd and one for a audio dac annnnddd set one as a hotswapable drive or multicard mega flash ect"}, {"text": "A dremmel and some magnetic filters would be a fun weekend case mod project with this case.   You needed 4 5.25&quot; drive bays because 1) 3.5&quot; floppy  2) cd/dvd RW 3) another CD/dvd rw so you could copy... make back ups of movies and games...  and 4) front panel sound blaster audio ports or memory card ports."}, {"text": "Kinda late but... I feel like this isn&#39;t really representative of cases from back then. I&#39;m still rocking an Antec Mini P180 from 2008 and it&#39;s still a very good case to work with and for the most part looks pretty modern still. Yeah, there&#39;s some missing features, like front panel USB3 but other than that (which is where the 5.25&quot; bay comes in handy; there&#39;s plenty of front bays with USB3 ports), it&#39;s fine. Then again maybe the P180 series was ahead of its time... Eh."}, {"text": "0/10 didn&#39;t run crysis."}, {"text": "this case is straight pimpin tbh. i actually like it"}, {"text": "In 10 years we will be making fun of all those super heavy tempered glass, 1-5mm intake gap and RGB to light a disco cases.... !"}, {"text": "Hey shut up my meshify c has a beautiful gloss"}, {"text": "you should review Gaming Bomb Xpider case from 2003 somehow xP"}, {"text": "Why you are uploading videos, which have even worse framerate than consoles? Consoles at least get 30fps, this video is 24fps."}, {"text": "hey starlord!!"}, {"text": "Late last year I got an NZXT Phantom 410 and built in it with modern tech and it looks great as well as staying ice cold. Blue and white is my color scheme in all fairness. I live in Central Indiana, so Colts and my high school&#39;s scheme was blue and white. It is like speed and ice in a beautiful mixture. Also I&#39;m not a big fan of entirely glass case person."}, {"text": "I dunno. I still have a case from 2012. But it was the best of the best back then and is still pretty good. The Pahntom 820 is still a good case even today. I dont know about the aerocool. It wasn&#39;t that great then and well obviously isnt that great now. Maybe try a better case from then like a phantom 820?"}, {"text": "This is the PC Master Race ship from the animation haha"}, {"text": "mine just work fine , entire pc part are assemable at table without a case"}, {"text": "dat plant tho"}, {"text": "Lol i just bought a Silverstone FT03B and it&#39;s a 2011 case...In my opinion it&#39;s still more original and innovativethan most cases out there in 2018"}, {"text": "Re: your question around <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=8m45s\">8:45</a> into it:  Four 5.25&quot; bays back in the day was common and spartan for the time.  You would need 3 or four if you wanted to add a drive cage for additions HDDs, and there were plenty of devices besides DVD&#39;s to fill them.  Many soundcards even came with a 5.25 bay module - like some of the SoundBlaster Audigy series cards.  Fan controllers, LED controllers, a tray for tools - whatever the scenario, they got used lots."}, {"text": "I have a tower from around 2010-2012 that has a huge fan front-and-center at the bottom. It also has two comparably-sized fans attached to the side, so airflow is definitely not a problem. It does make a fairly large amount of noise, though."}, {"text": "Aha my friend has this case, although he got his built in 2015"}, {"text": "Front intake is a sharknado obviously guys. Clearly the biggest threat to space-faring vessels."}, {"text": "I think it has extra drive bays so that you can add things like drive bay USB hubs"}, {"text": "I&#39;ve been reusing a tower from 2007 and it works I guess."}, {"text": "Still running with my coolermaster HAF x. It probably needs dust cleaning more than recent cases but it does the job and all the stock fans are still running. The only downside it it weighs about as much as an namibian."}, {"text": "My case, the Thermaltake Core P3, is nothing BUT airflow.  There can be too much, like in my case, a weekly dusting is not just recommended, but absolutely nessessary.  lol"}, {"text": "I think I&#39;ve got one of those sitting in my closet, I really need to see if it&#39;s not damaged and transplant an older system in."}, {"text": "Just needs some modifications so the fake jet engines allow airflow to the front case fan."}, {"text": "I never saw the point of the lights, yes it looks cool, but its a waste of both power and space, this case for example, rather than the single fan up front, those &quot;intakes&quot; could have been fitted with small cooling fans, with out the lights I would assume they could have included a fan up top as well, but Im not in the know of parts, I only know enough to hold a conversation sadly, I can understand, but I cant apply"}, {"text": "he pops the front with full force and says oh no an led poped out  bad quallity"}, {"text": "You rip the old case for have glossy styling...but you are also advertising fancy fans with RGB lighting. You don&#39;t think you&#39;re going to look back in 5 years and cringe at all the RGB? I&#39;m already cringing. I&#39;m proud to announce I don&#39;t use any RGB lighting at all, anywhere on my premises. I&#39;m like a time-traveling genius."}, {"text": "Fake surprised about removable cages in 2011? My Antec from 2006 has that, and my 2011 Define R4 is a modern case."}, {"text": "Damn 7 years ago?! Fr?!"}, {"text": "Russian Canadian that&#39;s awsome"}, {"text": "anyone who bought this instead of the coolermaster HAF X back then when he wanted maximum air flow: deserve to be sammed :^)"}, {"text": "I would make this case look like Cherno Alpha if I owned it. It would look awesome in drab green."}, {"text": "should do a review of a case from 2000 lol"}, {"text": "Time to revisit the nzxt phantom 820!!"}, {"text": "This case just reminds me of the old knock-off PS2 controllers you&#39;d find in a bargain bin."}, {"text": "Im rocking a Deepcool Genome II and appart from 2 added fans and a single front LED to light the Tvirus Res,  It&#39;s mostly stock. Runs great and looks sweet (imho)<br />Before that I ran an Antec 1200 Big, bad black box with fans, many many fans and enough drive bays to put some modern server cases to shame! <br />don&#39;t wanna sell the case as its a good case =) just didn&#39;t have the wow factor,  definitely function over style."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=3m27s\">3:27</a> I bought my current case 2 years ago and it has a fan spot on the side panel. Huh. Anyone knows when it was originally released? it&#39;s a Tesseract wh sw from Deepcool."}, {"text": "lul takes the top of the line product no one could afford back then :p yeah they were that terrible, this is a good walkthrough of the topline 2011, now try the normal gamer cases, i remember them, it is not that long ago, I bet i have a couple stored away myself, just think NZXT for a second :p"}, {"text": "but looks like crap generally"}, {"text": "Adding a direct fan onto the gpus is a great idea if you&#39;re air cooling."}, {"text": "Dmitry, the &quot;Shark&quot; sticker and &quot;Cyclone&quot; badge are in reference to the popular hollywood movie of that era, Sharknado."}, {"text": "its nice and for 2011"}, {"text": "I mean to be fair, if you are buying a non budget case, how do you not have a 2 dollar nut driver for taking care of your standoffs?"}, {"text": "very nice radio"}, {"text": "I wonder why the front lights don&#39;t work <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=4m28s\">4:28</a>"}, {"text": "I thought it was hideous, and then... the LEDs. I bet this was awesome in 2011"}, {"text": "This case design was already long dead by 2011, I had a Corsair 500r in  2011. This was more a 2005 styled case."}, {"text": "2 for drives, 1 for hard drive swapping and another one for fan controllers, an maybe another one for lcd that display the stats on the pc (temperatures etc. )"}, {"text": "I would mod the case so that the front air scoops actually acted as inlets."}, {"text": "The additional 5&#39;25 inch drives were for additional features such as but not limited to:<br />-fan controllers (even with touchscreens - yet we don&#39;t have that in 2018!)<br />-light controllers<br />-audio players (you know, radio + controls such as bass, tremble... like the one in the car) which could be hooked up to audio cards (old stuff, huh?)<br />-storage compartments<br />-additional ports such as USB, SD cards,xD ,MS/M2...<br />-PC stats displays or even gauges (extra kool)<br /><br />imo a great design, not a fan of modern glass boxes (yes, they&#39;re boxes as most of them have no design elements at all)"}, {"text": "That looks like a shity case from 2011, back then i had the fractal design define r3 and it was an awesome case for being silent, mostly good quality and having good cable managment."}, {"text": "I still have my Coolermaster CM Enforcer It&#39;s has good airflow but oh my God the front panel SCREAM &quot;Gamer&quot; and it&#39;s awful"}, {"text": "Aye it&#39;s star lord"}, {"text": "When a stock honda civic that has a good scoop, but doesnt actually do anything."}, {"text": "its starlord"}, {"text": "Old case looks sweet"}, {"text": "my first case, was cheap, and fairly high quality, i modded it with extra led&#39;s and would highly rate."}, {"text": "This is the case I recognize from the PC Masterace animated video. If you know which video I mean..."}, {"text": "In front of case: &quot;Areo&quot; <br /><br />2011 year of fake shits."}, {"text": "wow starlord become a youtuber"}, {"text": "look up system stuff from that time cpu were not as hot run as thay are now so u thank about it in that time windows 8 was just coming out and 2 core and 4 core was all that was out maybe some 6 cores but in gen it did dot tack alot to run a pc"}, {"text": "My case still looks like that lmaooo, Raidmax Viper II."}, {"text": "Does it include VTec?"}, {"text": "With regards to the 5.25&quot; drive bays, there are quite a few things you can install in those besides disk drives, such as media control panels, fan controllers, card readers, hot swap drive bays, and I&#39;m sure someone can think of other handy doodads they were used for. It wasn&#39;t uncommon to fill those up with geeky gadgetry back in those days, though it was definitely on the way out in 2011, hence the door to hide it all. Steam was pretty much the death knell of disc drives and with them external drive bays."}, {"text": "Side panel fans need to come back, really helps with the gpu and cpu VRM temps when using an AIO."}, {"text": "so after fucking up the fight against thanos you get your money from yt??"}, {"text": "Cases now just look like fish tanks @_@"}, {"text": "That case from 2011 is better than mine"}, {"text": "No one is gonna comment on how dirty his pc is?"}, {"text": "... when millennium  snowflake begin a review of a Ferrari 208 GTB ... wait a minute ! this is not a hybrid SUV?"}, {"text": "OMG Starlord! 😍"}, {"text": "I&#39;m still using a 2011 Antec case."}, {"text": "I still rock a Corsair Carbide 400R that i got in 2011....i was looking to upgrade but aside from not having a tempered glass, it still destroys a lot of modern case in rigidity,  features and craftsmenship. Plus it kinda looks decent"}, {"text": "My case from 09 looks way better than this, CM 690. Clean, all black, removeable HDD rack etc."}, {"text": "Let&#39;s go back even further. Say... like 2001?"}, {"text": "They both look like shit"}, {"text": "Why would you need 4?<br /><br />cd drive (might want 2), dvd drive, hot swap bay, <br />There used to be all sorts of things you could use to fill the bays."}, {"text": "my 2004 case has a front dust filter,a removable drive-bay and side panels that open with buttons,no need for screws,the cable management is also pretty ass."}, {"text": "Is it only me that couldn&#39;t give a damn less how my case looks? I really only care how it performs. Honestly, I cringe when they say &#39;cable management&#39;, as if &#39;good&#39; cable management, which only serves in an aesthetic capacity over &#39;decent&#39; cable management, is paramount.<br /><br />My rig sits under my desk where it can&#39;t really be seen, and performs quite well. If good cable management gets you off, more power to you, but I couldn&#39;t care less."}, {"text": "Really wish this video started like the one from seven years ago"}, {"text": "Back when water cooling support was just two holes in the back. lol"}, {"text": "Syclone + Starcruiser + Shark = They called it back in 2011, Sharknado 3: Great whites in space"}, {"text": "Aw, but I WANT optical drives. Blue ray burning/dvd burning. I also use those sockets for card readers and stuff."}, {"text": "I like gloss better than matte."}, {"text": "Priorities... :D :D :D<br />&quot;Meshify C have disgusting gloss on the interior panel&quot;<br /><br />Whole front covered in dust and the gloss is your main problem?! :P"}, {"text": "2011 = blast from the past? If you&#39;re 15, yeah, ok."}, {"text": "why this person look like that person in infinity war that in love with thanos daughter&#39;s ?"}, {"text": "&quot; more case handle has to have a hancanboth&quot; -Dimitri 2018"}, {"text": "I wish you compared an antec p180 instead."}, {"text": "your meshify c is disgusting."}, {"text": "To be fair, it looks sexy AF"}, {"text": "cases today are all boring , neverly every one is following the same internal design , with no outward flare either."}, {"text": "This is lightyears more advanced than the stuff I have."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=2m27s\">2:27</a> Bro..... Clean your Computer. OMG"}, {"text": "wow i had this one.who else had this case?"}, {"text": "why are u talking about 2011 like it was in the 80&#39;s xD 2011 is not that far from present :d"}, {"text": "Lucky you. The only case on Ebay at the moment costs 108 Euros"}, {"text": "It has four 5.25 bays. In case you want four blu ray drives."}, {"text": "For some reason i get you mixed up with Chris Prat"}, {"text": "Candle. It’s alright man, i accidentally combined sharp and heavy the other day, making “sheavy”."}, {"text": "I still use my Cooler Master HAF 932."}, {"text": "Im still using my case from 2011..."}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=6m06s\">6:06</a> &quot;something is... missing from this shot&quot; <b>inserts plantpot inside case</b> &quot;perfect&quot;"}, {"text": "its bullshit..... fake fans in the front is damn near false advertising... it looke d like it had awesome cooling when in life it has really bad air flow.... F-"}, {"text": "&quot;disgusting gloss&quot;... disgusting dust! clean that sh!t"}, {"text": "soon enough people will be saying that about your case lmao"}, {"text": "cases in 2011 are for 11 year olds and cases in 2018 are for 18 year olds."}, {"text": "2011? I had a 2006 Alienware Area 51 that was an absolute U N I T"}, {"text": "Yes sidepanel fans is something i kind of miss on my old case.<br />Had 2x white 120mm fans on a case ages ago with white cold cathode lighting up the inside of the case, looked great in the night honestly."}, {"text": "i chose that case for my first proper pc"}, {"text": "This was an interesting video though I&#39;d love to see a modern build in some of the really early cases back from the early to mid 90&#39;s.   That&#39;s when I first got into building PCs and it was rough.   Every single case you could get was that ugly beige color and all cutouts in the case were razor sharp.   Very hard to build a system without 2 or 3 cuts on your hands.  <br /><br />The multiple front 5 1/4 inch front inserts weren&#39;t just for CD/DVD drives but also other things like 3rd party multi-card readers, fan controllers, and audio inputs."}, {"text": "I still would use 4 drive bays, AND the sata port in the front. I have 3 Bluray drives and a storage drawer for thumb drives, and some headphone cables in it. I rip my movies, and I buy A LOT of movies, for my NAS so I need to have multiple drives. Have you ripped a bluray? it takes 20-30 minutes per movie, and if I get a series, I want to rip them at the same time. 3 X 30 minutes is a long time to wait, or I can do three at a time you know?"}, {"text": "I don&#39;t care what you say, that case is classy af."}, {"text": "This thing is better than A LOT of sub-$100 cases from 2017 and 2018. PARTICULARLY the CoolerMaster cases.<br />CABLE GROMMETS, removable drive cage, multi-colored interior, rear ssd bracket, giant motherboard cut out, etc!"}, {"text": "Rawr xd"}, {"text": "Weren&#39;t a lot of early pump/reservoirs made to take like 3 of the top HDD spots for the flip open panels that most of those cases featured?"}, {"text": "I had this in 2013.. :D"}, {"text": "i wanna see you reviewm first case th original cm cosmos"}, {"text": "I like the jet engine things on the bottom..."}, {"text": "my case have 4 150 mm 1500 rpm fans but my motherboard can&#39;t run anyone of them xD (only 2 pins that was needed for dual-fan spartan) When you have atx but feels like micro atx xD"}, {"text": "I had a 5 1/4&quot; reservoir and fan controller at that time, so it wasn&#39;t just for optical drives dimitri!"}, {"text": "Whoa now, no place for a 240 radiator, what do you mean? it&#39;s clearly got two radiator holes above the PCI-e slots to do an external radiator!"}, {"text": "Ugly"}, {"text": "Would love a case like the 900d with side fans.  Hate that high end these days dont give you the option"}, {"text": "the funniest thing now is that most of the cases of today.....look all the same even tho they try to look different, like they don&#39;t thing to make the case physicly different like shorter in depth as you don&#39;t need those dvd readers anymore and also the general look,<br />i like minimalist but this ist just boring"}, {"text": "So much potential!"}, {"text": "Looks like a speaker"}, {"text": "the most impressive thing about the case to me personally is that it actually had usb 3.0 ports. I didn&#39;t knew 3.0 was popular enough back then or even knew it existed when I was that young I guess."}, {"text": "I&#39;ve been using the same case since 2005. It&#39;s called nothing."}, {"text": "Damn that’s a ugly case that company should be ashamed for making that piece of shit"}, {"text": "94 degrees? I don&#39;t think that is the case. It sounds like your CPU cooler was not attached or wasn&#39;t working well..."}, {"text": "Do Cooler Master Stacker 830.  Its old, but held up really well except the USB 2.0 ports"}, {"text": "And i am here using my 2009 HAF 922!"}, {"text": "Lmao to what he says at <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=4m24s\">4:24</a> to a pretty much spotless case and then if you saw <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=2m26s\">2:26</a> and look at his PC in use... Oh The Irony Lmfao!"}, {"text": "I built my first computer around the time this case was launched but I chose the NZXT Guardian 921 instead. Back in 2012 I really wanted a larger side panel window but they were basically non-existent.  I&#39;ve changed cases a total of 3 times, the first of which being the Cooler Master Storm Stryker, then the Phanteks P400s  and now the Cooler Master Mastercase MC500P."}, {"text": "My first case experience will start in about two days with an NZHT H700i. I am building my very first PC"}, {"text": "Shark cyclone? <b>so close</b>"}, {"text": "this foo look like chris pratt"}, {"text": "where can you get this case"}, {"text": "bring back fans on the side"}, {"text": "Ricer case"}, {"text": "what happened to the flower??"}, {"text": "You comparing a shit case from 2011 to a decent case from 2018.... why dont you compare the Corsair 600T from 2011?"}, {"text": "The front fan would sucks air from under the front panel from the (hand) hole."}, {"text": "I happen to like the look of the case, it&#39;s like a  grown up zalman z11."}, {"text": "If a riced Honda Civic was turned into a case, this is what it would look like."}, {"text": "My case is from 2007 and it&#39;s great, it has 7 drive slots, full metal, cable management thingies and its bigg"}, {"text": "Idunno it looks pretty cool"}, {"text": "Floppy disk in 2011?"}, {"text": "I am running a case from 2010 that still holds up by modern standards. I think you just fucked up"}, {"text": "You reviewed the HAF-X in 2010.  It&#39;s STILL a great case.  I added a basement to mine to house two rads, PSU, and water pump PLUS, have a rad in the ceiling.  How about you revisit it?"}, {"text": "It&#39;s from PCMASTERRACE!"}, {"text": "SharkSyclone inside"}, {"text": "Might have been a decent case if, you know, the fucking vents were actually vents and not just ornaments."}, {"text": "I&#39;m still useing my antec 902 case side fans and all still the best temps/ performance I&#39;ve had. Never seen temps above 130f"}, {"text": "fractal desing refine r5 still use the side 140mm fan. gotta feed that r9 390..."}, {"text": "oh shit"}, {"text": "Gloss is beautiful!<br />I&#39;m sad everything is either fugly matte grey/black or white now.<br />I also miss <b>interesting</b> case designs - 99% of well rated cases for like 2 years now are identical. With modern insights like tempered glass, psu shrouds/basements, SSD mounts everywhere, more modularity, more space for cables behind the mobo, better airflow - these old case designs would be cool.<br /><br />That case ain&#39;t bad. Back SSD mount? My CM HAF stacker doesn&#39;t have that. TBF other than the side mount pci slot the CM was kinda outdated for 2016."}, {"text": "Early 2000&#39;s school PC cases. Whole thing is aluminium, most of them are squished. The PSU is in the front gets no airflow at all. We have a pile of those that caught fire. Front panel is cheap plastic. At the back there are two tiny fans."}, {"text": "You sure that bottom drive cage isn&#39;t removable, what&#39;s the screw for connecting to the bottom of the chasis, if not to allow it to be removed?"}, {"text": "Can anyone tell me what size of Linnmon table does Dmitri use in this video? Thanks!!!"}, {"text": "I have an enermax ostrog from around 2012 and im pretty sure this case is just an ostrog on the inside"}, {"text": "lol my case was released in 2008, more work to get cabling nice, has 200mm side fan, only usb2 on the front, still my workhorse, just modern internals."}, {"text": "this case looks so fugly  compared to todays cases. it looks like a toy/something a teen would think is cool."}, {"text": "Is that how much dust gets in front the Meshify C?! <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=2m32s\">2:32</a>"}, {"text": "Just today got a smaller version for  free,the black one.<br />Looks nice,awful cable management.<br />P.S.Lost the hdd drive holders 8("}, {"text": "it looks sooooooooo bad"}, {"text": "A lot of custom water cooled systems back in the day used bay mounted reservoirs, so having four optical drive bays was nice.  I have a dual height bay res in my Corsair C650D.  Cheers"}, {"text": "Id buy it today if those &quot;jet&quot; ports all had little high spin fans that actually pull"}, {"text": "That’s an ugly as fuck case lol."}, {"text": "lol i am still using antec 182 from similar era with mods it still works alright"}, {"text": "oh lol this is the case from flashgitz&#39;s pc master race animation!"}, {"text": "I use to have 4 slots on my first pc , one for music cds , a drive for a game ( some required the cd in the drive to load ) one a dedicated copy drive and the last one was a floppy drive back when it took a whole cd drive bay.<br />Pretty much back in the late 90’s you didn’t want to keep ejecting games ect."}, {"text": "Aerocool is the worst case to buy whatever year it is. Not fare to compere it with corsair which is one of the best. I challenge you to do the opposite. Compere a 2011 Corsair case to a 2018 Aerocool case."}, {"text": "hTa,s a ugly case! I Still use my Antec 902. So much feature are missing. Like being able to mount the PSU with the fan down. Dust filter that don&#39;t need to remove the whole drives cage to clean and good cable management. BUT the 902 with 2 nice front and side 120mm fans   and top 200mm fan to extract air still has great air flow. My build is casual. Only 1 video card, a Corsair H60 mount at the back as intake ( the 200 mm suck that heat out right out). I&#39;ve been looking to change it, building in it is a little bit of a pain. but it&#39;s sturdy and air flow still good. still doing it&#39;s job."}, {"text": "So glad minimalism took over the PC rice. But RGB is bringing rice back into the mainstream now."}, {"text": "Still rocking my CM Cosmos 1000 (2007)!!"}, {"text": "Case 10 years from now will be two pieces of plastic snap together, without any stylized design element. Components will be highly integrated, you can fit everything on a piece of motherboard, you will have one ram socket for 1T, you install the GPU the same way you install the CPU, all HDD by then are completely M2, all of them installed flush, they share the same heat sink and cooling pipe, you will have a perfect low profile sandwich that fit perfectly fit into a cheap enclosure in a similar way HDD fit into an external case. The device will work like a game console of today with utility apps."}, {"text": "That&#39;s a banging case for 2011. I had the HAF 922... unpainted silver internals, no gromets, no real space behind the tray..."}, {"text": "Omg wtf is this... Thing?! Is very... Horrible! Nzxt modern cases are the best"}, {"text": "Reason for 4 large drive bays:<br />[DVD-R/W] - Read/write [maybe bluray/HDDVD]<br />[DVD-R] - Read/copy<br />[Multi-Card Reader]<br />[Sound Controller or Fan Controller] - I/O from high-end sound card (Soundblaster etc.)"}, {"text": "in 2011 everyone still used cd drives. dark times when no one had proper airflow."}, {"text": "I’d love this case if the jet engine things on the front actually had fans in them"}, {"text": "My current case is an original cooler master cosmos and this looks pretty familiar to me with the eSATA, optical locks, etc."}, {"text": "In 2009 I had a Cooler Master HAF 922, still one of the best towers to date."}, {"text": "I started in a Raidmax Ninja II. Terrible cable management and look"}, {"text": "My favorite retro case was the Inwin Dragonslayer. Loved it!"}, {"text": "There were much better cases than this at that time. Cooler master 690 II for example had great air flow."}, {"text": "Why all tech youtubers have plants ON thier pc... why??????"}, {"text": "whats it called"}, {"text": "I&#39;m still using cases from 1999 and I cannot complain. Very roomy with no nonsense. I am happy and my controller machines running Win98 are too!"}, {"text": "Do one from 2001"}, {"text": "А тут ещё русские есть?<br />АУУУ! ОТЗАВИТЕСЬ!"}, {"text": "When 2011 is considered &quot;back in the day&quot;  <b>sigh</b> i&#39;m getting old"}, {"text": "ok now do a real mainstream case from 2011. antec 900. and i challenge you to only cable manage with the provided ties. im quiet certain there is only 2 provided along the hdd trays. and they are in fixed positions."}, {"text": "That actually looks sick though, kinda like a jet."}, {"text": "this shit looks like a cooler of the fx-8350 or the macbooks i9"}, {"text": "I dig that case"}, {"text": "sharknado case XD"}, {"text": "17 year old me would have loved this, although I’m way to be old to be 17 just 7 years ago. Really impressed for an older case, pretty dope."}, {"text": "I remember this case, back when I built my first PC I was like dang... I can&#39;t afford this case, let me get this cheap rip off alien case.  Remember that craze, just alien eyes everywhere."}, {"text": "I kinda miss having fans on the side window.  I don&#39;t use water cooling, so any extra fan is a good thing for me."}, {"text": "I just upgraded from a nzxt 410 to a Lian li alpha 330 the differences are amazing."}, {"text": "How come did it thermal throttle with this decent looking cooler and airflow that&#39;s actually not so bad? Maybe something was wrong with thermal conductivity?"}, {"text": "It&#39;s beautiful"}, {"text": "The white case i cant monte a Cooler CPU Corsair H150i RGB , ventilator 3x120mm on top ???"}, {"text": "For the love of god man, please clean the front of that meshify case"}, {"text": "make more video like this ! :)"}, {"text": "What is the background music at <a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=0m14s\">0:14</a>?"}, {"text": "People are so obsessed with these lights nowadays , get a christmass tree instead ."}, {"text": "My case from 2014 is not even half as good as this one"}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=7m30s\">7:30</a> Im sure you smacking the front panel off earlier had nothing to do with the led&#39;s not working anymore..."}, {"text": "Imagine having that pc build 7 years ago !"}, {"text": "star lord here"}, {"text": "All I care about from a case is a box with airflow. I watch this channel purely for entertainment"}, {"text": "You need 4 5 1/4 drive bays for 2 floppy drives, cd-rom and tape or high-density drive like an Iomega or card reader.    ."}, {"text": "Wtf why is there a plant"}, {"text": "In the world of pc, 7 years is &quot;back in the day&quot;"}, {"text": "Antec df85 was my first case and my god compared to something like the nzxt h630. It was trash."}, {"text": "lol mine looks older and is than this one XD"}, {"text": "<a href=\"https://www.youtube.com/watch?v=ItKE7H5WgDw&amp;t=11m21s\">11:21</a> &quot;Every single interior can accommodate for any type of hardware.&quot; Except internal 5.25&quot; drives... I know. I&#39;m weird. I like having my blu-ray drive that can read and burn CDs, DVDs, etc. permanently in my computer, not taking up a precious USB port. Netflix doesn&#39;t cover everything (I&#39;m looking at you Ghibli movies), and I&#39;m not spending money on multiple streaming services."}, {"text": "I remember wanting this exact case for my first PC back in 2011"}, {"text": "The Shark is a fan brand they sell at Fry&#39;s Electronics."}, {"text": "10 years later 300W will powerup High End GPU&#39;S!!! And cooling will be far more efficient for your cpu&#39;s"}, {"text": "Bro why is your meshify so dirty"}, {"text": "I can you give list of many cases from 2009-2011 which are better than RGB, Tamper Glass looking shit and also have better airflow. It seems you purposely picked the case from that era which I wouldn&#39;t even choose."}, {"text": "I have a Thermaltake Chaser MK-I and its even by todays Standards a good case. I have 8 fans in it so i can cool my overclocked i7 2600k and my two r9 290X. I mean, i can still play every game at the highest settings in full hd. :D Even if this Hardware is old now."}, {"text": "HAHAHAHAHA! DIRTY CONSOLE GAMING PEASANTS!"}, {"text": "This thing looks like it would have 16 megpipes and get all the highscores in MMOs."}, {"text": "My first case was from 2013 with cool blue led fans"}, {"text": "&quot;We no longer see these gamery designs&quot; - someone hasn&#39;t visited ibuypower recently...<br /><br />In other news, a 2011 Jeep Wrangler is the EXACT same Jeep as the one from just last year. This is not that long ago."}, {"text": "2011 pc case code name &quot;The dust builder<br />2018 pc case code name &quot;The expensive dust filter"}, {"text": "eww fractal case has so much dust in the filters dis gus TING"}, {"text": "you look like the guy from guardians of thee galaxy"}, {"text": "You need to put a amd fx in it no Ryzen"}, {"text": "this looks like a skrillex song"}, {"text": "can u buy be a rtx 2080 ti plz or a 1080 i need it or a msi gaming mother board for a pc i need it plz"}, {"text": "thinking about it... i have built my current pc in 2011..."}, {"text": "OMG I remember it! 2007 was my first pc build. It was a office used dell I bought off eBay for $90, it had a Intel Pentium. It was a small metal case, once I got a graphics card, the metal top wouldn&#39;t shut, it was a mess. Yeah I was poor. But I got it to run Half life 2 four years after it came out. I upgraded in 2010 trying to build a full PC same year comp usa closed...."}, {"text": "I was disappointed that the &quot;jet engines&quot; on the front weren&#39;t actually working fans. That would have been really cool."}, {"text": "That case is actually a very standard design inside. Multiple manufacturers used the same interior (with different colours). My friend has a case with the same interior."}, {"text": "Man I remember cases that guady being everywhere in the late 00s... <br />Personally I was not a fan, I knew back then that 10+ years later we would look back and think how tacky they looked. <br />I used a Lian Li (Lancool) K7B, which while completely outdated in terms of features, has a more &#39;time neutral&#39; (at least for now) exterior, and could probably be mistaken for a modern good quality, but budget barebones case.  - Id say its sleeker/sexier looking then OEM cases, and its subtle enough that you could build a machine for an professional environment. - Also it was really cool back in the day cause it was all metal, but it was really lightweight, making it great to carry into a lan party."}, {"text": "thinner the case the better the cooling<br />I remember when my temps were really bad on my full ATX tower but then I got a mid ATX and it was super thin and I thought it was a design flaw but my temps god better, and I could drill holes for new fans and upgrades"}, {"text": "I&#39;m diggin it. I like the excess that we no longer have. Everything is now a white/black slab sided box."}, {"text": "Where my Zalman Z11 plus boys at?"}, {"text": "Ehh i have a gaming case from 2005 it still works great."}, {"text": "I had this case...wow"}, {"text": "My first gaming case was the coolermaster storm sniper black. I have actually been very pleased with it through the years and never replaced it. It have some features that cases today usually dont. It is a very cool case, with big cutouts for ventilation and with two 200mm fans including. It has side and front dustfilters, but no filter at top or bottom. Although for my next build I plan to replace it, for something that is less noisy, I also want to make a clean, neat tempered glass case. Currently have trouble deciding between nzxt H440S, phanteks enthoo luxe and fractal design meshify C. <br /><br />I will keep my cm sniper case, I am too fond of it to throw it away. Prob will keep it for whenever I can afford a pure monster build that need a really unique case that will stay cool."}, {"text": "I think you did you benchmark all wrong, you&#39;re supposed to put the PC in its signature cyclone environment. That&#39;s where it gets the best air flow!"}, {"text": "I feel like you could still get something pretty much identical to this these days, minus the molex"}, {"text": "chris pratt?"}, {"text": "Holy shit that 2011 case was my computer case for like 6 years"}, {"text": "Am I the only one who thought that those &quot;turbine Things&quot; were speakers?"}, {"text": "Yes. side panel fans would be nice. They are a good way of getting air to the components faster,  and it is honestly not a bad thing to me."}, {"text": "omg you&#39;re just like chris pratt, good video btw"}, {"text": "Clasic!"}, {"text": "been building computers since 2000, and i can say i would have avoided this case in 2011."}, {"text": "5.25&quot; bays and floppy drives back in the day were used for front panel controllers for fans/LED&#39;s and expansion slots as well as optical drives- it was kind of neat, but I&#39;m glad we&#39;ve moved on to using software controllers.<br />Also missed opportunity to have those &quot;exhaust pipes&quot; have fans and actually help cool the case."}, {"text": "&quot;Ugh look at all that dust&quot;. Did you not notice the front of your fractal case? :/"}, {"text": "I still use my slightly modified case from 2006. My Thermaltake Armor. It works well so long as you cut a few minor holes for cable management."}, {"text": "Still running a HAF 912 Plus.<br /><br />Pretty ok with it, looking at current cases. I mean, it looks its age (2011), but it&#39;s heavy steel and cools well..."}, {"text": "my first case was pretty recent. the shitfenix neos"}, {"text": "my case still has a side fan(bought it December 2017) :/ its great since it directly cools my gpu but its true that it looks ugly lol<br /><br />*also, the fan brand is similar to my case right now.<br /><br />Uhm. uhhh. i can explain. The cases when i bought mine was mostly sold out for the size of my motherboard. i was too impatient since i have school projects and i need the case that time lol."}, {"text": "this would be fun to mod up"}, {"text": "&quot;that we thought back then were like the state of the art, highest end products&quot;<br /><br />What? That piece of shit case was ALWAYS cheap shit, disregarding the price."}, {"text": "mod dat shit MOD DAT SHIT MOD THAT SHIIITTTTTTT."}, {"text": "I still use an old case. CoolerMaster CM Scout 2"}, {"text": "That thing is so tacky"}, {"text": "Back in the day, my case was the Raidmax Smilodon. Black, blue and silver. My first build ever. It had an ASUS Striker Extreme LGA 775 motherboard, Q6600, 8GB DDR2 RAM and a Geforce 9800GTX (512MB). The CPU Cooler was a Zalman CNPS 9700 copper coloured."}, {"text": "I got an old Thermaltake Armor from 2006. In my opinion it is awesome by today`s standards"}, {"text": "In the ne t couple years well see implemented electric air conditioners Inside cases"}, {"text": "Side fans are useless. Front top bottom and back are ideal"}, {"text": "I would of put a 2011 system into it  xD"}, {"text": "Why didn&#39;t you pick a more high end case from 2011? Something for 150-200€."}, {"text": "I wonder if the 4 jet looking things at the bottom where intake fans if it would be any good or better"}, {"text": "my case has 2 spots for cd drives. it only has 1 dvd cd re-writable in it (for Music Cds and Ps1-2 Discs)"}, {"text": "They had 4 bays because if you recall back then having a fan controller in those bays were all the rage back then"}, {"text": "Are you swedish"}, {"text": "No side panel fan!!!!!!!"}, {"text": "you talk about 2011 like its 1995, lmao. disgusting."}, {"text": "I bought this case in 2013 and i&#39;m still have it, And i love it! But in a couple of months maybe Will be changing it"}, {"text": "sometimes if you used giant soundcards like the creative audigy 8B0010 and a 5.25 &quot; fan controller / temp monitor you would run outve 5.25 slots in a hurry"}, {"text": "#4 would be for fan controller lol"}, {"text": "You exaggerate a simple case that isn&#39;t even a decade old."}, {"text": "PLEASE CLEAN THE FRONT OF THAT MESHIFY"}, {"text": "My pc case is 6 years old... but the gpu stays at 70degrees C"}, {"text": "yo how cute is he though"}, {"text": "I do like Side Panel fans, <br />They would serve a great purpose for directed airflow toward the GPU or even towards the Motherboard in general.<br />Personally, I&#39;m not a huge fan of the RGB and Tempered Glass scene. <br />Then again, I am considered by many to be &quot;Old School&quot; when it comes to my approach on building things.<br /><br />The &quot;Shark&quot; is a long-running Case Fan model by Aerocool.<br />-The case for FOUR (4) 5 1/4&quot; Drive Bays <br />--- Fan Controller populating one Bay <br />--- LED Screen for readouts in another Bay"}, {"text": "Just remove the bay covers!"}, {"text": "i like this case. I actually use 3 drive bays 1 Enermax card reader/charge port/usb3 a dvd-rw in another and a NZXT Sentry 3 touch screen fan controller"}, {"text": "In Brazil if you are a normal person, you are stuck in 2011 computer cases."}, {"text": "The jet engines should’ve had built in speakers!"}, {"text": "Thenfront pf your meshify c made me uncomfortable"}, {"text": "That 2018 case looks a bit like my Antec case from 2010..."}, {"text": "Is this the discount Chris Pratt??"}, {"text": "The only disgusting thing about the Meshify C is that you guys haven&#39;t cleaned yours since it came out..."}, {"text": "Is like a riced pc case :v"}, {"text": "Lol I star Cruiser the cables for the switch melted lucky there was no damage to mobo"}, {"text": "Man i had a mini itx case from a office pc that my dad bought me when i still didnt know anything about pc&#39;s, and i remember getting into pc gaming and working in that piece of shit for a loong time, after that i had a 15$ no name case because my psu broke, and after buying the new psu i realised that to my suprise it wont fit in my tiny mini itx case. After that cheap one i can really apriciate my s340 that i have now. I wouldnt wish a 15$ case even on my worst enemy."}, {"text": "U should mod this for more airflow"}, {"text": "i had the same case but mine was the older version all black and i had to grind away a spot to get my gpu in it"}, {"text": "CD, DVD, Fan Controler, Card Reader. 4 Bays populated Also if I remember correctly there were Watercooling reservoirs that mounted in 5.25 bay area."}, {"text": "your voice is weird man, it has filipino accents."}, {"text": "The reason for 4 bays is multiple disk drives and add on fan controllers which are being phased out. Never seen this case here in the states and been building computers for years. Would love to get my hands on one if I can find one here available in the US. P.S. Love the channel"}, {"text": "Looks like you dusted that fractal meshify 7 years ago. :3"}, {"text": "5 1/4 drive bays were not just drive bays - multiple card input slots and some soundcards had additional &quot;drive bay&quot; units. also you could hot swap hard drives in a bay mounted connection"}, {"text": "Define R3 came out in 2010 (not to mention Antec P180 and successors way earlier) so this Aerocool thingie is pretty retarded for its time as well."}, {"text": "I was casually perusing tech videos when I instantly recognized the case in the thumbnail... Oddly enough, I actually just tossed this case in the dumpster yesterday... well, not EXACTLY this case... I bought this monstrosity from iBuyPower in 2010 in a pre-built (yeah, I don&#39;t do pre-builds anymore... I make them myself these days)... it was both the same and different from this case... the external &quot;jet intakes&quot; were 100% identical, but the internal construction was actually different... I had generic stamped silver metal inside, nothing fancy or blue... and the PSU slot was on the top of the case, not the bottom (as was the norm back in 2010)... nonetheless, the very distinctive outside intakes, side, front and top panel were 100% identical to the case in this review.<br /><br />While this review seemed to give a rather positive spin on this case, I regretted getting this case from day-1. Some things he either didn&#39;t mention or completely glossed over... IT WEIGHS A TON... this case is EXTREMELY HEAVY... way more than it needs to be... i&#39;ve never had a case this heavy before... the front &quot;door&quot; design... while it might look cool when closed, it&#39;s really kind-of annoying when you want to use anything the door covers... want to use the DVD drive? You gotta open the door... want to reset the computer, you gotta open the door... you also need to consider having the room to open the door too, so if you have your case tucked away somewhere, you have to make sure you have &quot;swing room&quot; for the door to open. Airflow in this case is terrible... he mentioned it, but its really bad... just bad. That alone would make me not want to use this case. One final thing I really hated about this case that he didn&#39;t talk about or even mention... those &quot;super cool jet engine&quot; thingies on the sides? Notice they&#39;re on both sides of the case... they include bulges on both side panels and the entire front bezel... this means, no matter which side you lay the case on, you&#39;re always sitting uncomfortably and unstable on bulges that make working on the case nearly impossible as it doesn&#39;t sit flat on any surface. If you want to install or remove anything from inside this case, you&#39;re going to have to remove every panel, including the front to get this case to lay flat... what a huge pain!<br /><br />This review was far too glowing on a really bad case design. I bought this in 2010 and it lasted me as my main computer till 2014, so I had 4 years of experience using this as my main case, and I hated it the entire time. It&#39;s been sitting in my closet for the past 4 years as my &quot;backup, in case something explodes&quot; emergency computer. Well, I just built a new computer this week, so I now have a &quot;new&quot; backup emergency computer... I very happily tossed this case in the dumpster yesterday (amazingly did not throw out my back with how much it weighs)... good riddens."}, {"text": "if they put like 60mm led fans in those 4 little fake fan holes, this would be case of the decade"}, {"text": "It would be so cool to see this case modded in a way where the &#39;jet engines&#39; in the front would actually provide airflow and some RGB goodness."}, {"text": "That case looks badass like jet sleek."}, {"text": "Why tf does it remind me of a transformer"}, {"text": "Dude... DUST YOUR PC! JESUSS"}, {"text": "all those 5&quot; slots... Well... one of the reasons why is there were different media drives and appliances for those more the optic readers...<br />one of &#39;em is a HDD cradle that allowed you to make your PC into a semi NAS with swappable drives or ZipDrives.<br />we actually used these Cradles to free up the workstations allowing you to log in on your &quot;own&quot; system at any workstation.<br />But on an another note... there were great computer chassis back then as well...<br />I remember rocking a Corsair Carbide 500 with a 200mm side fan in 2011"}, {"text": "We need side panel fans for vertical GPUs. I&#39;m sure manufacturers can bring side panel fans come back with modern style even on tempered glass."}, {"text": "And 7 years ago is not that crazy long time ago."}, {"text": "lol my current setup is in a case from 2011, a thermaltake armor a90 to be exact. I think think it holds up to modern cases fairly well,  at least in terms of appearance but it has zero cable management so I just have a rats nest in the bottom and the drive bays are non removable and have been pretty inconvenient for when I wanted to add drives. I have a new case on the way now, I had enough of the rats nest but this case will always hold a special place in my heart as the case that held my first gaming PC, and my second."}, {"text": "Review a case from 2000 or 1998"}, {"text": "It&#39;s basically a 99 Taurus with racing stripes: Completely inappropriate for the task at hand. We all know that gamers don&#39;t need airflow, because they never utilize the full potential of their hardware. Oh, wait."}, {"text": "The way that every case looks the same today is what is driving me more and more to the Mini ITX market, the aesthetic and the kinda more challenging builds are much more atractive than just buying a huge case and stuffing anything insinde, loses the personality."}, {"text": "You had removable hard rive cages in the early 90&#39;s😂😂😂"}, {"text": "I remember hideous looking cases that resembled Voltron."}, {"text": "Fans on the side panel are super nice and useful. I&#39;d much rather have added airflow in a critical area than see inside"}, {"text": "i got a NZXT case from 2006 or something xd"}, {"text": "We need four 5.25&quot; bays, 1 bay for the DVD/Blu-Ray drive, 2 bays for the Asus ROG Front Base Control Panel, and 1 bay for attaching a Card Reader cum 3.0 USB Port.<br />The rig would look fascinating, much better than RGB illuminated ones (with the front door detached). Try and see. Even today, people stare at this rig with awe. RGB is so common these days that most of the people doesn&#39;t care and have a &quot;Oh, it&#39;s so common&quot; look on their face."}, {"text": "Ugliest case I&#39;ve ever seen oh god"}, {"text": "I had this case called Ultra for a very long time just replaced it because it had no way of hiding the cables. It had a flip door in the front too."}, {"text": "Aerocool, oh boy that brings back memories.  My second or third build back when I was in high school was in an Aerocool ExtremEngine 3T, which had a 140MM fan on the front (and it wasn&#39;t choked off like this one) and a 250mm (yes, two hundred and fifty) side fan which took up almost the entire side panel.  I guess under the theory that more airflow can never be a bad thing??  It was utterly ridiculous, but at the time, my teenage self loved it."}, {"text": "First case I built on was a Raidmax Smilodon, still have it today. Getting ready to upgrade to a Nzxt 340 elite. Need room for my new water cooler!"}, {"text": "&quot;2011, so about 7 years ago&quot; you mean about two yea... <br />o shit. time flies."}, {"text": "4x  5,25&quot;  Drives for DVD Reader, DVD Burner, Card Reader and 1 extra if you need one more Card Reader to Copy stuff :D"}, {"text": "The StarCruiser Case brought to you by none other than Star Lord himself"}, {"text": "Hi! I have this case. Can i install NZXT X62 in it? i`m not ready to change my case ))) Thanks ))"}, {"text": "my sharkoon t28 has almost the the same layout....i need an upgrade i guess :P"}, {"text": "do another one with a case from early 2000s"}, {"text": "Your intros are shit.<br />Come on, you&#39;re a grown ass man. Fuckin act like it."}, {"text": ".. I love the look of this case xd"}, {"text": "Thought those were speakers in the case oof"}, {"text": "It&#39;s not a cyclone, it&#39;s a sharknado"}, {"text": "Why is he acting like 2011 was the stone age...? When did he start building?"}, {"text": "pc case&#39;s ricer"}, {"text": "I&#39;m really not trying to be rude, but your intro looks like it&#39;s from 2011"}, {"text": "It’s been 7 years since 2011? Time is a bitch"}, {"text": "It actually stands up well today"}, {"text": "and i sitting here with  a case from 2005"}, {"text": "No, gloss is ok"}, {"text": "better than my 90€ cooler masterbox 5t from 2017 :( i absolutely hate it. Someone want to change :D I will never buy coolermaster again..."}, {"text": "This case is so comparable to my case... I suddenly feel old lol"}, {"text": "Definitely like having side-panel fans.  There&#39;s just something about blowing air over the GPU that makes me feel better.  I don&#39;t need a huge pane of tempered glass that becomes a pain if something breaks it.  Airflow is important, it helps keep things cool in stupidly hot days."}, {"text": "Did they change the name of the channel?"}, {"text": "I&#39;d really love to see cases with this sort of aesthetic built to today&#39;s standards. Glass side panel, working LEDs, none of those riveted drive bays, and good airflow with support for four or more fans. The materials used also do look a little bit cheap which is something that could be improved upon. Being as outdated as it is I really wouldn&#39;t want to spend the money on it. That being said, it might be cool to try doing some custom mod with it. Maybe removing the 5.25&quot; drive bay and block off plates in favor of one or two fans would improve things, with of course some extra airflow in the front panel to make full use of them."}, {"text": "And here I still using some cheap 2010 PC case for my Ryzen. But tomorrow I will be getting my new Masterbox 5. Haha.."}, {"text": "I was intrigued upon first seeing the case in your video. The turbine ports in the front &quot;if&quot; functional as air inputs would be useful, however they are LED fluff gimmicky. Aesthetic features are .001 percent of purchase choice as function, ease of use is 99.9 percent   more relevant to such."}, {"text": "I had this case back in 2010"}, {"text": "clean your main bro that shits dirrrrtaaay"}, {"text": "Wait...FLOPPY DISKIN 2011"}, {"text": "This was 7 years ago, not last fakkin century"}, {"text": "Why are you so damn picky and the places you put the plant make me cringe."}, {"text": "+90 degrees Celsius? Did you forget to silicone the CPU to that giant heat-sync ?"}, {"text": "Try reviewing a Thermaltake Kandalf from 2007. Yeah, I still use that case. All of the cable-management-obsessed little boys can&#39;t stand a manly case like that."}, {"text": "dat random plant tho XD"}, {"text": "i dont see the backpanel"}, {"text": "do era correct you fuckin goof whats the point in using a case from 2011 and putting 2017 parts in it fuckin stupid fuck"}, {"text": "Still rocking my HAF X    i dont suck at  cable management   So the lack of a power supply shround is not enough to make me buy a new case.  with the exception of companies like Fractal .  cases seem to have dropped in build quality. specially Corsair cases"}, {"text": "I kinda like old pc cases from 2011ish era... don’t judge me."}, {"text": "That music needs to return :)"}, {"text": "The ricer version of pc cases"}, {"text": "Did you ever think of modding the case in such a way that you replaced the jet engine leds with smaller case fans?"}, {"text": "Dimitri I know you were high when you showed us that cool light effect on the wall, because I&#39;m high and I really enjoyed it"}, {"text": "4 are for 2x a DVD/CD   burner   popular back in a day to burn form one cd to another  1 for sd card reader and 1x for a fan  controller"}, {"text": "Sharknado case lmao"}, {"text": "Yes I do wanna see that acrylic glass is less expensive and less easily broken and does not have smeared oil prints"}, {"text": "I remember when I was playing PC games when I was 5 and being pumped getting a second disk drive so I could play two different games without swapping the disks around. Good times."}, {"text": "Look at it this way moding is fun"}, {"text": "My cousins have one of this case home. Terrible to have under your desk. The protrusions block part of the leg space, and the on/off button is easily pushed accidentally while trying to plug say a usb cable or a jack. Other than that, used to feel ok."}, {"text": "I like the plant. You should make a whole review about the plant!"}, {"text": "i think ill keep my transformers case"}, {"text": "Not gonna lie i want to buy this case and see how much modding you could do to it just to test how dope you could make it."}, {"text": "This case is beautiful"}, {"text": "Need name of dat case"}, {"text": "I nearly bought that exact case in 2011 :/"}, {"text": "Why is that potfern is everywhere? :D"}, {"text": "Honestly, might try to find this case. Looks like it be a fun mod project"}, {"text": "bruh my case is a 2006 case"}, {"text": "The lack of side fans on modern cases is a problem..."}, {"text": "man i used to have this case back in the day, i ended upgrading to the corsair 900D tho"}, {"text": "starlord"}, {"text": "You should cover some ancient OG af case builds."}, {"text": "had this case back in 2011, 18 yr old me thought it was the coolest thing. now using a more simplistic case look."}, {"text": "The perfect case would offer options to have side panel intake fans, good cable management, It would include special 3M cable straps for spots, 1 full tempered glass panel in the front with an option to have it a all metal side panel instead, Top option for up to a 360 radiator. I would also like to see screened in two 200 mm fans with magnetic levitation bearings all RBG for front intake. A Customizable/replaceable on and off button would be nice. Plus all drive bays removed and it has support for 4 SSDs since who needs HDD&#39;s anymore . A spot to mount a fan to blow directly up and the video card and motherboard would be nice also. Cable management options and superior cooling is what i would care about. No one care how cool your case looks if its overheating like a mofo."}, {"text": "I just dug my old CM HAF 912 out of storage and chucked some of my old/spare parts in to make my wife a decent gaming rig. It was hilarious to build in it after all these years. Wide open spaces but terribly located pass throughs, sharp edges where cables route, terrible spacing between routing areas. It&#39;s not a pretty machine, let me tell you. And that HAF &quot;high air flow&quot; basically translates to &quot;all dust flow.&quot; There&#39;s a &quot;filter&quot; in the front panel but you have to remove both side panels to pop the front panel off to clean it. Other than that, the only filter is a cheap piece of mesh with giant holes in it under the PSU. <br /><br />It is not a pretty machine. :)"}, {"text": "So that&#39;s how turboprop engines work! They use LEDs!"}, {"text": "this case is so awful"}, {"text": "a yet engine looking case from 2011 how horrible."}, {"text": "chris pratt talking about an old gaming case... interesting mmmm"}, {"text": "those &quot;extra DVD drive&quot; spaces was for things like HDD Racks or if i dont mistake even fan controllers"}, {"text": "The four 5.25&quot; bays were quite useful and actually still are.<br />I used to have two DVD drives for making copies, a small pair of speakers for LAN parties and a drawer for storing USB drives etc.<br />Now I use them for a 3.5&quot; quick swap bay, a 3-in-1 2x2.5&quot; quick swaps and laptop DVD drive, the drawer and I&#39;m gonna pop a 4x2.5&quot; rack in the final slot.<br />Oh and I&#39;m still using my Aerocool Aeroengine II with a custom paintjob from around &#39;05 - check out that bad boy if you want a turbine front xD<br /><br />Only real downside is that I had to take a hacksaw to the internal HDD rack to make room for the Inno3D GTX 970 Herculez X4 GPU - that thing is gigantic -.-&#39;&#39;"}, {"text": "You look like Avicii"}, {"text": "How about the Fractal Design Define? They were around in 2011 and didn&#39;t look gimicky and shit unlike this."}, {"text": "You could totally be a body double for Chris Pratt"}, {"text": "2 DVD-Drives, because you want to read from one DVD while burning on the other. <br />1 Slot for your tape-drive for backup purpose. <br />1 Hotswap HDD-Drive, because USB Sticks did not cut it back in the days.  ;-)<br /><br />And all for slots are used. :)<br /><br />Heck, I think I actually still have my 5 1/2 Hotswap Drive Enclosure ^_^"}, {"text": "Can put three CD players in my PC and burn three CDs at a time"}, {"text": "Designers of the cases think, how do they have to wash? &gt;_&lt;"}, {"text": "I&#39;d like a 5.25&quot; fan controller. Some look great."}, {"text": "I built a couple machines with my mom in ‘94. It was just a box - no separate place under the motherboard tray to route cables. Her stuff has high end, because she worked in computers, and got her masters in machine learning (crazy right) but it was a nightmare to build in those cases. The cables just literally crisscrossed everywhere, and they were all too short so they just hung in the middle of the case - cooling was awe full and the DUST was incredibly bad. <br />All computer cases from all manufacturers were still federation beige. Hella boring. <br />I remember one of the first consumer optical drives had a containing case, where you took the CD-ROM containing sleeve/case out of the drive, folded the disk into the case, then loaded the case into the optical drive. Thing was massive and sounded like a goddamn jet. <br /><br />Cool vid. Were there earlier cases compatible with current ATX? I’d love to see some wacky shit."}, {"text": "bc 2 can be used for a water res and another bay for the fan controller"}, {"text": "Sooooooooooooooooooo ugly case"}, {"text": "I can&#39;t wait for the AI to take over, and future generations will all be saying &quot;I remember when I used to use my computer for porn. Now it uses ME for porn.&quot;"}, {"text": "I&#39;m still happy with my old ATOP XBLADE."}, {"text": "In the future we will be laughing at RGB."}, {"text": "how are bladeless fans not a thing yet in cases."}, {"text": "lol i would actually like more gloss cases, i had to work soooo hard with plastidip to attempt to make my matte case appear more glossed, was wanting a white case and it had to be gloss for what i wanted"}, {"text": "this was a pos case in 2011 and its an even bigger pos now this case is even a pos for 2009"}, {"text": "I actually have this case at the moment. Bought it back in 2011. Moving into my new build in NZXT S340 Elite Purple Edition this weekend :D"}, {"text": "Like a hotwheels case"}, {"text": "@HardwareCanucks Floppy disks x2 so you have 4 bays"}, {"text": "Case Design has stagnated.  Bling bling is does not make your computer go fast. Good air flow design does."}, {"text": "This was a cheaply built crap case for 2011. I&#39;ve used a Chieftec Dragon case back in 2002 that is way better than this mess. Yup, review a Chieftec Dragon!"}, {"text": "F_ck this looks awesome, blue and black and no stupid glass"}, {"text": "I bought the Antec 900 2 back in 2011. It was actually considered a good case I believe. This one looks like your typical mid-range case."}, {"text": "4 drive slots? Hell man, you asking why?<br />One for CD, one for DVD, one might be for Blue-Ray, one for floppy discs :)<br />(ugh ugh not like I have floppy disc slot at all xd)"}, {"text": "you have 4 bays, for the following:<br /><br />DVD drive (possibly dual for copying optical media)<br />Floppy drive, just because<br />Fan controllers...because airflow!<br />media interfaces"}, {"text": "i was useing the Cooler Master - Elite 430 ATX Mid Tower Case for 5 years and i had a fan on the side and it was good haveing one on the  side but now if you did that the fan will be in the way of most cpu coolers"}, {"text": "I&#39;m still using an XClio A380 from 2007. 2x250mm fans, looks kind of similar to this, but bigger. Much bigger. It kind of looks like a transformers sex toy. But there&#39;s no other case as quiet or with as much airflow, and plenty of room to fit my watercooling. Newer isn&#39;t always better."}, {"text": "Hell yeah I want my side fans back. Tempered glass is useless without side fan mounts."}, {"text": "In 2011 you would be lucky to have the PSU o the bottom of the case. like i had a metal case with a power supply shroud on the top XD"}, {"text": "I have 25yr case with a 1080ti in it"}, {"text": "I have the NZXT H700i... and i really didn&#39;t think through the fact both tops and front are solid metal, because i have the corsair LL fans which can hardly be seen with the case on ground level. Regardless super nice case and great cable management options, it has a nice modern look with the other parts in the pc"}, {"text": "I had that case."}, {"text": "93C? Dauym :D<br />Great Video Dimitry!"}, {"text": "Tahts why we have the lateral panel fan in the old days, is a &quot;direct&quot; air intake for the CPU"}, {"text": "Wtf are those tumors on the side?"}, {"text": "Gloss hate is for filthy people."}, {"text": "my case is from 2004 and still works like a charm ... water cooling is overrated"}, {"text": "you are starlord?"}, {"text": "The reason for for drive bays is for audio/dack control. Clock/temp an display cdrom/DVD rom burnerand a usb/sdcard panel or maybe a external hdd swap bay maybe lighting control"}, {"text": "He kinda looks like Cris Pratt"}, {"text": "Looks more like a 2005-2008 case. In 2011 we had cases that look similar to today. Just no tempered glass or psu basement."}, {"text": "i have a pc that use&#39;s the same case it was my 8-7 years old gaming pc but then i got a new gaming pc not to long ago"}, {"text": "4 drive bays... 1 cd rom 1 cd burner, 1 dvd rom 1 dvd burner... what&#39;s so hard to understand? :)"}, {"text": "Wow I have this case xD"}, {"text": "Anyone here remember the silver cases with blue led fans from the mid 2000&#39;s?"}, {"text": "So those turbine looking things are just decoration? What a POS."}, {"text": "This is what a car guy would call &quot;rice&quot;"}, {"text": "Its easy to explain the 4 5.25 bays..  1. DVD drive, 2. Card Reader 3. Fan Controller and the 4th you replace with a tray for USB sticks and what ever else you might need..   <br />I want them to bring this sort of gamer style back... Can you imagine an RGB Jet turbine fan looking PC !!  That would be EPIC!!!"}, {"text": "Vary rarely do I like like over designed cases but fuck me even next to other horrid cases this is hideous."}, {"text": "i still have my red cyclone in my colection and i love it"}, {"text": "First build I used a phantek enthoo pro in titanium green still love it"}, {"text": "I have this case sitting right beside me! still works just fine"}, {"text": "I&#39;ve bought this case 2 years ago....... :D"}, {"text": "My first case experience was when I was trying to upgrade from a P233 clone to a K6-2 500 and found that AT and ATX were quite incompatible. I just bought whatever was cheap at the local computer shop and proceeded to cut the living crap out of my hands as I figured out how to build a PC completely blind"}, {"text": "this case would be amazing if the front jet things were functional."}, {"text": "I had this case 4 years ago. Removed the front LED&#39;s and replaced them with filters, mounted 3 fans to the front, 2 on top and 1 on the bottom. It was pretty sweet at the time :)"}, {"text": "I hate gloss finish. They get dusty and then scratched. And it makes it ugly. Stop manufacturers. Stop"}, {"text": "Dude you look like Christ Pratt, <br /><br /><br /><br /><br />that&#39;s fucking amazing!"}, {"text": "Did anyone notice that he looks like Chris Pratt?"}, {"text": "This video is ridiculous. You chose a case that would have looked ridiculous in 2011. It wasn&#39;t showing the real difference between cases because you chose something intentionally hokey. Cooler Master HAF 912 and 922 were both out before 2011. If you include 2011 releases, Carbide 500R was released that year. <br /><br />This video is just choosing a shitty case that happens to be old. I could pick out a semi cheap, ridiculous looking case from this year and find the same issues."}, {"text": "{insert comment about RGB everything}<br /><br /><br />I even got an ad about an RGB toilet bowl"}, {"text": "Tacky in look but functional."}, {"text": "That&#39;s funny... That is the case that i bought 6 years ago and still use"}, {"text": "Gimme the side panel fans, I&#39;ve got 2 980ti&#39;s pushing a 2160 monitor, all that heat, getup on outta here"}, {"text": "My mother had a gaming pc with this case<br />...disgusting"}, {"text": "sharknado?"}, {"text": "I actually really like that casw"}, {"text": "Didn&#39;t know a case could look cringey lol"}, {"text": "I still run a 2011 NZXT H2. Still pretty awesome and more practical than pretty much everything else on the market right now. Except for the watercooling possibilites, which are limited to a single 120mm radiator. Enough for my i7 though.<br />It has a nice swap-in hard drive bay, which I would really miss in newer cases, haven&#39;t seen that one in a while."}, {"text": "1 DVD combo +1 bay reservoir  (watercooling) + rheobus = 3 bays :)"}, {"text": "Cable management? You didn&#39;t do any...."}, {"text": "Its so cool"}, {"text": "I miss the old review style"}, {"text": "What monitor is he using in the beginning of the video?"}, {"text": "The cases I built in back in the day must have been made from rejected razor blades. Nobody built a computer in the mid 90&#39;s and didn&#39;t spill blood to the case gods."}, {"text": "First experience: 20€ Midi Tower in 2011: Cuts on my hands, cuts on the wires, cuts everywhere!"}, {"text": "Dipshit, you might not like gloss, don&#39;t buy it. Some of the rest of us do like it shut up move on"}, {"text": "Hilarious! :D &lt;3 the shark on the fan! lol"}, {"text": "You gay lol"}, {"text": "7 ago i bought my case from mastercooler, they still sell it"}, {"text": "Yah but does it have vtec"}, {"text": "i seriously hate how we went from design that look super cool and physicly distinguishable from each other to just front of the case been flat and the rest been visible from the inside, like give us more variety !"}, {"text": "The biggest problem with modern case is  hdd disappears.that&#39;s suck."}, {"text": "I had a 5&quot; card reader before so"}, {"text": "Why hasn&#39;t anyone made a SHARKNADO reference? come on"}, {"text": "Today, the the kids dont know how to build or setup anything by themselves..so all they do is buying overpriced &quot;gaming&quot;-pc, chairs, mouse, keyboards which will end at about 2000 bucks for a set &quot;ready for gaming&quot; which you can do for 600€"}, {"text": "I&#39;m sure every comment is just mentioning how cool this case really is and how shitty thew new cases are. <br />It is God&#39;s work to find a cool case in 2018, i will scour your channel for those cases since this is the fire video i saw from you."}, {"text": "I thought this case was fucking ugly, even back then."}, {"text": "2011 was 7 years ago? fuck"}, {"text": "First thing you fuss about is gloss... Yeah I&#39;m not finishing this vid, pansy"}, {"text": "I use all 4 of mine on my case, BD-RW, Card Reader, FAn controller, and a pullout drawer"}, {"text": "My first build case...but I put mine together back in 09&#39;..."}, {"text": "Dude I had an aluminium case from ANTEC in 2001 or 2002 and it had removable hdd holders xS"}, {"text": "Im so glad the era of those style of cases is over because fuck me their ugly as sin."}, {"text": "This case would fit a 2009-2011 blue-PCB Gigabyte mobo just great. :)"}, {"text": "Aerocool was a budget-oriented company. Frankly, I think this is case is quite okay even for a budget build today. I like it. Apart from the thickness of the metal."}, {"text": "Sometimes you&#39;re looking for a case with style."}, {"text": "Haha I use a case from 2007... I don&#39;t  know if that&#39;s a good thing though"}, {"text": "for the life of me I HATE those &quot;jet engine&quot; lights... not ventilation, LIGHTS... uuugh"}, {"text": "Very ugly look like a bus."}, {"text": "&quot;That&#39;s my freaking father&quot;"}, {"text": "Hi Quill,have u found a planet to start a YouTube channel."}, {"text": "30 euros? this is Canada!"}, {"text": "I still have my NZXT Guardian 921, in the deepest corner of my room, behind a desk, still sporting a decent AMD fx based system. My wife hates it and she wants to trhow it everytime I turn it on at night, but c´mon it´s the Guardian, it takes care of the night creatures around us when we sleep..."}, {"text": "good stuff i like the case, very clear &amp; very good video."}, {"text": "&quot; <b>I&#39;M A GTX1080</b> &quot;"}, {"text": "I have a case with a side fan, and I use it to give extra air to both the CPU and GPU. This is also the reason why I keep the GPU open-air and without it&#39;s original shell."}, {"text": "That case is Sharknado."}, {"text": "I&#39;m still using my trusty old LianLi PC201-B from 2007 :D<br />seven 5.25&quot; drive bays but no ssd mounts, 2 optical drives installed which I never use<br />2mm thick aluminium side panels<br />proper threaded brass inserts for all the screws<br />no cable management<br />hdd bays are stripped out to make room for the custom watercooling loop<br /><br />the case and the watercooling loop survived hardware upgrade after hardware upgrade and I have no plans to ever switch it fopr something new"}, {"text": "good review. this is an old enemax case. top stuff in its day. case out with lots of diff. front covers. this jet design was just for show, but the rest of the case was well thought out and was good suited for the amaount of cables at that time. if u built HW from 2011 in there, u will see there is enough room."}, {"text": "I will say this was not a popular case 8 years ago. The Corsair Graphite T600, NZXT Phantom, Cooler Master CM Storm, and quite a few more actually had and still have good functionality."}, {"text": "your cable management tho is just awful..."}, {"text": "i bought this case, ... worst decision i ever made"}, {"text": "extra drive bays, to hide ...... as CaseyNeistat would say  &quot;Drugs&quot;"}, {"text": "the light artifact is very attractive i believe that could sell cases with a switch for it"}, {"text": "That&#39;s not a case that&#39;s a bloody Rolls Royce jet engine"}, {"text": "Re review the Silverstone Raven RV02"}, {"text": "Bays for extra 5.25 bays like USB and card readers."}, {"text": "The old optical drive bays were pretty common for fan controllers and extra I/O like card readers etc. Those kind of things are pretty hard to find now, they&#39;re just external things these days."}, {"text": "That Meshify has like 3 years of dust on it, but hasn&#39;t even been available for a year yet...."}, {"text": "Im still using the NZXT H2 case thinking about upgrading though :P"}, {"text": "Nice blast from the past. Painted orange and tricked out like a muscle car - pretty sweet. Sad on the airflow."}, {"text": "I&#39;ve had removable drive cages in most bloody 486 machines, how is that special in 2011?"}, {"text": "the usb ports are on the top."}, {"text": "Better then mine."}, {"text": "Bashing those poor sidepanel fans, my HAF X is sad now :D"}, {"text": "Can i please have that pc"}, {"text": "4 drive bays = LCD fan control, memory card reader, 2 DVD RW drives."}, {"text": "I rebuilt my computer in my old Haf 922 case to save money.  Only flaw in it was putting the power button on top (I have a cat).<br /><br />We&#39;ll have more themed cases again.  When we run out of ideas, we go back to old ones.  Look at how wanting more classic car designs reverted car designs back away from boxes not too long ago."}, {"text": "somewhat ironic that a floppy disk and usb 3 in the same case"}, {"text": "I&#39;m still rocking this case."}, {"text": "you can add fan control speed controlled other 2 dvd slot or usb port system"}, {"text": "Idk why but u kind of look like Chris pratt"}, {"text": "Look like I am stuck in time with my Antec P280. Sadly, all Antec fans are death now."}, {"text": "BLYAT from the past"}, {"text": "This is the old &quot;AeroCool- Scharknado-Case&quot; xD"}, {"text": "It looks like the quadjumper from the force awakens"}, {"text": "ANTEC 900 FOR LIFE"}, {"text": "Using side panel fan with few mm distance from the panel. The side panel fan mount cover still in place. Fan from the bottom and the lower fan of the front gives almost no airflow to the VGA but now i have a bit more air down there... :D"}, {"text": "Why do u remind me of Chris Pratt???"}, {"text": "Thank you Star Lord for this review.<br />Also it looks like every ricer&#39;s dream."}, {"text": "I have the red version of this case. So far it has done pretty well. However the amount of times my friends have gone &quot;whats that button do?&quot; and pressed the power button is mind boggling."}, {"text": "Why 4? Bc around the time that case was new there were a TON of add-ons for those bays. I remember having on my tower back then a DVD+/- light scribe, a CD-RW (it was still common back then to listen to music via CDs, so you&#39;d load a game in the DVD-rom, kill the audio on it &amp; listen to a CD instead), a card reader, and a car-lighter/ ashtray in the top (just bc I thought it was the weirdest thing I&#39;d ever seen for a PC at the time). I know I saw USB 3.0, loading slots for external hard drives, advanced sound card externals, temp readers, AM/FM radio controls, a few other options. <br />It was toward the end of the era of those parts, but ppl were still hyped about them in 2011. Seeing 4 in a case is a nice blast from the past."}, {"text": "That&#39;s a shitty case but we had some great cases like the Fractal Define R3 and Arc midi already back then. An you would definitely have wanted extra clearance for your Radeon HD6990 at 30,5 cm long ;)"}, {"text": "Syka Blyat, like this comment if you know what it means."}, {"text": "SHARKNADO"}, {"text": "Holy crap that cost the same price as my pc... 😐"}, {"text": "Fuck dust filters, get airflow."}, {"text": "2018 and major influential companies like Apple still offer black gloss. Calm the fuck down, who the fuck are you?"}, {"text": "2011 isnt that old in terms of physical engineering."}, {"text": "Ugly ass case"}, {"text": "Wait what is that 2018 case?"}, {"text": "Want something specialized? ThermalTake Core P5"}, {"text": "this entire time i was screaming in my head &quot;MAKE THE JET ENGINES ON THE FRONT SPEAKERS&quot; and i&#39;m disappointed at how the makers missed such an opportunity"}, {"text": "I actually have this case"}, {"text": "The bays would have been for potentially a fan controller or one of the earlier aio liquid coolers were the rad and pump mounted in one of the 5.25 bays.  Thermaltakes “big water” comes to mind"}, {"text": "Just use a nice black Antec. Some of those things GS has space for 4-6 120mm fans."}, {"text": "They&#39;re called Louvers..."}, {"text": "I own a Rosewill Armor Evo. With 4 120mm fans on the side panel...which immediately lowered my temps by a few degrees on like everything...so, yes, bring them back.<br /><br />The thing&#39;s a tank."}, {"text": "I still use one of the 5.25in bay on my dark base pro for my 4k blu ray player since I like to double my gaming machine up with true 4k media. Streaming compressed material is no fun. It&#39;s getting harder and harder to find an optical drive bay unfortunately."}, {"text": "2011 was 7 years ago??? What is wrong with the universe."}, {"text": "That intro made me cringe so hard.."}, {"text": "This case looks like it was designed by a 13 year old in his parents basement and the instructions he got on design from the company was just the case should have &quot;attitude&quot;."}, {"text": "Why four Disk Drive Bays? Fan controller, Led controller, System Stat Displays.... Big thing back then most optimised for a Disk Drive"}, {"text": "When your case is in the vid lol"}, {"text": "1 DVD drive and a 2 story fan controller or light controller"}, {"text": "2011 is to current, go for 2006-2008 cases :D"}, {"text": "Hey, this is the PC case from FlashGitz&#39; Console Wars."}, {"text": "2027: how terrible were PCs from 2018"}, {"text": "The corsair air 540 case has amazing cable management because everything can just be thrown into the back and be forgotten about"}, {"text": "Please drop that monstrosity off a building. And upload a video of it :P"}, {"text": "the hard drive Cage was removable in 2006or so so yeah"}, {"text": "Reminds me of my Raidmax Ninja II"}, {"text": "1 minuet in and I’m thinking Jesus Christ do you even know what your doing"}, {"text": "your computer is so dusty, wth"}, {"text": "Chris pratt?"}, {"text": "It looks pretty cool cooling fan compartments though.<br /><br /><br /><b>SIKE</b> your computer gonna overheat man those fakes"}, {"text": "This is a terrible comparison. You picked a shitty gimmick case with a bunch of non-functional crap and LEDs on it, and compared it with a standard glass-sided enthusiast box."}, {"text": "They be playing half life 2 on this boi"}, {"text": "This case is better than the Carbide 200R I got in 2013"}, {"text": "Funny, I never liked those Goldorak style casing... The only thing that&#39;s cool is the eSATA port (no it&#39;s not hilarious, it&#39;s a very useful port giving a transfer rate which is a bit faster than USB 3 - thus even for disks that are SATA 3 standard, I still use mine over USB especially since they never turn off along some USB port configuration on the chip for power efficiency)."}, {"text": "Pretty sure one of first cases I bought was called the Black Demon...ya I&#39;m not even kidding."}, {"text": "The case from 2011 and the one from 2018 both look good."}, {"text": "that looks EXACTLY like the case from the console wars"}, {"text": "Tbh I thought that case was awful even back then. I was using a molded antec 1200 in 2011."}, {"text": "Hey Chris"}, {"text": "I deduct 10 points since the &quot;jet engines&quot; are not intake fans"}, {"text": "Am I the only one who put a 5.25 inch DVD R/W drive into their new gaming PC build?"}, {"text": "for a minute I thought that intro was new. ;_;"}, {"text": "This case reminds me of my antec p180b. And that case was ahead of its time."}, {"text": "Not bad, Fans on the side need to come back.... we... need ... air........"}, {"text": "I am still using my computer from 2011 and can still game with it. And the case is a HAFX a case they are still selling today."}, {"text": "I actually own and still use this case!"}, {"text": "Maybe this should be the sharknado case ."}, {"text": "lol its so ugly"}, {"text": "i&#39;ve once seen a removable hdd case from a case made in 2000"}, {"text": "I have all 4 optical bays full, DVD drive,Blu Ray drive, fan controller, usb/card reader"}, {"text": "Its not this case what is terrible, its the fact that today most of the cases (dimensions, inside component places, empty spaces) are exactly the same + some window. SAD.<br />Fun video, like! :)"}, {"text": "Anyone ever tell you that you look like peter from Guardians of the Galaxy LOOL"}, {"text": "So this is what Chris Pratt is doing these days"}, {"text": "Love the PC wars animation thing"}, {"text": "I built my first gaming computer in this case! It was awesome."}, {"text": "I have this exact case with a old Intel Quad Core Q8300 in it, with a HD 6970 2gb GPU. This pc is now purely just a media box, but due to how the older AMD GPU&#39;s got rather warm, I ended up putting a fan on the side, which definitely helped the airflow, unfortunately I had to mount the 140mm fan on the outside of the case, up against the perspex. THE GOOD OLD DAYS LOL"}, {"text": "Side pannel fsns are great for keeping GPU cool."}, {"text": "I still have 2 of those Aerocool shark fans on my CM Storm Stryker right now and holy FUCK. All you ever need is just two of them ever, one in the front and then one in the rear and that&#39;s it. Any more and you desktop would be hella loud. For about 95 CFM and with all those fan blades, they&#39;re bound to get loud quick."}, {"text": "I&#39;m glad to inform you that Aerocool still includes the standoff screwdriver today even on a 35€ case...My expectations were literally blown for the price and appart from a window panel screw that was kinda off center and tricky to line up and the super flimsy metal panels which were consistent with the price point, the Aerocool Aero 300 FAW I got for a friends build was the best bang for the buck case I have ever seen.<br />PS: Flimsy cheap cases have a surpising advantage at carrying them, while my workstation in it&#39;s Carbide 400R with it&#39;s 850W PSU(the eaviest component of the build but still the case weighs 10 times more than the aerocool one) really takes a growl to carry around!"}, {"text": "That side panel would&#39;ve been a good for hiding your weed!"}, {"text": "That guy looks like Star lord from Guardians of the galaxy"}, {"text": "First case was a Rosewill Challenger.  I had a lot of molex powered fans and cable management was a NIGHTMARE.  Airflow was awful.  I had to take a hacksaw to the middle drive bay to make room for a 1060.  I mounted a fan in the top drive bays lol.  I have recently bought an Air 540 from Corsair and I love it.  Yes, it&#39;s absolutely massive and it isn&#39;t as aesthetically pleasing as some of the newer cases, but it does great at what it does.  There is next to no cables to block airflow in the main chamber and I&#39;m able to have all the fans I could ever want.  Not a fan of the openings in the bottom though above the HDD hot swap bays."}, {"text": "&quot;Fans on the sidepanel definetly a trend that has been dead for a while&quot; <b>looks down at my case I bought a year ago with a fan on the sidepanel</b> Hmmmmm"}, {"text": "Hey, i have this case!"}, {"text": "&quot;floppy disk area&quot; looooool"}, {"text": "I used to have this case"}, {"text": "Even the ChieftecDragon from 2006 has removable hard drive cages.<br />About the 5.25&quot; bays: How about a DVD drive to read disks, a CD burner, a card reader and a fan controller.<br /><br />But that is one damn ugly case. Hard to find one that is decent today, but if those spaceships would try to be bought...."}, {"text": "I&#39;ve been watching your videos lately and I love them but there&#39;s one thing that I can&#39;t get off my mind... why do you look like the guy from Jurassic world"}, {"text": "Chris Pratt, is that you?"}, {"text": "Oh Christ it&#39;s so tacky"}, {"text": "&quot;light palm hit and front panel fly&#39;s off &quot; and this is for air flow lmfao"}, {"text": "Honestly this case, even by 2011 specs, looks strait out of 2006 LOL! The first time I seen it was &quot;wait a minute, did I already see this over 10 years ago in a magazine?&quot; Honestly, I don&#39;t mind cases that look like this, too many &quot;modern&quot; or &quot;sleek&quot; cases out there. I want a computer that stands out from the rest instead of looking like a piece of furniture or something that belongs in an A/V rack."}, {"text": "You call that bare bones my is just a metal box"}, {"text": "Even my fucking CM Mastercase had a molex plug for the front panel lighting... Weirdest fucking thing ever, even the onboard fan controller used a SATA power connector"}, {"text": "In 2011 I had the Antec P183"}, {"text": "What.. you never heard of a Starcruiser Syclone Shark?  Get with the program Dmitry."}, {"text": "Not sure why you compared a $129 case to something that probably cost $35 when it was new.  I&#39;m pretty sure 80% of cases at that price point had cable management in 2011."}, {"text": "you should do this video with a even older case"}, {"text": "say that&#39;s hilarious more........"}, {"text": "this is nicer than my haf 922, except its alot uglier"}, {"text": "just realised how shit my pc case is now theres absolutely nothing good about my pc like the cpu doesn&#39;t even work properly can I just have that pc please mines a complete shit show"}, {"text": "Why is the reset button something that has to be very open? I dont think it would be good to reset your pc accidentally..."}, {"text": "I feel like someone could mod this to make those intakes on the front actually work..."}, {"text": "Check out the Raidmax SMILODON PC Gaming case with side fans galore"}, {"text": "That stupid pot plant.... why?"}, {"text": "despite the &quot;jet engines&quot; looks pretty cool."}, {"text": "Id still build in it honestly, my standards arent high since i built my first rig inside a compaq presario case."}, {"text": "Old case experiences summed up in two words: Sharp edges."}, {"text": "yeeah, I got my define R4 in 2012, it&#39;s still holding up just fine."}, {"text": "Those fans(your sponsor) are epic"}, {"text": "I nearby bought this one for my first build until I won a aerocool gts in some giveaway... which nowadays is also outdated I guess..."}, {"text": "When all your cases are older than 2011..."}, {"text": "pfff lol... my case is from 2010...it has no glass no transparent nothing.... it has side panel fans, front panel, the back and the bottom and one on top... its just black...it works just fine... I have an i7 3rd gen with 16GB ram and a gtx 1060ti.... it even has 2 DVD readers... and I have installed my Wifi antenna, and extension for my SSD 500GB and 2 HDD 1tb each... at the end I like the retro look on my computer...the way it looks doesn&#39;t diminish performance."}, {"text": "All my gaming computers have come in the most basic $35 rectangular cases.<br />They look like computers that should be found in your grandparents house but have always been maxed settings.<br />My current comp runs my HTC Vive, TV, and Computer simultaneously, and its in a $30 cooler master case.<br /><br />I never seen the point of fancy cases with stupid LED lights and 5 case fans.<br />I also have never seen the point of stuff like expensive water cooled systems either. Just buy a 850watt PSU and a $30 hyper cooler heatsync/fan and your good to go for overclocking.<br /><br />Havent had a CD-ROM drive in my comp in 6 years. Dead technology."}, {"text": "Gaming carpets when?"}, {"text": "someday you should review my old 2001 beige box :p"}, {"text": "I did the side panel fan in 2018 in a case mod on an older dell dimension 9200 xps410  i pimped up to the max but yeah nowadays that kind of style is long gone regarding newer cases."}, {"text": "my case is from 2011... it&#39;s a cm storm scout."}, {"text": "Fucking honda civic fans building a case..."}, {"text": "best dust filters on earth!   Use the bounce sheets from the dryer!"}, {"text": "I so much hate doors in the front!"}, {"text": "It honestly doesnt look like 2011 very much, we had lian li and fractal design making cases that resemble what we have today, this thing looks more like 2006 with all the useless plastic and it basically being a piece of decorative gloss on top of a completely normal boxy case"}, {"text": "watching this on my BRIGHT RED SYCLONE case, have kept this build since 2011, with a minor upgrade in between! weird seeing it getting reviewed on this channel"}, {"text": "im still using a 9-10 years old case..."}, {"text": "&quot;Every case looks the same&quot;. That&#39;s exactly why I went for the Aerocool P7-C1 for my build a few months ago"}, {"text": "yeah i had one. didnt last long. was a piece of shit really lol"}, {"text": "The misaing hole for the 8 pin Cpu connector ended up meaning I had to pass  the cable on top of the Cpu fan. Yay"}, {"text": "the case is pretty damn cool in my opinion"}, {"text": "that case looks fucking hilarious"}, {"text": "I had this case, i think i have it in the closet somewhere"}, {"text": "I had a Lian Li PC-60 in the year 2000 with a removable HDD cage..."}, {"text": "I don&#39;t remember anyone claiming this case was the state of the art case back in 2010. lol. Maybe something by Cooler Master, Lian Li or  Fractal Design. lol"}, {"text": "Could you please test the gaming headsets from Audio Technica?"}, {"text": "i used 3 of the drive in front back in the days and one time i had 4 in use. i had CD. DVD. then CD burner and a DVD burner. but later on i got a CD/CD burner. and even later it got cd/dvd and a 2 burners."}, {"text": "I have a similar case, its not optimal but its what I got. The front broak of the, it has only 2 fans that are quit bad but apart from that its a case it works.lack of dust filters is a issue though"}, {"text": "D OMEGALUL C top"}, {"text": "still looks cooler than my Deepcool tesseract"}, {"text": "Lol i use a Case from 2008 xD"}, {"text": "&quot;They&#39;re not there for airflow&quot; - Interest gone to 0"}, {"text": "If you don&#39;t know what you need four optical drives for then you probably shouldn&#39;t be making videos on pc components. Retire."}, {"text": "he looks like Chris Pratt"}, {"text": "I have 4 DVD drives in my Dell xps 710 😁"}, {"text": "im using a case from 08"}, {"text": "Zalman Z11 was a very similar case to that, its just so funny how they designed everything to be aesthetics focused and absolutely terrible for airflow. The good ol&#39; days amiright?"}, {"text": "My entire system (minus the case, I upgraded the case a few years ago to the NZXT H440) is older than this case.<br />My original case was the Antec 900 that had ZERO cable management or dust filters. These 2 reasons is why I upgraded"}, {"text": "replace the front and the side panels - could be a good case for this era."}, {"text": "I hated the side panel fans back in the day."}, {"text": "a fan controler"}, {"text": "i love this case"}, {"text": "Drive bays in 2011 were many for dvd drive/ cd drive/ temperture monitor controller and 1 watercooling bay  if the consumer wanted to  do that hence the head room on the remove able bay area underneath"}, {"text": "I have an AZZA Genesis 9000 in black that I bought back in 2014 and it&#39;s insanely massive! It has tons of airflow,  a reversible motherboard tray and room for 3 200-230mm fans! It still holds up really well today aside from the power switch being a little iffy. OH and it also came with 7 fans pre-installed."}, {"text": "I would put an external fan monitoring in one of the 5 1/4 inch drive bays and 3 usb 3.0 drives for in other 3 bays but I have a s340 elite so I’ll pass"}, {"text": "My very first gaming case pc back in 2009-2010"}, {"text": "jesus dude clean your front intake haha"}, {"text": "this was a neat video thanks for sharing i love doing tech videos on my channel keep it up guys"}, {"text": "First case I had was a box"}, {"text": "tomatoes salami and bread."}, {"text": "inside looks like sharkoon vg5-w"}, {"text": "Ugly case. It&#39;s terrible. XD"}, {"text": "I still have an ancient Antec Three Hundred and oh god cables are so hard, I really can&#39;t make my 8pin EPS look good"}, {"text": "You could actually populate 5 5.25&quot; slots easily. Pair of drives for copying, dual slot reservoir/pump combo, plus a fan controller for the OCD. If you drop one of the optical drives out (or the fan controller) there&#39;s your 4 slots used."}, {"text": "Man I still use a Cooler Master ATCS-201 from 2002, the joys of 80mm fans and sleek brushed aluminium. Surprised it keeps everything cool,  with my 780ti and 4690k never overheating."}, {"text": "That&#39;s so nasty"}, {"text": "&quot;what was cable management like 7 years ago?&quot; it was covering mustard and ketchup with bright red mesh sleeving and zip tying the shit out of everything in sight....then you would have to cut all of the zip ties a week later because you wanted to change something...it got to the point where you didnt even bother trying organize cables and just let everything hang around in there (until windowed cases became the standard in PC builds, then we started giving a shit again)"}, {"text": "I have a case from 2010 and it is still great, Define R2."}, {"text": "Haha my 2018 case has:<br />-ATX-Board tray<br />-2x 420mm radiators<br />-4 hard drives<br />-7x 5,25&quot; Bay (every bay used)<br /><br />And still room for more"}, {"text": "Where are you from?"}, {"text": "I want beige cases to make a comeback."}, {"text": "2018: Flat cases, no airflow<br />2011: Cases that literally look like they have jet engines and intakes with no airflow"}, {"text": "4-bays because you can burn DVDs in quad-SLI<br />It&#39;s 4 times faster."}, {"text": "That&#39;s a cool case. Can we have a bit of stuff like this in 2018 and not everything being tempered glass? I&#39;m someone (one of the few?) who doesn&#39;t like tempered glass so some choice would be nice."}, {"text": "Bitch, my last case up till a year ago was a LianLi from 2001 an aluminum behemoth.... on wheels! It was heavily modified and was a water cooling rig but still- it did it&#39;s job."}, {"text": "Why need 4 5.25&quot; Bay&#39;s? --&gt; DVD Drive, Cardreader, Fancontroller, Harddrive Hotswapbay ... there&#39;s plenty of options to use these<br />i personally use a Cardreader, DVD and 2 Hotswapbays in my Main PC .. and i absolutley hate cases with no bays..."}, {"text": "Oh wow... that opening...<br />Made me do a double take on the date of this video.<br />Good job. :D"}, {"text": "Well  HAF 932 is still my mian PC XD i cant affort a new one RIP"}, {"text": "Ive still got a beige one in loft......."}, {"text": "You probably had so many 5,25&quot; bays for front panel fan controllers, Display inserts and perhaps even modding possibilities. It was a better time in my opinion."}, {"text": "Now try with a Thermaltake V2 or V3 :)"}, {"text": "I am literally watching this video using this case :D Completely stumbled into this lol"}, {"text": "I still use my case from 2009, Corsair Obsidian 800D. That was a real high end case.... This on the other hand is trash"}, {"text": "Hey Dimitry. Could you take a look at the Zalman Z11 NEO case?"}, {"text": "i remember I used to close the back panel with the help of my feet... similar with when you are trying to zip your overfilled luggage"}, {"text": "Dude I’d take this over any modern pc case. It’s actually unique and different. I swear every new case looks the same now. My current rig uses a mid tower from 2004. Raidmax cobra 822 if you were interested"}, {"text": "So basically, as with most &quot;fancy&quot; cases from back then, it&#39;s just a dressed up aluminum box."}, {"text": "well it was 100 $ on release in 2011 ,and it is 100 $ now ............7 years later thats how technology works .......it neever improves so why would price change be neccessery"}, {"text": "Pretty impressive for it&#39;s time. Still passable for today."}, {"text": "You look like Chris Pratt’s nerdy cousin, “spaceking” 🙄"}, {"text": "You needed 4, 2 opticals, 1 fan controller, 1 flash drive reader, and perhaps 1 audio break out thing from say a higher end soundblaster card.  Maybe 3.5 to 5.25 adapters needed for some.<br />Or simply 4 optical drives, ripping your cd collection as fast as possible."}, {"text": "I remember this case"}, {"text": "Must be pretty terrible."}, {"text": "Blast from the past: NO REMOVABLE MOTHERBOARD TRAY!"}, {"text": "Slow day at the Hardware Canucks office I guess. Cases have not changed that much since 2011. We have a bigger focus on cable management, more painted interiors, and less 5.25&quot; drive bays and that&#39;s about it. I just did your whole video in one sentence. In another 7 years we can look forwards to another iteration on this video that says &quot;Oh look, tempered glass, that was a thing in 2018, oh, and a PSU shroud and basement to hide your cables!&quot;"}, {"text": "My case has fans on the side panel rip"}, {"text": "&quot;fans on the side panel are definitely a trend that has been dead for a while&quot; fans on <b>windowed</b> side panels maybe. otherwise they are good."}, {"text": "Why the plant????"}, {"text": "Just a single 140mm fan for intake?  I was hoping for four little ducted fans!  That would have been cooler (literally)!  😉"}, {"text": "Russian-Canadian Chris Pratt"}, {"text": "you can buy as stupid cases today.<br /><br />...difference with 2011 and 2018 is basically nothing.<br /><br />difference with 2011 and 2000 would be far greater. 1990 and 2000 are from different planets."}, {"text": "<b>2019 mercedes CLS uses those same &quot;engine exhausts&quot; as blowers</b> .  Dam, this case designers really DID know the future."}, {"text": "2011 is retro? Try using a case from 1998-2000 instead. Lets see you mod your own window onto the side. Those cases were solid steel as were the panels from cases that were safe to actually stand on and stack other machines ontop of sometimes 4 towers high. Modern cases are weak, they only look pretty."}, {"text": "maybe  the leds don&#39;t work because you SLAMMED THEM YOU BARBARIAN"}, {"text": "Aerocool Shark! Those fans are legit! True, it looks tacky when not spinning but it moves a ton of air. I&#39;m having a hard time finding them here now though, not sure if they&#39;re phased out"}, {"text": "I thin it&#39;s cool but I wouldn&#39;t order a case from Germany. They&#39;re already expensive enough in Canada.<br /><br />BTW, how long does it take to master cable management? Five PCs? 10PCs? More?"}, {"text": "I need that case can I get the link"}, {"text": "2011 ain’t that long ago. You should go back to the early 2000s when LianLi was pretty much on everyone’s wish list because of the clean looks and removable motherboard tray."}, {"text": "The first computer case I built in gave me a permanent scar as a reminder."}, {"text": "Back in 2011 you needed 4x5.25&quot; bay. You needed a slot for ODD, a slot for a fan controller, and ofcourse a double slot for that water cooling reservoir with the integrated Laing DDC.<br /><br />Something I&#39;d like to see more manufacturers do is make fans like the Arctic Cooling F# Pro PWM series."}, {"text": "The HAF 912 was the true standard issue warrior back in the day"}, {"text": "Dvd Drive<br />Burn Drive<br />Burn Drive<br />CD Drive?"}, {"text": "&gt;Throwback HardwareCanucks<br />&gt;Completely throwback case<br /><br />Yup, this is a throwback."}, {"text": "I still use Antec Super LAN boy from 2005."}, {"text": "Wasn&#39;t this back when Intel soldering their IHS? Maybe that&#39;s why no one cared about case thermals."}, {"text": "Still have that case lol"}, {"text": "Wow the first intro!!!!"}, {"text": "Old cases shows how little has changed. I could probably get all my hw inside my first case, chieftec dragon medium tower and be happy aswell.  The radiator would need some modding but thats to be excpected."}, {"text": "That&#39;s not a question of it being from 2011. Standard cases haven&#39;t changed much in the past 7 years. My Fractal Design Arc R2 (?) is no different from modern top models.  So pretty misleading title."}, {"text": "Hey!<br />I have midrange Chieftech from 2013 and it looks nowhere near contemporary cases."}, {"text": "Those 4 slots on the front can be used for hot-swap caddies for HDD&#39;s, seen it, done it, I did it way back in 1998 when I worked in I.T. Support, I kept one drive full of games and a drive full of work documents and just swap them over, it was cheaper than buying a Jaz or Zip drive and as a technician I had access to plenty of spare drives.<br />This is though when I was running DOS 6.2.2. and Windows 3.1 Workgroups, then Windows NT 4.0. so a while back, when a 240mb, yes 240 MEGAbyte, drive was considered reasonable, my setup has 2x 85 mb drives and a 212 mb drive. With 24mb of RAM (8 mb onboard and a 16 mb simm) in a Digital Venturis case running an overclocked Intel DX50 (@66mhz, no fan needed, tiny heatsink)."}, {"text": "pfff e-sata, firewire is where its at"}, {"text": "Of course I want a side fan trend to come back, it&#39;s the slot with the greatest impact on cooling, no idea why it ever went away."}, {"text": "there was a time where Harddrives where larger and had to go in the 5 1/4 inch bay"}, {"text": "One of the 4 bays would have been used for the floppy drive, which you needed to update the bios on a lot of older motherboards. It was also not uncommon to have 2 disk drives for direct copying. Also, most of your custom front panel fan controllers etc were typically done through the 5.25&quot; bay. For instance, back in the day, I installed a remote starter for a computer and it used the front 5.25&quot; panel for mounting the interface."}, {"text": "I actually never understood everyone&#39;s issue with glossy plastic, especially on peripherals I prefer it as it doesn&#39;t look worn as quickly."}, {"text": "Hello, pal, new sub have a great day."}, {"text": "WTF, the guy talks like he was born after 2011."}, {"text": "Do you know Corsair ?? I&#39;ve got a Corsair 600t and I assure you that case it&#39;s much better than lots of 2018 gaming case."}, {"text": "Hi Dimitry, could you please review the CM MasterBox Q300p?"}, {"text": "I really feel a strong urge to build a Core 2 Quad system with a GTX 660 or something in this case. Hmm."}, {"text": "I have had my pc case since 2008"}, {"text": "Why is your meshify case so filthy? (literally caked in dust)"}, {"text": "I&#39;m missing a Battlestar Galactica reference :)    This case is so &quot;Cylon&quot; :)"}, {"text": "y&#39;all are talking about 2011 like it was a long time ago."}, {"text": "my suggestion for an old case to use next would be......an Antec 800 version 0 (they sold millions of that case) and Antec 1200 v0 or v1 with dust filters and after compleating a build do a full dust filter clean!"}, {"text": "With it&#39;s filterless side panel and massive side fan, I feel like my 2013 corsair 400r is only a step up!!! ."}, {"text": "I guess cases didn&#39;t evolve much."}, {"text": "Shark fans were/are sold by aerocool separately. I got 4 black ones way back when."}, {"text": "Horrible case as with anything from that brand. Also bad for 2011.."}, {"text": "look s very good even now"}, {"text": "Man that was nostalgic for some reason"}, {"text": "Blu-Ray, DVDRw, Fan speed controller, card reader - 4 bays"}, {"text": "That case was from a time when 1080p was the 4k of today"}, {"text": "U really need to clean that meshify c"}, {"text": "the case im using right now is also from 2011 almost identical structure inside except NO CABLE GROMMETS :( Cases like this will indeed accommodate a 240 radiator if you drill out those rivets and pull the drive bays out of the front lmao"}, {"text": "Why is Chris Pratt reviewing a case?"}, {"text": "Putting actual fans in those jet intake things would make a great case mod!"}, {"text": "FOUR Side 200mm fans. I say we should go there next!"}, {"text": "I still have a rather reliable computer (used for music production) with a case from 2009. It has a monstrous 9&quot; fan on the side panel. People who see the case still think it is pretty awesome... even if the actual specs are mediocre by today&#39;s standards. <br /><br />Whoever Azza is did it well, for a cheaper case (less than $100). Matte black surfaces and a reasonable amount of acrylic on the side (but not so much that it gets scratched up a lot). And in the pre-RGB days, this at least had some color lights, with that big fan on the side and the two on the front glowing a nice deep blue. Coupled with my ASUS alienwear mb, it has a couple glowing elements including an alien head that flickers with cpu activity. LOL<br /><br />There is also another 9&quot; fan on top. So twin 140mm front intake fans and TWO 230mm fans (side is intake, top is exhaust) and a 120mm exhaust fan in the rear... temperature is crispy. The only thing I don&#39;t like about it is the cheap look of the logo itself. The mesh in the front is metal and the frame is Japanese SECC steel. The only drawback to that large fan on the side is that it eats up 30mm of space making taller CPU cooling systems impossible. That said, with all the airflow in this case, my i7 stays plenty cool with just a basic heat sink and fan setup. Azza Solano 1000 ATX Full Tower."}, {"text": "Chris Pratt? What are you doing here?"}, {"text": "If Dyson made a PC-case, this it what it would look like."}, {"text": "man you reviewed the wrong version.... you forgot about the EDGELORD one.... dissapointed<br /><br />btw, my red/black cyclone ll is still activly gathering dust under my desk and making everybody entering my room be like wow"}, {"text": "sooo... my low end gaming case from 2017 is a high end gaming case from 2011? Seriously though, the similarities are surprising. (Thermaltake versa n23)"}, {"text": "I have a HAF XM and a HAF XB v1 from back in 2011/2012. Both of them are still good to go :)"}, {"text": "omg my old case was just terrible i cut some pieces to make fit my cpu liquid cooler"}, {"text": "Old intro is here"}, {"text": "Now make it functional"}, {"text": "I like this drive removeable cage"}, {"text": "Reminiscing my old Nvidia Edition CM Haf-X, that was a sick case."}, {"text": "tempered glass looks sexy and all but my god my case weighs like 30 pounds"}, {"text": "Hey D, i have a nice place where you can store the z170 thats just sitting on your shelf 😉😉😉"}, {"text": "I can&#39;t use the new cases with watercool specialisation, cause i need 3x 5,25&quot; slots for my hard drive extenders and ROM.<br />So i have to cool my system with airflow instead of water.<br />And if you think about it... An watercooling unit in the end is just an expensive aircooling method."}, {"text": "Okay, but why would you pick that case when say the corsair graphite 600t was already out one year earlier?"}, {"text": "Already a bunch of reason for 4 drive bays. but there was also this thing which you could switch hard drives from the drive bay. and then place the drive in a safe. i guess to try to protect information. my dad had something like that."}, {"text": "For some reason, I initially thought that the jet intake things were subwoofers"}, {"text": "You can have a BD burner and 3 hot swappable drives or 2 + a fan controller :D"}, {"text": "Talks trash on dust inside the case, has his own rig front panel covered in it. GG lol"}, {"text": "i almost bought this one back in the day. but then i realized the front is a joke and deceiving."}, {"text": "memories i kinda miss that era."}, {"text": "Dude!!! There&#39;s grommets in the back in case you need a quick fix with some of the cables! That&#39;s a pretty good idea!"}, {"text": "I love gimmicky, obscure cases like this."}, {"text": "Back when all pc cases looked different lol"}, {"text": "Ugly ugly ugly, i dont know what&#39;s worse ... this or anything alienware brought out."}, {"text": "Case designs are an expensive gamble for CEO&#39;s to bet on for a par course tbh."}, {"text": "Damn I really like the blue motherboard tray"}, {"text": "the days before modular braided cable PSU&#39;s"}, {"text": "...are you Chris Pratt?"}, {"text": "I thought that intro was the actual intro and tripped out"}, {"text": "hahahahaha i had a case like this, i thought it was the coolest case ewer, but a year later when the new cases came it somehow lost its beauty and became the ugliest case ever. thanks for the video man, som blast from the past."}, {"text": "I think it still looks cool lol"}, {"text": "As far as big cases, I remember the Antec P180 being a sexy / popular case back in the day (2005-2010), Antec 900 (2007-2011), and Lian Li PC70 (and ones like it) from about 2001-2006. Should check these out. And man, the Chieftec dg-01 (and the million copies of it) from the early 2000s... saw them everywhere and they sucked to work with. <br />As far as smaller (but still ATX) cases that were popular (2005-2009ish) there were the Antec Sonata series, and CoolerMaster Centurion 5."}, {"text": "I want.. To start a company that hand makes wooden cases for computers. Call it a niche.. Call it stupid.. But I want one like.. yesterday."}, {"text": "if I have the $$ to choose, I wouldn&#39;t use the built-in motherboard fan controlling software.<br />instead I&#39;d go buy several analogue fan controllers, or touch screen version. Those will populate optical bay real quick."}, {"text": "this video made me realize you look like the Canuck version of Chris Pratt lol"}, {"text": "I really think that a refresher of this style of case and bring it up to date would be awesome! Cases are all same/same now, back then... Case makers were willing to push design and make things that were very unique. I remember going to Lan parties and you would rarely see 2 people who had the same case"}, {"text": "Some people were still playing games with CDs"}, {"text": "The spilled lighting does look cool....Uhh, great, now we&#39;re going to see the rise of case manufacturers harnessing the power of RGB light spillage.... :-("}, {"text": "I don&#39;t understand why this case was chosen. My current case a Corsair 500R is vastly superior to this case and I&#39;ve had it since end of 2011. Nobody in 2011 was buying these Aerocool &quot;gamer&quot; cases. Why not a HAF or something that was relevant?"}, {"text": "I cud see some hardcore EVE Online players getting this case lol"}, {"text": "fan controllers for those that don&#39;t like using software for fan control. There&#39;s a few devices you can use in 5.25 bays it just all depends on what you want out of it. If I had enough usb headers open on any motherboard I&#39;d probably connect a multi card reader to it as well."}, {"text": "I don&#39;t remember how I controlled the speed of my shark fans, but I actually like them. Decent fans, but they could definitely be better. This is one case I probably would&#39;ve tried to find and buy if I knew it existed."}, {"text": "how about we review an NZXT Switch 810 instead?"}, {"text": "Oof... My case I got for Christmas in 2017 has no cpu hole, no rubber grommets, barely any 970 clearance, a fan on the side panel and only 1 dust filter on the psu... sound fammilliar? Also it came for about $25 after rebate soo..."}, {"text": "Mod that case for 2018 EXTREME AIR COOLING!"}, {"text": "I like to put a large, slow fan on the side panel It helps give my behemoth of an R9-390 some extra air and keeps the noise down."}, {"text": "It makes me wonder if somebody managed to mod in 20mm fans where the front holes are."}, {"text": "psu schoud lol those days are gone again. they came and left :("}, {"text": "man do a even older case review :) like where the psu is on top those old gaming cases :) (and not the ones every one had in the p4 days that i see every where)"}, {"text": "need to do the haf x case look back now..."}, {"text": "ahghhh coolermaster 500p case in white loooks nice i got mine in grey for 35€ might spray paint it matt black cause not a fan of greyish :) the white one looks pretty chill and cool to see this case on channels :) its 150€ new i got it fricking cheap !) and still dont feel like its worth more then 80€ its all plastic..."}, {"text": "uh try cases back in 2000, why 2011?  Stop misinforming people, remember back in the day that shit met needs."}, {"text": "Revert back you say, man i&#39;m using my motherboard box for my case."}, {"text": "i had a Fractal Design Define XL back in 2011 along with my sandy bridge build based on i5 2500k, 8gb 1600mhz ddr3, asus p67 deluxe motherboard, 60gb SSD for windows 7 and 120gb SSD for games along with a 1tb for storage and a Corsair TX 750 powering my GTX 580 :)"}, {"text": "Russian girls are pretty, don&#39;t know why he went with an Israeli one?"}, {"text": "This isn&#39;t necessarily a representative case of the era; I used to use an Antec Nine Hundred and it had much better airflow--2 120mm fans in the front, one in the back, and one 200mm on top. However, it had no dust filters so dust was a serious problem and even cost me a CPU cooler. It also had only three 5.25&quot; bays instead of two, and I did use all of them (BD-RE drive, DVD-RW drive, 3.5&quot; floppy drive).<br /><br />I&#39;m actually going back from my current Corsair Crystal Series case to a (slightly) older case though because USB external drives are a curse sent by God to punish us for planned obsolescence. I&#39;m going to move my current Ryzen 5-based main computer to a Fractal Design R5 and install an internal BD-RE drive and an LS-120 drive (a fancy IDE floppy drive that takes either old-fashioned 1.44MB disks or its own 120MB disks). Yes, a floppy drive, because I also have a retro PC and floppies are way more convenient for transferring small files to MS-DOS systems than CD-Rs."}, {"text": "There&#39;s new cases that aren&#39;t as nice as this!"}, {"text": "I&#39;m so glad &quot;gamer&quot; products aren&#39;t as synonymous with marvell comic book styling anymore. Now if we could reduce the amount of obnoxious RGB lighting we&#39;ll be in good shape."}, {"text": "For some reason, these days designers don&#39;t like to experiment with design of things. Too afraid to stand out. I wonder why."}, {"text": "No way that&#39;s from 2011."}, {"text": "NZXT Trinity... that was sharp."}, {"text": "What’s that 2018 case, looks gorgeous."}, {"text": "4 of the 5.25 bays were big with modders, 2 for DVD cloning, 1 for water cooling, and 1 for aftermarket audio panels or LED switchs"}, {"text": "oooo very nasty"}, {"text": "pretty good case"}, {"text": "This thing looks sick, I wish I had 1"}, {"text": "My old ones aren&#39;t that good-its a choice between 80mm (2x front, 1x rear, 1x side) or 120mm+80mm (1x rear, 1x front). Then again, the newer of the 2, the one with all of the 80mm fans, also supports AT motherboards so a 286 build inside it wouldn&#39;t get any where near as hot as my 4790K+GTX 970.   And the older case is completely tool-less, and has an add-in card support bracket for all 7 PCI/PCIe slots."}, {"text": "Drive was used for fan controler"}, {"text": "And I still use a NZXT. Lexa black line from 2005!"}, {"text": "If it&#39;s any consolation, I&#39;ve put a RYZEN 1700 in a Raidmax Ninja II... orange!"}, {"text": "Check out the HP Blackbird 002 from 2007. Way ahead of its time."}, {"text": "What is with you and that goddamn plant? xP"}, {"text": "I am still using a &quot;Gigabyte 3D Aurora&quot; case from 2006, awesome case it&#39;s seen many builds fits just about any hardware and has good airflow, it&#39;s the longest I have ever keep any PC part."}, {"text": "Really ugly case."}, {"text": "i like it"}, {"text": "Dudes check out the Deep cool Quad stellar. I want one so bad because it is so unique."}, {"text": "I would mod this case to add really small fans on the &quot;turbines&quot; and remove or just move the LED&#39;s aside."}, {"text": "Where&#39;s the vacuum?"}, {"text": "whose case is this?"}, {"text": "This case is pretty lit actually &gt;:P"}, {"text": "Sold my thermaltake level 10 GT a few months ago. That thing was a beast in 2011 (and is still decent now). Looks like an infant transformer though. And it weighed more than it needed to with all the hardware in it."}, {"text": "During much of the 2000&#39;s you couldn&#39;t get enough 5.25&quot;s. Two optical drives were common (for making perfectly legitimate backups for your frie....own movies), the SoundBlaster front bay was a &#39;must have&#39;, some of the fan controllers were really cool, as well as other bays with VU meters and what not, and personally I couldn&#39;t imagine life without quick-release hard drive bay."}, {"text": "And now we need to question. Why are we still using the outdated power connectors on the mainboard? Why is ATX still the standard with SLI being less and less supported? We should have moved to mATX as the standard and most supported form factor. Why are the cases still the same size even though we got rid of all the 5.25 and most of the 3.5 bays? WHY IS THERE SO MUCH EMPTY SPACE IN TODAYS CASES??? Shrink the damned cases already! 99% of users don&#39;t need 360 push pull radiator space. 99% of people don&#39;t need ATX. We got enough cases for the 1% that do. We need more smaller form factor cases, and mainboards!"}, {"text": "Gosh darn dude....vacuum your dust filters from time to time man...."}, {"text": "No front panel airflow? They really were ahead of the curve."}, {"text": "I used to have the antec 900, now THAT was a nice case..<br /><br />Edit: From 2006 Btw."}, {"text": "Why do you think it will be terrible when its from 2011?"}, {"text": "It would be nice to see more options of actual desktop cases again."}, {"text": "I miss these days of case design. It was like the wild west. So many styles to choose from. Some of the old retro case could definitely be retooled for modern features and re-released today. Too many me-too cases these days."}, {"text": "I&#39;m  getting  cancer from your content"}, {"text": "In 2011 you could buy a LanCool Dragonlord K62, best case of that era hands down."}, {"text": "well i have a removable hdd cage in a pc thats from 1999 so not really new :)"}, {"text": "Fan controllers panels are for example housed in the 5.25&quot; (ODD) area, so you could have like a thermal monitor, a controller and 2 ODD... but yea since there are so many software based things to control those and many are now mobo standards, they are pointless."}, {"text": "Why do you need 4 ? Because there are cd roms, dvd roms, cd writers, dvd writers, additional usb front panel (even now some motherboard include a usb (type c) front panel), sound card front panel (creative usually has one), external hdd enclosure, etc"}, {"text": "Actually, 5.25&quot; is NOT only for ODD, but also for accessories! I have a Cooler Master Mastercase 5, with only two 5.25&quot; bays, and i&#39;m like holy shit that sucks because i really want a 3.5 and 2.5 hot swappable bay, and also a hub with differents cards slots, like compact flash etc...But i have an ODD so i can&#39;t, i need to choose between two options, but that&#39;s the problem :/"}, {"text": "Not all old cases were bad. I still have my Gigabyte 3d Aurora and it&#39;s a great case. It was actually Gigabytes first ever case. Made from a mix of plastic and brushed aluminium, with changeable side panels (Air inlet or perspex window). A little tight for todays needs but it&#39;s lasted me a very long time. I&#39;ve had it since 2011"}, {"text": "fractal design define r5 includes that motherboard stand tool"}, {"text": "hope we still be here,, for the next 7 years :)<br />your vid become better, i mean the way you record it"}, {"text": "Haha i still have that case in my bedroom running my bedroom tv"}, {"text": "I would totally mod those fake jet turbines and install some RC impeller motors in there. Hook up a fan controller for the noise factor and you would have awesome airflow. I wonder if CaseKing has another one on the shelf ..."}, {"text": "Syclone II is prettier than CM for me :)"}, {"text": "The intro...nostalgic"}, {"text": "case from 2011 is bad ass"}, {"text": "I have 9 * 5.25 bays"}, {"text": "My first build was in a beige AT mid-tower. That 386SX-20 ran Commander Keen like a boss!"}, {"text": "ha, I&#39;m still using a case from 2004  that I got from a supermarket for my secondary pc. Lately I changed its harddrive and the mounting system was simply scary - some outstanding metal pieces scratched over several sides of my poor hdd..."}, {"text": "Why 4 5.25&#39;&#39; bays? For removable hard drives. USB speeds sucked, that&#39;s also the reason for eSATA port."}, {"text": "As much fun as this kinda time period was but i am glad that the stuff is done.<br />The early 200x to early 201x had some incredible horrible design thingies that i would really like to forget.<br />All this incredible ugly plastic covered cases painted in some shiny colours. It made you feel like the gangsta pimp of some ugly hookers you sell on the streets."}, {"text": "soo is there a HardwareCanucks Discord?<br />If not i would be more than glad to open one up."}, {"text": "I still use the same velocity micro case that I bought from BestBuy in April of 2007 and still has the Windows Vista sticker. Of course since then, I rebuilt it with newer components made mainly between 2013 to 2016 such as an i7-4770k with 16 gb of ddr3 ram at 2666 mhz and a gtx 1060 6 gb gpu."}, {"text": "I think for what you are looking for in cases you have to go to cheaper cases.  Side fans, external bays, more interesting design language, are all much more common when you get into the sub tempered glass price range.  Tempered glass in my opinion is a blight, and it&#39;s nice to see someone look at something that isn&#39;t just a tempered glass box."}, {"text": "I&#39;m currently working on a Dell XPS 720 from 2007. It&#39;s a beautiful aluminium case, but not compatible with anything we have today. No room for cable management, no air filters and the weird BTX form factor. I only use the site, top and bottom panels, everything else will be custom."}, {"text": "4 5.25 drive bays from 2011 = 2x DVD drives for CD/DVD copying, 1x multicard reader, 1x fan controller (because mobos did not include them at that time)"}, {"text": "Gaming case? Gaming chair? Gaming keyboards? Gaming games? Gaming Tables? Gaming CRT&#39;s? What makes a case a gaming case? like is the Phanteks Evolv a gaming case? no? but i have gaming products in it. How is the Akracing Gaming table out of stock? oh god i can keep going"}, {"text": "Side panel fan is good for graphics card cooling I got a 2011 designed case just for that reason"}, {"text": "oh look its chris pratt aka the guy from guardian of the galaxie"}, {"text": "Mine Define R3 from 2010 looks better(although no lightning), thumbscrews everywhere inside, has metal plates, more dust filters and under 100€. This Syclone is inferior.<br />Oh, and it also has mount for side fan :D"}, {"text": "Why is there a pot on top of it?"}, {"text": "Oh god, the ricer cases of back then."}, {"text": "You should have revisited one of the Chieftec Dragon DX cases."}, {"text": "That &quot;4Drive&quot; area was mostly used 4 water cooling modification... Setting up pumps and reservoirs... At least here in my area..."}, {"text": "If you are going to do another one of these dinosaur case reviews I recomend the Antec p190, if you can find one. It would be cool to see how a once $400 case stacks up against a modern $100-$150 case."}, {"text": "I have a CM Stacker 830, nvidia edition, from 2006 still new in box, if you want to review a really good ancient &quot;gaming&quot; case."}, {"text": "A CASE FROM THE DISTANT PAST OF 2011!<br /><br /><b>realizes I&#39;ve been building my own PCs since 1996</b><br /><br />:-("}, {"text": "The reason the airflow is so sub-par today is because this would be for something like an Athlon II or something where a stock cooler would actually do some good.<br />Nowadays you need at least two intakes and one output (with perhaps top-mount fan solutions because in my experience it can get toasty without them.)"}, {"text": "My Antec P182 from 2007 had most of the features of a modern case. Removable cages, dust filters, some cable management (not great to be fair), a PSU cage thing, minimalist look. Maybe it was ahead of its time!"}, {"text": "that song at the beginning reminded me of oldies porn . ."}, {"text": "I use old lian-li cases still, because they are very modular and the option parts are great. choice of feet, fan grilles, windows, liquid cooling options, drive cage setups, power supply placement, and so on."}, {"text": "How about an CoolerMaster HAF X as a retro look back? I´m still using my case as my gaming rig. I bought it in September 2010."}, {"text": "Wish you would do more headset and amp videos like you used to do :)"}, {"text": "that case is better off without panels, dem&#39; abstract lighting in the wall is amazing :o"}, {"text": "Masterbox Q300L pls"}, {"text": "now that is ... fugly!!"}, {"text": "How many subs you had back in 2011 Dimitri? Case looks fucked by the way, i am happy that stupid &quot;star wars&quot; trend died."}, {"text": "The HAF-X from Cooler Master did have a type of PSU shroud in 2011.<br /><br />I also remember a lot of multi-port card readers and fan controllers being used in 5.25 bays."}, {"text": "Coolermaster HAF in about 2009... worst thing ever, didn&#39;t even have a painted interior!"}, {"text": "Gore warning. <br />I worked in a computer shop assembling machines something like 15 years ago. That was Horrible; the owner bought the crappiest cheapest shit he could get his hands on - there were sharp edges everywhere. One day as I was opening up a new case, I opened my left middle finger to the bone on a piece of debris inside. Still don&#39;t have full tactile sensitivity in that finger .."}, {"text": "I have two Noctua 140mm fans on the side of my Corsair Vengeance C70, and I just built my PC last year."}, {"text": "Why are you talking about 2011 like it&#39;s been decades ago. Quite frankly, so little had changed in cases since then it&#39;s laughable. New fashion trends came in, but internally there were barely any changes. Biggest change were PSU basements and shrouds becoming standard, and thanks for that."}, {"text": "I have a couple of those shark fans. They get a little loud but they move a ton of air!"}, {"text": "4 5in bays 1 dvd player 2 dvd r/w 3,fan controller 4,hd quick swap bay 5 more usb`s headers"}, {"text": "star lord?"}, {"text": "Damn, his cable management is a step above mine. Well, mine are hidden away anyways, so it&#39;s all good."}, {"text": "the 4 Bay 5,25&quot; wasnt all that bad, since there are Pump/Res combos out there wich Pupulate into those Slots and can be filled from the front. Also there are caddy&#39;s from Lian-Li for example  wich could House 3,5&quot; HDD&#39;s + 1  120mm Fan"}, {"text": "It&#39;s an alright case. I like the one I have now, and it&#39;s an old case as well. Don&#39;t know the name of it tho, because it was second hand. I modified it to my needs, and it looks great. :)"}, {"text": "I Love the looks of this case"}, {"text": "Christ! Clean your Meshify case!"}, {"text": "Why need 4?<br /><br />Back in 2011, my computers all have the following layouts on the front panel:<br />1x Blu-Ray Drive (ROM-only, BD-RW drives are for rich kids back then)<br />1x DVD-RAM Drive (to back up important stuff)<br />1x front panel for Sound Blaster X-Fi (the king of sound cards back in the day)<br />1x FrontX modular front bay, with: 1x front serial port (just in case I need to sync my obsolete palm pilot), 4x extra USB ports and a FireWire port (because the extra USB and FireWire connectors on the nForce mobo is too good to waste)"}, {"text": "basically we now have &quot;class&quot; to fit the role of &quot;master race&quot;"}, {"text": "hurricane X is my favorite channel"}, {"text": "2 would be for water-cooling bay and 2 for DVD drives?"}, {"text": "Great vid mate, i remember when that case came out ,wasnt into it too chavy for me, im into my HAF xb the only case anyone could ever need, i know i need help :-)..."}, {"text": "Dmitry I got 1 word for you SHARKNADO!!!!"}, {"text": "when back in the day felt like yesterday lol"}, {"text": "I am still using a Cooler Master Ammo 553 which is over 8 years old! The internals however, are only 1 year old :D. (Doesn&#39;t have cable management though)"}, {"text": "Just buy an airplane"}, {"text": "This case is still sexy tho"}, {"text": "I‘m surprised the airflow inside was that bad."}, {"text": "my earliest case expirience was one from idk how ild it was the bc that was in it had a q6600 and a kinda garbadge airflow but i fixed the airflow by cutting a kole for 2 120mm fans in it and it works great the gpu can intake a lot of air and closing the back panel was a 2 man job if i didnt want to risk my acrylic side panel i made"}, {"text": "Pretty sure shark is the branding for the fans and not the case"}, {"text": "So, my case I&#39;m using right now I got back in 2012. the NZXT phantom. Overall a good case, but it also has that silly door over the front expansion bays. at least it doesn&#39;t matter now since we don&#39;t use CD&#39;s any more lol.  Clearly back then there was an aspect of &quot;MAX AIRFLOW&quot; or forgetting airflow at all and is something that appeals to a kid like hot wheels. These days it&#39;s like the cases mostly matured at the same rate as the people making them. More like a quality piece of furniture."}, {"text": "suddenly my recommended tabs are filled with airplane videos"}, {"text": "You can fix glossy plastic pretty easily with a bit of 0000 steel wool"}, {"text": "i want to see that side panel fan trend come back but it shuld be a transperent blower syle fan witch exhausts to the back"}, {"text": "First case I did a proper build in was the good ol&#39; Antec Super LanBoy, I loved that case. From there I went Antec 900 (OG one with USB 2.0), Fractal Design Arc Midi (Rev 1) and currently in the Fractal Design Define S"}, {"text": "This is better than my current case..."}, {"text": "Back then we used 120 mm rad  aio cpu coolers into the back with push pull config set as exhaust and eliminated cooling issues."}, {"text": "We had 4 5.25” drive bays because we had to have 2 DVD writers as well as ... fan controller ... temperature monitor? I’d like to know what we did with those cases with like 8 5.25” drive bays."}, {"text": "Here is my answer on how to populate all four 5.25&#39; bays..., and it was in my first RGB build. :P<br /><br />BAY #1 - standard CD/DVD writer<br />BAY#2 - additional DVD writer for dual-layer DVDs<br />BAY#3 - Fan controller for up to 6 fans<br />BAY#4 - RGB lighting controller (back then there were no mortherboards that would have RGB controller integrated into it"}, {"text": "Case name should be &quot;shark torpedo&quot;"}, {"text": "Wow you need to clean your PC 😂"}, {"text": "im using my zalman z11 plus hf1 case works great"}, {"text": "I think a little gloss is nice personally"}, {"text": "I want this case for a modding project no joke where can I buy one?"}, {"text": "Mod it to work with the design :o"}, {"text": "Looks over to my PC with e-sata port on the front and acrylic side panel with fan mounting holes that have no dust filter"}, {"text": "So it is called the &quot;Syclone&quot; and Also has sharks, was this a bad prophesy predicting SHARKNADO?"}, {"text": "Frankly the cooler master cm690 (firist series) I had released in 2007 was way more modern with its meshed design, dust filters and not too excessive aesthetic... Also panels weren&#39;t this flimsy at all"}, {"text": "am i the only one who loved that case design"}, {"text": "THIS IS MY CASE! :D I bought it in 2013, so I&#39;v had it for a few years.. YOU CAN PUT FANS IN THE TOP?! that is how much I know about my own case &gt;_&lt; <br />I use the side slot as an exhaust, back is an intake for CPU watercooling, front is intake, top.. empty -.- <br />lets just say.. I don&#39;t regret buying this case I love the look, I love engines and stuff. but the airflow indeed could of been better."}, {"text": "No please do not bring back fans on the side panel it&#39;s a terrible idea"}, {"text": "it feel like watching star-lord review somethings."}, {"text": "Why the fuck i like Mac OS more than the fucking windows !??"}, {"text": "But we do have specific cases, with the trend of tiny PC&#39;s"}, {"text": "I would like to see much of the aggressive designs like this one in modern cases"}, {"text": "It&#39;s kind of bland, was (and is) definitely cheap, but it&#39;s still hard to beat the Corsair 200R from 2011.  As for earliest case...  It was something beige in about 1995."}, {"text": "Why 4? DVD, CD, SB Live Breakout Panel and Fan Controller/LCD monitor back in the day"}, {"text": "my 30$ rosewill tyrfing case came with a stand off screw, other cases dont? i thought it was standard.."}, {"text": "The first case I built a system in (rather than simply upgrading CPU/RAM/drives/expansion cards in) was the Lian Li PC-31 back in 2001... this had thumbscrews everywhere, removable drive cages (although primarily to allow you to install the drives outside the system), removable motherboard tray, a fan controller for the filtered front intake fans and was largely or entirely made of aluminium.  It&#39;s probably a decade or more since I last built a system in the PC-31 (or the larger PC-69 I bought not long after) but I suspect that it would hold up pretty well today apart from lack of cable management features and the comparatively tiny 80mm fans.<br /><br />Maybe I should get a new power supply, some new fans plus an APU, mobo and RAM to make myself a NAS..."}, {"text": "How is this made in 2011?! This design is clearly made in 2005! Think alienware back then. Those looked better."}, {"text": "People used to have fan controller that took up 2 5.25 drives and then a cd and dvd drive thats why there are 4"}, {"text": "I can&#39;t wait for 10 years from now when we&#39;re saying &quot;Damn remember when you needed a motherboard for computers lol&quot;"}, {"text": "I&#39;m actually using a case from 2005 right now, my case is a 2005 dreampc edition of the silverstone TJ07, I&#39;ve upgraded it to USB 3.0, which appearancewise is basically the only upgrade I am aware of that it was missing"}, {"text": "The perfect case for a Sharknado themed build :D"}, {"text": "The inside hurts my eyes"}, {"text": "I was REALLY excited when the intro was like the old days...your Fractal Design Define R4 review has lead me on a never-ending Fractal Design build cycle (each PC since then has been a Define case)...my very first case though was the Antec 900 haha"}, {"text": "built my first pc back in 92 Pentium 75 with the  classic off white case lol"}, {"text": "Yo this case actually looks really cool. It would be cool to see a modern take on it."}, {"text": "We had 4 because dvd/cd writer times 2. and fan control + temp = 4 bays:)"}, {"text": "5.25&#39;&quot; water reservoirs used to be popular, as well as fan controllers."}, {"text": "I could see someone needing the 4 5.25 inch bays. 1 dvd drive,1 dvd/CD drive for easy duplication, 1 for a sound card breakout interface and finally a fan controller. Great video !"}, {"text": "Gotta use dem 5.25inch drives man!"}, {"text": "This was a great throw back!! Thank you"}, {"text": "CD to CD copying is a trend before, thus having four 5 1/4 bays. 1 for a CD-ROM, 1 for a CD-Writer, 1 for DVD-ROM/Writer."}, {"text": "This was awesome seeing this, I almost bought this back in the day... wow I sound old all the sudden."}, {"text": "4 optical bays are SICK for hotswap adapters. Like there is adapters that make 2x op-drive bays =&gt; 5 2.5inches hot swap bays!! Also for like 1 bay into 2x2.5&quot; + 1x3.5&quot; !!<br />Would quite fit with the futuristic theme to have a sick-ass storage server in it... like... with an higher end CPU, running unraid, a big array for network fast storage, and a gaming VM.<br />+ some hotswap bays have a fan built-in just to suck the heat away from the drives.<br />That + a bit of moding to give this rig some air, better fans for efficient push-pull configuration, and you have a great system in hands."}, {"text": "LOL!!! My current PC case is an old Compaq Presario from 2001! :) This case is the bee&#39;s knees to me. XDDDDDD"}, {"text": "thats the sickest fkn case"}, {"text": "I have a HAF 922 still. I like it."}, {"text": "thats what could also have been used for 5 1/4"}, {"text": "Why did it have usb 3.0 and a ssd mount in 2011 🤔"}, {"text": "esata drives"}, {"text": "usb drives"}, {"text": "Do a review of the Lian Li PC-60 or similar from circa 2002"}, {"text": "My guess is the many optical bays were probably for if you wanted a bay resevoir while still having a DVD and/or CD drive."}, {"text": "what is that plant pot for?"}, {"text": "The &quot;Syclone&quot;, fake air flow...a shark sticker?!<br />SHARKNADO! That&#39;s it! :D"}, {"text": "needed four for multiple burning"}, {"text": "The first case I worked in was a horizontal beige box with a lock and a turbo button.  Probably had a 386.  Gotta go.  I think those damn kids are on my lawn again."}, {"text": "While I&#39;ve not really used DVD or any other drives for ages, the front five&#39;n&#39;half inch slots come definitely handy for things such as HDD- and SSD-sleds, for swapping storage and necessary setups easily. It might not be a major thing, but there are still <del>some</del> uses for them even at high-end systems. And if you are one of those kind of people, there are alot of fancy LED and Fan-controllers with touch-screens nowdays."}, {"text": "Two elements of the 2000&#39;s I wish had stayed in case design were screwless attachments and thumbscrews. I had a Thermaltake case that used metal riders that attached to the screwholes on the sides of HDDs and optical drives which then allowed you to securely slide the drives right into the case bay. It was brilliant and I&#39;ve never seen it anywhere since. I know people hated thumbscrews but damn they made life a lot easier both inside and outside the case. Still the spirit of innovation does live on sometimes. My favorite case fans are the Deepcool UF  120 mm fans which don&#39;t use screws but instead use heatproof silicon gripper threads that will neither be damaged by heat nor interfere with the electronics in any way because they&#39;re a neutral non-conductive pliant material. Absolutely fantastic idea."}, {"text": "how in the world was the cpu throttling?? It should have plenty of air. And the cooler it not that bad..."}, {"text": "Aerocool shark ... have those fans back in 2011, back when I thought LED are super cool. Loud AF!"}, {"text": "2011 is nowhere near far back enough if you want a retro impression.  Get a case from the 1980s.  This case was perfectly viable, if a little &#39;gamery&#39; in its design."}, {"text": "The 140mm aerocool shark fans are actually pretty high quality."}, {"text": "If we are going to do flashbacks to past cases I would love to see the old Phantom 410 come back to life and see how it handles today, although I can assume that it&#39;s termals would be better that the Bitfenix Enso."}, {"text": "The front looks like a Xenomorph fucked a 60&#39;s muscle car."}, {"text": "Honestly, I&#39;d want to see more of these cases."}, {"text": "NZXT NEMESIS ELITE EDITION was pure love tho..."}, {"text": "I was surprised that case had good cable management to bad about the air flow.Then again it fits right in with most of the case made now days for air flow. You are right 99% of the cases today are all pretty much the same and very boring to look at and it don&#39;t matter how many flashing lights you install a square boring box is still just that.<br /><br />My real complaint with some 2017 cases and almost all 2018 cases is the lack of hard drive bays as in 3.5 drive bays. Sorry folks 1 or 2 3.5 drive bays don&#39;t cut it when you want to build a real computer that actually has many many TB&#39;s of space.With SSD drive being so small and the ones that are bigger costing so much you need 3.5 drives to get the space you need. I have picked out several cases for my next build and quickly put them on the no go list because they won&#39;t let me install my 4 4TB&#39;s drives unless I let 2 of them just flop around on the bottom of the case that is. Whats wrong with case designers these days? Make cases that look good and are also useful to use it is not all that hard to do.If you can&#39;t think up good designs then go ask someone that was in the industry about 5 years ago they will know for sure."}, {"text": "now that&#39;s a good case I would buy one"}, {"text": "Side fans definitely do not need to come back lol. My haf 922 had the steel honeycomb side panel where you could mount fans. I eventually cut that out and put an acrylic panel in myself. Of course it was also decorated with company badges too. With a custom paint job and psu shroud. Those were the days."}, {"text": "Did you lose your motherboard IO shield?"}, {"text": "TBH, I would actually be interested in a case that looked like this but had modern internal design features."}, {"text": "It&#39;s so horrible i want it. Give the actual tweaks and i&#39;ll buy it"}, {"text": "My first case was the NZXT Noctus 450."}, {"text": "that seems like it would have been a really cool case for it&#39;s time"}, {"text": "Surely it was cool back then, mine was just plain case"}, {"text": "Mod the case and make the led turbines into fan intakes and then rebuild and review the case based on the airflow!"}, {"text": "I don&#39;t think I have ever owned a case that had any options for cable management. The only &quot;cable management&quot; was the 5.25 bays you would shove all your extra cables in. Also that cage was updated for you. SSD&#39;s were a super new thing towards the end of 2011. So i doubt that SSD mount was original. Even if the case could mount SSD&#39;s it would have come with the conversion for the standard HDD cages. That was a pretty standard practice for a year or two for SSD mounting."}, {"text": "waiting for that Steelseries Arctis pro wireless video"}, {"text": "this reminds me of my NZXT m59 from 2011. but less jet engine tho"}, {"text": "4 5.25&quot; bays in the front, potentially because of something like a fan controller which some of them took up two of those slots if I remember, then another for an optical drive? Just a thought."}, {"text": "damn that intro got me :D"}, {"text": "CASE IS SICK!!! HOOK ME UP!!!!"}, {"text": "make a video about the worst trend of all time for pc&#39;s, RGB"}, {"text": "Antec 1030 circa 2001?<br /><br />First case I bought for a build that was not a beige box, it even had a full sized window on the side! Decent layout in the sense it had a ton of room, it&#39;s quite a large tower, but cable management was non existent at the time.  You basically bundled up your loose cables with a cable tie and called it a day. You could get really fancy and shove any extra psu cables into an empty 5.25&quot; bay at the top. Lots of fan mounting points with a nice plastic shroud to clip them into, but your limited to 80mm.<br /><br />I still have a Q6600 system in it actually on a Gigabyte P45 UDR3 (fancy!) with 8gbs of ddr2 sitting in the basement.<br /><br />The only downside was the case is almost all steel except the plastic front and seems to weigh 40+ lbs with a build in it."}, {"text": "I went from a Zalman Z11 Plus to a Fractal Design Meshify C and the building experience was worlds ahead. It is my favorite case on the market and I am considering a hard-line custom loop in the following 12-24 months."}, {"text": "$$$$$$$$<br /><br />Why would a company make a case that won&#39;t cater to as many people as possible? More cost effective to just build one that suits a greater market.<br />Where as this case, would only be bought by a gamer with a particular build or taste."}, {"text": "this section is full of bots saying no front bay drive options is just great....The jew run media industry pays companies to exclude optical media options in the name of greed and even trolls comment sections posing as  us to sway opinions."}, {"text": "My gigabyte horus g1 has 6 5.25 inch bays if you remove some hardrive bays"}, {"text": "I like the 2011 case better than the white one he has on his desk."}, {"text": "I miss your case reviews!!!"}, {"text": "Am I the only one who don&#39;t like cases with windows or rgb"}, {"text": "Shark, cyclone and starcuiser... Sharknado in Space? sign me up."}, {"text": "&quot;We didn&#39;t get sent some crazy expensive shit none of you want, So here... We will copy Gamers nexus instead!&quot;... Still missing the mark. Unsubbing. Its been real. But im out."}, {"text": "And why is he acting as if this thing is from the stone age? The Fractal Define R4 came out a year later, and it&#39;s basically a &quot;modern&quot; case..."}, {"text": "@dimitry 5.25 bay for front bay fan controller, temp sensors etc."}, {"text": "I recently bought a Cosmos II case notably for its side panel fan mounts, where I now have two Noctua Industrial PPC 3000 silently spinning at ~1000 RPM most of the time but ready to roar when the 4 (reference) graphics cards underneath get hot, so yeah please let there still be choice for side panel fans!"}, {"text": "id love to mod that case to make the front &quot;engine&quot; things with small fans could be kinda cool"}, {"text": "This is from 2011? It looks like one of those weird cases I saw in shops back around 2005-ish."}, {"text": "But will it fly?"}, {"text": "cooler master storm sniper was a beautiful case with a lot of air flow back in 2009, you can buil a pc today with that case, its never get old,"}, {"text": "I have to admit its a case I truly like the look of. Thanks for the review. I like this idea of looking at older gear.Well Done!"}, {"text": "Those Aero Cool Shark fans where their own product line. They where quieter and had better flow then simularly priced Coolermaster fans at the time. I still have a pair in an Antec 900."}, {"text": "Nice-looking case, like a futuristic train or something designed by Dyson.  Is ducted air cooling still a thing?"}, {"text": "Remember, this case was from 2011, back then 4 disk drives were actually pretty damn good cause you could put your fan controllers in there.<br />I had a setup with a lcd screen and  knob controller, it looked mad AF!"}, {"text": "My Aerocool Strike-X is still awesome :D Not a lot of features, but as a second rig (Got a Corsair 750D now) it&#39;s not bad."}, {"text": "Thanks Dyson !!"}, {"text": "The jet engines are actually really cool, all cases today look so identical, seeing some variety would be cool combined with todays case standards"}, {"text": "I want that case."}, {"text": "Could you stop with the handheld video?  I get nauseated watching it"}, {"text": "Can you guys make a video on what to do after you build a pc? Like what drivers to install, where to get them, windows updates, things like that?"}, {"text": "I hate the recent trend of having only 2 or 3 HD slots."}, {"text": "This case is just so damn tacky."}, {"text": "yes bring back 200mm case side panel fans like the old haf series and make sure it has a dust filter"}, {"text": "When Michael Bay designs a case."}, {"text": "a DVD drive, cd burner, that bank readers for the different type of sd cards and a zip drive should fill up the 4 5.25 bays."}, {"text": "I feel like people forget stuff too fast, and understate the past (woooo 7 years! STONE AGE!!), as far as I can remember, this is a pretty mid-range style case from back then, you could easily find more top watercooler mounts and such if you went to the higher end stuff. Like, it&#39;s nice, but nowhere near the nicest of 2011. People like, think 2011 we were admiring fire or what!<br /><br />For the 4 5.25&quot; bays: one BD-RW drvie, 2 bays for a big fan controller, top 3.5&quot; combo bay sounds great for adding extra USBs or such."}, {"text": "How can I use the adressable LED&#39;s from the enermax fans, if I have to use the Fan hub, which is connected via a normal RGB header?"}, {"text": "I defiantly want to see the return of side panel intake, over the GPU, best deal would be venting on the panel itself with dust filter and a removable bracket for holding the intake fan or fans to that venting over the GPU area, I get why it stopped happening on cases but I want to cool my graphics cards more so then look at them."}, {"text": "I built my first PC in 1996. The case was beige on the outside and murderously sharp unpainted steel on the inside.  After a long series of laptops and prebuilts from work I decided to build my own PC in a more modern case.  My first comment was &quot;Oooh I&#39;m not bleeding!&quot;  😝"}, {"text": "I&#39;d rock that case, hell I&#39;m still using an Antec Two Hundred version 1, USB 2 (Not that my board even has a USB3 header, broke as a joke!). Side panel fans are great if you actually care about more than the looks of your case, they can force fresh air into the GPU area or vent it out if need be, I had to unhook mine and my GTX 750 ti is not happy. They also help to keep the stagnant air around the nether regions of the motherboard moving. I&#39;d ditch the front LED&#39;s and open up those jet engine ports personally though. I tend to do slight modifications to old cases to keep them going longer, necromancy of the computer variety.<br /><br />Also, four bays because DVD, Bluray, fan controller, and I guess you could put one of those old school trays in the leftover bay, the little drawer things I miss seeing on cases. They gave my thumb drives a happy place to live.<br /><br />And as far as early case experience, this strange relic of a case is space aged compared to the AT systems (That&#39;s right, not even ATX) that I learned to work on."}, {"text": "Well at least this case qualifies as a &quot;real&quot; computer case because of the inclusion of external drive bays. Screw most cases of today, cause &quot;muh innovashun comes from stealing off others&#39; ideas&quot;, just like the smartphone fad market. Long live my 900D"}, {"text": "I love fans on the side panel; just adds extra cooling to the side instead of a worthless glass panel."}, {"text": "In Germany, these cases are sold brand new for 30 euros, could be an interesting choice for a budget gaming rig."}, {"text": "The classic gaming case that I loved... Maybe do one of these?...<br /><br />- Antec 900<br />- Corsair Obsidian 800D<br />- Cooler Master 690<br />- Cooler Master HAF 932<br />- Corsair Vengence C70<br />- NZXT Phantom<br />- BitFenix Colossus<br /><br />I could never afford these at the time as I was only a kid but damn they were incredible even by todays standards I think they probably have better airflow since most cases now seem to have air flow as a after thought. <br /><br />Currently I am using a SIlverstone RL06 Pro... Because airflow!"}, {"text": "Will you be interested in reviewing the Geeek H700 case? It&#39;s a triangular DIY case"}, {"text": "I still have this case! I will buy it from you since mine is degrading for sentimental reasons!"}, {"text": "When’s the arctis pro wireless video coming as there like $500 AUD want to know if there worth it."}, {"text": "This is actually better than my 50 euro new case"}, {"text": "First case was a TT Armor A30. Still love the case, but I have to heavily mod it to get decent airflow and fix several questionable design choices. The V21 is everything this case should have been."}, {"text": "They BOTH look like shit. Then they looks super gamer gay now they look super wanna be minimalist that just looks cheap."}, {"text": "Now, this is a type of review I&#39;d like to see more of."}, {"text": "I am using a case from 2005 with a 4th generation i7 sounds ridiculous I know"}, {"text": "My God... Clean your case!"}, {"text": "Those acrylic side panel fan mounts made for pretty noisy systems: The fans vibrated the side panel like crazy."}, {"text": "Waiting for 90’s beige plastic to come back"}, {"text": "You don&#39;t know cable management pain until you try and neatly cable an old socket 8 motherboard in an even older AT mini tower case..."}, {"text": "We&#39;re constantly building Franken-PC&#39;s. This is kinda perfect for that!"}, {"text": "sexy"}, {"text": "why do you own so many white things lol"}, {"text": "Making an interesting case is kind of like making a new car body imo."}, {"text": "I would get that case and first take a dremel to different fake airflow places to make them real airflow. I do like side  fans, butt not over the clear parts as it obscures your view. If I went all out, would get a custom glass piece to replace the window and add vents/mounting holes for fan in the triangle above the window...if a good fit was found. Overall I really do like that case."}, {"text": "If the vents were functional, I&#39;d be ALL OVER that shit! Damn fine retro jet engine!"}, {"text": "Reuploud ???"}, {"text": "Sharknado?"}, {"text": "multiple optical drives for copying and different needs, and the bays for front-panel control boards!"}, {"text": "Ahh back when Dmitry was actually still in Canada...those were the days"}, {"text": "Got really nostalgic there with that intro lol"}, {"text": "I want that case. And as for air flow for the front of the case, nothing that a dremel cant fix."}, {"text": "man i was wondering why the intro was missing some pixels"}, {"text": "Dude your meshify dust filters need some love...."}, {"text": "I have one thing to say.. and that is clean out that mesh front panel on that Meshify C! Holy crap the amount of dust that is built up on there."}, {"text": "is that case from flashgitz pc masterrace?"}, {"text": "The First case I ever bought was the Cooler Master HAF912. What a case made me fall for large fans and quiet operation. I replaced that with the Silverstone Raven 02. That was in some measure better than the 912 at cooling performance and complexity. The case I replaced it with and currently own is the Thermaltake Core X9. As far as I am concerned it is the best case I have ever owned. I currently have a 420 AIO in my case no problem."}, {"text": "my earliest case experience was sometime back in 2022...because with the gpu prices of today, that&#39;s when i&#39;ll likely be able to ACUTALLY build my first build... -_- (I&#39;m very salty)"}, {"text": "Who thought making this case could be a good idea?"}, {"text": "I have an aero cool silent cube case in my practice, it&#39;s very very robust builded and silent, of course houses mid range hardware since it&#39;s purpose is for taking notes, patients files. Can house radiator fans and has unmountable anything. Good company imo."}, {"text": "It&#39;d be really interesting to see a pc from this era go up against a modern equivalent to see how far we&#39;ve come. Maybe around the $500 region?<br />Anyways amazing video as always Dmitry. Your case reviews never disappoint at all."}, {"text": "tfw your first budget case from 2016 is worse than the one from 2011."}, {"text": "love of the first sight...i want this old jet case"}, {"text": "I&#39;m building a Ryzen in NZXT Lexa very soon. Think 10 yo case. It has functional AMD Athlon XP system in it.<br /><br />From new cases I wish they had more ARTistic design etc. wrapped in colors and patterns from outside. Inside more white or chrome!"}, {"text": "I still have 2 of those red LED Shark fans in a bin somewhere..."}, {"text": "Why 4 5 1/4&quot; bays you ask. I&#39;m wondering why your asking? Did you forget about fan controllers and USB hubs and Creative SoundBlaster front mount or NZXT&#39;s LED strip that was controlled by a 5 1/4&quot; bay device. There were many reasons back then to have multi drive configs back then. Not so much now a days, but back then, yeah, it was a thing."}, {"text": "For the love of all this holy, please mod the side panels and jet engine passages to become functioning! That would be awesome!"}, {"text": "Wow I always wanted that case for the looks ..."}, {"text": "I put my ryzen build in my antec 1080amg case from my P4 build from 2004. Got insanse airflow to this day with great temps."}, {"text": "My first &quot;good case&quot; was a Gigabyte 3D Aurora, back in 2006.<br />It was bad ass with the thick aluminium front panel.<br />I wish I could still use it these days, but it lacked all modern features like a CPU cutout and actual space to put cables in the right side panel. xD"}, {"text": "I use a Ryzen 1700 with a 1060 6GB and have a DVD writer and Blu ray reader.  NOT out of date you tech tubers are going about it wrong!  If you stream off netflix etc and run into difficulty they are gone!  It is crazy how we are going backwards but hey ho!"}, {"text": "My first build was in a Soyo Dragon mid tower in 2003. The 2011 case is so much better than the old Dragon was, but I still loved that case. Try doing a build on one of the ancient beasts like that on your channel. I would be interesting to say the least."}, {"text": "To be honest, I quite like the design."}, {"text": "Thank God for today&#39;s minimalism!"}, {"text": "The Antec 182 is 10 years old and beats many modern cases in airflow =)"}, {"text": "Someone(linus?) did the same case few weeks ago, me no like"}, {"text": "No to side fans coming back, imo they give minimal additional cooling and interfere with the air flow going through the case + with out good dampning they are alittle more noisy than normal."}, {"text": "I should send you guys my Sigma Unicorn Metal Storm."}, {"text": "omfg that intro"}, {"text": "Why would you need more 5.25 in drives? For your cigarette lighter/cup holder combo of course! No lie my dad had that in the pc he built around 2007 lmao"}, {"text": "I love my Antec P182, but cable management does suck even with a fully modular psu."}, {"text": "If you think that cases airflow was bad then just remember that in that case if you wanted 2 hdds, one optical drive and a floppy drive then you needed 2 ide cables and a floppy ribbon cable. HA! let me see you airflow past that XD"}, {"text": "No mention of the CPU backplate cutout on the motherboard tray? Really? That was a huge breakthrough. It was such a pain in the ass to change heatsinks to/from towers or AIOs cause you had to remove the whole motherboard to get at your backplate."}, {"text": "Ah... 2011 cases.. Where 2 disk drives were a thing, Fan Controllers were eveywhere. Good times."}, {"text": "Gloss or no gloss is a preference, and I prefer it. I just don&#39;t finger my case after I build it you must do it alot to complain about somwthing that isn&#39;t actually a bad thing..."}, {"text": "The reason for the 4 optical drive bays are because in the early days people would burn cds and sell them to make a bit of extra pocket change, these systems were called &quot;repeaters&quot; i think. I remember when i was 16 i would burn emulators, roms, games and songs on cds and sell them for like 10 bucks each. Gave me some nice arcade money.<br /><br />Also in the olden days anything inside your computer that needed to be seen or interacted with from the outside always came with an interface that you put into a cd bay. So ... fan controllers, early water cooling controllers, early lighting controllers, peltier cooler controllers, card readers etc etc etc"}, {"text": "Still better then a modern case where is just all glass with no real vents for cooling the modern trend is a joke"}, {"text": "I like that he takes pride in his cable management skills. Well done video."}, {"text": "I start to wonder why we get shocked when we first touch a PC<br /><br /><del>Got shocked by a Phanteks P400 Tempered G, loving it</del>"}, {"text": "lel i have this case rn XD"}, {"text": "Do 2001!"}, {"text": "Jesus Dimitri, clean that meshify! Pronto, or else I will call fractal Josh to come deal with you."}, {"text": "Where is the cohesion... Sharknado?"}, {"text": "What’s wrong with gloss"}, {"text": "I miss how case makers used to come up with wacky and cool designs for gamer cases. Most modern cases look alike which reminds me of how modern cars also look so similar which is very boring IMHO. Would love to see makers start experimenting again."}, {"text": "Old cases have more character"}, {"text": "just put in a car spoiler and boom 1000 fps on minesweeper"}, {"text": "I had a antec 300 illusion in 2011 :)"}, {"text": "You know 2011 was not that long ago right ?"}, {"text": "I think even in 2011 this was awfull tho."}, {"text": "I&#39;d like to see how much difference (if any) you&#39;d see in the cooling efficiency if you used a Noctua NF-F12 (static pressure) fan at the front and an NF-A12x15 (airflow) fan at the back instead of those &quot;gee whiz&quot; LED things that came with the case."}, {"text": "Shark? Syclone? Sharknado Case!"}, {"text": "That intro music!! Memories of videos that got me sub to u guys &lt;3"}, {"text": "Meshify C is awful if takes that much dust in the front!"}, {"text": "This case sucks man. The front looks like intakes but nooooo. No no no no."}, {"text": "My first build was in a Corsair 343 Elite. Thankfully it was a fairly low budget build so there was enough room for most of my components (mATX motherboard, mini sized GTX 750 etc.) but my power supply was a Corsair VS450 which is not modular. Having that many ketchup and mustard cables in such a confined space was such a mission to work with."}, {"text": "We need shaped tempered glass that can look like the acrylic on this case"}, {"text": "The first computer I ever built was in an Antec 900. It kind of hard wired me into my love of air cooling and stubbornness to adopt liquid cooling. Still today, that is the case that I base every build experience on. I didn&#39;t find a case that I thought was its equal until the Cooler Master HAF series. I&#39;ve built 2 computers in the Fractal Design Meshify C, and I feel that they are superior to the Antec 900, but the Antec 900 is close. I would LOVE to see an updated Antec 900 with a PSU shroud, better cable routing, USB 3.0 and C (but I think they added 3.0 a few years after I bought mine), and a tempered glass panel."}, {"text": "I like the old style reviews better as its stacks up pros against lows in the summary like CVPTV does"}, {"text": "I like side panel fans. I have an 8700k still in a Corsair Carbide 500R cause it still works great. I have 2 fans on the side panel, one blows cool air right in front of the graphics card, and the other one blows on the motherboard VRMs, which is great since I have liquid cooling and the VRMs wouldn&#39;t see much airflow otherwise."}, {"text": "I remember my dad&#39;s pc back in 2009 had 4 5.25 drive bays. He used a CD/dvd drive, CD/DVD burner, a multi card reader, and a casette tape reader to save his music and audio books digitally. It also had removable drive bays but completely lacked any cable management. Not even cutouts to get behind the motherboard tray."}, {"text": "Kinda surprised the PSU is at the bottom. Feels like in 2011 most cases still had the PSU placement at the top"}, {"text": "I remember putting together my first pc with just about zero knowledge of what I was doing.  I didn&#39;t even know what cable management was."}, {"text": "........water cooled rad....... Make it real. Like if u want it"}, {"text": "Because Aerocool sell those Shark fans separately and are actually good fans, think of Be Quiet! selling the Dark Base, supplying Silent Wing fans."}, {"text": "If you look at a case market it&#39;s kind of like smartphone market, first we had all of these smartphones that all looked differently and you could tell right away which phone a person has, now all of the phones look the same for the exception of some of the companies that usually fail because most of the ppl wanna see the same shit like thin bezels and wireless charging, and the same kind of design as everyone else, and if sony makes good phones but boxy looking design everyone all of the sudden starts to hate Sony for big bezels, and old design and shit like that. Same with cases, since 2000s we&#39;ve seen a ton of cases, but for the past couple of years ppl wanna see a case with a lot of RGB, glass panels EVERYWHERE, and inside radiator support, USB 3,0 and a rigid construction. Now if any company will try to do anything different, most likely for them it&#39;s be throwing money on the wind because it&#39;s design, it&#39;s manufacturers process but then everyone are most likely gonna hate that case...."}, {"text": "I was looking forward to this video. That case is actually more modern than I thought it would be. You should do another retro case build, going back to like 2006 or so. No cable management with those. No dust filter, and top mounted PSU."}, {"text": "Well, i have CM HAF X from the same 2011. It is propably better in some aspects than h500m that i am waiting for now, but i still want than amazing modern glass and rgb"}, {"text": "How about a 2018 second look at the Corsair Vengeance C70?"}, {"text": "&quot;Why would you ever need four 5 inch bays&quot;<br />fan controller, sd card reader, hot swappable hdd bay, dvd/bluray player, watercooling reservoir, etc.."}, {"text": "Hey, still running HAF-X with x79+393k here.. living on the past!"}, {"text": "I actually kind of like that case’s aesthetic"}, {"text": "It&#39;s easy why you have 4 3,5 cages, you can use multiple of them, you can put anHDD hotswap, or you can take them out and put a fan there bro"}, {"text": "Back in the days the CPU and video cards where not as powerhugry and it didn&#39;t generate as much heat as the stuff you out it in Dmitriy"}, {"text": "So that&#39;s a no accounting for taste."}, {"text": "That was my case!! ( the red one). And i tought it was super. Now i have a custom loop in a P3 with  custom wood accessories"}, {"text": "I could have sworn you had over 1M subs!!!??"}, {"text": "Can you suggest me a good cheap mid / full atx case for an asus z97 pro gamer and an asus 1080ti turbo (29mm long) because i&#39;m using a Zalman z-12 plus and i think it&#39;s trash because of it&#39;s bad airflow and NON-removable hdd cage that limits airflow.<br />Sorry for commas but i&#39;m tired. These are for you: , , , , ,"}, {"text": "You said that intro was a blast from the past, but I just though it was a Linus tech tips video starting off with an ad read by Ivan"}, {"text": "I have the Cooler Master Cosmos SE. it came in two variants, the glass side panel and the mesh side panel with dust filter. I chosed the mesh one as I was able to fix a 200mm fan on it. And that thing keep my 2 GTX 1080s pretty cool. Glass panel is just for the look, it keeps too much heat inside the case unless you go full watercooling."}, {"text": "Honestly, while I&#39;ve never been a big fan of crazy alien/spaceship designs on cases, I still think this particular case looks much nicer than a lot of the crap that comes out today. :) If only the jet engine cutouts were functional..."}, {"text": "that case-theme had something for everybody:<br />- Starcruiser-elements<br />- Shark-elements<br />- Cyclone-elements<br /><br />what else could you possibly want?"}, {"text": "song name?"}, {"text": "Not a great example of an older case. An antec 300 or CM 690 II would be better to give you an idea of an older case with decent for the time features."}, {"text": "Why four 5 1/4&quot; drive bays.... DVD burner, cd burner, card reader, &amp; fan controller was the norm back then, some people had a sound card controller up front... yes, I am an old ass gamer"}, {"text": "Dimitri I think the 4 bays slot is also for use for the fan controller. Aerocool has the strike x for example and is 2 bays use."}, {"text": "it would have been cool if the &quot;turbines&quot; were actual working fans =("}, {"text": "State of the art from 2011 would have been something like the Coolermaster HAF X i think.<br /><br />How about you go back even further? The Antec 1200 and 900 came out around 2007/2008 ish."}, {"text": "Dude, 4 bays to rip them DVDs"}, {"text": "the other 51/4 drive bays were populated by fan controllers and card readers too."}, {"text": "best case on the world"}, {"text": "one thing I want to come back is BLACK AND BLUE CASES, its all black and red or white and blue now days"}, {"text": "I want to see older cases! Like mid 2000&#39;s"}, {"text": "4 bays for 5 quiq swap drive cage or CD DVD  fan crontroller and maybe some extention from the motherboard"}, {"text": "OK, either Bulgarian or a Bulgarian girlfriend...or both? Anyway, честита Баба Марта на патерици!"}, {"text": "I think nowadays, gamers will trick out their rigs more with RGB LEDs, water cooling etc, glass sides to show off their work, while people who just want a workstation will just opt for plain cases instead."}, {"text": "1x DVD drive, 2x Fan controller,  last slots might be internal hot-swap drive bay"}, {"text": "Please go way back to the past. Do some millenial case review."}, {"text": "Funny, I made use of 4 slots easily back then, 1 DVD drive, 1 CD drive, 1 removable HDD rack, 1 card reader. The card reader I still use to this day, it is a godsend if you&#39;re a photographer or videographer"}, {"text": "I was recently thinking about that case funnily enough"}, {"text": "4 big bays would let you install fan controllers. A lot of those were huge and would go in those bays. Same with media card readers, some water cooling reservoirs, etc."}, {"text": "Nowadays we have RGB addiction! :P"}, {"text": "Nice"}, {"text": "that cyclone case looks like the equivalent of a super tacky extreme aero body kit on a honda civic"}, {"text": "Try out 2008 - Asus Vento 3600"}, {"text": "Yo, could we get a re-review of a corsair 760t in 2018?"}, {"text": "wow dude clean that filter lol"}, {"text": "one thing that i missed from the past, removable mobo tray!"}, {"text": "that old intro ;)"}, {"text": "I have this case..."}, {"text": "I like the accidental light art. I had an old Alienware case a while back. Almost no room for cables behind the mobo tray. Lots of lighting though."}, {"text": "I mainly use cases from the 90&#39;s because they are built better and some actually have surprisingly modern futures .<br />Anything they lack like USB you can add in using a Drive bay adapter ."}, {"text": "Please do that old style one more time please..... It just brings back memories. It&#39;s what made me subscribe you....!"}, {"text": "Im still using an Aerocool Syclone! lol. Been thinking about upgrading my case for 5 years :P more fun to shop around than actually buy."}, {"text": "I&#39;m curious just how bad the airflow is, given the front is closed-off."}, {"text": "BUT IS FRED HAPPY?"}, {"text": "Totally not worth the money to be honest.<br />Look at the quality-hype of 2005 , cases from Antec and Lian-li...sound dampening, solid fixings on the bays, a dedicated psu-chamber with again sound dampening etcetc..with high-end cases just going for 100/150€ with awesomely good airflow ...and then towards 2011 , like this case, developing less quality, more visual-bling , less sound dampening etc...poor poor development on these cases in this pricerange to be honest.<br />Even today..the prices of case of equal quality is just too high.<br />However, what I do like are the developments on open cases and very high-end desk/cases...that&#39;s lovely to see these days."}, {"text": "i think side fan section would be practical for side mounted gpus...but it would still need a dust filter"}, {"text": "Fkk me im buying one with some mods on there oh shit yeh.  Haha"}, {"text": "Can we go back to the glorious (for the time) Cooler Masters 690 II? It was a really great case for the time and I feel that even for today standard it&#39;s still an ok-ish product!"}, {"text": "Not that impressive considering NZXT Switch 810 came out in 2012."}, {"text": "points to the most dusty case i&#39;ve ever seen: LOOK AT THE DISGUSTING SHINY GLOSS DETAILS"}, {"text": "I&#39;m still using my silverstone ft-02 and I don&#39;t plan on Replacing it anytime soon. It&#39;s from the same era and cable management is not good but i still love it."}, {"text": "my first &quot;gaming&quot; case was the CM Storm Scout l , now I have the Tt The Tower 900, I don&#39;t think that I can get to mid tower again hahahahaha."}, {"text": "Just two 3 things, corsair + obsidian + 550d :)"}, {"text": "nice bro keep it up... :)"}, {"text": "CD, DVD, 2 x Floppy = 4 bays :)"}, {"text": "Probably should just delete the green lights completely to allow more airflow through the front of the case"}, {"text": "There was more for like a Fan controller with all the knobs! Or a SD card reader?  That is amazing how the case really supported cable management back then!"}, {"text": "it good to go back <br />once in awhile"}, {"text": "Blast from the past! 👍"}, {"text": "480p would be period fitting, right?<br />Back when the like/dislike bar was a lightsaber, I think?"}, {"text": "Also, with the poor VRM designs of modern sub-premium motherboards and the popularity of AIO coolers that all but eliminate direct airflow across the VRM, side panel fans would be an extraordinarily beneficial addition to restrictive modern cases. But, of course, that means that they&#39;ll never make a return, because airflow improvement options are &quot;so outdated&quot;..."}, {"text": "First case was the Antec 900. Literally no cable management to speak of, but god-like air flow included."}, {"text": "Fan controllers and card readers went into the 5.25&quot; drive bays. Motherboards in 2011 didn&#39;t really have PWM fans.  I had a 4-fan controller on my old case to control the fans."}, {"text": "Who else started with a prebuilt case?"}, {"text": "Why were there so many drive bays? For all the add-on crap that you could put in them, not limited to disc drives - a frustrating problem with modern cases that have all but eliminated drive bays. Just because disc drives and full-size HDDs have all but disappeared doesn&#39;t mean that there aren&#39;t still uses for them. How about mounting all of these case integrated lighting/fan controls in the drive bays. An add-on product that they could then sell individually as a universal piece that could be added to any case.<br /><br />Overall, this just sums up my feelings with modern enthusiast cases - not only have they hardly improved at all(build quality is about the only legitimate objective area of consistent improvement), but they&#39;ve only limited us with FEWER options. I fell out of the PC seen from about 2013 until about 2016, and, when I went to build a new PC(my 2010 era Phenom II X6 1045 + HD 5770 was definitely in need of upgrading...), it was REALLY disappointing looking through modern cases. It seems that the only focus within the industry at that point was &quot;Swedish design&quot;(AKA, visually nearly identical featureless hard cornered black boxes with solid front panels - I LOVE clean aesthetic design, but I&#39;ll be ecstatic when this God forsaken variety restricting design language dies...), often unnecessary glass, and RGB RGB RGB. Airflow didn&#39;t improve, cable management has barely improved(and you often have to spending 3 digits to get those improvements), and unique designs are nowhere to be found."}, {"text": "the slomo nod was saucey af"}, {"text": "IMO you should just look at some of the older fractal design cases, instead of that cheap looks over functionality case-thing."}, {"text": "I had a &quot;Casecom&quot; tower with a massive turbine on the front, looked great and provided lots of air for its time. I must admit I have a soft spot for over the top cases."}, {"text": "Dude, how do you get your sweater so clean bro?? Tell me your secret!"}, {"text": "In 2018 you still say fans like “fayyyyns”"}, {"text": "please check out the Enermax Steel Wing case"}, {"text": "Still got my old Aerocool shark fans. They are good on airflow but DAMN they get loud and they have finger eating serrations on the fan edge so they literally bite your fingers like a shark."}, {"text": "Cool retro review. Please do more from time to time."}, {"text": "&gt;Dimitri<br />&gt;hardware canucks<br />Ty che blyat??<br />Why is it called hardware canucks if everyone is European?"}, {"text": "Had this case for years! But everything ended up overheating. Just kept the lights and fans"}, {"text": "hmmmm  strip all those plastic &quot;effects&quot;  on the front... and replace the front with mesh  and its resembles a cheap entry case; a sharkoon T28 case"}, {"text": "What happen if I use 95tdp processor with 125tdp processor..... please tell me it&#39;s urgent"}, {"text": "Be honest, the exterior design on the front LOOKS BETTER THAN THE USUAL SQUARE CASES RELEASED TODAY"}, {"text": "Who else read the title as &#39; a terrible case from 2011&#39; ??"}, {"text": "&quot;why do you need 4 bays?&quot; Top was provisioned for either a 5.25 or a floppy, then a CD/DVD-ROM, CD/DVD Burner, and then a fan controller (or something similar... maybe a few hotswap HDDs).... it was easy to fill all those bays, just not everyone did it..."}, {"text": "My first major build was in the phantom 410. I still think it is fairly attractive but it is just SO bulky. What&#39;s more, you can&#39;t take the front panel off for cleaning your fans without having to remove anything in the 5.25&quot; drive bays. Additionally, the hard drive sleds were a complete nightmare. The built-in fan controller is a nice feature that I see lacking in many modern cases, so I miss that. I really dig the new compact style of cases that forgo 5.25&quot; drive bays in favor of radiator placements and a smaller footprint."}, {"text": "It&#39;s funny, I was recently tinkering with the idea of rebuilding my &quot;first custom pc&quot; after I found the old case at my local Free Geek. Wonder if I can find a pair of working 7950 GX2s."}, {"text": "Get a Dremel and cut slots under the scoops on the side panels, remove to LED&#39;s and put four small fans there. As for the 5.25 bays... a DVD-RW, DVD, fan controller, and lighting controller. They made more than just drives to fit there."}, {"text": "I actually like that case, it looks amazing. However, I would rather buy something that allows air to enter from the whole frontal panel, but if it weren&#39;t for the poor aiflow and I were looking for a case right now, if I find it cheap I would definitively buy it."}, {"text": "Still better airflow than the h500p"}, {"text": "Those side jets are the equivalent of go faster racing stripes"}, {"text": "The huge industrial looks of the Cooler Masters and Antecs were very cool looking at one time, now they are just massive relics."}, {"text": "I honestly love the older cases. I went out and bought a Alienware aurora from 2006. Still the coolest case out of everyone I know"}, {"text": "that is the ugliest case I&#39;ve ever seen"}, {"text": "ooooohhh the intro.."}, {"text": "I just bought myself a HAF-X,1st came out around 2010.  The reason I wanted it,no rgb,no glass and a 200mm door fan to help cool the GPU and NVME drive on the motherboard. No<br />modern case i found has a side fan."}, {"text": "The extra 5.25 drive bays are for fancy LCD touchscreen fan controlers"}, {"text": "Pretty sure I can find cases from 2011 selling in the stores here in Brazil. Plot twist: They&#39;re still expensive..."}, {"text": "Aww I was hoping you were gonna stick with that intro XD"}, {"text": "Does the 2018 case come with the plant, or is that extra?"}, {"text": "Stop copying other youtubers..."}, {"text": "I still use my Zalman Z-machine gt1000 case.  You should try to get one of them to review like this :)"}, {"text": "My first case was a blue Raidmax Tornado it was horrible to cable manage but it did have ok air flow..."}, {"text": "I could have sworn a different tech tuber did a review on this exact case. Or it might have been Gamers Nexus talking about the jet engines or maybe it was Hardware Canucks? Idk all the tech tubers blend together which is a good thing"}, {"text": "I’m still using a Corsair Air 540, mainly because I still need at two optical drive bays."}, {"text": "Woah, my NZXT Phantom 410 is getting old!"}, {"text": "I find it funny the&#39;re doing this subject on my birthday"}, {"text": "Oh, look. Review of old cases. The same thing Steve did some days ago."}, {"text": "should check out the silverstone rv02 made quite a bit ago and still to this day has the best airflow ever to be in a commercial case"}, {"text": "My case has 2 80mill fans on the side :)"}, {"text": "Awww man, old school. But still waiting for  a proper &quot;jet intake&quot; system in a case that actually brings air... Well I guess you could mod this... But put an old FX in it! Lol"}, {"text": "Such an awesome looking case! If it wasn&#39;t for the shortcomings such as airflow I would actually get it because I really like the science fiction appearance of it. Very good looking case. Would have been cool if the RGB worked. Also I doubt that we will have computers at all in 6 years. I think by that time computers will be chips in our heads, lol. Or maybe I&#39;ve been watching too many sci-fi series...."}, {"text": "I got a NZXT Phantom from 8 years ago, That case in 2018 is still amazing. Still ton of airflow, and very good cable management. Not sure you remember that Case, it even fits a noctua d15."}, {"text": "Usages for the 5.25 drive bays: DVD/CD Reader/Burner; Fan/light controlers; SoundCard front I/O; Extra MB front I/O; WC reservoirs passthrough for external WC systems; Removable HDD Drawers; card readers; etc... Accessories for these bays where very popular :)"}, {"text": "I&#39;ve got two ancient gaming cases that need recycling cos they cant fit anything inside them anymore (mainly graphics cards are too big for them now)."}, {"text": "The oldest case that i&#39;ve got, and still use for my main pc,is actually form 2009, the Corsair 800D, it&#39;s awesome in every way, but it&#39;s big, which btw i like, but it&#39;s missing some features, i does not have any front intake fan, 5 x 5,25 bays which is kinda useless. But it has so much room for cables. Love to see a video of it today"}, {"text": "NO FUKCING NO FANS ON SIDE NO BAD DOG BAD"}, {"text": "So those jet engine ducted fans are fake? WTF?"}, {"text": "Fans on the side panel was a very functional trend. Massive improvement on cpu and gpu cooling. Too bad it simply doesn&#39;t look good with all the visual trends from nowadays."}, {"text": "&quot;Look at the date&quot; we are not the first of April, however. My first pc was in 2011 and I took a Fractal Design not this weird thing xD"}, {"text": "I haven&#39;t bought a full sized case since 2012 (Corsair 550D), and I see no reason I would want a new one now unless I wanted to do an RGB build..."}, {"text": "it could easily pass for 2016&#39;s case interior-wise"}, {"text": "I shall never forget my Corsair 800D, what a HORRIBLE case that was for an insane amount of money."}, {"text": "Looks like my Dad&#39;s old Sony speaker."}, {"text": "I would like a 2018 review of the NZXT Phantom 820. Still hoping NZXT will launch a revised version of the same case as I like big towers."}, {"text": "What about something like AvP X6 case, 20£ with no fan but with psu shroud and acrylic side."}, {"text": "Try checkout coolermaster enforcer next!"}, {"text": "Main reason for many 5.25 inch drive bays was that hard drive space was at a premium  but you could store tons of data on discs"}, {"text": "That static discharge on your finger! Ouch🤪"}, {"text": "Why you put a plant in top of a case🤔🤔🤔🤔😑😑😑😑"}, {"text": "No no no no no. Forget the gloss on the meshify c. The dust O GOD the dust. EXPLAIN YOURSELF!"}, {"text": "I HATED the cheesy case designs back then.  There’s a reason why that was my gaming laptop phase."}, {"text": "I love this series. Make more videos for old PC items please."}, {"text": "Fitting intro for this case.  Great video Dmirty"}, {"text": "This case is gross. Really impressive cable management and internal paintjob for the time."}, {"text": "I&#39;m using a Corsair C70 - A case that doesn&#39;t look like every other case on the market. I wish more unique cases existed, but there isn&#39;t many."}, {"text": "I still have the NZXT Zero, the first OG full-tower from NZXT with an aluminium chassis. The thing is huge, but it barely fits anything in it. Could barely get my HD 7950 in there. Cable management is a mess. Watercooling? Mount it on the outside and drill some holes in the case. Taking out the drive bays? Forget it, it&#39;s all riveted in. I can&#39;t even get my Thermalright Ultra Extreme 120 to fit in it without removing 2 of the 4 side fans, and then it STILL touches the side panel. <br /><br />Yeah, cases back then kinda sucked."}, {"text": "4x 5&quot; bays for DVD RW Drive x2, Removable HDD bay, and ofcourse the USB, MicroSD/SD/CF card reader."}, {"text": "Why do so many cases in 2018 look so boring compared to previous years"}, {"text": "Cherry Mx power swithces"}, {"text": "i just viewed your infinity war trailer, can&#39;t wait to see you in action!"}, {"text": "Fractal R2 was from 2010 and still is perfect. Silent and quite decent airflow. Still fits all necessary components, including 240mm rad."}, {"text": "Hey, I remember this one, back in the day I thought it looks cool. Thanks for the vid!"}, {"text": "Im still using a case that’s from 2009 actually.<br />It’s the Xigmatek Midgard which back than was like a 70€ case.<br />It’s nothing special but it’s actually really well built. Heck I’d say that it’s more sturdy than today’s 200€ cases, like you actually need to put effort in to try and flex the motherboard tray even a little bit. Today’s cases are really flimsy in comparison. <br />It even came with a fan controller and an external SATA connector at the front and back. The only thing that I’ve changed over the years is one case fan because the one in the front started rattling a little bit, apart from that there is no scratch whatsoever. <br />Pretty cool thinking about it especially considering it’s price back then."}, {"text": "This case is even nicer than mine..."}, {"text": "Back in like 2011-2013, I really liked the dragon crazy angled cases but matured into a old-school modern hybrid case"}, {"text": "Holy fuck, clean your room! - At least vacuum your room once a month... Or in your case, at least once a year.<br />My computer is rarely cleaned, and I&#39;ve removed the dust filter from the intake. Yet when I clean it, it is nowhere near as disgusting as your front panel."}, {"text": "I actually use a 5.25 inch drive bay for extra usb ports on the front of my case and a dvd drive so the fact that modern cases don&#39;t have them annoys me a little."}, {"text": "Perhaps it’s just me, but I do miss the “gamery” designs back in thoe days, gaudy as they can sometimes be."}, {"text": "I do have a fan on the case window. It helps a lot with GPU temps, like a LOT! But unfortunately, you can&#39;t make a glass panel with a fan."}, {"text": "For the question of 4 dvd bays: If you&#39;&#39;re a pesky pirate in 2011 and you make a bit of side money by selling cd with games/music/films to the neighbourhood you need 2 dvd roms and 2 dvd-rw so you can write those pirated dvds efficiently."}, {"text": "Ye"}, {"text": "Believe it or not, I am STILL using a case from 2009. The case itself, is an Antec Super Lanboy (that&#39;s the aluminium one). Back then Antec was one of the top quality/functional case maker, that was also not overly expensive. And yes, it has done its job all this time, even though airflow and cable management are not very good. I did though DIY&#39;d two side fans to try and get some more airflow (mostly since I&#39;ve always ended up using AMD CPU&#39;s, which get hotter than Intel). No reason really I haven&#39;t changed it, beside the fact that I always try to get the most use out of the hardware I buy (another example is I finally had to retire a still working slot-load IDE Pioneer DVD-Rom drive about a year ago, with my last motherboard upgrade that didn&#39;t have IDE on it). But the last time I upgraded the innards last year, I still found it was a very decent experience."}, {"text": "Lol, this case is better than mine :)"}, {"text": "reveiw the cougar mx 330 its a great budget case sometimes finding it new for $25 with tempered glass on pc part picker"}, {"text": "i built a pc for my grammie with this case.....shes 99 and terrified of it, keeps telling everybody she can, the aliens are visiting her."}, {"text": "who cares about gloss plastic ? The ONLY thing you touch on a regular basis is the power button, as long as this is not gloss plastic who cares ?<br /> (and this also apply to your comments about brushed alluminium it DOES look great, so who care if it does take fingerprint ?  Nobody touches his case all day long, this is not a relevant point to make)"}, {"text": "Today I just want a tiny ITX case with no windows and optimum air flow."}, {"text": "Sure, let´s ,ake fun of old technology. Cause that´s funny."}, {"text": "I would love to see a functional jet themed PC case. Make it all silver aluminum with visible external rivets and functional jet engine air intakes at the front with 120/140mm fans.  They should also have a programmable module tapped into the power button so that you could add in something like an afterburner low fly pass on boot or something. I&#39;d probably do something silly like have Will Smith yell &quot;I have GOT to get me one of THESE!!&quot; as mine. That would be awesome. &quot;I ain&#39;t heard no fat lady!!&quot; lol"}, {"text": "can you check out the newer aerocool cases? Doesnt seem to be any reviews on them"}, {"text": "I still have my old thermaltake xaser III from 2003, There is today not many cheap, goodlooking cases today with e-atx support"}, {"text": "tfw GN did something similar just a couple days before"}, {"text": "I&#39;d kill for an Apevia X-Jupiter Full Tower case... anyone wanna send me one? ill pay!"}, {"text": "I reconigzed you 2 months ago, so this nostalgic intro, people have experienced, is something i can&#39;t relate to"}, {"text": "loving the classic intro"}, {"text": "All you need is mesh sleeved ketchup and mustard psu"}, {"text": "could you put AIO on side panel?"}, {"text": "Do you not have any pride? How the heck is your computer so dusty?"}, {"text": "ammm my Phantom 820 is for 2012 and dont look like that (Thanks god)"}, {"text": "@Dmitry, I still have a case from 2004, that I used to build my brother&#39;s 1st custom system in."}, {"text": "I actually think it&#39;s sad almost all new cases are form over function. LED, tempered glass everywhere and bad airflow. I would like to see side-fans make a comback, also I want to see fewer cases without 5.25 bay I actually still use them for my hot-swapable ssds, also I want more cases that prioritize airflow over style."}, {"text": "I wanted one of these so bad When they launched"}, {"text": "I see a lot of potential in this case!"}, {"text": "The first PC I built in was from the early 2000s and had 5 optical drives with 3 CD drives with one drive only able to write to a CD, and a AM FM radio below the fan controller, in those slots, as the case had a acrylic side side panel with a 2 80mm fan attached to the side panel, and also had the power supply above the motherboard tray; and didn&#39;t have any cut outs to pass cables thought the case back of the case as there was no back section to work in, and came with a fixed hard drive cage at the front bottom of the case."}, {"text": "GN did that a week ago"}, {"text": "Gloss accents are still present because not everyone has your exact taste."}, {"text": "I just want the smallest possible case that comes with a liquid cooler pre installed for a thread ripper and a titan v.<br /><br />With 12x 3.5 inch drives and 2 optical drive bays (5.25 inch i think)"}, {"text": "My first case was a budget Antec workstation case from circa 2007. No cable management, no side or top fan mounts, 4 or 5 5.25&quot; bays, 2 external 3.5&quot; bays, and it came with a power supply and a floppy drive. We&#39;ve evolved a bit since then."}, {"text": "What happened to the case you were designing Dimitri?  My next build would be in that one!"}, {"text": "I&#39;ve got an Antec 1100,.  What&#39;s funny is that while the case in this video  looks cooler than mine, mine actually is cooler, literally!"}, {"text": "I have it and i like it.I built my pc in 2016 and put the best components at the time in it . Last year i put a 1070 in it.I kinda like it because it&#39;s different"}, {"text": "5.25 drive bays were (and are!) very useful for things such as fan control or information panels, removable hotswap SATA drive slots, or card readers, in addition to the always useful Blu-Ray/DVD drives. The current trend in cases is to remove all of them, which is a shame, since it forces my desk to be some kind of frankenmonster of cables and external USB cludges."}, {"text": "My first build was a decade before this case came out... Unfortunately the system I just overhauled felt like a painted version of my old case without the acrylic window or the acrylic face... Bitphenix Outlaw... not a very classy case... Cant decide if im going Fractal, or waiting for the O11 air"}, {"text": "4 5.14&quot; drive bays since 2 were usually used for optical drives, one for a card reader and the last for a fan controller"}, {"text": "The new Thermaltake c70 has side panel fan mounting"}, {"text": "This case does not represent the case market in 2011. Define R3 was released 2010 and is better than this case in every way. This case has design that was blast from the past already in 2011."}, {"text": "Cyclone shark starcruiser. It works"}, {"text": "That cpu cooler can <b>LIQ</b> ... my balls."}, {"text": "Can you the same review on the NZXT Phantom 630 please ?"}, {"text": "7 years and manufacturers still could care less about air flow (the single most important factor of a case imho) and care more about catering to gamers (from jets to rgb it&#39;s still useless looks crap)"}, {"text": "Worth buying?"}, {"text": "That old case kinda looked like a speaker at first."}, {"text": "my 2016 pc case looks like it belongs in the 90&#39;s era, super white and metal everywhere xD + I&#39;d mod that case and put pod air filters on the intake where the engine looking parts are and make it an all out fan :D"}, {"text": "ironically, i got hold of a semi old case CM n300 for a build and realized it was a more pleasant experience then i expecrted as i could very quickly tuck all cables behind a off center hdd cage and as it will be a WS build i had more then enough HDD cages to install without the modern cases limit of just 2 mechanical and 2 ssd.<br /><br />best part is it had a crudely gap for use a different located front ports for different models, i could if one attached a hook in a corner install a 3x 120 fan setup on the front."}, {"text": "Not enough woodgrain...<br />LGR would not approve.<br /><br /><br />More old cases please!"}, {"text": "About 3-4 years ago I built my first computer in a rosewill galaxy-01."}, {"text": "I guess he has never seen the 2 or 3x 5.25&quot; to multi-3.5&quot; hard drive cages that would go into those 5.25&quot; bays?"}, {"text": "Considering I was still using a super x alien case from 2003 I’m sure a 2011 case is not that bad. This dude is acting like 2011 was ancient times. Also yes there is airflow coming through the front. There’s slots that you can see right through when you had the door open. They also had removable hdd brackets in 2003 and removable motherboard trays in 2003. This guy sucks."}, {"text": "What&#39;s the point of the turbines if you can&#39;t have 4 small fans there???"}, {"text": "Side Panel Fan... YES!! ( Filtered though )"}, {"text": "You should mod this case and see if you can improve this case."}, {"text": "$100 for this case? In 2011 the cooler Master haf 912 was $60, with great air flow, something that many modern cases don&#39;t have anymore."}, {"text": "yea cases in 7-8 yrs from now will sprout wings/ self levitate and there will be no cables cos everything will be wireless !!!"}, {"text": "THE INTRO"}, {"text": "Perhaps take CD drive covers out and drill a fan hole in top under jet engine fins? Then the vents wpuld actually vent..."}, {"text": "atleast this case is somewhat interesting in it&#39;s design, LED&#39;s and blue interior unlike most of the junk on the market today which seem to think the solution is to just throw more glass at it"}, {"text": "Dimitriv looks like one of those videos of The Mansion of Nacho vidal LOL"}, {"text": "I think you missed the fact that this case was premium back then, which is why it has standard features of today. If you took a 50 dollar case back 2011 and compare it to 2018 50 dollar case, i imagine it would be a lot different"}, {"text": "Nice but would like to see you do some build in cases from backwhen where you are using parts from that time"}, {"text": "this case jumped the shark"}, {"text": "You could get watercooling resevoirs in 5.25 inch bays. Iy was really helpful with cases that didn&#39;t have very good watercoolung support"}, {"text": "it was ahead of its time"}, {"text": "5.25 inch drives are actually super useful, even today. Anything from installing multi card readers for content creation, multi or single slot reservoirs, fan controllers, and like you mentioned even dvd/blu ray drives. I kinda of hate that they&#39;re mostly gone now."}, {"text": "Are you going to do a ryzen dualboot hackintosh build?"}, {"text": "I sadly say that I wasn&#39;t watching this channel 7 years ago."}, {"text": "hear me out... what if they were going for.... wait for it... a sharknado aesthetic??? it all makes sense, now."}, {"text": "Some would say that this case is almost as bad as.... a paid dyson vacuum review <b>puts on sun glasses</b>"}, {"text": "Why 4x 5.25&quot; slots? well, DVD-W + DVD-R, Fan controller and HDD Enclosure for fast insert/removal :)) oh the memories"}, {"text": "Fucking hell mate, clean that meshify case!"}, {"text": "Back in the day I had two CD/DVD burners and two removable hard drive enclosures. Now I have no optical drives, two SSDs and one HDD."}, {"text": "I had a zalman z11 plus, then when the s340 elite was released I moved my system into that"}, {"text": "I had to check 2 times to be sure this is new..."}, {"text": "OMG the old intro!!!!!"}, {"text": "My meshify c is as dusty as mine lol. Have to clean it once a week"}, {"text": "I will NEVER buy a Case without side panel fans.  Mesh modded Corsair Carbide C200R FTW! (I cut out the front panel, and put metal mesh behind it, as well as sawing through a bt of the HDD cage the blocks some of the bottom front panel airflow. Then, I have mounted my top Cougar Vortex 140mm fan on the OUTSIDE of my case, using a 140mm to 120mm adapter with mesh fan grille, ot actually looks badass IMO, like those stupid votrex things, only FUNCTIONAL!)"}, {"text": "Still Rocking my Corsair 600T"}, {"text": "I have a BeQuiet Silent Base full tower now... it uses thumbscrews and it&#39;s not that old.  Quiet as hell.<br /><br />My last case was the Lanboy Air (I know alot of people hated it but it was actually decent).  Sold it.<br /><br />I remember WAY back though, I had a knock off case that was made to look like an alienware (oh god how bad it was...)<br /><br />But then I had one that literally every OEM had the same version of, can&#39;t remember now what the hell it was called but I&#39;m sure someone here knows what I&#39;m talking about)...  The front grill was non removable and solid plastic, with cutouts that were kind of curved/angled upwards.  I&#39;ve been searching around google images and couldn&#39;t find it at all, all I know is that all of them 85% of the time were completely unbranded"}, {"text": "I love the throwback at the beginning."}, {"text": "You know it’s an old pc case when it comes with a red sata cable"}, {"text": "&quot;We have this disgusting <del>dust</del> gloss on the interior panel... not cool.&quot;<br /><br />Jesus, Dmitry, clean that front panel! lol"}, {"text": "This was a fun video. I would like to see more retro cases."}, {"text": "That case was hideous garbage, even in 2011. My Antec Solo that dates from 2006 is much nicer (still using it). Heavy steel in a nice piano gloss black,  filtered front intake fans, nice captive thumb screws, swing out side panel of HEAVY steel. Sure the Solo isn&#39;t up to date in many areas, but isn&#39;t as awful as that thing."}, {"text": "it&#39;s the PC case from Console Wars animation"}, {"text": "That case is absolutely disgusting.  You should do more of these reviews. Also, your Meshify case is filthy bro."}, {"text": "I used to own that case.... man what was i thinking."}, {"text": "Meanwhile my case is still a Z11 since 2013 ^^"}, {"text": "The case looks nice.<br />And nothing against gloss - if it is done correctly it can look nice. kinda like the case - a bit of modding - adding fans to the intake-fakes :P<br /><br />I have a 12 year old PC case standing around - well, it was for professional use, 3 ways to mount the mainboard (up to E-ATX), fully customiseable drivecage and so on. The case is very sturdy and heavy as fuck - i think it is 1mm steel.<br />And an office-PC that has a nice 140 backside intake fan with dustfilter and an airduct going directly to the CPU. Really great for cooling, but no dedicated GPU and only a 4x PCIe1 slot."}, {"text": "ahhhh, i had a classic antec 900. i have videos on my channel :D"}, {"text": "l0l the intro looks hilarious in 2018"}, {"text": "No it’s not, that b roll is too sexy for 2011."}, {"text": "Idk, i like it."}, {"text": "why not review a new case with old fashion video? would be a good idea lol"}, {"text": "Nice review, love the revisit of of old hardware.<br /><br />But about airflow, what if the second front fan was installed, would that help the airflow so the CPU would not throttle?<br /><br />Generally, I would like to see reviews with stock fans, and then a comparison with the case modified with additional fans. Many cases have more room for fans. This is especially relevant when it comes to the cheaper cases that comes with maybe one or two fans, but with the possibility to add more fans."}, {"text": "The jet engines should intake air"}, {"text": "Dope af"}, {"text": "Caseking is awesome! :D i buy all my hardware there"}, {"text": "zalman z9. I have a video of building a server inside one released right before the new year."}, {"text": "The shark and the cyclone is a prophecy about Sharknado. They were right."}, {"text": "I love side panel fans.  It&#39;s great because it helps cool VRMs when you&#39;ve got AIOs and some of them give you extra GPU airflow.  Kinda ruins a vertical mounted gpu tho and that&#39;s a shitty trend people enjoy so what do I know."}, {"text": "Amazing video, again."}, {"text": "for hot GPUs yeah the side-mounted fans are VERY useful."}, {"text": "Nice work, I like the reviews for some old hardware. I have the Azza Hurricane 2000, a case from 2010, if you could find some to review it would be great. I personaly think it&#39;s holds very good today, even with some mod it could be even better."}, {"text": "Before this was even released, I had my CM Storm Sniper. And it was so much better than this one. Especially in terms of airflow :)"}, {"text": "Aerocool makes really cool cases imo"}, {"text": "Why 4 slots on the front ? Well, 1 DVD writer, 1 Bluray reader, 1 dual slots reobus fan controller :)<br />In any case (ah ! ), my CoolerMaster HAF 932 from 2009 is still great at making sure dust is evenly covering my components :D"}, {"text": "Gotta say these unusual designs are adorable in a way. But what is this? Nice side-panel window with airflow options, but no built-in vertical GPU mount? Crazy!"}, {"text": "it may be old, but i&#39;m still in love with my NZXT Phantom 530 &lt;3"}, {"text": "I actually checked the upload date  if this is 2011 or 2018..."}, {"text": "lol Corsair AX760i ... horrible PSU .... good luck with that case and system .. watch out for the PSU overheating when the fan doesn&#39;t turn on because of the design flaw and horrible 4 year old Link software that still doesn&#39;t function properly ... don&#39;t ever use &#39;sleep&#39; mode .. if you do .. make sure you unplug the internal USB connection and plug it back in or the fan wont work and your computer will shut down unexpectedly if you are doing anything intensive. <br /><br />Stay away from Corsair crap ... they used to be a company that put out quality but they got greedy .. started putting out all kinds of different products and spreading themselves so thin they cant or don&#39;t want to waste the money on quality control anymore .. now they are pumping out overpriced garbage and trying to skate by on their reputation"}, {"text": "Am i dreaming cos I have a strange feeling that someone else also re-reviewed this case a few months back ???!!@???"}, {"text": "Can you maybe review CM690 II by Cooler Master from the same era? It&#39;s got a usb 3 version (it&#39;s called advanced and it might be one of the hidden gems of that generation being both really useful and rather cheap too)"}, {"text": "I still have a case with the power supply on the bottom. <br />Get on my level..."}, {"text": "Newer cases look like minimalist art with a touch of RBG while these older cases look like 1950s cars."}, {"text": "Oh the days of 3-5 full size drive bays. I can’t speak for everyone, but I have a PC that was built in late 2011/early 2012 (whatever week Ivy Bridge released in the US), and I used 1 bay for a normal DvDrw, another for a Blu-ray lightscribe rw (oh those laser etched graphics on discs were kick ass, then another bay for a 17 in 5 card reader and some extra front USB, then I popped one of the other two bottom covers off and put 3 really old (like p2 old) cpu fans side by side (I obviously removed the heatsinks) for extra airflow. Wow those fans were tiny. Two came from a dual p2 system where the other cpu went into a pci slot. Definitely looked cool for the time, though the case itself was much more understated, and the door hid the fans. That left one spot empty, which I thought about putting a front midi and eq in for retro games, but never got around to it. The cable management in my case was also ATROCIOUS. Airflow: B+, cables? If you did not have a drill you were screwed. Tiny holes, no space, no gromits, nothing as I think they assumed you’d toss them in one of the 11 total bays; well 14 if you count the 3 ssd which were way too expensive to be feasible for all but the really cool kids then.<br /><br />Oh, side fans. I like them, but if the temps are good, do you really want a fan screwing up the look of a slightly tinted tempered  glass panel? Probably not. Acrylic thumbs up, tempered glass, nope."}, {"text": "Upgrading a 1999 systemax computer was my first case experience lol."}, {"text": "MOD IT!! WATER COOL IT PLEASE!! THIS CASE HAS POTENTIAL!!!"}, {"text": "you should modify this case so that the front air hole things actually function to fix that airflow, paint it, use some cablemod cables, cut out a bigger hole for a larger acrylic side panel window, use better fans...and then sell it and donate the money to charity"}, {"text": "I always put a fan in the extra 5.25&quot; bays, I would have tried to remove some of the front panel parts that block airflow, and I bet the side fan would have helped your temps. Otherwise,  I think this was a pretty cool case, of course it&#39;s over the top styling, but they did have some good ideas for 2011"}, {"text": "Now everyone&#39;s gonna be like: &quot;I want an old case.&quot; 😂😂😂"}, {"text": "Still think it looks cool"}, {"text": "Damn that intro though. 😍"}, {"text": "review of an ancient case from 2011... build my current pc in 2011.."}, {"text": "It&#39;s ok as long as it doesn&#39;t have RGB cancer"}, {"text": "Wait this vid aint from 2011??"}, {"text": "So upsetting the turbines arent airflow :("}, {"text": "Transparent forsenCD"}, {"text": "My first black Antec gaming case build was pretty much &quot;plenty of room to put things in, add fans, cram in all the cables &amp; and hide all my mess &amp; shame with the windowless side panel.&quot;"}, {"text": "Aerocool Cyclone 2 vs. Antec GX909!"}, {"text": "DVD drive, Fan controller, card reader (SD, MD and stuff) and a removable case for HD, which was good when portable HDDs where not cheap and mainstream thumb drives where in the 16gb max unless you had too much money to spend on a thumb drive, some of them had usb and power supply, so you could remove it from your computer and easily plug into another if needed"}, {"text": "More side panel fans in 2018!!!"}, {"text": "where is the skylakeextreme build"}, {"text": "Hooked up? With a case"}, {"text": "That intro good old memories."}, {"text": "awww that intro tho! Missed it so much...."}, {"text": "RGB and Tempered glass can both go die in a fire for all I care.  and do we REALLY need a PSU shroud anyways?"}, {"text": "Bring back the sd card reader!!! I&#39;m sick of having an add-on for such a common item."}, {"text": "Am i the only one here who double check when was the video published after the intro plays"}, {"text": "I still love my 5.25 bay drive for my card reader and fan controller :P"}, {"text": "It was very easy to fill four 5,25 Drive Bays back in 2011. I had 2 CD (later DVD) Writer, a 4 channel Fan Controller and a 3,5 HDD Mobile Rack. :) Now I have only one DVD Writer, and Thats I&#39;m gonna keep."}, {"text": "How old is fred ?"}, {"text": "ＡＣＲＹＬＩＣ　ＳＩＤＥＰＡＮＥＬ"}, {"text": "I got confused with the old intro, I accidentally skipped to an old video."}, {"text": "bro in my thoughts this is the case from future 2020😎"}, {"text": "This is absolutely one of the ugliest cases I&#39;ve ever seen."}, {"text": "That case from 2018 looks terrible"}, {"text": "Had to check the upload time. Confused me"}, {"text": "dusty b0i"}, {"text": "Back in 2011, when Antec, Zalman and Cooler Master&#39;s HAF series were so dominant in the market"}, {"text": "When you said 2011 was back in the day I feel old now lol"}, {"text": "Dmitri I dare you to put your pc in that case"}, {"text": "that is one strange case lol. you can see that now its all about tempered glass and about good looks."}, {"text": "I was like wait how old this is only to relize that its your old into for that case ×p"}, {"text": "So basically comparing two boxes 😂"}, {"text": "Side panel fans work. A better modern application would be interesting to see implemented.<br />You could modify that case into something relevant."}, {"text": "Remove the potted plant on top of the case!! Very distracting and doesn&#39;t do much!! I&#39;m sure u love the plant, but it has nothing to do with a jet turbine inspired PC case! A jet or something futuristic I can forgive, but this plant just doesn&#39;t belong there.. Sorry Dmitri and plant, I know the plant has been real good."}, {"text": "Do a rereview of the corsair c70 !"}, {"text": "Why 4x5.25 drive bays? When I built my first PC from the ground up (around 2003), I had a case with 5x5.25 drive bays. I had a DVD ROM drive, a DVDRW and a CDRW. The CDRW was faster burning CDs than the DVDRW was. The DVD drive was for reading. I had a Fan controller also, with temp sensors. I had planned on adding a control panel from the top of the line soundblaster from those days. If I had ever added the soundblaster I would have filled all five 5.25 drive bays. I had two 3.5 external drive bays, both filled. One with a floppy drive (needed to load drivers for raid) and the other had another fan controller for the cpu fan."}, {"text": "Please tell me that not only Eber had a dyson vacuum ! It&#39;s needed to clean up that very very very very very dusty Meshify C !"}, {"text": "<b>Do a 4000$ PC build please?</b>"}, {"text": "god the intro!!! so much memories :)"}, {"text": "This would be a great case to mod. Paint. make the front jets functional for air flow."}, {"text": "it&#39;s the galactic sharkclone the follow up to sharknado and in space."}, {"text": "Got a red and black version to sell?"}, {"text": "That intro actually made me explode of nostalgia!<br /><br /><br />AeroCool were so ahead of their time that they even predicted the &quot;NO AIRFLOW&quot; trend."}, {"text": "CD, DVD, Floppy, SD card reader. That&#39;s why it has so many bays :)"}, {"text": "Its smells like bad quality :D"}, {"text": "that intro holy shit i was 11 when i watched that video"}, {"text": "This case would&#39;ve gotten you laid back in the day"}, {"text": "You speak and people still buy i5 2500.."}, {"text": "Haha i remember this old style"}, {"text": "why the fuck dont you clean ur meshify?"}, {"text": "Paint it grey/beige for a Star Trek Enterprise build"}, {"text": "This case reminds me of the upgraded street sweeper from the movie Robots."}, {"text": "Old Intro. Rip NCIX."}, {"text": "I have been waiting on this"}, {"text": "A fan on the side made as much as 7 degrees difference for me in a case that already had front intake fans. I think it was one of the most stupid decisions to get rid of them so you can watch internals through a window that now need to be louder to keep the same low temperature, or hotter to keep the same low noise level."}, {"text": "Thats one dusty Meshify C..."}, {"text": "Lmfao i was gonna get that case when i was thinking of building my first pc"}, {"text": "What up?"}, {"text": "Here under 50 views"}, {"text": "The intro 😍😍"}, {"text": "Hello,Dimitri! Can you review the MARVO HG9012 Headset? I bought one for 50 bucks,I got a very nice headset. USB Connection,green lighting and 7.1 surround sound!<br /><br /><br />MARVO is a Romanian brand,I think,I am saying this because this brand is very popular in Romania."}, {"text": "yeeeee boi early"}, {"text": "Ooo new intro"}, {"text": "I did pretty much this exact video about week ago. Except mine case was from 2007. Take that. :P"}, {"text": "The intro.... Bringing back memories"}, {"text": "Can it fly?"}, {"text": "First"}, {"text": "You ain&#39;t first"}, {"text": "Good"}, {"text": "1st"}]