[{"text": "At <a href=\"https://www.youtube.com/watch?v=8RIqJDDgtU8&amp;t=7m30s\">7:30</a> <br />line number 10 <br />Can someone please explain these terenary operators , how is he using it"}, {"text": "It would be really cool to see LC 1186 with dp[N][K] implementation!"}, {"text": "Hey! I’m newbie , where should I start from, which videos should I start watching in order to learn algorithms ?"}, {"text": "You are my inspiration.Please keep uploading your <a href=\"http://videos.it/\">videos.It</a> helps me understand how to  approach a problem"}, {"text": "I am a huge fan of you sir!"}, {"text": "If you teach me how to code then I will work for free for you"}, {"text": "Please make a video on Leetcode problem 407."}, {"text": "Can you also upload live coding of CF rounds after contest are over"}, {"text": "Errichto, should I Solve leetcode for interview preparation?"}, {"text": "When will be the next streaming?"}, {"text": "His coding logic is so clear. Like.. Mozart making a symphony.. 👍.. Keep inspiring us.."}, {"text": "This makes me wann kill myself. How is he even able to think so quick?"}, {"text": "playlist on hard combination and permutation problems. generating function and FFT etc pls"}, {"text": "I just want to be able to do medium problems man, I wish there was a defined clear way to get better.<br />I admire you dude, the amount of work it takes to get to this level must be huge. I hope you achieve what you are aspiring for!"}, {"text": "Thank you Sir! Nice video ✌️"}, {"text": "what is the meaningful definition of dynamic programming? whats the next step in programming languages?"}, {"text": "Thank you"}, {"text": "This video really helps me a lot .<br />Can you please suggest a book for dp or any references"}, {"text": "I really appreciate your videos errichto! But it would be great if you avoid medium difficulty questions like 2nd &amp; 3rd and stream nice problems like the 1st one."}, {"text": "Thanks man really help full could u please upload something of graphs.thanks..."}, {"text": "Man, you are a talent!!!"}, {"text": "Lol, does leetcode video, buys leetcode t-shirt soon.  Legend."}, {"text": "Thanks a lot for this, this kind of video is really helpful"}, {"text": "You rock dude!!"}, {"text": "I wonder how good you are at DP you imagine them so quickly and dimensions and dp equations. Someday I aspire to be as fast as you. Till then continue streaming about Dynamic programming."}, {"text": "Very Nice! I saved the problems on Leet Code. If I have some issues (for sure I will) I will come to this video!"}, {"text": "This video really helps. Thanks!"}]