[{"text": "Waaaaaaaayyyyyyyyyyy toooooo slowww"}, {"text": "<a href=\"https://www.youtube.com/watch?v=1KMPGpSd7XI&amp;t=2m05s\">2:05</a> just saving the part I&#39;m working on."}, {"text": "Jane , thank you so much for this marvelous tutorial !   :-)"}, {"text": "Thank you very much your continuous help. Could you do a tutorial on Bach&#39;s Aria BWV 515 (Anna Magdalena). Thank you."}, {"text": "Thanks for posting darling!^^"}, {"text": "This piece, I learned piano off of.  There was a certain section I never learned."}, {"text": "Hey Jane, everything&#39;s fine? My name is Miguel and i am a young pianist starting my college right now here in Brazil... So I had the idea to record some pieces that I decided to learn and post on YouTube as a remembrance, however, I found the reception my video had cool (Even without pretensions) so I&#39;m trying to see if I turn my channel into something about piano to these future videos. I uploaded as the first video of the channel this piece, the quality is not the best yet but I did my best for the moment. Can you please give me some critics and advices about it? I would like a lot if you can listen to me and give some advices if you have them. Thank you, peace.<br /><a href=\"https://www.youtube.com/watch?v=IQK4qjdM9XE\">https://www.youtube.com/watch?v=IQK4qjdM9XE</a>"}, {"text": "I want Santa Lucia. Ah, BTW remember i&#39;m from the Philipines?"}, {"text": "Are you guys listening out there?<br /><br />Jane has asked us all for a $1 contribution to help a young penniless young man to buy a digital piano to help him developing his extraordinary skills so he does not have to pay rents to work on classical works he treasures.<br />We all know what we all ow to Jane’s daily dedication for making tutorials for tastes and all levels of piano music.<br />The figures can’t lie : 112 656 subscribers  74 093 753 views… That tells a lot. Doesn’t it?<br /><br />Dozens of us have requested tutorials from Jane and where very pleased when she duly delivered them.<br />Many have expressed their thanks. Meaning many of us owe much much more than $1 worth of gratitude to Jane.<br />Any objection?<br />So please guys, now is the time to show your gratitude to Jane. The money is not going to fill Jane’s wallet. Instead, it will help a very deserving young man to perfect his skills the same way many of you are lucky enough to do with the piano you owe.<br />No act generosity there. This is will only show your gratitude to Jane.<br /><br /><br />GoFundMe page: &quot;HELP SEAN GET A PRACTICE PIANO&quot;<br /><br /><a href=\"https://www.gofundme.com/cffmp-help-s..\">https://www.gofundme.com/cffmp-help-s..</a>.<br /><br />Many thanks in advance."}, {"text": "Bonita pieza"}, {"text": "Hola querida Jane.Yo otra vez,tratando de aprender Para Elisa.Es maravilloso lo bien que enseñas.No te cambio por nadie.He aprendido muchas piezas de tu tutorial,y para que no se me olviden trato de tocarlas todos los dias.Así mantengo mis neuronas bien ocupadas ja ja.Un abrazo desde Chile."}, {"text": "Tank you ! :)"}, {"text": "I        doubt that Beethoven would have believed that this was his most<br />loved piece of music, <br />he must be laughing at all the other  compositions which simply never made it to this level of popularity, and  all  that unnecessary work..............."}, {"text": "your math tutorial got me here.....<br />very nice<br />keep up the good work.<br />stay thirsty my friends!"}, {"text": "Bonjour Jane, <br />J&#39;ai trouvé la partition, je vous remercie. Quel magnifique morceau de vie !<br />Christine"}, {"text": "Bonjour Jane,<br /><br />J&#39;espère que vous allez bien. Avez vous fait un tutoriel sur le nocturne 20b en do dièse mineur ? Je vous en serai très reconnaissante.<br /><br />Bien cordialement<br /><br />Christine"}, {"text": "Jane eu amo você, sou do Brasil e aprende a música &quot;sonata k.545 .<br />eu vou fazer uma apresentação com ela,  graças a você!♡"}, {"text": "Jane, thank you! You&#39;re helping me a lot!"}, {"text": "En cetin yerini cala bilmirsen mallll"}, {"text": "Thank you very much for this tutorial! :)"}, {"text": "Thanks."}, {"text": "👏🏼👏🏼👏🏼👏🏼👏🏼😅"}, {"text": "good vidéo i am french"}, {"text": "Like, Thanks again."}, {"text": "Es de Mozart"}, {"text": "Hola  Master Jane  Agradecerle por los videos tutoriales  me sirvieron mucho le pido que aga un video  turorial de  Piano Sonata No.3 in B-flat major, K.281  y saludos desde Juliaca San Roman"}, {"text": "at the 2.50 minute mark, when you play the the E-Eb-E-Eb-E, why on earth would you swap hands in the middle of it to play the last bit with the left hand? This makes no sense to me at all!  There must be something about this I don´t get. Please, Jane, explain this to me :)"}, {"text": "Una vez más gracias Jane !!!! siempre eres mi salvación ."}, {"text": "Jane!!Need ur advice!!I can&#39;t read notes but I can just memorize the whole keys..I could played part 1 in 3 days..is it good or bad?They said it is bad habit..."}, {"text": "증말로 꼼꼼하게 잘갈커주십니다 감사합니다,,,ㅋㅋ"}, {"text": "extraordinar. chiar am învățat."}, {"text": "I can do that but diffrent way"}, {"text": "Could I played this song in keyboard? Cuz I dont have any piano yet ;~;"}, {"text": "Do I have the level to try this  ? this is my 2nd year of piano learning  (I&#39;m a beginner ). Tx for thé video anyway.  You made it looks easier"}, {"text": "Awesome! I love this! We&#39;ve a few keyboard video way too."}, {"text": "Hola Jane! deseo felicitarte por los excelentes tutoriales que has subido, para personas como yo que muy tarde en la edad tienen oportunidad de poder aprender he encontrado en ti la forma mas didactica para ver si lo que uno va aprendiendo va teniendo sus frutos, nuevamente muchisimas gracias!"}, {"text": "this deserves more likes"}, {"text": "Amazing, thank you"}, {"text": "Its the best way for memorizing fur elise beethhoven <br />Thank you"}, {"text": "Level?"}, {"text": "The part with the eight consecutive E-s is so weird"}, {"text": "I love it sz"}, {"text": "I played fur elise before Jane!"}, {"text": "Hello Jane<br />Could you upload a tutorial for Brahms Hungarian Dance No. 5 arranged by Cziffra.  I can provide the sheet music if you need.  <br /><br />Thanks "}, {"text": "Thank you Jane for Tutorial, the only video help me, i will share my first part very soon :)<br />thank you again &lt;3"}, {"text": "Great tutorial Jane! thank you for sharing"}, {"text": "You have beautiful hands, and no I&#39;m not being a pervert. :)"}, {"text": "this is cool tutorial i memorize the step on how to play eethoven fure elise thanks "}, {"text": "This is amazing except a little slow... Probably the sheet music"}, {"text": "thank you very much &lt;3<br />You&#39;re the best teacher.<br />please upload the Canon in D tutorial ^^ <br />. love you ^^"}, {"text": "I have grade 4.  If I study your video (Part 2) really hard, I can probably play this ?  Thanks for playing this song very slowly for us.  You are so nice."}, {"text": "You&#39;re fingers are so long haha. Longer than mine and I&#39;m a guy! Not that that&#39;s impossible, just that I wish I got long slender hands instead of these short stocky stubs. I can only reach a damned octave..."}, {"text": "Bonsoir Jane,<br /> J&#39;ai 52 ans et je viens de faire l&#39;acquisition d&#39;un piano Angot &amp; Elbeuf que j&#39;ai accordé .<br />Donc votre vidéo très bien décomposée me permet de me lancer dans cette aventure de l&#39;apprentissage .Merci Jane."}, {"text": "Thank you so much yes I recived your email did you recived mine back. I just send one back =) "}, {"text": "I take just 1 week to play Fur Elise."}, {"text": "Really great tutorial, thanks! I just want to know why changing hands at <a href=\"http://www.youtube.com/watch?v=1KMPGpSd7XI&amp;t=2m50s\">2:50</a>."}, {"text": "Thank You for this :). It&#39;s right what I needed "}, {"text": "Dear Jane, <br /><br />here comes a message all the way from Holland. First I wanna say thay I&#39;m loving your videos, I think you do just great !! Please keep on making these.<br />I do have 1 request If I may. Can you post / play a song from The Disney Movie Pochahontas named Listen to your heart. I just LOVE this song sooo much and I was looking for a great tutorial by this song but Injust couldn&#39;t find it. Would you maybe please make a video with you playing teachinf us on the piano, like all your others video&#39;s. But please that 1 from pocahontas: Listen to your heart. You will make me verry happy I wanna play dat song for a long long time now. please teach me =) I saw you did Colors of the wind too. I love Disney. Wel I hope you will consider it.  excuse me if I make some writing mistakes. Iam from holland you know. <br /><br />Well I give you my best and wish you much luck with your page. I hope to hear from you.<br /><br />Greats From Amsterdam <br /><br /> C."}, {"text": "Can you play this song slowly please"}, {"text": "So can tell me where are you from? You&#39;re very good teacher ! Thanks you!"}, {"text": "Thank you very much)))"}, {"text": "jane, please upload the tutorial richard clayderman theme Coeurs D&#39;Or 1990 greetings from mexico"}, {"text": "Thanks!"}, {"text": "So-good-teacher..."}, {"text": "Belíssimo! Emoção a mil!<br /><br />Wonderfull! Emocion at million (?) per hour!"}, {"text": "Thanks, Jane! You&#39;ve done some amazing tutorials! :)"}, {"text": "Lol"}, {"text": "Estou tão feliz. Meu Teclado Yamaha Psr E343 chegou há 3 dias e já consigo tocar uma parte dessa música.  Olhando pela partitura."}, {"text": "Her arms looks kinda like Mamas arms from the movie Mama"}, {"text": "Hi Jane its me Paul :) hehe from germany, your fan hahaha :-D a nice idea for your next tutorial would be My Lonley Road... that would be awesome ! :-) "}, {"text": "Jane (I made this tutorial), trying to reply to a question, got message &quot;You are not allowed to comment on this post.&quot; What is wrong with Google+?<br /><br />Reply to @John Turk First part is easier, about level 3, 2nd part level 5"}, {"text": "what grade is this?"}, {"text": "Thanks for replying to my comments, you are very kind!"}, {"text": "Jane ,BeatBoxer Is a Music using you&#39;re Mouth Parts Like Sound in *Wonderful-Taste ( Like a Eating Apple you say Hmmmmmm!.. Wonderful-Taste ) ok :) Thx alot of Für Elise and im 11 yrs old :3."}, {"text": "Good job Craig. Don&#39;t know what Beat Boxer is. But I am planning to upload &quot;homework&quot; to my channel. Let me know if you&#39;re interested."}, {"text": "Thx fo the Learn i Learnred myself and im a Beat Boxer I try this at Home and thx for u Jane :3 Next time i have Für Elise Beatbox at my Video will on Nov 8 or 7 , 2013\n\nThx."}, {"text": "you are absolutely right. names of keys are only for communication purpose. those sight-reading music must mentally form a direct link from the printed note to the piano key. and bypass the name of the note completely."}, {"text": "Thanks, i have only learnt the first part but i did it so quickly because of you! I find it hard to learn with all the notes and stuff, all i really need to know is how to play it, not what the keys i&#39;m pressing are called! "}, {"text": "I think you are kidding, but still, please do not hurt yourself, incorrect hand position and posture can result in hand and back injuries. you can learn from young prodigies perform on YT. most have excellent form. have fun and good luck :)"}, {"text": "good job on learning it yourself, that is the ideal :)"}, {"text": "Thank you, I learned by myself and i was not sure about if i did it right, until i watch your tutorial."}, {"text": "exists distortion... but thanks anyway :)"}, {"text": "Nice hands.."}, {"text": ":)  good luck! "}, {"text": "im learning how to play the piano and i thought that i could impress my keyboard teacher by playing it lets see if i learn :)"}, {"text": "You&#39;re welcome. Thanks for writing!"}, {"text": "hating will get you nowhere. read the comments and think? what is Ken K doing wrong? i will  help you if you write back."}, {"text": "you&#39;re welcome, and thanks for writing."}, {"text": "Thank you very much Jane for this lovely tutorial. \nRegards.\n"}, {"text": "I hate when someone posts a video calling it a &quot;tutorial&quot; but there is no tutoring. Kind of hard to learn when all you video is yourself playing. And way too hard to judge which keys you play versus just put your finger near. Sorry."}, {"text": "You&#39;re very welcome. Glad you can play with both hands together now. Your English is good (I do not know any French!). just one word correction:  &quot;made&quot; instead of &quot;don&quot;. have fun  :)"}, {"text": "you&#39;re welcome. re request, sheetmusic has to be sent to me, then request posted under my request video. detailed instructions are on my website. good luck :)"}, {"text": "Thank you for all the great tutorials on your channel !! They are very helpful. Could you maybe do Dietro l&#39;incanto by Ludovico Einaudi ? \n\n"}, {"text": "thanks :)"}, {"text": "THIS IS AWESOME!!! "}, {"text": "you&#39;re welcome. you must be a good student. hope you are learning to read music :)"}, {"text": "It&#39;s really helpful. Thanks alot, now I can play this beautiful song :)"}, {"text": "wrong approach. ideally, learn to read music and follow along with the score. until then, watch my finger movement, not what&#39;s under them. your brain has mirror neurons that enable you to copy MOTION. use your ears too."}, {"text": "you&#39;re welcome. enjoy!"}, {"text": "Thanks!!! GRacias!!!! I will Practice Following you !!! Million Thanks!!!"}, {"text": "Nice job but I can&#39;t see you play the notes of the second part because your hands are blocking it"}, {"text": "For the LH, A and E will sound nice. and thanks for writing! :)"}, {"text": "Thank you for the video, it&#39;s so helpful!   You have nice long fingers so it&#39;s easy to see what notes you are hitting..    \nCan you give an alternate chord ending for me?   My short stubby fingers can&#39;t stretch that wide.   I can&#39;t get the A with my pinky (left hand) without getting  B as well. :)   Thanks."}, {"text": "I greet :-)"}, {"text": "you&#39;re welcome"}, {"text": "Danke schön."}, {"text": "you&#39;re welcome :)"}, {"text": "that&#39;s good, and..."}, {"text": "Thank u"}, {"text": "This helped me play"}, {"text": "glad it helped, and you&#39;re welcome :)"}, {"text": "нет слов\r\n.."}, {"text": "read comments and you will see most hold the opposite opinion. uh oh, why?"}, {"text": "not tutorial, slow motion,   gaaaaaaaaayyyyyyy"}, {"text": ":)"}, {"text": "Прикольно"}, {"text": "thank  you"}, {"text": ":)"}, {"text": "buuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuaaaaaaaaaaaaaaaaaaaaaaaaaaaa exelent\n"}, {"text": "thank you for your praise :) I know you will play better than I soon!"}, {"text": "you are good player I´ve been playing since the age of 3 and I can not still be around for a very ;D,  you are MASTER!!!"}, {"text": "&#39;more faster&#39; You have more important things to work on than nitpicking someone&#39;s tutorials."}, {"text": "Not very sharp are you? I wasn&#39;t aware tutorials should be played fast. &gt;.&lt;"}, {"text": "you must be a good student :)"}, {"text": "amazing lesson i&#39;ve learned it so fast!!!!"}, {"text": "thank you :)"}, {"text": "muy bien mostrado goood!!!!!"}, {"text": "Thanks. Have made a few more since then ;)"}, {"text": "EXCELENT VIDEO MAKE MORE PLEASE!\n"}, {"text": "faster is already a superlitive btw. "}, {"text": "People like you can not be helped, with or without talk."}, {"text": "Just stop. (face palms)"}, {"text": "Bet you can&#39;t even play a single part of this you moronic imbecile "}, {"text": "lol. will leave comment as exhibit A  :)"}, {"text": "Didnt help what so ever u should&#39;ve talked to help others you moron"}, {"text": "This part is quite easy, so answer is yes. There is a &quot;children songs&quot; webpage that is a fine way to start for adult students reading notes at the same time. Other easier pieces are marked with an asterisk * on the &quot;piano tutorials&quot; page. Good luck :)"}, {"text": "IS this a piece you would recommend for a beginner to try ? Also I remember seeing a section of beginner videos on your channel some time ago, however I can&#39;t seem to find them anymore. Please help. Keep up the good work"}, {"text": "Nice :)"}, {"text": "I am happy for you. You must be a very good student :)"}, {"text": " This helped alot, thank you :). I was having trouble at first, but I thought I had bad positioning with my hand. My class is jelous that I can play more of this song after only having piano for 5 months. Thank you soo much :)"}, {"text": "this is very hard and it s very good\n"}, {"text": "is that logical? :)"}, {"text": "thank u so much . God Bless .\n"}, {"text": "you&#39;re welcome. good luck on the second part:)"}, {"text": "glad it helped. you&#39;re welcome!"}, {"text": "thank you. i was looking for slow version. i learnt the first part. thank you. God Bless\n"}, {"text": "really helping! thanks!"}, {"text": "yours is a nice message to wake up to. thank you :)"}, {"text": " hello my dear teacher    my dauther is learning this melody thru your video , you make it so easy to learn ,      thank you very much i appreciate it  "}, {"text": "you&#39;re welcome :)"}, {"text": "I have learnt the first riff by seeing this video thanks alot for uploading this."}, {"text": "they must have been proud of you, me too  :)"}, {"text": "thx,\nyou are the only one that does it slow. I played it to my family and I was really good! thanks again"}, {"text": "You&#39;re welcome. Glad to hear of your accomplishment."}, {"text": "Thanks it help me ! Now I know how to play this song more faster and smoother"}, {"text": "do you know the word &quot;tutorial&quot;?"}, {"text": "who said they are not? :)"}, {"text": "You Guys shoulda learn staves"}, {"text": "good job. I&#39;m proud of you! :)"}, {"text": "Thank you so much. Today I showed to play this to my music teacher and, Okay thank you so much.\n"}, {"text": "we knew :)"}, {"text": "thank you :)"}, {"text": "i mean should"}, {"text": "the other tutorials were so confusing and this is the best tutorial ever! or shoul i say №1 tutorial!"}, {"text": "1 hour ever\n"}, {"text": "You&#39;re welcome. Glad it helped! :)"}, {"text": "Thankyou! Helped alot!! "}, {"text": "glad it&#39;s useful :)"}, {"text": "Useful, thanks!"}, {"text": "you&#39;re welcome"}, {"text": "thanks \n"}, {"text": "you&#39;re welcome. glad it helped :)"}, {"text": "orrorosoooooooooo\n\n"}, {"text": "you&#39;re very welcome. good luck with it."}, {"text": "I have always been looking for a piano tutorial like this and finally I am here.Thank you for your patience to film this vedio. &lt;3 ^V^"}, {"text": "it is free on imslp dot org"}, {"text": "not really, but thanks :)"}, {"text": "You&#39;re awesome :)"}, {"text": "im looking for the piano tutorial of the ELEANA by paul de seneville played by richard clayderman ; could you make a pisno tutorial of this theme??? please.."}, {"text": "yes, use the webpage (description link)"}, {"text": "do you have the notes pleasee!! or the sheet\n"}, {"text": "thank you"}, {"text": "imslp dot org is the best﻿ source of classical music in public domain"}, {"text": "you have beautiful hands"}, {"text": "please see &quot;requests&quot; page on my website (description link)"}, {"text": "You could make a video tutorial of Hachiko - Goodbye Piano ????? PLEEEASE"}, {"text": "congrats on your nord stage 2. nothing&#39;s too good for a beginner :) good luck learning this famous piece. but, ahhh... my piano playing is not at all brilliant ;)"}, {"text": "This is simply perfect... I click on the video I learn and then I don&#39;t need a teacher, this is simply great, you only learn those you reallly want to!"}, {"text": "thanks, glad you liked the tutorial :)"}, {"text": "wow so much patience!  your awesome! Mahalo for the tutorial "}, {"text": "you&#39;re welcome :)"}, {"text": "Thanks a lot...!!"}, {"text": "do you mean the second part? best is to click the webpage (description) for links back to youtube."}, {"text": "yes, many have :)"}, {"text": "Great tutorial! Does anybody learn the second ending?"}, {"text": "glad you like it. yes. Beethoven works are in public domain. Info is on webpage - description link  :)"}, {"text": "glad you liked it, and you&#39;re welcome :)"}, {"text": "Best tutorial I have seen thank you kindly "}, {"text": "almost? i might make a slower one just for you :)"}, {"text": "and could even slower\nI almost fell asleep"}, {"text": "oh no, but thanks :)"}, {"text": "your great"}, {"text": "my goodness, thanks! I don&#39;t deserve the praise, but I do care :)"}, {"text": "glad it helped :) "}, {"text": "Your videos are so helpful. :)  You&#39;re very talented."}, {"text": "thanks for such a kind comment :)"}, {"text": "and index finger for the B?  it&#39;s okay. But the 4th and 5th fingers must learn to coordinate side by side. practicing the E major scale will help."}, {"text": "happy for you :)"}, {"text": "Very nice of you to play it slowly... This is the best tutorial I got in YouTube!!! Thanks a ton.. It&#39;s only because of you I learnt to play fur Elise..."}, {"text": "trop lent et des accords innapropriés avec d autres méthodes vous apprendrez plus vite et plus juste"}, {"text": "me faltaba la parte de la otra mano graxxxxx"}, {"text": "it&#39;s a good video, but maybe a bit difficult to look on both left and right hand at the same..."}, {"text": "many learn from this, wonder why you can&#39;t? because you did not bother learning to read music and want to be spoon fed. Because you need to resort to swearing, you are blocked. Stay away from my tutorials, I do not make tutorials to help brats like you."}, {"text": "bai nay hay nhi\n"}, {"text": ";O Thank you!!"}, {"text": "please visit the webpage (video description link) for links to Part 2."}, {"text": "Great job &lt;3 I&#39;m looking all over youtube for the second half of the song. I&#39;ve known for years how to play this part, but I can never seem to find a slower version of the other half of the song ;c "}, {"text": "Johnny Welch should get credit. Apparently the attribute was more a mistake than a hoax. Your pointing out the fact should help. Thanks."}, {"text": "thanks for letting us know. why such a hoax?  the statement on how to behave is certainly a good one."}, {"text": "please see &quot;Requests&quot; page on my website"}, {"text": "Can you show how to play a song Taverdiev&#39;s &quot;The Little Prince&quot;? Thank you that you teach others ..."}, {"text": "searching (Ctrl_F) the word &quot;level&quot; on this page will lead you to answers"}, {"text": "Which is the level of this song?"}, {"text": "ok tnks ;) "}, {"text": "This is the way to do it so brilliant even a dummy like me has hope xx"}, {"text": "Interesting. I just play it with the right hand anyway. I prefer to use economical fingerings than fancy ones, unless of course I see a strong reason not to (e.g. exercises). I hope I&#39;m not doing something horribly wrong by that. :D\nThanks for the tutorials. :)"}, {"text": "I don&#39;t comment on Youtube until now and it&#39;s just because you&#39;re amazingly helpful, especially for someone who doesn&#39;t know how to read music how to play piano. "}, {"text": "yes :)"}, {"text": "Thanks for the tutorial, does practicing the right and left hand separately help when learning to play a new piece? "}, {"text": "sure, the same ones who fall asleep in class :)"}, {"text": "Does anybody fell as\nsleep on their piano?\n"}, {"text": ":)"}, {"text": "I&#39;m so glad I have you on youtube... :)"}, {"text": "thank you, i should have tried to explain why Beethoven wrote it that way. I never asked any teacher or scholar, so I could be wrong. I assume alternating hands keeps the melody flowing better, and it&#39;s more fun to watch? "}, {"text": "he has a point."}, {"text": "you are all very welcome :)"}, {"text": "Please view my channel it would mean alot"}, {"text": "Thank you so much ! This really helps me ! =D "}, {"text": "THANK YOUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU "}, {"text": "Lololol I play it really weirdly..."}, {"text": "It&#39;;s easy .. "}, {"text": "I have a sheet of it"}, {"text": "I visited your website and I have to say that what you have done is unbelievably amazing and generous! Anyone who makes critical comments should be ashamed of themselves. I have always wanted to learn piano (I&#39;m 48) and many piano teachers do not want to give lessons to someone my age. Thank you so much for your website!!"}, {"text": "Excellent tutorial, thank you!! Playing it slow like that helps me to make sure I use the correct fingers on the proper keys! Well done!! :)"}, {"text": "yay i learned it\r\n"}, {"text": "thanks, but no foul language under my videos"}, {"text": "THANK YOU VERY MUCH, It&#39;s amazingly helpful. Thank you a lot."}, {"text": "nice, I will help me a lot, since I can play only this part one, not two, and there were a few notes that i playng wrong... so, thanks!"}, {"text": "The great Latin American writer and Nobel Prize winner Gabriel Garcia Marquez,﻿ dying of cancer, passes on his last words on how to live, among these: &quot;I would probably not say everything I think, but definitely think all I say.&quot;"}, {"text": "POR DIOS *-*"}, {"text": "Nice and thanks"}, {"text": "Part 1 is at most level 3, but part 2 is level 5 (my guess that one who has been playing for 5 yrs can learn this easily). &quot;easily&quot; is a key word here."}, {"text": "What level?\n"}, {"text": "That was very great and ... ZzZzZz"}, {"text": "you are very great! thank you for all this! its awesome! :D"}, {"text": "this is very useful.  please ignore the whiners."}, {"text": "I want you to learn to read partitures also. my tutorials are you to follow along while reading the score. i made 3 silly lessons on reading music to get you started. try those?"}, {"text": "come check out my version of fur elise"}, {"text": "Focus on my finger movement, not what&#39;s under them. More importantly, follow the sheetmusic. I started this project to inspire you to learn to read music and be less dependent on tutorials! :)"}, {"text": "I think it would be helpful when dictating notes or pointing out the keys in the keyboard. Just suggesting"}, {"text": "Thank you !!! &lt;3"}, {"text": "Grazie per averlo postato :))"}, {"text": "request link is in profile or website. good luck."}, {"text": "please make a tutorial for &#39;i&#39;ll take manhattan&#39;"}, {"text": "merci bcp bcp c&#39;est un garnd travaille vous donnez un grand aide pour que les gens puisse jouer du piano classique merci thanks very much"}, {"text": "because Beethoven wrote it that way. "}, {"text": "look again... LOL "}, {"text": "imslp is the best source of free classical music"}, {"text": "@cosunnyd i&#39;m happy for you :)"}, {"text": "I recently bought a Casio CTK4000 61 key keyboard, and it comes with a built in lesson for Fur Elise. I learned it quickly but was unsure whether it was an accurate version, so I watched your tutorial for reference, and it is correct . \n\nI enjoy your videos, you play beautifully. I took piano lessons at age ten for awhile, but stopped them after almost a year, but I&#39;m learning again through visuals instead of sheet music... At age 25.\n\nMy keyboard also has Sonata op. 27 no. 2 &quot;Moonlight&quot; 1st mo"}, {"text": "@diamanti224  Gratz bro."}, {"text": "@bbdhrggl \n\nyou are an Angel  ....God bless you!!!  Many, many, many .... thanks."}, {"text": "@gabi4ctin  debussy arabesque no. 1"}, {"text": "Hi, how knows what is this﻿ melodie:    h   t    t    p       kiwi6.com/file/7wieyt1ort"}, {"text": "i soo  much wanna learn this after my exam"}, {"text": "Perfect, thank u ! ♥"}, {"text": "@TheQwalkson the score is written that way :)"}, {"text": "I Love this!"}, {"text": "Thank you."}, {"text": "@TheBrianAwad pls follow request instructions "}, {"text": "Hi. Can you please put Giovanni Marradi&#39;s Dreams for a piano tutorial. Thanks!"}, {"text": "i learned fur elise by myself and my mam and granda told me to go to piano lessons.when i got there, the teacher said can you play anything i said a bit and played fur elise and he was amazed.\n"}, {"text": "please check out my channel im 9and play fur elise,godfather and will be uploading much more videos soon"}, {"text": "Wow so hard for someone who has been playing for six years by teaching themselves."}, {"text": "@ckim0324 my guesses: Part 1 is Level 2, Part 2 is Level 4."}, {"text": "What level is this?"}, {"text": "Anyone else find this super relaxing?"}, {"text": "Thank You Very Much :)\n"}, {"text": "@ellenellie100 you, and all who have thanked me, are very welcome."}, {"text": "Thanks, i found this very helpful, "}, {"text": "@MOHH2COD4 Beethoven wrote it that way. :)\n\nMight be interesting to follow the score (free on imslp), even if you do not read music yet."}, {"text": "@redlittleteapot Beginners Step by Step Tutorial of Fur Elise On Yamaha EZ-200 Keyboard [Right Hand Part Only] This is how i Learned! its Real Easy! Learned in  just 10 Min. !!!!!! Love this song"}, {"text": "@redlittleteapot am sure you can. learn a few measures at a time. count! and have fun :)"}, {"text": "hi, just found our old portable electric keyboard , and I want to learn Fur Elise ( which I always want to learn), hopefully I&#39;ll learn this piece from your tutorial even if I do not have any background in playing the piano, thanks a lot for this video :)"}, {"text": "thanks for ur nice easy way of learning this difficult song.\ngopu from india"}, {"text": "@GeorgeChar95 have no idea what that is. sorry."}, {"text": "@bbdhrggl yeah the scales i hate them but we all have to do this chore:)\nThanks! By the way, do you know the tabs for &quot;Gloomy SUnday&quot; from Rezso Seress???? I&#39;ve been scanning the whole google for days but found nothing:( If you do have it, it would be also a great idea to make a tutorial for it since it&#39;s such a beautiful melody. (i am always talking for the original piano version of course)\n\nThanks again:)"}, {"text": "@GeorgeChar95 practice the hardest ten measures: play them very slowly with the metronome, when no mistakes are made increase the tempo a tiny bit, soon you will get to tempo. For technique, are you practicing scales? The Little Pischna book is good.  Play slowly and don&#39;t move on until perfect. Good luck."}, {"text": "@bbdhrggl  i am 17 and i play the piano since i was 10. So i guess i play the piano for 7 years already. But i stuck at the fast part. Do you know any ways or methods to practice that part and learn it? Thanks:)"}, {"text": "puur verveling\n"}, {"text": "Thank you so much. Don&#39;t listen to the inmature people complaining about your hands. They&#39;re perfect. And so is this tutorial."}, {"text": "Bien tocado pero mas rapido"}, {"text": "bien tocado peero aburridooo\n"}, {"text": "@diamanti224 that&#39;s a wonderful story, i wish you continued happiness playing the piano"}, {"text": "Thank you very much,i learned part 1-2 when i was on summer vacation,then when i went to my school i told to the teacher what i learned,and the students including the teacher,been suprised,because i never had know hot to play piano.Then when i saw this,about 3 months ago,i asked my parents if they could buy me a piano,because this inspired me to play piano.Then from that day,i am practicing everyday piano,and for now,i am learning Turkish March Part 1.Thank you very much again!"}, {"text": "@satriani32 yes, i remember you and am glad to hear of your progress. I am well, thank you.  :)"}, {"text": "Hello, remember me? Just wanted to say I learned this piece on my own and my sight reading is getting better, trying to follow the finger suggestions in the sheet music especially in the lively part in the the 2nd video on this tutorial. Thanks for inspiring to play piano with the #14 3rd movement and as far as I&#39;m concerned your video editing is great, some people just wanna complain, I think you do a great &quot;job&quot; on these videos especially since they are free on youtube, hope you are well :)"}, {"text": "@hawkmoth11 my job? :)"}, {"text": "@Calvin8076 it is your job to learn to read music. don&#39;t blame others for your shortcomings. "}, {"text": "@MagicallyFat  the beethoven the sonatina in G is nice and fun, the bach minuets are popular. go to the SONG page on my website, the pieces marked with a * are easier"}, {"text": "@bbdhrggl which one is easy, cause i can play this one really well. but my finger placement is all wrong its like im almost typing thats how i do it"}, {"text": "@MagicallyFat we were all like that. we have to train the finger muscles gradually. start with the easiest pieces. not this one. good luck."}, {"text": "how come i cant properly lift my fingers (more than one finger movees when i try to move ne)"}, {"text": "@sofad15 you must be an athlete too  :) yes, we workout every day"}, {"text": "2:35 no entendi que fue (: ??"}, {"text": "i&#39;ve just made a cover thanks to your tutorial :) please watch and comment :)\n/watch?v=QGxoE2ikHP0&amp;feature=player_embedded\n"}, {"text": "Oh. thanks a lot.\nIt&#39;s very Cool\n"}, {"text": "Merci pour cette vidéo !! (from Belgium ;) )"}, {"text": "Thank you so much for this tutorial! It really helps."}, {"text": "Wou, me gustan tus manos (: y pues una forma de tocar despacio para los que apenas estamos aprendiendo :D! genial!! (: "}, {"text": "i Just Learned it.. Its not this good.. But check it out! :) /watch?v=Ix0uQwNAG5s"}, {"text": "@crazygirlFaithie27 lol, that offends yourself, not me  :)"}, {"text": "exelent.  I hope  you  up load  more   videos  like this   tks   I  like  very  much"}, {"text": "ur tutorial helped me very much!!! thanks for making it!\n"}, {"text": "@NintendogsHelping are your sure? ;)"}, {"text": "@tamedtiger11314 hi, was she surprised?  :)"}, {"text": "The speed is fine. I can follow what she&#39;s doing without panicking. It&#39;s great for a beginner like me, and I mean a total beginner. I&#39;m teaching myself how to play piano from scratch."}, {"text": "@MilsterandFloza \nThe speed is adequate for the learner/beginners. It is my case. If you already know how to play, and is finding it too slow, you should not be watching this movie, there are other videos with multiple choices, including records for speed. Show some respect. Thank you, dear bbdhrggl, for helping me. Keep it up."}, {"text": "thanks man\n"}, {"text": "@bbdhrggl Yeah,I know ,but money is the problem nowadays !"}, {"text": "@zekson008  if money is no problem, it would be better to take traditional lessons. a teacher can see what you are doing, and give personal advice."}, {"text": "Thank you on this ,man do not need to take classes after lectures like this one ?"}, {"text": "I LUV YOU&#39;RE VID!"}, {"text": "@TiTaNiK211 i know\n"}, {"text": "I wish i had bigger hands, my hands barely reach an octive...:P\n"}, {"text": "@MilsterandFloza thanks, that is actually a compliment. I could have gone even slower to help more viewers."}, {"text": "look his/her hands..."}, {"text": "@2regine26clair6 see a shrink? ;)"}, {"text": "@rapzee98 thanks:)"}, {"text": "get your piano tuned!"}, {"text": "You are amazing! You know that?"}, {"text": "Simplemente excelente!! Gracias..."}, {"text": "Love your video, specialy that is slow so I can learn and then do fast. your video is the best. thanks from Mexico\r\n"}, {"text": "@prelude6x6 That part you are talking about is repeated exactly, later in the song. Just go by that part. You&#39;ll notice that the camera is moved over. Look at the C that is printed on the piano and how it &quot;moves&quot; over."}, {"text": "Thank you SO MUCH for slowing this down. That part where the 5 e&#39;s are played always confused me!"}, {"text": "@MeganMarshmallow102 hi, thanks for writing. I rarely put notes on my tutorials because i rather you learn to read music, it is a useful skill. i made 3 silly lessons on reading music. once you understand the principle you will find it easy. use others&#39; reading tutorials to continue advancing. good luck. :)"}, {"text": "Nice video this will help me alot. It must have been so Dull recording that video XD good on ya!"}, {"text": "so nice eeeeeeeeeeeeee"}, {"text": "@MegaHabboAddict who knows? you might have some of that dna in you too"}, {"text": "i love it!!"}, {"text": "@Mistikey1 imitation is the key"}, {"text": "@Mistikey1 did imagine"}, {"text": "Hola sabes tocar  imagine? bueno espero tu respuesta bye cuidate"}, {"text": "hola me gusta tu video pero yo creo q le falta un poco de explicacion porque  no se nota casi que tecla tocas :D BUENO SALUDOS CUIDATE :D"}, {"text": "@prelude6x6  let&#39;s try closing yours eyes and listening... whatever notes you hear are correct. the video transitions are not optimal. glad the tutorial&#39;s useful. :)"}, {"text": "@ricsiloli that&#39;s nice. make sure you use correct posture. lypur tutors that."}, {"text": "THX, this is the tutorial i was serching for~~ im on the second part of the song...and the speed is perfet for meh to follow~~"}, {"text": "great lesson !"}, {"text": "THANKS SO MUCH!\r\ni just got a keyboard 2 days ago and i&#39;m one lazy guitar player player who can&#39;t really read sheets well (i&#39;m workin on it)... so this is great!!"}, {"text": "@blittzzzzz I believe you.  :)"}, {"text": "thanx for showing.. im up to my 3rd part now.. im only 10. ive been playin since i was 8. i can play bryan adams and beethoven. and richard clayderman :D.. im not lieing"}, {"text": "Did a great job on Moonlight sonata tutorial, the best on youtube."}, {"text": "@PrinceACE8 Some people are mad at the world. I don&#39;t blame them."}, {"text": "@bbdhrggl did I neglect to put it in the video description? well, I just checked, it&#39;s there... so I added one view. Always read the descriptions, I put important info there."}, {"text": "@Jigsawszilard I&#39;m glad you can&#39;t"}, {"text": "@fantasyfair2009 ooh, this is for third year students? there are many other good and easier classical pieces on the Monkey Song List.\n\nHow to judge whether you are ready to learn a new piece:\nIf you can sightread it through without a lot of  trouble, then it is the correct level for you."}, {"text": "aaahhh too complicated...im such a begginer :(("}, {"text": "Thank you so much! The tutorial is perfect !!"}, {"text": "i love your hands."}, {"text": "you made it very easy for me to study it. :) thanks."}, {"text": "@pelmilkyway2404 yes, about half"}, {"text": "like it"}, {"text": "nice 1"}, {"text": "You are absolutely correct. I neglected to give him credit! Will now. Thanks."}, {"text": "The start: that&#39;s Evo Pogorelich! It sounds like it!"}, {"text": "i love you =)"}]