[{"text": "Bloody Gear ... New Meta 2019"}, {"text": "This video has not aged very well"}, {"text": "Note that this was made 4 years ago and its almost completely irrelevant now with all the amazing new mice on the market today"}, {"text": "Why using mouse if all you need is red device on thinkpad keyboard"}, {"text": "owen a Logitech G502 for little over 5 years the left mouse button is just now starting to double click. Over all one of the best gaming mouse on the market. Now to get Logitech to bring back the G15."}, {"text": "where the hell is Logitech G Pro Wireless?"}, {"text": "Use rocketjumpninja the YT channel for goot mice reviews."}, {"text": "oh how far we have come"}, {"text": "Literally just got the g502 in the mail and I already wish I got the Naos 7000. That pinky rest looks like heaven lmao"}, {"text": "I have big hands and my Steelseries Sensei is too small. Any suggestions from the community?"}, {"text": "So.. you forgot SteelSeries and Zowie mice.."}, {"text": "I like the Razor Naga for RPG’s"}, {"text": "The Tyon is like a costly G300s..."}, {"text": "First"}, {"text": "Lol mouse pad looks like postit paper"}, {"text": "im not gonna tickle your ballsack about the G502, but it <b>is</b> a good mouse.<br />also it&#39;s really not that heavy."}, {"text": "I personally use either a g503 or a Corsair glaive rbg<br />Idk I just think they’re the better for me"}, {"text": "Where is the Roccat Kone XTD? It&#39;s in my opinion, the best Laser mouse around."}, {"text": "i think the corsair sabre and m65 mouse is decent"}, {"text": "Please Pin My Comment and Give Me A Heart I want A Gaming Mouse!"}, {"text": "No razer deathadder elite? i know its too expensive but its really good"}, {"text": "Basically the roccat for mmos, and the g502 for shooters.<br />I use the Tyon for playing wow, and the g502 for any shooter game. You cant beat the Roccat in layout and functionality, pressing the shift button on the thumb down is so perfect, it took me a while to get used to pressing in the shift key on the g502.<br />G502 pro: Smaller, unlockable scroll wheel, and the sensor is better, if i make lines in mspaint, the roccat mouse makes unnaturally shaky lines.<br />G502 con: You cant bind shift+mousewheel up/down. The shift button takes some getting used to, since you click it into the mouse instead of the table.<br />Tyon pro: Binding something like windows volume to shift+mousewheel up/down is something i almost cant live without. You can actually comfortably click shift and the other buttons on the top.<br />The extra 4 buttons on the side of the normal left and right click is so perfect, i really only use one of the ones on the right side, because pressing them down is tricky for my fingers, but when im on other mice, i keep wanting them there too. This is not a good travel mouse, if it falls down, the flippy button on the side easily gets broken, but while it lasts, its genious, i bound it to my most used skill in wow, and it&#39;s so natural to press.<br />Do mind that the other thumb buttons can be shift+x bound, but your thumb is busy holding the shfit key down, so the only way to click them is with a pinch manouver with your pointer  finger."}, {"text": "This Video I like so much!"}, {"text": "Had a G502 for a year. The mouse was a weird shape for my large hand so, I sold it to get the finalmouse ultralight and wireless logitech g703. The g502 is a great mouse , I loved it. It just isn&#39;t not for me."}, {"text": "they never focus to Cougar, cause Cougar is a German brand who&#39;s they are doing very well in very affordable cost......................."}, {"text": "Im very very happy with my Mars Gamming MM5 (including dpi switcher, leds indicators, logo iluminated RGB, 16K DPI, 9 weights customizable, etc. I bought 4 years ago and still perfect. The price are cheaper nearly 25 € (Eur) but I keep in mind Logitech G502 for the future. Thanks Dimitri for the review ;)"}, {"text": "And the most important thing is proudly made in China!"}, {"text": "I reco.mend the G502, it&#39;s amazing mouse, but you have to also buy a good mousepad."}, {"text": "Why isn&#39;t the G403 on the list? Didn&#39;t you say it&#39;s one of the best out there with a simple yet sexy look?"}, {"text": "Actually if you’re on a budget, and you like a mouse that can be used by left and right hands<br />The Logitech g300s is quite nice<br />It lets you change the dpi<br />And it is like the first roccat mouse in the video, with the 4 buttons on the mouse button <br />It actually is quite nice"}, {"text": "I use the razer deathadder. it&#39;s really good"}, {"text": "&quot;Just 79$&quot; I&#39;m just like....I don&#39;t even know.."}, {"text": "I still haven&#39;t found a mouse I like as much as the Logitech MX510/518. :c Its actually really frustrating."}, {"text": "The cm storm low key lows exactly like the Deathadder from the bottom and the palm area height and general shape is super similar"}, {"text": "I STILL remember this video for its thumbnail."}, {"text": "What about the Razer Death adder?"}, {"text": "Razer deathadder where is it!?"}, {"text": "That asus oooouuu👍💪"}, {"text": "G502 will be a trure killer if they can cut the weight to 100 gram..... over 120 gram is a little too heavy for fps gameplaying."}, {"text": "Logitech g602 is my favorite"}, {"text": "Where is the g502 spectrum"}, {"text": "Lmao scrubs I use my trackball mouse"}, {"text": "Rival 600"}, {"text": "Watch out on TYON. I have lots of issues with it in UE3 based games. One of updates made it even worse. Games stutter after 10-20 min to point of unplayability! Uninstalling all roccat software did not fix it! It is in firmware something so fucked up that this mouse is unuseable. After unplugging it even game restart is not needed! With other mouse game like Killing Floor 2 starts to work normal. Plugging in TYON again takes another 11 minutes and it is very bad stutter and sound glitches!!!!<br /> Other game that I tested recently was free Xcom 2 from steam and same happened there!!!! This piece of shit made my game stutter in base view, mission mode and even in main menu while I was moving this piece of turd mouse! If I stopped moving it then stutters stoped but game anyway was not perfectly fluent! It had about 50FPS while game by default starts with 60FPS and is like that if no ROCCAT mouse is used!!!!<br /><br />For many months I thought it is some other problem that is causing those UE3 based games to go bad. And it was just this shit mouse! Also I own other ROCCAT mouse NYTH and it is not better! After playing UE3 based games after about 60-120 min  game start to have performance issues!"}, {"text": "g402 g502?"}, {"text": "G502 ❤️"}, {"text": "I Have G502 Proteus SPECTRUM It&#39;s AWESOME"}, {"text": "logictech g602"}, {"text": "Careful You Need to Look for Dmitry talking about Computer Mice That&#39;s for Someone That Knows Why Computers have Mice"}, {"text": "Allmost 1 mil subs! I love this channel and good luck!"}, {"text": "Yo gust fucking buy a g502 Logitech for 70$ one of the best on the market what is that shit"}, {"text": "roccat tyon＝Click on a stone"}, {"text": "Tyon is by far the biggest let down ever.  Amazing mouse.  The layout is perfect. drivers are complete shit."}, {"text": "The sponsor of this vid bankrupt"}, {"text": "Too bad I&#39;m Left handed"}, {"text": "Where’s mad catz m.o.u.s.?"}, {"text": "DPI makes none to zero difference."}, {"text": "<b>These gaming mice are shit not yours but all in general how tf is someone gonna quickscope/quickswitch with the wheel when the rubber is in the middle and not on the sides?</b>"}, {"text": "i support Logitech"}, {"text": "G602?"}, {"text": "can you do a review on the gladius 2?"}, {"text": "o yeah and a ball track for minesweeper"}, {"text": "also use the m557 on accasion for mincraft"}, {"text": "i use my logitech g310 for hardcore roblox tho"}, {"text": "personally i use the logitech g502 protiouse specturom ( the rgb version) i am in love with it but as of right now i am in the market for a lighter and more minimalistical desighn such as the logitech g403 (ps the reason there are so many spelling errors are because i am typing fast because i do not have a lot of time hope you understand.)"}, {"text": "He is not lying the Logitech g502 is a beast and it has been serving me well for around 6months so far"}, {"text": "I&#39;m seraching for something like the naga with 9-12 buttons on the side and something with buttons up by the clickers as well... Does anything like this exist?"}, {"text": "I have that mouse the Razer Deathadder and for 3 years now Ive never a problem with it...I bet you sat on it  before you dropped it, lug-nuts!"}, {"text": "I got a Razer Deathadder... It fell once and left click didn&#39;t function properly... Never buying something from Razer again"}, {"text": "do not own the Logitech G502.. but ive played with it.. it think their are too many buttons, i would say the Steelseries Rival 600 would beat the G502 in my perspective...!"}, {"text": "Dmitri, let&#39;s be honest, the Zowie FK2 is the best mouse from a competitive view. It has no fancy <b>cough*performance enhancing RGBs *cough</b> but it has one of the best sensors out there plus, it is ergonomic and rated nearly perfect by Rocket Jump Ninja and many Pros."}, {"text": "I have the g602 and i think its really good"}, {"text": "i got the cm storm inferno about 6 years ago for 50$ CAD and its still their black sheep with software configuration way beyond everything else i have seen and the button configuration really resemble to a natural predecessor of the roccat tyon. Its been dropped so many times and it never failed me"}, {"text": "Zowie EC-2A"}, {"text": "macros at will"}, {"text": "RIP Ncix"}, {"text": "I love how he keeps saying asoos"}, {"text": "Logitech g502 is the best"}, {"text": "Zelotes T90 is a good mouse for just 15$ on Amazon like if you buy, own, or want it"}, {"text": "Zowie EC2-A &lt;33"}, {"text": "I personally prefer Logitech g502 &amp; razor rgb have for gaming as i have been using them for a long time and have no complaints"}, {"text": "A perfect mouse: razer deathadder elite"}, {"text": "Red gear g9 Thor??"}, {"text": "thumbnail is so eye catching"}, {"text": "I got the g502 last week, and it fits my small add hand so well"}, {"text": "i am a lefty but i hold a mouse and game like normal people i hold my mouse in my right and wasd ond my left"}, {"text": "is the Armaggeddon Alien IV G9X Good??"}, {"text": "I own 502 Proteus Spectrum not core but im very satisfied"}, {"text": "Currently I am using the Logitech G502, and this device is amazing. Never had better one, but for sure my next mouse will be the ROCCAT TYON :) if of course Logitech will not come up with something better. :P"}, {"text": "Razer Basilisk"}, {"text": "Zowie ec series feels so good"}, {"text": "I am using Steelseries Rival 500"}, {"text": "waaaaaay too many gadgets on these mice...gimme a simple one like roccat savu....i love this mouse....have it since it was released.....still the same mouse....indestructable and perfect for gaming if you have don&#39;t have a huge hand....."}, {"text": "I Myself Use a trust GTX... 170??? I    dunno But i freaking love it, it uses 2 double A batteries, The lights Are red, it doesent Have software and it uses a USB dongle"}, {"text": "The ROG Gladius is SEXY!!! I&#39;m going Asus, baby!"}, {"text": "No razer deathadder?"}, {"text": "SteelSeries Or Razer? no? Okay"}, {"text": "My biggest gripe with the g502 is the middle click. Some genius over at logitech made the middle click far heavier than the sideways clicks for the scroll wheel, meaning that I often trigger the left scroll button while trying to middle click. This problem alone is making me consider returning the mouse."}, {"text": "i dont see how people can use a left hand config i myself am left handed and even then it&#39;s just weird having your mouse on the left"}, {"text": "Civilian profit cultural legend substance solve shortage body horizon."}, {"text": "need 1 new video like this &lt;3"}, {"text": "WHERES THE NAGA?!"}, {"text": "who uses the on the fly DPI switches? by the milliseconds it takes to adjust your hand they gonna kill u. isnt better to train yourself to snipe with the same DPI?"}, {"text": "Logitech g903 is a great mouse"}, {"text": "You can&#39;t really have the top 5 gaming mice to be honest. There are so many factors that play into getting a gaming mouse that is perfect for you that you can&#39;t just narrow it down to one general mouse. Maybe the best mouse for certain CATEGORIES, but there is no perfect general mouse, only the perfect mouse for you. Shape, weight, sensors, buttons, cable length, rgb compatability, click feels/actuation force, size, adjustability, grip style... the list goes on. The thing you really need to do is find the perfect mouse for your play style and perference."}, {"text": "Why is it called Mice ?"}, {"text": "wow, go and see what the pros use rather than what the market is throwing out there."}, {"text": "gaming mouse with 6 buttons? what kin of games are you playing?"}, {"text": "I use the NAOS 7000."}, {"text": "and wotafuck? Where is the Zalman ZM-M401R?"}, {"text": "Only switch and sensor type play big role, this review is shit, sorry."}, {"text": "I just got the Logitech G502 (Spectrum) And it is the best mouse ever..."}, {"text": "u should do top 5 keyboards"}, {"text": "<a href=\"https://www.gearbest.com/mouse/pp_615003.html?vip=2068242\">https://www.gearbest.com/mouse/pp_615003.html?vip=2068242</a>"}, {"text": "I have  a Cyborg RAT and it&#39;s great!"}, {"text": "I use the asus rog spatha it is a bit heavy witch is good so it only lifts up with force.  In other words a very good gaming mouse. It&#39;s also wired/wireless"}, {"text": "Nothing Corsair or Razer?"}, {"text": "Razer deathadder is good to..  I have the deathadder and its awesome and is around 69 dollars with a g5 sensor"}, {"text": "From experience I can tell you that gaming mice will not make you a better shooter. I suck at FPS games and I recently bought the Steelseries Rival 310, Zowie EC1 and Zowie FK2 to see if I could be turned into a better shooter.<br />These three mice are the top choices for the professional gamers of FPS.<br />Result: same scores, same accuracies, same everything. The only thing that matters is ergonomics... DPI, lasers, 1-1 tracking and all that is complete bullshit."}, {"text": "The best gaming mice is one that moves the cursor, and clicks"}, {"text": "Cougar 700m"}, {"text": "which one of these have the best censure and dpi ranges?"}, {"text": "they need a wired g602"}, {"text": "OMNIVI CORE 4LIF"}, {"text": "I have the bad habit of grabbing the mouse with the tips of my fingers instead of resting my whole palm on it, and it sucks because buttons 4 and 5 are always out of reach, I need to break the habit :/"}, {"text": "I have. Logitech G502 and it was 4k pesos or 80$ but it was worth it"}, {"text": "Whether Gaming Mice is more accurate than normal mice ?????"}, {"text": "g502 proteus spectrum yesssssssss"}, {"text": "666 k subs"}, {"text": "Logitech needs to bring back the G9X"}, {"text": "Corsair M65 FTW. By far my favorite mouse."}, {"text": "Corsair harpoon.Good shit"}, {"text": "I recommend the Logitech MX Master S2, and yeah I know its not a gaming mouse but its really good at designing👌"}, {"text": "I have my G402 (same as G502, just a bit different looking) and I LOVE IT!"}, {"text": "i got the g810 keyboard and a g9x mouse. but im looking to upgrade the mouse. but so far no mouse has as smooth a scroll wheel as my g9 from decades ago. lol even the 502 with smooth mode isn&#39;t as smooth? weird?"}, {"text": "I don&#39;t understand how anyone can find the logitech g502 comfortable. It&#39;s just so narrow and I have tiny hands."}, {"text": "mice?"}, {"text": "who else is using one of these mice while watching this? I&#39;m using the razer one."}, {"text": "why is mouse maker promoting hacking bro fuq macro :/ csgo no recoil macro is too high"}, {"text": "good video"}, {"text": "How did you change the opacity of your thumb when you are using the mouse - that is so cool."}, {"text": "I currently use the SADES S7 wired mouse and absolutely love it. It initially felt long for my hand but I got used to it and use it for everything."}, {"text": "Huevadas jajajaj... yo juego mejor con un logitech g1"}, {"text": "No razer deathadder elite?"}, {"text": "I&#39;m looking for a wide, relatively lightweight (&lt;115 grams) optical mouse with a similar button layout to the Roccat Tyon or the Logitech G300s to use at a DPI of around 4000. What would you recommend?"}, {"text": "I have the roccat mice"}, {"text": "love the Tyon!"}, {"text": "Guys i need help. SO i will upgrade my mouse annd idk what to choose in three:<br />Logitech G502, Razer Mamba, or Corsair m65?"}, {"text": "I use steelseries rival its awesome"}, {"text": "I like The R.A.T 7"}, {"text": "I use M65 by corsair and I love it. I use it over a year and it&#39;s like a dog with aluminum built. I have big hands and roccat is not in my list, my vendor suggested roccat is not for big hands when I bought M65."}, {"text": "Of this 5 mouses, someone burst fire mode ?"}, {"text": "Zowie?"}, {"text": "Congrats on 400 more"}, {"text": "i use A4Tech Bloody V7 Mouse...very very good gaming mouse"}, {"text": "in my opinion it&#39;s mad catz check it out"}, {"text": "Damn none of the mouses are cool...well my gaming mouse lights up only worthh 10 $ !!!"}, {"text": "Reason why I&#39;m watching this is because I sold my mouse and the 2 spares I had broke."}, {"text": "No razer mouses? Srsly <del>_</del>."}, {"text": "This video is old but this definitely isn&#39;t the &quot;top 5 best looking gaming mice&quot;"}, {"text": "As a lefty, this was hard to watch"}, {"text": "Reckon that at least 1 Corsair mouse should be on here"}, {"text": "Corsair M60"}, {"text": "+HardwareCanucks which is the best mouse?<br /><br />Naga Epic Chroma<br />Logitech g502 thx :P"}, {"text": "Wouldn&#39;t it be Top 5 Gaming Mouses? I know it sounds preposterous, but it is a homonym and  usually classification in language with homonyms is represented by different structure in plural and singular"}, {"text": "I have the roccat tyon and I will try to use it to the rest of my life<br />it&#39;s fuck8ng great"}, {"text": "<i>Buys $15 bluetooth Microsoft mouse</i><br /><br />     Sees this"}, {"text": "Where are the steel series mice"}, {"text": "i have proteus core"}, {"text": "cool but no naga?"}, {"text": "ask any true gamer and none of these touch the top 5. I myself run a Razer Naga. had it for just over a year and love it. had to personally repair a button a friend broke, but other than that it&#39;s a damn good mouse for what I paid for it"}, {"text": "The g502 is my desktop mouse, and I recommended it for FPS games mostly, but it fits well into any sort of game genre. I tend to make the thumb buttons for drinking HP/ mana potions for games like grim dawn, for example, and Logitech has the best configuring software I&#39;ve tried."}, {"text": "Well i have a Corsair M65 PRO RGB FPS mouse only because 80% of my PC (everything except MOBO/CPU/GPU)  and all my other peripherals are from them and they have great customer service and none of their products have failed me<br /><br />also i have a kind of OCD to sticking 1 type of brand for everything as for me it does not feel too good for some reason"}, {"text": "anyone here have the g300s"}, {"text": "Logitech G700"}, {"text": "i prefer the shape of razer s mice its simply a personelle preferance, am more of a claw grip user iv try g502 and g900 both very great mice but its very more natural feel for me with for exemple the ouroboros (razer) its the best mice i ever use am aslo an hardcore fps gamer (battlefield counter strike...) its feel like more quick click ,very more"}, {"text": "Great video and awesome BBC Top Gear style editing!"}, {"text": "Lefties get no love!"}, {"text": "Wanting that gladius now"}, {"text": "zowie not included?"}, {"text": "I used to be 1k mmr in dota but thanks to the g502 im now 1.4 k best gaiming mouse"}, {"text": "Can you do a rewiev on the Arokh X-1??"}, {"text": "I only see razer"}, {"text": "g900 instead of g502"}, {"text": "I have a g502 and it is the best mouse I&#39;ve ever had.  Sadly it is very hard to &quot;spam&quot; though, for example in csgo, you can&#39;t really shoot with tec 9 that fast. It can be easily countered with a rapid fire macro which I use on the &quot;sniper&quot; button because I only use 500 DPI, I don&#39;t even get it why you would wan&#39;t to lower your dpi on the fly."}, {"text": "I&#39;m using Razer Deathadder mouse, but I bought Mionix Naos 7000 today. Good bye Razer..."}, {"text": "where are the razer mice is that a joke?"}, {"text": "And i&#39;m still waiting for a good mouse with a 5-way dpad on a compfortable position.<br />Cyborg did it one but you had to break your thumb to use it."}, {"text": "i have logitech g502 its the best."}, {"text": "I have a Razer Naga Molten Edition with 12 side buttons 2 just off the left mouse button, and a lovely scroll wheel so 17 buttons in total. With Razer synaps and key Macros I have definitely outdone myself with gaming AND programming.<br /><br />For anyone looking to buy a Razer Naga, do it, its absolutely amazing."}, {"text": "Are u from Vancouver BC by any chance?"}, {"text": "What about the mad catz rat mouses"}, {"text": "Source quietly province Palestinian normally quantity heavily architecture unique."}, {"text": "I own a draconia by sharkoon not well known but very nice mouse"}, {"text": "502, I didnt get extra feet in the box, should I have?"}, {"text": "i have and use the Logitech G502 Mouse and its very good."}, {"text": "Red dragon"}, {"text": "Best I got was a Logitech g300s cause I got small hands"}, {"text": "The mouse that I use is a roccat Kone XTD which is Freaking insane the, the fit is perfect the customization for the RGB lighting is amazing and the censor is spot on. It also has a compartment where you can change the weight of the mouse I would highly recommend checking it out."}, {"text": "what is with the Razer Naga 2014 ? i become this mouse to my birthday and i think its really good too"}, {"text": "Steelseries Rival ?!? lol what a list."}, {"text": "I have been using the Roccat Tyon for almost 2 years now and I have not had any problems with it. The software has a bit of a learning curve and can be a pain to install however. This is by far the best mouse I have ever owned"}, {"text": "where is the razer ouroboros or razer mamba tournament edition"}, {"text": "Check out my updated Version for 2017!"}, {"text": "Pack and/or forehead miss wooden cheap area police"}, {"text": "Maaaate i have HUGE hands :3"}, {"text": "avago 9800? thats a shit sensor"}, {"text": "Havit HV-MS801 is just 6.50Euros and has lighting and 2400 dpi"}, {"text": "guys the channel &#39;&#39;rocketjumpninja&#39;&#39; is amazing at mice reviews (i don&#39;t own this channel and i don&#39;t have any contact with the owner) i just love the reviews"}, {"text": "Anker mouse is best mouse"}, {"text": "i have a g502, and i love it."}, {"text": "corsair m65"}, {"text": "I have a laptop );"}, {"text": "My gaming mouse logo lights up._. Just only one thing lights up"}, {"text": "U forgot to mention Rapid Scroll switch in G502 ;)"}, {"text": "Where is the Zowie Mice?"}, {"text": "so satisfied with the Logitech g502 proteus core ....so good for fps n general shooting games.."}, {"text": "get cool gaming mouse with only 5 Dollars <a href=\"http://www.gearbest.com/mouse/pp_336194.html?vip=718550\">http://www.gearbest.com/mouse/pp_336194.html?vip=718550</a>"}, {"text": "If you want a real gaming mouse you get the cyborg r.a.t 7"}, {"text": "Rat 7 best mouse ever"}, {"text": "The fuc* i never heard about the 3 mouses the only one i know is the logitech lol"}, {"text": "I own a G502, and i&#39;m honestly surprised that the feet are made of teflon. i&#39;m also using it on Logitech&#39;s hard mouse mat, but the friction just doesn&#39;t seem very low ;_;<br /><br />although i do enjoy this mouse, i plan on changing it for The Z (by Swiftpoint) because it has some REALLY nice features, and i also plan on editing that mouse to get it just right"}, {"text": "I&#39;ve been using the Roccat Tyon for a couple months  now and it&#39;s a great piece of hardware.  The number of buttons available provide you a great level of control without having to jump your hands all over the keyboard.  Not to mention, the &quot;shift&quot; button doubles the amount of options you have; it&#39;s really nice.  The only criticism I would give about the product is actually the program that comes with it that controls all the buttons and customization of the mouse.  While it&#39;s a pretty fleshed out system, it can be a bit daunting for the unassuming user and it is sluggish to apply the changes you make.  Not exactly a deal-breaker, but worth mentioning."}, {"text": "i want it"}, {"text": "Razer?"}, {"text": "Logitech G700 RULEZ :P I love additional buttons, which I use for Z(lay down) in BF1, M(ap), T(gas mask in BF1), G(renade) all in my right hand! ;) And it is wireless! :)"}, {"text": "Looking forward for 2016 edition ... when is it"}, {"text": "i want a wireless mouse with a mouse pad that can charge it wireless"}, {"text": "Hey, i saw your unique vids and enjoyed it :D i make similar videos and hope to see you on my channel.  i produce gaming, vlog, and funny challenge videos that you PROBABLY would enjoy!  i love entertaining people and i&#39;d love to find a chance to entertain you with some of my for you to enjoy some of my content! -Conor or Conween LOL :D!"}, {"text": "I cant believe that i own the G502"}, {"text": "shitty video. shitty mouses."}, {"text": "I recently purchased a Logitech G502. I&#39;m really happy with it, especially because I have small hands. However, I&#39;m not happy with the fact that I can&#39;t tune it due to my computer being too old to download the software. Also, there is no extra teflon in the packaging! I&#39;m just glad I got the 2 year warranty."}, {"text": "razer diamondback?"}, {"text": "I&#39;d recommend the Rival 300, awesome fucking mouse"}, {"text": "I&#39;m getting a laptop soon and will probably need a mouse (it&#39;s a gaming laptop), can anyone explain why there is such a price difference in mouses and if I could just buy a basic £5/10 mouse instead of £30?"}, {"text": "today i just got my Corsair M65 Pro RGB mouse from amazon and i love it so far"}, {"text": "im suprised that Razer wasn&#39;t in the list"}, {"text": "Didn&#39;t even mention Razer mamba of g602... or g900 or the R.A.T. thing."}, {"text": "I got a thrust gxt25 and its really cheap got a dpi botton and 2 bottons on the side, i got it for about 7 dolloars. and its 2 years old and works like a charm even after i throw with it after some bad games."}, {"text": "where is razer deathadder?"}, {"text": "top gaming mouse for what? mmo? fps? mobas?"}, {"text": "I use the razer deathadder"}, {"text": "Im in love with the Corsair M65 RGB"}, {"text": "Palestinian joint assure sufficient."}, {"text": "Like for 400 more videos? Best keep that promise Dimitri!"}, {"text": "guck bedoel gok haha"}, {"text": "oke haha ik ga een eigen kanaal maken hij heet zooper 080 oke like pleas aboneer duimpje omhoog thx mensen alvast haha het gaat over pranks en tricks lateh oja mijn naam is oualid"}, {"text": "Still think my SteelSeries Rival 300 beats everyone of those."}, {"text": "WHAT ABOUT RAZER"}, {"text": "Lol two years ago"}, {"text": "u hv 839 vids"}, {"text": "where is razer naga epic chroma???"}, {"text": "In my experience, 15€ mouse are the most reliable ones, as they don`t have any novelties that could break. Though good mouse are reliable enough for reliability not to matter anymore."}, {"text": "the best mouse you will ever use is the mouse that you are comfortable with. <br />Any reasonable quality mouse from $40 - 60 will perform as well as any $100+ mouse as long as you are used to it and happy with it. People who think buying an expensive mouse will make them better are in for an expensive lesson and disappointing lesson. The best mouse is the one you use all the time and are used to it. Simple as that. <br />(caveat being it still has to be a reasonably decent mouse. just not necessary to buy stupidly over expensive mice)"}, {"text": "Best for csgo?"}, {"text": "another cool mouse is the GX-M1w (there used to be a $12 dollar one  bus it sold out) and it&#39;s a great fit in my hand and it changes colors and it&#39;s wireless <br /><a href=\"https://www.amazon.com/ENHANCE-Wireless-Optical-Receiver-Ergonomic/dp/B00TK17W8I/ref=sr_1_4?ie=UTF8&amp;qid=1477522174&amp;sr=8-4&amp;keywords=GX-M1w+mouse\">https://www.amazon.com/ENHANCE-Wireless-Optical-Receiver-Ergonomic/dp/B00TK17W8I/ref=sr_1_4?ie=UTF8&amp;qid=1477522174&amp;sr=8-4&amp;keywords=GX-M1w+mouse</a>"}, {"text": "what about redragon perdition"}, {"text": "Mionix Naos 7000 is simply the best mouse for CSGO."}, {"text": "got to say the MadCatz MMO-TE is the best mouse i have ever used. not sure of the actual specs but it has 15 additional buttons (12 being on the thumb area) and a total of 19 buttons (not count scroll wheel). of these button only right click and mode buttons cannot be programmed (scroll wheel has independent up, down and click programming).<br />The GUI it comes with is really nice and has 3 profiles which can be changed by the mode button. As for DPI, well you get a lot of flexibility, pick any 4 numbers between 25 and 10,000 and you can set those as your DPI (multiples of 25) its macros are easy to program just by pressing the buttons on your keyboard/mouse while having you mouse in an area.<br />Additionally the mouse comes with a quick lock on the back which lets you extend the length to suit you hand size."}, {"text": "so dragonwar phantom G4 is not in your list."}, {"text": "fk this i have a trackball"}, {"text": "Got my G502 2 years ago, and still works flawlessly!"}, {"text": "The Razer Ouroboros is a really good mouse too"}, {"text": "Asus Spatha  :D"}, {"text": "Lgtch g502 !!! Oh... my;my; !!"}, {"text": "Razer mamba chroma is amazing"}, {"text": "Where is the element(/zeroground) niiro"}, {"text": "m65 is a solid mouse"}, {"text": "My logic: Loudest Mouse = Best Mouse<br />Please if you know any good and loudclick gaming mice, please tell me."}, {"text": "Where is Razer ?"}, {"text": "Razer Death Adder"}, {"text": "Someone talked me into trying the Zowie EC2-A, and while I will say it was a very solid and responsive mouse, I just couldn&#39;t handle the smaller ergonomics, and experienced frequent hand cramps. Plus, I tried using it on a lower sensitivity, just like the pros do, and after 2 weeks I just couldn&#39;t adjust properly. Sad to say, I ended up going back to my RAT 7 and it felt better immediately, not to mention improving my game, even though the Zowie was a very good mouse. If you want some truly great ergonomics, then the RAT 7, or one of the RATS, will suit you well, even though it&#39;s a laser mouse."}, {"text": "ROCCAT Kone Xtd best mouse for larger hands."}, {"text": "i was thinking about getting a mice<br />No questions asked i will buy the g502 spectrum"}, {"text": "had a rat9 for 4 years, had a g502, for one month, had to bring it back when the mouse click blow up, spent a month talking to them, they took weeks to reply, ended up having to go back to the store, and ask nicely for end exchange. <br /><br />was lucky to get one, got a rat TE, hoping its as good as the rat 9."}, {"text": "Plz make a review on A4Tech Bloody V3M gaming mouse"}, {"text": "My Razer DeathAdder Chroma is better than all of them"}, {"text": "got the G502, great mouse, horrible cable tho"}, {"text": "almost 500k SUBs"}, {"text": "My g502 malfunctioned the first day i got it."}, {"text": "The razer naga or the corsair scimitar??"}, {"text": "I got the G502 but I am going to return it, the sniper button annoys me. I&#39;m thinking about XTD OPtical from Roccat<br />My first choice was the Tyon but I&#39;m afraid that the sensor will decrease my fps gameplay"}, {"text": "Where&#39;s the James donkey 007 gaming mouse"}, {"text": "i got good taste for mice :3<br />i bought the g502 when not understanding Sh1t about mice and pc&#39;s :&#39;D now i do alot more but okeh bought it around 2013 working still verry nice :3"}, {"text": "Tecknet Raptor all the way"}, {"text": "i have a g8 ghost shark"}, {"text": "Logitech hypervision furry"}, {"text": "Logitech g502 and I absolutely love my mouse"}, {"text": "Stipan Lisica. Dračanska9, Split, Srinjine, 21292."}, {"text": "I use a G502 I&#39;ve had for  over a year now and its still a pretty perfect mouse. Bought the cloth pad with it and I&#39;ve never had an issue with the teflon feet."}, {"text": "Monix looked just like Qpad 5k mouse. What i do own and love it."}, {"text": "ill stick with my razor moba"}, {"text": "MAD CATZ CYBORG M.M.O.7 GAMING MOUSE"}, {"text": "watching this high got me fucked up"}, {"text": "I have a zeletos t90 spider inteption"}, {"text": "My G502 is fine and I&#39;ve had it since December. Will it get worse? So far it is the best mouse I have ever used."}, {"text": "Don&#39;t shop @ NCIX. They are scammers. I tried to buy Corsairs M65 RGB PRO and they charged me 4 times for only 1 mouse that I tried to order, and I only got a receipt for 1 mouse order. They couldn&#39;t ship me any mouse at all because  they said they couldn&#39;t get money from the credit card company and credit card company told me that they already sent out the funds to them and that they already taken the funds, and NCIX denies that they have taken the funds. Now the only way I could get back my $320 back is file a dispute thru the credit card company and I need to wait up to 2 months to resolve this issue to get my money back."}, {"text": "Deathadder Chroma, flashy and all yes but has always gotten the job done."}, {"text": "you have got to be kidding, this is your top 5 for gaming mice? what were the qualifications, being able to get a free sample? your baseline should be legends like the g9x and the deathadder chroma, not a bunch of off-brands and upbadged plebs... a more appropriate title for this would be &#39;top 5 alternate gaming mice&#39;"}, {"text": "is the ReDragon Samsara any good?"}, {"text": "why do all good mice have cords? dangit"}, {"text": "wher razer"}, {"text": "is the R.A.T9 a good mouse cuz i hzve one"}, {"text": "Razer Mamba for ever!"}, {"text": "Corsair M65?"}, {"text": "I can not imagine gaming with something other than my Razer Naga, Bit odd at first but once you get used to it, all other mice just cant compare,. Sometimes 17 Buttons dosen&#39;t seem like enough though."}, {"text": "I&#39;m gonna ask this one as it seems no one can answer me on it, can you do a top 5 list of left hand gaming mice? I&#39;m right handed when it comes to actually writing but I use my mouse with my left hand and all right hand gaming mice don&#39;t work with me as my thumb is on the oposite side so they cause major comfort issues."}, {"text": "I just bought the G502 and I find it too easy to scroll forward when you try to click down on the scroll wheel. Also, the 3rd sniping button on the side so far forward, that it&#39;s impossible to reach unless you hold the mouse like you&#39;re picking up a small turtle shell. They make them like this on every revision. When will they learn to put the third button right under the two side buttons? I may just go back to my G500s."}, {"text": "I havent watched yet..The logitech g502 is on here.."}, {"text": "I have had gmx 4for like 2-3years and still works."}, {"text": "And we did"}, {"text": "yes i own the logitech g502. but i got the rgb version wich is very cool. i am very happy with my mouse"}, {"text": "what keyboard is he using?"}, {"text": "Mionix Castor or Roccat Tyon?"}, {"text": "I have the logitech g502 since a year and had no issues with tephlons feet"}, {"text": "What about the g303? I heard that one is also really good."}, {"text": "I Think the G402 is better because it is much cheaper (In my country, G502 is excatly two times more expensive), simpler, and feels larger. I think G502 is overpriced just because of 2 extra buttons, Sniper Button, More Colour Blue used, and the name (G402-G502)."}, {"text": "I have both the Corsair M65 Vengeance and the Logitech G502 and I much prefer the M65, it&#39;s a lot better for gaming. The G502 feels cheap and is hard to use, not sure why everyone raves on about it."}, {"text": "I&#39;ve had the g502 for around a year now, and it&#39;s amazing. Super comfortable, good button options, and you can find it for like $40 on sales and stuff sometimes."}, {"text": "I use the MX Master for productivity and gaming cus it has a clean and simplistic layout. Simply the best imo!"}, {"text": "name of bgm?"}, {"text": "my Logitech 502 got sensor problem after use it for about 2 years , is that normal ?<br />the sensor is auto move while not moving , mean that the arrow is auto shacking itself ..."}, {"text": "I want to get the g402. It&#39;s only 40 bucks right now"}, {"text": "A"}, {"text": "I own the tyon for a year now i think. Amazing."}, {"text": "The logitech G502 is amazing"}, {"text": "razer Mamba?"}, {"text": "i have the razer naga great mmo mouse<br />for mc"}, {"text": "Just wondering which is the better mouse out of the Mionix Castor, Naos 7000 or Avior 7000?"}, {"text": "Still having my Steel Series Rival 100 mouse. Works perfectly and I don&#39;t need mice with numbers on sides and shit like that. Still think most are just to show off. I can be Global on CS without a 200 dollars mouse."}, {"text": "i got a zelotes optical mouse which works fine for me"}, {"text": "zowie mouses are the best mouse for gaming end of story. Bye"}, {"text": "I feel corsair should be on the list, especially given their competitive price-points."}, {"text": "Tyon for now on the market is N1 !!!! PERIOD :D ... for an MMO ( and not just )  mouse I`ve used them all ... razor`s, steelseries, a$tech logitech etc..... but tis TYON is just outstanding !!!"}, {"text": "I suggest Razer DeathAdder Chroma."}, {"text": "My g502 just arrived yesterday and it feels good for me, nice thumb grip and very precise. I dont need the extra weight anyway, its already heavy on its basic.<br />The software also provides mousepad sync as the surface of every mousepads is different"}, {"text": "i have roccat tyon😆😉"}, {"text": "i got the logitech g502 proteus spectrum and its actually the best mouse i ever had i strongly recommend it!!!! ;-)"}, {"text": "I have a G502, loved it as soon as I bought it, still love it today. The only reason I am looking for a new one is because it&#39;s LED lighting color is unchangeable. :( My red PC setup needs a red mouse and I am bummed to say goodbye to the awesome G502."}, {"text": "No SteelSeries 300/700? fuck this"}, {"text": "The roccat is not working well....its just acts like not having 1000hz, you see it a little laggy. and on the same pc the 1000hz sensei from steelseries performs just great. i will love to use the sensei with the shape and button layout of the roccat. I guess you cant have it all."}, {"text": "Logitech G300s is BEAST"}, {"text": "At <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=0m28s\">0:28</a> what is that mouse in the top right?"}, {"text": "The Zowie ec2a and ec1a is relly god"}, {"text": "Rat mmo 7, enough said"}, {"text": "So G 502 is best or worst ?"}, {"text": "I have small hands, is the roccat tyon for me? Thx"}, {"text": "Where is the Razer Mamba !??!"}, {"text": "correction. mice is mouse plural for the animal. mouses is plural for the tool"}, {"text": "wow these mice are complete shit all but 1 the proteus g 502 and I now own the wireless g900 rgb and its one of the best mice on the market,but I am into multi large button mice like the scimi from corsair its better than any of this junk said to be top 5........not"}, {"text": "The only thing I need for my gaming setup is the pc I have been saving for a while"}, {"text": "I&#39;m looking for a mouse for league of legends but i really don&#39;t need the extra buttons.<br />what do you guys reccomend?"}, {"text": "is it gaming mice or mouse?"}, {"text": "I&#39;ve change my Perixx M-100 for a Corsair Sabre Lazer RBG and damn... its mouse is bae!"}, {"text": "What about the razer gaming mouse"}, {"text": "microsoft 3.0 The best mouse ever"}, {"text": "we want budget gaming mice not rip off my wallet mice"}, {"text": "what keyboard is that?"}, {"text": "CM STORM MIZAR for 59$ is in the top fives? I really would get a SteelSeries Rival 300 on it&#39;s place with just a 50$ price tag and for being much more comfortable and lil heavier. And yes I have tried it and it have been my primary mouse since first time I met it... :)"}, {"text": "What keyboard were you using at <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m07s\">3:07</a>?"}, {"text": "Dont drop the soap..."}, {"text": "I bought a turtle beach grip 500...idk if its that great but it cost me 60€ and it felt really good in hand"}, {"text": "Make a G502 RGB = millions of customers"}, {"text": "you soo need 10102102102103210321 sub"}, {"text": "razer deathadder croma?"}, {"text": "Teflon feet ? , My g402 just arrived yesterday !! will it have the same problem !!"}, {"text": "And just as i was watching this, you now have 801 videos. Good on you Dimitri!"}, {"text": "So the mionix mouse is just a rip-off of the Q-pad 5K..."}, {"text": "I got the naos 7000, hate it, used it for 30 mins and really struggled to use it any more, you have to slump your hand on the mouse and you cant lift it off the mat and went back to my old broken m65"}, {"text": "<a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m15s\">3:15</a> What Keyboard Is he Using?"}, {"text": "I would suggest the Redragon  M901 Perdition it is very fast and unique"}, {"text": "corsair"}, {"text": "Deathadder Chroma OR Mionix ?"}, {"text": "not enough buttons for mmo i prefer razers"}, {"text": "Got myself a Naos 7000 and G602, loving them both but none comes close to my trusty Naos 5000 to be honest :("}, {"text": "Razer DeathAdder Chroma is still the best for me :P"}, {"text": "i like the first mice"}, {"text": "I got nr 5, very nice mouse, lots of customizable buttons and useful features."}, {"text": "What means DPI ? because my cannon &quot;gaming mouse&quot; has an GPI button that makes the scroll wheel blink red"}, {"text": "Dragon War G8 Unicorn? anyone?"}, {"text": "Ummm if ur on a budget get the cm storm devastator, u can get it on amazon for like 25 bucks. It is amazing, only negative is a heavy middle click"}, {"text": "the avior and naos use lazer sensors"}, {"text": "my logitech perfomance MX is cool enough for me"}, {"text": "R.A.T 7      I got this in the spring of 2010. Still flawless."}, {"text": "Aaand im here with a 10$ mouse but hey<br /><br /><br /><br /><br /><br /><br />It has mouse4 and mouse5"}, {"text": "shit mouse with 74903 useless dpi( with native acceleration sometime), 10 useless touch, shit custom drivers who crash etc.. <br /><br />the only good mouse are zowie&#39;s mouse."}, {"text": "I like the first mouses design but theres waaay to many buttons for me"}, {"text": "and you didnt do the deathadder"}, {"text": "At <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=0m28s\">0:28</a> whats the name of the mouse on the top right?"}, {"text": "You never included ROG Gladius of the top 5 in the description lel"}, {"text": "a wireless mouse or mice that has great LED lighting,adjustable lights,dim, and changable colors, and chargable battery with extra battery.just like the wireless Playstation control."}, {"text": "The logitech G502 is awesome man!"}, {"text": "Nope I jus baught a 13 dollar wireless gaming mouse on amazon"}, {"text": "razor?"}, {"text": "logitech g300s is better for many game, trust me"}, {"text": "i have the logitech g502 :3"}, {"text": "Hello. Can someone suggest me a mouse with 3+ or + buttons? I&#39;m kinda a Dota 2  player and the Deathadder is a comfy mouse, but...i need 3+ buttons on it. Including the Mouse 4 n 5 ofcourse. In total 5 buttons."}, {"text": "I play CS:GO and I don&#39;t have gaming stuff and I maybe buy pad,mouse and keyboard and I want to know if the deathadder chroma is good for that game?"}, {"text": "People don&#39;t buy the proteus core, The spectrum is out with more rgb colors and the same exact price"}, {"text": "How to close the mouse LED ?"}, {"text": "<a href=\"https://www.amazon.com/AULA-120560-GHOST-Expert-Gaming/dp/B00B1NZN5M\">https://www.amazon.com/AULA-120560-GHOST-Expert-Gaming/dp/B00B1NZN5M</a><br />best mice i can think of(and only 17 €!!!!!)"}, {"text": "is Razer really that bad?"}, {"text": "Razer makes good mice"}, {"text": "Logitech G502 was hard to get used to for gaming in the beginning, but i love it now."}, {"text": "It&#39;s all about the Logitech G7000! Lol I love it since it is wireless but I can also make it wired with the charger if I&#39;d want to. It&#39;s also amazing in every other aspect as well and it the perfect weight."}, {"text": "WHERE IS LOGITECH MX MASTER MOUSE???"}, {"text": "i still prefer my g9x"}, {"text": "666 dislikes..."}, {"text": "I have the G502 Spectrum and I love it a lot!"}, {"text": "Me logic <br />Best looking mouse = best mouse"}, {"text": "Bought a Roccat tyon. I use 400 dpi and windows 5/11 sensitivity. I tried to use the tyon but found the laser incapable of tracking fast movements and would strongly not recommend. Rival 300 is the mouse i currently use and I would really recommend it or the new 700. Optical mice beat laser mice at precision and high movement speed."}, {"text": "Really liked this review, very cool. Outdated about 2 years but still appreciate it. Picked up the XTD Roccat 8200 DPI today, highly recommend it ( a 2016 mouse)."}, {"text": "G900 Chaos Spectrum"}, {"text": "I really like my g502 and if it will breaks one day I think I will buy it again"}, {"text": "Mad Catz Cyborg series is way better than all of these"}, {"text": "redragon perdition m901 I think this is one of the mouses you can get"}, {"text": "using the razer imperator"}, {"text": "i use razor naga 2011"}, {"text": "WHY NO MX518!?!!????!!?"}, {"text": "I have the Logitech G502, and it&#39;s fucking amazing. Been using it for 3 months now, no problems with the feet. I think they fixed that issue."}, {"text": "im still using the Logitech g502"}, {"text": "recently bought a razer ouroboros and it&#39;s the best mouse I&#39;ve ever had. definitely a massive step up from the mad catz rat series"}, {"text": "I like the RAT 3..."}, {"text": "Logitech G602 is Gr8"}, {"text": "N-tel G9  is the best Gaming mouse"}, {"text": "And I&#39;m sitting here with a 10 dollar mouse from Ross"}, {"text": "Missing the Razer Deathadder on this list"}, {"text": "For me the best is the Corsair Gaming SABRE"}, {"text": "roccat kiro"}, {"text": "Razer Deathadder ?"}, {"text": "omfg..................i should start reading constructions... i have a logitech by myself, its probably and older version as the #5 you guys have shown. But i never knew for what the target-symbole button was for............... the motion of the lsd&#39;s was always so werid until it really was at super low lol, ive never realized this put my dpi on extrem low WTF.<br /><br />wew............. aint gonna buy a new mouse , but thank you anyways lmao..... <br /><br />ps: having this mouse since 2 years now. this shame."}, {"text": "IMO i think the utechsmart Venus is the best mouse, the price is definitely a pro"}, {"text": "I love my Roccat  TYON"}, {"text": "logitech g300<br />is good"}, {"text": "The g502 is amazing"}, {"text": "i have a Logitech G602"}, {"text": "Logitech g300s"}, {"text": "Logitech MX518. 11 years old but still bad ass."}, {"text": "I have a mad cats rat 7"}, {"text": "G502, there is problem with cable protection fibers theyre shit but im fine with the rest :D"}, {"text": "razer mamba 2012"}, {"text": "How are Mad C.A.T.Z rat 7?<br />And how are the Razer deathadder?"}, {"text": "Blackweb gaming mouse and key board yep"}, {"text": "Does anyone know the best minecraft/jitter clicking mouse?"}, {"text": "hey can u help me choose , which mice is worth for cs go dragon war g12 reload or g9 thor? help please"}, {"text": "utechsmart: uranus. cheap and awesome. Metal, weighted (optional) bottom, smooth as shit, 9 map able buttons."}, {"text": "i&#39;m still using the razer deathadder 2012"}, {"text": "dragon war G9 Thor, Its good Budget gaming mouse with ergonomics suitable to most right handers"}, {"text": "I own the g502 but i am not a fan of the blue lighting"}, {"text": "MADCATZ R.A.T?????"}, {"text": "Logitech by far has the absolute BEST customer service i have ever dealt with, my old Logitech gaming mouse was have connectivity issues so i sent in a support ticket, and they sent me a brand new mouse that had the same price as my old won when new!"}, {"text": "Yes, they mentioned my mouse the Logitech G502!!!! Best part is its like it was made for people like me with tiny tiny hands (I bet you unless your like 12 or younger I have smaller hands than you)!"}, {"text": "<b>*i can talk in bold*</b>"}, {"text": "the arachnid araneus is an ergonomic mouse for gaming.  (google it)"}, {"text": "I have a Xtreme Gaming mouse and keyboard and i love it !<br />So recommended !"}, {"text": "i like the razer noga that im getting on my birthday june 12"}, {"text": "i have a Xtrust GTX 120 gaming mouse"}, {"text": "you should clean your table ;D"}, {"text": "Gila mouse is really good, that is the one I use"}, {"text": "PSA:<br /><br />3k+ DPI is VERY useful to those gamers who also use the same mouse to control their multiple displays/home theaters setups, post-sessions...<br />So try to get a budget mouse with CLOSE TO 2k DPI if you use Widescreens!<br />Your wrist will thank you!<br /><br />Also, the mouse software MUST allow to match colour mode to the current DPI, this is a definite advantage for FPSing!<br /><br />The extra buttons are best used for Media Browsing OUTSIDE of Gaming...in the heat of things, only a trained gamer remembers to use them or the macros.<br />Keep your mouse simple, and DPI profiles perfected for each type of game!<br /><br />And, alas, NO idea why all mice are not rubberized on the sides by now! That is sinful!<br /><br />- THE INTERNET POLICE"}, {"text": "i like corsair m65 sniper buton useless !"}, {"text": "G900!!! released recently. Look it up. Works better than wired"}, {"text": "MY NAME IS JEFF wait these are nice"}, {"text": "G502"}, {"text": "Newest 2400 DPI 3D Wire Mouse USB Gaming Mouse Mice 2.4GHz Computer Mouse for Laptop Notebook Optical Mouse 2016 ECDREAM product<br /><a href=\"http://www.aliexpress.com/store/product/Newest-2400-DPI-3D-Wire-Mouse-USB-Gaming-Mouse-Mice-2-4GHz-Computer-Mouse-for-Laptop/1735358_32302446528.html\">http://www.aliexpress.com/store/product/Newest-2400-DPI-3D-Wire-Mouse-USB-Gaming-Mouse-Mice-2-4GHz-Computer-Mouse-for-Laptop/1735358_32302446528.html</a>"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23G502\">#G502</a>"}, {"text": "I will never buy a logitech mouse again. They once were my favorites (mx518), but they focused more and more on fancy bling bling and looks over quality. Had so many problems with the G500, it should be a crime to sell such shitty products."}, {"text": "fuck this mices razor nagar and lioncast lm30 best mices ever"}, {"text": "Razer Better"}, {"text": "more like top 5 mice you can&#39;t afford"}, {"text": "i have a RAT pro S. is it good?"}, {"text": "wow shit list rofl"}, {"text": "And I Thought My Mouse Was Basic"}, {"text": "Крутой обзор))"}, {"text": "I owned a logitech g502 but my hand was too wide so it was shit and bought a razer naga"}, {"text": "I use a Logitech mouse its cool"}, {"text": "Gladius Army!"}, {"text": "I have the Mad Catz  Rat 9 😸😅..."}, {"text": "staples $10 optical mouse :D"}, {"text": "unfortunately in the Logitech G502 Proteus Core, they don&#39;t have the feet in a package, because I bought one 2 or so months ago, all I got for customization was the weights."}, {"text": "Man I bought G402 a week ago :("}, {"text": "people forgets bloddy for some reason :?"}, {"text": "My $15 walmart GamerTech mouse is top of the line if your interested in purchasing go he..... fuck no this thing is shit should have got a DeathAdder.... FUCK!!! Im 14 so i cant really afford items like this. Like if you too have a shitty mouse :)"}, {"text": "<b>KINDA OFF TOPIC</b>  hello my mouse has some issues and i dont know if it is the software or the hardware itself. I bought a razer deathadder recently and im using it to play csgo. Can someone please tell me if i should wait untli razer fixes it or should i buy another mouse???"}, {"text": "Mad Catz R.A.T T.E here."}, {"text": "Gaming Mouse R-X5 black, is it a nice mouse?"}, {"text": "ZOWIE FK/EC/ZA?!"}, {"text": "direct off amazon :YCCTEAM 4000 DPI 10 Buttons LED Optical USB Wired Professional Gaming Mice with Nano, Ergonomic + Aluminium Base.  I have this mous and its very nice to have"}, {"text": "looking back at this old vid I noticed he spelt Mionix wrong."}, {"text": "Well i got big problems with the tyon software. Doesn&#39;t let me change my setup"}, {"text": "But by the looks of the video those mice use a stiff low quality plastic braided cable that will move your mouse when you take your hand off of it."}, {"text": "Logitech g303 Daedalus Apex is very good and similar or better than death adder"}, {"text": "Wait... people choose to be lefty with a mouse or is lefty style used by injured, amputee, or disabled people? I&#39;m left handed and always use the mouse on the right but once I had a boxing fracture in my right hand and had to go lefty... just curious."}, {"text": "I have the Mouse.. Love it! :D"}, {"text": "my cat eat my 1000 dollar mouse"}, {"text": "whats DPI?"}, {"text": "I play CSGO, TF2 and games like Batman, JustCause and a variety of games but which mouse should I get? Razer Mamba Tournament Edition or Razer Deathadder Chroma"}, {"text": "I love my Logitech G700 and G700S.  Masterful hardware, backed by worthless and pointless software from Logitech."}, {"text": "mx master"}, {"text": "mouses"}, {"text": "what about the Naos 3200? is it the same as the Naos 7000 but with a lower maximum DPI setting?"}, {"text": "I personally own about 8 or 10 mice from budget wireless to high end wired gaming mice. With varying brands I find that not all mice are created equal but keep in mind people, if it&#39;s a flagship mouse of any peripheral manufacturer such as Logitech, ROCCAT, RAZER etc, each one has a different feature and utilizes different technologies and are all worthy of praise. There are varying levels of quality and precision in each category and in most cases, price will dictate the quality features. So, in summary, they are all good, but good is relevant only to the application and person driving the mouse. For gamers, accuracy, precision, speed, button placement, laser vs optical the list goes on. Buy one and you&#39;ll want the features of another, that&#39;s how it works and they all just keep getting better optics with more and more features but at a price. So pick one that suits your needs and fits your hands, and remember, they&#39;re all pretty darned good mice and they are only as good as the person using it. Great video Dmitri!! CHEERS!!!"}, {"text": "My proteus is badass. I got the Spectrum version, and it is absolutely fantastic. I would say by far the best mouse on this list, and one of the best if not best gaming mice ever made. Good investment."}, {"text": "these are awesome mice but i prefer personally mad catz rat tournament edition"}, {"text": "I have the Logitech g502 and I personnaly think its great"}, {"text": "im thinking about getting the naos 7000 but i dont know if itr would fit my hand that well, can anyone whos happy with it send me their hand size? (also thinking about the G502 and the deathadder)"}, {"text": "MIONIX CASTOR ALL THE WAY🤓👌🏼"}, {"text": "I would&#39;ve rated G502 a little higher"}, {"text": "V nice Thanks"}, {"text": "How much is the g502?"}, {"text": "How much is the average cost of a gaming mouse?"}, {"text": "Dimitri where are u from dude?"}, {"text": "A Corsair M65 is pretty good i have the pretty old on with the U looking thingy and it  has 8 changeable buttons all you need to do that is Corsair Utility engine. Its a good mouse (9/10)"}, {"text": "Not a MadCatz rat 7?"}, {"text": "Bit late to the party, but love your reviews.  I have to say I have owned the Logitech G502 Proteus Core since it&#39;s first release and consider it to be the finest mouse I&#39;ve ever used.  I have used lots of other mice as well and none have compared (for me)."}, {"text": "And here I am with the stock Azza mouse that came with my computer."}, {"text": "i had the Logitech g502 it was OK. the pulling rate was fucked up and was hard to play cs go. i just got the Razer Naga hex and its by far the best mouse i have ever haf"}, {"text": "Hey there Dmitri! I happen to own the G502 Proteus Core, as well as, the ROCCAT Tyon. I find both of these mice to be of top quality in build, ergonomics and performance. Each one of these mice have very unique features that showcase their intended purpose. Currently I have both mice attached to my PC and at the ready so that whatever the task or game at hand, I have the finest tools available. either of these mice are a fantastic option for a multitude of tasks and each has their strong and weak points. Bottom line here is that the engineering and design that went into each one of these mice has been over the top and each one will outperform most gaming mice out there, worth the money for sure!"}, {"text": "Nice videos, but i think the &quot;Razer Deathadder Chroma&quot; should be in the video to."}, {"text": "im <br />Mouse:<br />3200-DPI-7-Button-LED-Optical-USB-Wired-Gaming-Mouse-Mice-For-Pro-Gamer"}, {"text": "Omg the G502 is EPIC! So far no problems with the feet"}, {"text": "what is a budget but good ambidextrous mouse?"}, {"text": "»Top Tecznology«"}, {"text": "I&#39;ve gotten the RedDragon Gaming Mouse with 18 programmable buttons and 16400 DPI. It comes at the competitive price range of 30 British Pounds and is an epic gaming mouse for mmo&#39;s and the like. Personally I use it primarily for the Elder Scrolls Online and it is so much easier to play that game with those extra hotkeys. I have also remapped it so that on one profile I have all the Windows key combo functions on my mouse. A really good mouse all together!"}, {"text": "i have master mx and g402"}, {"text": "logitech g303 or g402 ?"}, {"text": "im so happy there is no razer at this list :D<br />and even happier logitech is no.1 cause everything logitech makes is the best<br />i have g9x for like 8 years now"}, {"text": "My cat ate my mouse..."}, {"text": "I&#39;m the poor kid with the RedDragon..."}, {"text": "Just a buy a logitec mouse they never disappoint u unlike those razer shits out there with horrible durability"}, {"text": "What that big button where the thumb rests? Is it an aiming button?"}, {"text": "the rog gladus is the mouse im using now"}, {"text": "dude im using the logitech g502 right now holy fuck this is weird, much coincidence, such wow"}, {"text": "i had g502. its not suitable for claw/fingertip mixture grippers"}, {"text": "G502 the best and the most precision gaming mouse what i ever have 😀😀😉"}, {"text": "Top 1: Razer Deathadder ;)"}, {"text": "Were is the R.A.T 9?"}, {"text": "I just honestly love my LGT G402 Hyperion. Perfect button placement, and is extremely comfortable."}, {"text": "If you want a good wireless gaming mouse that has batteries that last a long time. Get a Logitech G602. I don&#39;t have to replace batteries for like 2 months. And there isn&#39;t any noticeable input lag from my experience."}, {"text": "Why didn&#39;t you add the Deathstalker chroma mouse"}, {"text": "Zowie Fk2 ? :P"}, {"text": "my daily driver is the Corsair m65 rgb, and I love it"}, {"text": "i tried  minoix castor, steelseries rival 300, zowie fk1 , logitech g502,  razer mamba tournament edition. razer deathadder chroma,  corsair m65 rgb  <br /><br /><br />all is shit !!  except mamba tournament edition, very close but not enough  and castor was very god to, but still ehh. <br /><br /><br />i dont look for the design i look for a mice which fit my hand so perfect and well so i can move it back front upp down side to side, so fast and so great so my eyes get so big of joy and happiness so i cant believe it.  <br /><br />i have not find that mice yet but i will."}, {"text": "where the hell is razer?"}, {"text": "If you can&#39;t afford the G502, try the G402.  It has a slightly worse sensor and less buttons, but otherwise fairly similar."}, {"text": "Yo, ur finger nails look oogly, xD"}, {"text": "macro to snipe ? HAH! N00B:p"}, {"text": "the g502 is a very good mouse i will buy it its really cool looking and i love the way they made it i have a g300s but the bset mouse in my opinion is g502"}, {"text": "Hi Dimitry, i would like to ask for your recommendation on gaming mouse according to my requirements<br />it&#39;s only simple request, i have bigger hands but i don&#39;t want to use any programmable buttons that usually found on any gaming mouse on the market recently<br />i have a razer krait 2013 version but it&#39;s to small compare to my right hand, but it&#39;s so responsive and light<br />could you give me any recommendation for gaming mouse that suitable for my bigger hands??<br />thank you very much, very good video though<br /><br />greetings from Indonesia :)"}, {"text": "Got a $7.00 mouse.    Love it"}, {"text": "My option is g502 and g402 cuz they are the best"}, {"text": "seriously its a damn mouse i bought mine at walmart for $5 works better then any of these"}, {"text": "Speedlink decus gaming The Best"}, {"text": "got one of the first Microsoft mouses with laser. got it 14 years ago . still works. best mouse ever :)<br />and i am a gamer.. yea i got a super gamer mouse one time pay 60 euro like this mouse on your video , i play with it 3 months and broke :D"}, {"text": "I guess my 16400dpi Lioncast LM30 with 12 Mouse keys rules all of them"}, {"text": "<a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=5m56s\">5:56</a> broken"}, {"text": "I have the g502 proteus core and am SOOO happy with it even at its $80 price tag"}, {"text": "I got G502 for christmas."}, {"text": "You sound like BiboyQG"}, {"text": "I have the Razer Mamba Chroma and its amazing!"}, {"text": "Razer Naga meh?!?!?!?"}, {"text": "i dont get it. wasnt gladius suppose to be wireless ?<br />Why entire clip it has no wire and then it does have a wire ?"}, {"text": "You missed ROG Gladius in the description fyi"}, {"text": "where is g303"}, {"text": "I have the Logitech G502. It&#39;s fuckin amazing."}, {"text": "I&#39;ve tried the 502 from Logitech that a previous job got us to use for AutoCAD. and as it said it had many customizable buttons. only 1 was really customizable. it included the primary and secondary as well as the two up and down buttons. the adding of weights was interesting. as a mouse for word processing and internet browsing not bad. but for gamming and graphic use. go with something else. I personally own a Razor mouse at home with 12 number pad button by the thumb. and I think its a great mouse."}, {"text": "Razer is best!!!!!"}, {"text": "You are defenetly not a gamer lool ;_;"}, {"text": "R.A.T and M.O.U.S 9 are the best for FPS, MC and any other game"}, {"text": "HOW CAN YOU NOT HAVE THE NAGA ON THERE?<br />NAGA IS MVP"}, {"text": "What about Blackweb Grim Gaming Mouse? The ambidexterous variant specificlly, is 30 dollars, it has a DPI of 3200! Backlit and feels really nice. I like it allot. For thirty bucks and is ambidexterous, HECK IT IS A GREAT DEAL!"}, {"text": "JUST LOGITEH ADVERTISEMENT. oh my friend please g502 is a lego toy. u put it to first place if u r talking about gaming mouse how its lighter its better. steel series is pure gaming mouse. in this list just roccat mouse has a new tech with left button."}, {"text": "I prefer the corsair m65. Its very comfortable and it&#39;s perfect for fps games."}, {"text": "i have the G502 and it is a beast and fits my hand perfectly. <br />HIGHLY RECOMENDED."}, {"text": "razer mamba ain&#39;t good?"}, {"text": "Rival 300 ????"}, {"text": "5 things that fit into a category of things I can&#39;t afford"}, {"text": "The currency of the page are dollars or pesos?"}, {"text": "Здарова Дмитрий! :)"}, {"text": "I love my castor!!!:D My little cobra:)"}, {"text": "alienware man"}, {"text": "apple bflh"}, {"text": "<a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=0m30s\">0:30</a> what on earth is that on the top right corner??"}, {"text": "Gg"}, {"text": "dont worry dude your voice is really good"}, {"text": "What about the Logitech g700s😑"}, {"text": "i got G502 and im really happy with it only minus on the older version is it dont have rpg lights but on the new version those have"}, {"text": "why is there no razer mice? lol"}, {"text": "I have the g302 and its really good, but if it breaks i will deffo go for the g502"}, {"text": "im using razer Mamba and i must say, its fucking good"}, {"text": "Razer Naga Hex all the way."}, {"text": "cool"}, {"text": "Project mc fly"}, {"text": "Are razer mice shit?"}, {"text": "I want to change my mouse to a logitech mouse,but, I cannot decide between g502 and g602.Can someone/dimitry help me out?"}, {"text": "I still think the GAMDIAS Zeus is the best... 9 Macros in very continent places, adjustable sides for any hand side, Braided strong cable, 5 profiles in software, great grips (one for FPS and one for MMO) that can be switched out, 8k DPI Max,  lights, cmon, best mouse EVAR"}, {"text": "I have the logithec g502"}, {"text": "where is razer deathadder"}, {"text": "Where is the Rat from madcatz????"}, {"text": "Hmm I agree with his top 5 list except I feel like #2 spot should be the CM Storm Reaper. That&#39;s just my opinion."}, {"text": "I have steelseries kinzu v3 and steelseries qck"}, {"text": "adx firepower vo2 is a good mouse"}, {"text": "i think i switch to the Mionix Avior, cause this is on sale on ebay in germany right now :D<br />good video!<br />LG"}, {"text": "RAZER NAGA FOR THE WIN"}, {"text": "I own a logitech g502, I don&#39;t have any issues with the feet on the bottom. But this mouse is really great for me! :)"}, {"text": "In video it says Monix, not Mionix :D"}, {"text": "Razer DeathAdder is a good budget gaming mouse"}, {"text": "I use Roccat Tyon. i actually just bought it yesterday, because my vorsair mouse broke. The Tyon really works well for me. I missed absolutly nothing. But i don&#39;t really know yet how to make a rest color. I don&#39;t have the software yet."}, {"text": "one major thing they always miss with a classic form shape Mouse, no wings to provide lift grip between your pinkie and index and between the pointing and thumb fingers, that&#39;s a ideal, because of what we called gravity, since this ad is bogus of the anti-gravity ability, major flaw in the invention of Mouse controllers that seem to epic fail with companies, nothing like accidental pressing the back/forward buttons on the side and still drop the Mouse, because it has love-handles like a fat ass that makes it slip more and no, &#39;Mousewings&#39; for lift ...i would call it. in fact you could add infinite buttons with that simple lift ability."}, {"text": "I have the madcatz rat, its amazing!"}, {"text": "honestly for any gaming I have done great with just a regular mouse, its great for people who are on a budget and if you look for just the right mouse youll find a great gaming mouse. don&#39;t buy any mouse under $20."}, {"text": "I got the normal rocat for 27$ and it is fine for me if you do not have the mouny for that mouse"}, {"text": "how is logitech g300s???"}, {"text": "Hey guys, I&#39;m really interested in the Logitech G502 but not a fan of all the buttons. Is there a more simplistic version?"}, {"text": "the logitec is  a great mouse"}, {"text": "g-skill mx780, why ain&#39;t it in here? it&#39;s just/better than most on this list"}, {"text": "razer doe"}, {"text": "I have problems to trust ROCCAT.. every time i touch their stuff i get the feeling of a cheap plastic."}, {"text": "I have the Konix mouse , 20 euros and very cool :D"}, {"text": "i got the corsair k70 rgb with the normal corsair logo and i got the corsair sabre optical rgb with the corsair logo"}, {"text": "I would recomend the Steelseries rival 300"}, {"text": "i just bought a logitech g602 which is basically a wireless nicer feeling g502 but it has 6 programmable buttons not including the dpi buttons :D so yeah, im pretty happy with it"}, {"text": "Can you please tell me the name of the keyboard you are using at <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m12s\">3:12</a>?"}, {"text": "I dont have any of these. But I am fine with my BAKTH"}, {"text": "Razer naga"}, {"text": "deathadder ftw"}, {"text": "The ROG Gladius is only under $700 <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=2m45s\">2:45</a>"}, {"text": "I have a razor death adder I&#39;m thinking of getting a g502 from Logitech"}, {"text": "where are the R.A.T mice"}, {"text": "I have the g502. love it"}, {"text": "Can anyone recommend me a good mouse from $70-0<br /><br />I am a palm grip user, i play csgo and league and my hand is about 15cm long.<br /><br />sorry for bad english"}, {"text": "O"}, {"text": "I prefer the razor naga"}, {"text": "Love your voice, it&#39;s not annoying!<br />It&#39;s my opinion, I hate grainy voice."}, {"text": "But why there is not Razer deathadder crhoma ;("}, {"text": "Gladius is one ugly mouse. Kinda miss the days when you just played games, no matter what mouse was under your palm."}, {"text": "Razer Ouroboros :D"}, {"text": "my mice is way beter xD ;D"}, {"text": "I have razer deathadder chroma, its a nice one but it sometimes slides out of my hand until i get used to it again the next minutes (it only slides off the first time i use it in the day)"}, {"text": "damn bro the g502 is beast, i have a small hand and it is really comfy and helps me get flick shots with the AWP with eas cus of the customizable weights"}, {"text": "ROCCAT Kone Pure Military is where it&#39;s at.<br />* Under $50 on Amazon. <a href=\"http://amzn.com/B00KLVN2YO\">http://amzn.com/B00KLVN2YO</a><br />* Has pretty much the best sensor on the market (PMW 3310).<br />* 5000 DPI. (i mean, hey, it&#39;s there)<br />* RGB light.<br />* Braided cable.<br />* Full driver suite is available on not only Windows, but Linux."}, {"text": "how bout the naga"}, {"text": "If you&#39;ll mention G502 i&#39;ll shoot you."}, {"text": "Razer Mamba (not TE)"}, {"text": "For everyone with low budget i would recommend &quot; A4Tech V7m&quot; mice. It is really cheap (atleast here, in Poland), got place for thumb and those 2 little fingers, got really comfortable metal sliders under it. I bought it for like 22$, with &quot;A4Tech X7 Gaming&quot; mousepad for another 5$.<br /><br /><br />Using for 3rd year, still working smooth and precise."}, {"text": "What about the sensei"}, {"text": "Any good mouses for tf2? (Demoman pls)"}, {"text": "i bet cheap mouses will beat some of these"}, {"text": "Where is the 502? Where is the steelseries mice like the rival?"}, {"text": "I wonder if you could somehow use the joystick for the aircrafts to use for bhopping in csgo."}, {"text": "mamba razer ???"}, {"text": "what about g602 and g300s"}, {"text": "commenting for fun"}, {"text": "What&#39;s the difference between optical and laser sensors? Wich is the best?"}, {"text": "g300s anyone ?"}, {"text": "top 1 razer whAT?"}, {"text": "Logitech g400s for life!"}, {"text": "@HardwareCanucks can you review Zowie ec2a ? :P"}, {"text": "logitech g100s? :D"}, {"text": "mx master"}, {"text": "“Mice&quot; belongs to animals<br />“Mouses&quot; belongs to Tech"}, {"text": "The ROG Gladius is basically A Razer Deathadder"}, {"text": "GB all these for about 10bucks:/ <a href=\"http://www.youtube.com/results?search_query=%23england\">#england</a> rules"}, {"text": "GB al"}, {"text": "Im Saving For A Good One!"}, {"text": "I have like 8 gaming mouses I realy dont know why XD"}, {"text": "I would recommend the Logitech G602 gaming mice. It is extremely comfertable, and it has 6 programmable G buttons. It too has sensitivity buttons at 6 different levels."}, {"text": "if u redid this video would u add the Mionix Castor? thanks"}, {"text": "Hello lads, I am currently using a   Utechsmart US-D8000-GM   been using it for a while and enjoy it immensely from the weight to the aesthetics.  However the buttons on the left side of the mouse (all 3 of them) are super loose, any suggestions on an upgrade?"}, {"text": "steelseries?"}, {"text": "PROJECT MCFLY IS THE BEST MOUSE OUT THERE! Also I got one of the mouses"}, {"text": "Deathadder and Rival are better, for FPS, than all of these."}, {"text": "Feet on the CM Storm wear out in about 2 weeks. Asus Gladius has brutal sensor issues. Should not be on the list.<br /><br />No mention of the Deathadder 2013?? Have you actually used any of these mice for an extended period of time excluding your &quot;daily driver&quot; mionix?<br /><br />Currently using the Roccat Kone XTD since 2013. Have to say, build quality is second to none. Still as good as new. No switch degradation or mouse wheel softening. It is beautiful"}, {"text": "I just purchased the Logitech G502 Proteus Core less than a month ago. I don&#39;t understand why its receiving glowing reviews. The sensor is really good, but the mouse suffers from some very annoying problems. 1) The scroll wheel is heavy and in addition to the tilt functionality it constantly wobbles when the mouse is swiped side to side and 2) since the rmb and lmb buttons are separate from the top shell it constantly makes this weird &quot;quack&quot; noise when your sweaty fingers are lifted from the buttons. Logitech was VERY and I mean VERY close to having a perfect recipe with this product. Great design, poor execution."}, {"text": "Razer ourobors is the best. I have it since 4 years. Rly good product. I recomend buy it if you can afford it !!!!<br />xD"}, {"text": "me too !"}, {"text": "I have the roccat tyon and iam happy with it cus i can click faster with it than with my old mouse. I can click with my old mouse just 8 clicks per second and with the Roccat Tyon 12 :D"}, {"text": "logitech g402"}, {"text": "wtf is this ownage pranks?"}, {"text": "I use logitech G700s"}, {"text": "honestly the naos is overated, its good for people with medium or small hands but for large handed people better off gettting something else"}, {"text": "i only have a razer deathadder chroma :("}, {"text": "bunch of shits"}, {"text": "pfft all of these mice  sucks and are  fucking  Uncomfortable  MadCatz ® - ARE the best!"}, {"text": "As a gaming mouse collector, Logitech G502 is one of the best mouse I&#39;ve used. The ergonomics is just amazing coupled with its fast, sleek as look, can&#39;t recommend it more."}, {"text": "G602 master race"}, {"text": "Best budget mouse: G402 Hyperion Fury. On sale for half off in some places for black Friday (idk if it&#39;s available internationally.) anyways $60 USD is the MSRP, but you can find it for cheaper everywhere."}, {"text": "i own the logitech and i warn you if you have big hands you won&#39;t be completely satisfied."}, {"text": "502 &gt; everything, literally a button for precision firing at long distances in my games, cant mess with that, and my little baby girl hands love it to death"}, {"text": "Logitech G502 Is The Best! <br />(For me at least)"}, {"text": "Razer Naga Kappa"}, {"text": "how is a gaming mouse better and can it help you be better in a game"}, {"text": "this video may be helpful for other gamers - idk, but for fps players only those 2 mionix were mentioned, why? 3310 sensor, the best implementation is in FinalMouse, though built quality is not the best, also Mionix Castor, Roccat Kone Pure Millitary, all new Zowies and few others"}, {"text": "CM storm? Really?"}, {"text": "just buy this products in china and you get them cheap cheap."}, {"text": "Mionix Naos has been really good mouse tbh, i recommend checking it out :)"}, {"text": "2.56 Monix avior .....pls...a...fucking....monix"}, {"text": "Wow, gold hack tool<br /> here  =&gt;  <a href=\"https://www.facebook.com/779173268855660/photos/pb.779173268855660.-2207520000.1447271494./779174558855531/?type=3&amp;pidid=344e0075-9c69-4aa9-9401-63609f18a68a\">https://www.facebook.com/779173268855660/photos/pb.779173268855660.-2207520000.1447271494./779174558855531/?type=3&amp;pidid=344e0075-9c69-4aa9-9401-63609f18a68a</a> <br /><br /> Lets fun start                                                                Top 5 Gaming Mice"}, {"text": "I have small hands and I really didn&#39;t like the Logitech G502, felt cramped and way too narrow of a profile."}, {"text": "How is a razer deathadder not in this top 5?"}, {"text": "I use a Trust gtx250 mouse. It&#39;s a good mous."}, {"text": "I&#39;ve been a die hard Razer Deathadder fan, just because it fits the contour of my hand so well. The only quabble is that it doesn&#39;t have enough buttons for the only game I play (Guild Wars 2). Do you think the Proteus G502 is a good replacement? I am all about ergonomics and proper &quot;fit&quot;, but the Proteus looks like it has a lot of &quot;not so smooth&quot; edges"}, {"text": "steelseries rules"}, {"text": "hmm razer naga hmm"}, {"text": "And the razer naga?!"}, {"text": "hate to bring it to you guys but the scroll wheel is a big fucking fail on the logitech 502. dont know what they were thinking. what a deal breaker."}, {"text": "İ&#39;m best look and best gaming mouse : LOGİTECH 502 :)"}, {"text": "Just $79.00..."}, {"text": "just upgraded my old MS Sidewinder Mouse to an Logitech MX Master, which I know isn&#39;t actually a gaming mouse but it&#39;s certainly good enough for my casual gaming needs, plus it&#39;s killer for productivity. The feel in the hand is also great. Just as a side... People on forums or reviews complaining about the Bluetooth connection issues and &#39;lag&#39; when connected via Bluetooth... this is a Windows power management issue, not an issue with the mouse. Just disable power saving on the Bluetooth adapter of your computer. Once the PM has been disabled, BT and the Unifying dongle delivered indiscernible performance for me. 125hz polling rate isn&#39;t a problem... your monitor is probably 60hz, so if your mouse responds twice as fast as your screen, that&#39;s actually fine for most gaming. If you are some CS:GO tournament player, then it might be a little slow for your jedi skillz but for general gaming its really just fine."}, {"text": "Mionix Castor"}, {"text": "Can you review a DeathAdder Chroma?"}, {"text": "gaming mice?<br />i think mouse"}, {"text": "You forgot Razer Naga :D"}, {"text": "I use Razer Deathadder.  Like people shit on razer so much for their shitty products but the deathadder is a great peripheral if you ask me."}, {"text": "HC, I noticed you used the Mionix Naos as your daily driver for 1 year and I saw that you reviewed the Mionix Castor. I do a ton of draftin at work in AutoCAD and I&#39;ve been really loving the Naos 3200. I&#39;ve been using that for almost 10 months and I feel like it&#39;s part of my hand now when I draft. I&#39;m thinking about switching to the Castor, but I wanted your opinion on it since you know what the Naos is like. Would you recommend the Castor over the Naos? I&#39;m really considering trying it, but it would take something amazing to replace the Naos IMHO. At home I use the Logitech MX Master (I don&#39;t draft at home and I don&#39;t play video games) and I like it, but I think it&#39;s a little too heavy since I use the Naos the most and I switch to the MX master when I get home."}, {"text": "what about razor naga"}, {"text": "the gmx 4 should be on here i absoloutly love it and its really nice and it fits my hand and its really comfortable"}, {"text": "Where is razer deathadder croma"}, {"text": "What about budget, man"}, {"text": "Whos the best mouse for mouseabuse?"}, {"text": "what keyboard was that?"}, {"text": "Top 5worse mice ?"}, {"text": "I love the G502!"}, {"text": "hahaahah loosers no razer naga most used gaming mouse for pros"}, {"text": "This Biggs said the lighting looks sexy dear lord"}, {"text": "Dimitri plzzzz"}, {"text": "7-colour cycle breathing + 6 single color breathing + 6 single color constant light; A total of 13 kinds of light mode, , 9200 DPI  (1000-red/1600-orange/2400-green/3200-light blue/5500-blue/9200-purple)<br /><a href=\"http://www.aliexpress.com/store/product/7-Color-Professional-Wired-Gaming-Mouse-8-Botton-3D-Scroll-Wheel-Optical-Gaming-Mice-Computer-Mouse/1241446_32499877164.html\">http://www.aliexpress.com/store/product/7-Color-Professional-Wired-Gaming-Mouse-8-Botton-3D-Scroll-Wheel-Optical-Gaming-Mice-Computer-Mouse/1241446_32499877164.html</a>"}, {"text": "The Razer Naga Chroma is my personal favorite. The wireless option as well as full spectrum cycling make for a very sexy piece of hardware, oh, and the 12 buttons on the side make for the perfect mouse for MMORPGs."}, {"text": "Can someone recommed the Asus ROG Gladius? How is the ergonomic aspect?"}, {"text": "g502  is amazing."}, {"text": "do you know a good mouse for small hands and with clawgrip? im 90% sure im gonna buy the razer orochi but i like to know my options."}, {"text": "Im the 1mio Viewer :D"}, {"text": "use sharkoon gaming optical mouse"}, {"text": "Or heh heh you can just get a magic eagle 7 led dpi gaming mouse for 15$ bucks :D"}, {"text": "Can you find any mouse that is left handed, please. And do not include The razer naga or the deathadder, also no ambidextrous mouses. Please...."}, {"text": "Hey Dimitri, really cool episode, what would you say, is the best &quot;basic&quot; mouse, so none xtra buttons, or stuff i dont need, if i don&#39;t game, thank you already for your answer :D"}, {"text": "For the G502 I actually just purchased it on Friday and it doesn&#39;t come with any replacement pads(feet) on the bottom of the mouse."}, {"text": "mine is razer death adder 2013 and its already 2015 and i usually get 15-16 click per seconds and it was 10-11 click per seconds at my old and razer is much comfortable it has nice grips and its probably the b est mouse for me... its worth it guys and cheaper than other razer products, its only 3499 pesos here in philippines and its 77$ in america"}, {"text": "Deathadder or SS Rival for League of Legends/CS:GO?"}, {"text": "I miss my old diamondback 3g"}, {"text": "razer deathadder has to be in this list"}, {"text": "What about a Gigabyte mouse?"}, {"text": "List of mice leaves a lot to be desired, I can&#39;t consider any of the &quot;5 Button&quot; mice, &quot;Gaming&quot; mice. At best these are fancy coloured Facebook mice, for any MMO gaming, Most FPS nowadays, just about Any game with support for one... 5 buttons doesn&#39;t justify the price tags, when there are FAR superior alternatives."}, {"text": "&quot;soft touch coating&quot; I seriously hate this in mice. it scratches and marks too easy and will look like trash after a month of use"}, {"text": "No Razer??? WTF"}, {"text": ""}, {"text": "I am left handed but have trained my hand to use right hand mouse. I like it..."}, {"text": "What keyboard do you have?"}, {"text": "Which mouse is the best? I need to be able to throw snowballz at n00bz in club penguin"}, {"text": "this makes my mouse feel lame."}, {"text": "I have the Logitech G502 mouse, and i love it!"}, {"text": "Did you hear that ladies!? he likes a slightly larger body 😉 get in there!! Ps. I like the gladius x"}, {"text": "Cobra 3-lue"}, {"text": "Ouroboros or g502? And why, why not?"}, {"text": "is mices from Biohazard good ??"}, {"text": "Mad Catz R.A.T series ..."}, {"text": "My gaming mouse is an old fat white Microsoft mouse I found in my grandparents house. I have to hold it together with duct tape to stop out from falling apart. I can&#39;t wait to get a job..."}, {"text": "This is the best gaming mouse no doubt, this guy convinced me. If you give it a chance, he will convince you too.<br /> <a href=\"https://www.youtube.com/watch?v=AsHtjnDMYkE\">https://www.youtube.com/watch?v=AsHtjnDMYkE</a>"}, {"text": "Hello, cool vids<br /><br />go an check out my videos :)"}, {"text": "it&#39;s pronounced &quot;mouses&quot; <br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /> <br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />At least i think so<br /> <br /><br />also Don&#39;t bother going down<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />Its going to be a waste of time"}, {"text": "G502 or naos?"}, {"text": "The G502 is the best mouse that I&#39;ve ever had. It&#39;s great for gaming and super using. I use the G240 mouse pad that&#39;s engineered for this mouse and haven&#39;t noticed any foot reduction."}, {"text": "most of them mouses are shit man :S :( the last ones awsome thats it!!..."}, {"text": "If you find the opportunity please review the Final Mouse 2015"}, {"text": "For computers, the plural of a mouse is mouses. Just sayin&#39; :)"}, {"text": "i got a brain so i bought a razer deathadder chroma its the best gaming mouse out there and it its cheap"}, {"text": "Sunvbicht"}, {"text": "I have Mad Catz R.A.T. 9 and that is one of the best gaming mice!! Super product!!! But your best 5 gaming mice are super too."}, {"text": "For me the Logitech g502 wore out way to quick, even though i had the new batch. after 1 year the buttons became spongy witch increased random and double clicking, and the mouse feet had to be replaced around the same time. The free turning mouse wheel actuated itself and was hard to press down in both modes. The G buttons as well as the cable flange thing going into the mouse are deforming like they are melting?!. And some minor issues like the clear G logo for the light yellowing and the cable braid being very sensitive to desk edges. Some of the things that just aren&#39;t great are the way too aggressive grip at  the begging (witch wear out quick too), and the fact that its doesn&#39;t have rgb. also wen you have a paper cut and you touch the braiding it feels like pulling up silk underpants with a paper cut, it really fucking hurts. The G502 is a great mouse for up to a year then you need to replace most of it."}, {"text": "logitech G602"}, {"text": "logitech G602"}, {"text": "logitech G602 any day"}, {"text": "logitech G602 any day"}, {"text": "have"}, {"text": "i hawe tyon roccat i like it"}, {"text": "Yes I love my Logitech g502 Now I know you said that the back pads get worn out and I believe they have fixed that because i have had mine for a year now and I am 13 years old I am not the best with care and so you would think that a kids mice would be trashed in a year but mine is in perfect condition I especially love the shape because it fits my hand perfectly and I would never want to trade my mouse for anything else even the one razer one that has both left and right hand feature thing the one in a clear case etc"}, {"text": "Razer Ouroboros"}, {"text": "mionix naos 8200."}, {"text": "Хуле русский по англискйи заговорил? А? Дмитрий?<br />Русские обзоры в студию! )"}, {"text": "i&#39;m glad you did not include steelseries sensei, because it is by far the most uncomfortable mouse i have ever tried in my hand. dont buy the sensei, it sucks. i would like to get the mionix naos 7000 because it looks so comfortable and it got great reviews!"}, {"text": "Roccat tyon is a fantastic mouse with so many Marcos and bad ass led lightning that you actually can see but the preset macro for each game is Very limited, VERY. Don&#39;t even have cs go but a Very good mouse"}, {"text": "LOL Fucker have you never heard of Razer you dumb fuck??"}, {"text": "hi guys I&#39;m not a professional gamer and I&#39;ll buy mouse for my free time.Should I<br />buy g300 or g302.I usually play bf,cs and Dota 2"}, {"text": "Logitech g300s sure not the best but good enough for long time daily use and your dominant hand doesn&#39;t matter with its design :)"}, {"text": "No rival?"}, {"text": "&quot;fireglider&quot; since years - still happy with it and its pretty &quot;cheap&quot; (15-20€ or less) - 2 died (1 of overuse and 1 b/c production failure but got it switch with a new one that time) - still i prefer it over every other mice out there - propably just a very personal opinion but hey - it has good dpi (and dpi switch button) - good glides - weights (that i never use) - 5keys (LMB RMB MMB - 2SMB(left with different grip)) also fits pretty nice into my hand. opinions may differ but hey. thats that :D"}, {"text": "i have a roccat kone pure and a razer goliathus mousepad... the mice doesn&#39;t go well with this mousepad u.u"}, {"text": "I&#39;ll make purchases based on this review. Well done. /sub"}, {"text": "Make an updated video please?"}, {"text": "thinking about getting the razer death adder but not sure, my budget is £100, does anyone recommend any other  mice?"}, {"text": "is it me or is this sips lol"}, {"text": "I&#39;ve had the G502 since late 2014. The one complaint I have is that I sometimes accidentally graze the dpi mode button. I think the button itself should have been harder to press, and possibly located somewhere else, like under the mouse. There are already two dpi buttons on the left side - no idea why they felt the need to include another one right below the mouse wheel.<br /><br />Other than that; top mouse. Possibly the best one I&#39;ve had."}, {"text": "The Deathtaker by GX Gaming is really really good and has a lot of extra fully programmable buttons if that&#39;s something you look for. I like it a lot and it&#39;s cheaper than similar mice but very durable."}, {"text": "roccat krone pure is great and not price i love it the my razor"}, {"text": "Razer naga molten. Just. Amazing."}, {"text": "I&#39;m trying to decide between the Logitech G502 and Mionix Castor..."}, {"text": "Mice?"}, {"text": "lol i have the Logitech G502 too  xD<br />There should be a R.A.T Mouse too"}, {"text": "after opening/using/repairing a bunch of gaming mice i decided to stick with logitech as they offered the best build quality (external and internal) by quite a margin. e.g. the scroll wheel mechanism on older razer mice is probably the worst you could ever find"}, {"text": "what about MadCatz R.A.T. 7 or R.A.T. Pro X mice?"}, {"text": "Turn your smartphone to computer trackpad <a href=\"https://www.facebook.com/iTouchPad-1489177817968840/timeline/\">https://www.facebook.com/iTouchPad-1489177817968840/timeline/</a>"}, {"text": "Could you review the Roccat Kone XTD with the optical R5 sensor?"}, {"text": "I been looking for a new mouse (and keyboard) for a while now. I have the Logitech G5 now, but want a mouse that has a few more buttons (2-3 more). Roccat Tyon comes close but has just too many buttons and I don&#39;t like the lights on it. Also, it doesn&#39;t seem to have an infinite scroll wheal. Wish there was a mouse like G5 with added lower shift button like Roccat Tyon, and the one extra button on each edge of the two main mouse buttons (instead of the two on Roccat Tyon), and infinite scroll wheel."}, {"text": "Guys I need help<br />I am trying to find a really nice looking mouse that is a wireless (I don&#39;t need all the fancy MMO buttons, all I need is hot looking mouse that is verrry comfortable and has a lot of LED options, especially red/black kind of lights since my laptop is red/black and I want to move it around and that&#39;s why I need a wireless mouse and something to match with it)<br /><br />now the only wireless mouse that I have come up is razer ouroboros/naga/mamba<br />- Ouroboros looks amazing to me personally I really like the design, I am not sure how it feels in a hand tho...but the only things I don&#39;t like is the expensive price...in Canada best buy it&#39;s $200-220 with taxes which is a lot for a mouse, and also I don&#39;t like the fact that it is green color only....I like the color, but it just won&#39;t match up unless I turn it off<br /><br />-Mamba....seems allright, but I don&#39;t really like the design of it, but it seems ok<br /><br /><del>Naga</del> nice looking mouse, tho I don&#39;t need the buttons 1-12 buttons on it, I think it will just be uncomfortable for my thumb and I will always press against those buttons, the color changing is very nice....I can change it to red LED to match up...but price is still expensive around $190 in Canadian best buy<br /><br />anyways can someone recommend any wireless mouse? something nice looking not cheap stuff, would love color changing option to match up with black/red laptop LED keyboard...<br /><br />oh and for wired mouses I was looking at g502, g303, mionix avior 8200, ROG Spatha, Asus ROG Gladius (can anyone reccomend the g503/g303 and Gladius? the only issue I see with g503 is the color is blue I can&#39;t change it to red.. :("}, {"text": "I ve been using the Coolermaster Mizar for like 7 months. <br />The up DPI button, became really mushy, like a pressing a marshmallow, in 2-3 months,<br />and now, after half a year the scroll wheel died. in goes up or down randomly when ever i scroll.<br />made me Not trust Cooler master, ever again."}, {"text": "You sound like Farengar in Skyrim lol"}, {"text": ""}, {"text": "BUY YOUR PC HERE <a href=\"http://buildpc1.weebly.com/store/c18/ALREADY_MADE_PC(s).html\">buildpc1.weebly.com/store/c18/ALREADY_MADE_PC(s).html</a>      and get a chance to winn xbox 360"}, {"text": "I have the Asus Gladius and the Logitech G502. I prefer the Logitech, it just has a better grip for me. The Asus is a bit wide."}, {"text": "I like #3"}, {"text": "Razer Deathadder &lt;3"}, {"text": "Nice preview THX :)I invite You to watch my channel :)"}, {"text": "G500s master race."}, {"text": "What should I get? G502 or the G600? I play MMOs and FPS games, so I really can&#39;t decide what one to get."}, {"text": "I bought a G502 to see if it could replace my G9X.  Nope.  G9X is still the best gaming mouse Logitech has ever released, IMO."}, {"text": "im getting a gaming mouse soon!"}, {"text": "5 mouse recommended, 3 of them don&#39;t have perfect sensor..."}, {"text": "I have got and iz is super mouse for gamers it is dark glider"}, {"text": "I have a large hand, but becasue I only use my fingers to move it, the protheus core suits me well."}, {"text": "I have huge hands and I love my proteus core :)"}, {"text": "every FPS PRO player knows that the only mouse in this review good for it&#39;s price is CM Mizar. Tyon will never be used by a FPS pro player because of too many buttons,  G502  really suck because of it&#39;s weight and shape, Mionix is pretty good and Asus but in this range of price they have no chance VS Deathadder 2013 / Chroma / 2013 Classic. 2013 (green) / Classic (blue lights) has same sensor like This Asus in video S3988 and Chroma has S3989. For peoples that have issues with Deathadder with double clicking most of them are by corupted firmwares just ask on razer support to give you a new firmware and if is a hardware issue it&#39;s easy u have guaranty or if not you can find a tutorial on youtube how to permanently fix it is not too hard and u will have the best ever FPS gaming mouse. If you like Deathadder you will probably like the new Mamba Tournament Edition too. So this review is made by casual gamers and they are speaking about FPS games with G502 or Tyon :)))))) This 2 mice are great if you wanna play  DXBALL  or  TETRIS or for FPS when you play against BOTS (easy)"}, {"text": "<a href=\"https://wn.nr/6xKHk\">https://wn.nr/6xKHk</a> LOL see that... Best computer ever."}, {"text": "Been using a Razer Taipan for two years, still hasn&#39;t failed me yet.<br />If you want an excellent ambidextrous mouse, consider the Taipan :)"}, {"text": "I have the razer blackwidow, works perfectly I&#39;m using it for nearly a year now. My mousepad is the razer goliathus, great mousepad I really recommend it. Now I thought razer products are really good and I should get a razer mouse since my Logitech g600 broke after 1,5 years, so I Got the razer deathadder and its complete shit, first it is completely out of cheap plastic, the mouse wheel makes weird noises after 2 days and I can say this because the first one broke so I got another one and that broke 2. So I can really recommend razer mousepads and keyboards but the mice are complete shit."}, {"text": "I hate it when he says &quot;Technology&quot; in the intro, sorry about that this is an awesome channel though :D"}, {"text": "i have a Trust gxt166. ^v^"}, {"text": "Rizer baby hhhhhhhhhhhhhh"}, {"text": "Wrong, wrong, wrong, WRONG. No Razer mice? What?"}, {"text": "No deathadder? Awww"}, {"text": "Asoosse xD"}, {"text": "sry but the top5 mice are - 1.Zowie fk1/2<br />                                                2. Zowie ec-a<br />                                                3.Razer Deathadder 2014/ chroma<br />                                                4.Steelseries sensei / sensei raw<br />                                                5. The Final Mouse"}, {"text": "I use a Talon Blu gaming mouse and im pretty happy with it =)"}, {"text": "here&#39;s another one.     <br /><a href=\"http://www.amazon.com/gp/product/B00HTK1NCS/ref=s9_simh_gw_p147_d0_i2?pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_s=desktop-2&amp;pf_rd_r=1S0Q81BKA65PGX0NBGNY&amp;pf_rd_t=36701&amp;pf_rd_p=2091268722&amp;pf_rd_i=desktop\">http://www.amazon.com/gp/product/B00HTK1NCS/ref=s9_simh_gw_p147_d0_i2?pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_s=desktop-2&amp;pf_rd_r=1S0Q81BKA65PGX0NBGNY&amp;pf_rd_t=36701&amp;pf_rd_p=2091268722&amp;pf_rd_i=desktop</a>"}, {"text": "Hey guys I found another cheap gaming mouse w/ 3200 DPI.     <a href=\"http://www.amazon.com/gp/product/B00KD3NY2A/ref=s9_simh_gw_p147_d0_i14?pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_s=desktop-1&amp;pf_rd_r=115G01NYXC1EF02HAFHZ&amp;pf_rd_t=36701&amp;pf_rd_p=2079475242&amp;pf_rd_i=desktop\">http://www.amazon.com/gp/product/B00KD3NY2A/ref=s9_simh_gw_p147_d0_i14?pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_s=desktop-1&amp;pf_rd_r=115G01NYXC1EF02HAFHZ&amp;pf_rd_t=36701&amp;pf_rd_p=2079475242&amp;pf_rd_i=desktop</a>"}, {"text": "hey what can i but my hands are big"}, {"text": "I have the original Razer Mamba should I go for the g502? I had the g9 a couple months ago and I LOVED IT. I switched my mouse surface and it tracks like shit."}, {"text": "WTF? Where is Roccat Cone Pure Military/Desert? Why Tyon?!"}, {"text": "I use G502. Amazing sensor, best of the best)))))))"}, {"text": "razer chroma is good"}, {"text": "rat 9??? also has weights bro just saying but maybe not at that time or maybe you guys didnt know about it yet"}, {"text": "Top 5 gameing mice nahhh I saw a mice looking like a transformer."}, {"text": "For guys who dont have money for this stuff u can get A4tech x7 for 20$ and u will never want to change it. My first one lasted for 4 years. It has one of best software on market, you can make any click do whatever you want and save it so you can change macros during game. I fucking love it."}, {"text": "I have the Logitech G502 and love it.<br />I recommend it to anyone who likes that type of design and the functionality of all the programmable buttons."}, {"text": "guys, cougar"}, {"text": "what is Mice - I told its mouse"}, {"text": "wow. no razer mice"}, {"text": "i think number one should have been the corsair m65 RGB i own one and its one killer mouse"}, {"text": "I like the 602 better"}, {"text": "Deathadder 2013 or Chroma?"}, {"text": "What keyboard is that?"}, {"text": "And good mice for Team Fortress 2?"}, {"text": "i got the logitech g502 and it is awesome!<br />with a mousepad it nearly floats over the ground and the mousewheel is just unreal!"}, {"text": "I have the Logitech G502. I am in love with it. I&#39;m a Counter Strike player, and I like to bind shoot to my mousewheel for faster shooting with handguns. And the G502 mousewheel, you know it has no resistance. :D Well, you can push a button to make the mwheel resistant, but like that, it&#39;s just so awesome to shoot. :D"}, {"text": "Razer Ouboros, I&#39;ve been using it for almost 2 years now and it&#39;s still working as well as when i bought it it&#39;s rly smooth has a nice scroll nice weight and adjustable height and length i would highly advice it"}, {"text": "Got a gaming keyboard and mouse on Amazon for £25 total keyboard has led lighting between the Keys and the mouse has fwd and bck buttons as well as double click. It is called Asus blue gaming keyboard or something along those lines. If you don&#39;t like that I would recommend a plug in Xbox controller as they are unbeatable and but all mouses to shame"}, {"text": "ROCCAT Tyon purchased recently. It rocks. From the Logitech G300 this was a nice upgrade"}, {"text": "did you consider razer deathadder?"}, {"text": "I&#39;m still using my Logitech g9x :) such a beast mouse"}, {"text": "Damn any under like 30? Shyt"}, {"text": "the roccat Kone XTD , this mouse is LEGENDARY , customisable weight system , customisable sensitivity levels , awesome ergonomics , very good sensor , very cool lighting effects and awesome easy shift functions."}, {"text": "Any good gaming mice for League of Legends?!<br />P.S. A silent one"}, {"text": "dude, why didn&#39;t you mention any of the mice that actually matter on the market?  what about razer or corsair? they have the best mice, I don&#39;t get it."}, {"text": "guys, if you are serious about gaming than buy a razer deathadder, it&#39;s that simple."}, {"text": "Where is the RAZER DEATHADDER ?? Very False Video"}, {"text": "i think razer mcfly. XDXDXD"}, {"text": "why no razer?"}, {"text": "i have the g502 mouse and i am happy with it"}, {"text": "i have the madcatz rat te"}, {"text": "everest dlm 355 ???"}, {"text": "i have de G502 and its cool the color of the lignt is nice dans up to 1200ppp amazin xD"}, {"text": "which one of them do you recommend, for a gamer that plays CS:GO and rust?  I&#39;ve looked alot on that Logitech Proteus Core 502.<br />Right now im using a deathadder 2013, but I dont like it, because its to small for my hand, the rubber grip is not that good as I expected. <br />And one of my mayor problems with the deathadder is, that my pinky and ring finger cant relax, and after some hours of gaming they start to get a little sore<br /><br />Great video, and nice recommendations but after seening all these nice mice, I get a little confused in which one i should choose. I want the best of the best mouse  a fps gamer can get. I dont care about the price, as long its a good mouse, and lives up to my standards :) <br /><br />I know its a old video, but I still hope that you will reply my comment ^^"}, {"text": "Torque x10 carbon great mouse for lefties too."}, {"text": "R.A.T7 or R.A.T9 ? VERY ergonomic, adjustable weight, macro buttons, adjustable dpi, and adjustable palm and fingers attachments, check it out"}, {"text": "Zowie FK1/FK2<br />Logitech G400s<br />Steelseries Sensei.. <br />Instead we got Lasertracker mice? Really?"}, {"text": "I recommend the Logitech G700S wireless gaming mouse, the extra buttons on the thumb side are very handy and there&#39;s no cord to get in the way, the weight is great and for medium to large hands this mouse has good support for your palm."}, {"text": "Surprised the Razer Naga with an entire num pad under your thumb was not on this list. Everyone that has one seems to swear by it but I think the lack of including buttons being dispersed between your 5 fingers is a bad design as it limits response time due to high volume of buttons under one finger. To each their own, I guess.<br /><br />Worth mentioning is the Steel Series WoW Cataclysm Mouse. Large array of buttons all spread out very nicely across all the buttons to allow for button combinations as well as better response time due to multiple fingers ready to execute a series of button presses. It has 11 extra buttons (making 14 in total with left click, right click, and middle mouse click). Left click and right click both contain a single button to each side, making a |0|^|0| configuration with | being a button, 0 left/right click and ^ middle mouse. There is also a single button behind middle mouse as well and another single button on the far right side. The last 5 buttons are under the thumb with three being vertical and two on top horizontal. Just google the mouse if you are still confused. It is slightly heavy and bigger than most mouse but still has an ergonomic design to it.<br /><br />The UI for the button customization is for WoW and is all given by in game action as opposed to actual keyboard press and even follow the same press style (single press 95% of the actions and Press/Hold on the WASD + QE (movement and strafe) keys only.) The macro commands are scripted for WoW software so will not be accepted by other games. You will have to find the in game action related to that key press and bind that action to the key you want in order to say bind L to Mouse Button 12 you have to bind &quot;Quest Log&quot; to M12. Other than that, it has 10 profiles that you can have and even store a profile on the mouse as well as have profiles linked to specific characters in WoW so when you log in that one it will load the profile automatically. It can be worked around for any game, a bit of a hassle to due but still possible. If you want a mouse specific to WoW then the Steel Series WoW Cataclysm Mouse is 100% the best mouse you can have and will improve your gaming experience.<br /><br />I have the Logtiech G502 Proteus Core Mouse for FPS style games, since they require less extra buttons and I like the snipe button. Pretty much just the DPI shift and two side buttons are all you need plus the weights in the bottom are very nice. Very responsive and the software is easy to use to make macros and profiles."}, {"text": "I am using a Zalman ZM-GM1. This replaced my broken R.A.T 5, works just the same, few less functions and customisation options, but at the time it was at least £30 cheaper. Great budget gaming mouse and it has also lasted longer than my old R.A.T"}, {"text": "where mad catz mice at?"}, {"text": "nice."}, {"text": "Forgot the Zowie FK1, great mouse. Although this apears more to be a general guide."}, {"text": "should you get a mouse that only supports the drivers for w7 and w8 if you want to use w10? what will happen?"}, {"text": "I have one of those mice it is really cool"}, {"text": "ummm...naga?"}, {"text": "Don&#39;t mind me, just me and my 2009 mouse and windows 10 😕"}, {"text": "why is there no razer mouse in this list, razer is best"}, {"text": "Love the TYON"}, {"text": "I owned deathadder. Lost to double clicks issue. My bro&#39;s deathadder 2014 also started to double click too. Currently using ss rival and it&#39;s beast!"}, {"text": "what about the deathadder? most pros use them"}, {"text": "Hey everyone, i currently have the Logitech MX performance and is looking for a new mouse thats wired. I used to own a Razer Mamba which i really liked until it was stolen along with my laptop. I was thinking about sticking with Logitech but Razers&#39; chroma series is really neat haha. Serious replies please, id rather not hear the usual hipster replies about how razer products suck."}, {"text": "Where is the Zowie FK2? <br />Razer Deathadder? <br />Why all these mice with mouse acceleration?<br />And piss off with the stupid dpi change shit. how are you going to build up muscle memory if you change sensitivity all the time?"}, {"text": "can i offer an opinion, all of those called precision trough dpi &#39;s enhancements are  utterly unnecesary,raw input does has a limit and that&#39;s  A SPACE LIMIT you&#39;re not gonna extend your arm 50 cm away from your mat,youll look like an idiot and its unnecesary ,most of the pro gamers settle for a 40 dollar mice,there is no need to spend hundreds of dollars on marketing schemes,and if you bought a mice cause it gives you some kind of prestige,get the fuck out of your house, hit the woods and fuck a grizzlybear...if you can."}, {"text": "How are the drivers on these mice? Do you have to download them from some random website, or is it automatic?"}, {"text": "Gigabyte Aivia Krypton!"}, {"text": "I have a Razer DeathAdder I use for gaming. I think it&#39;s fine, except for the fact that it&#39;s so darned small. Can somebody recommend a mouse that would fit a larger hand? I wear a size 11 glove (XL). Thanks."}, {"text": "A very underrated and unpopular mouse is the Logitech g5. This mouse has a very smooth feeling with high dpi capabilities. I personally own the Battlefield 2142 edition and it has lasted since the release of that game to this very day. And it also has customizable weights like the g502. I really recommend it!"}, {"text": "What is the best Mouse for osu! ? :D"}, {"text": "Bought the G502 few days ago. It&#39;s fkin awesome"}, {"text": "Wait... There are better mice than my ball mouse? Since when?"}, {"text": "how much did CM paid you to put their ultra shitty mouse on your list? You actually put G502 lower than that? Thumbs down."}, {"text": "Razer naga FTW. Everyone says it&#39;s an mmo mouse but i use it for all my games and  it helps do things way faster imo"}, {"text": "I just bought the G502, this mice is in every &quot;top 5 mice&quot; vídeo out there, I hope its as good as people say :)"}, {"text": "Kone XTD. It has a really good sensor, nice ergonomics, good lighting, easy-to-use driver, and adjustable weights."}, {"text": "These are all like really expensive im buying a gaming mouse and its only 10$"}, {"text": "What about the Logitech g700s for people like me with big hands"}, {"text": "i was hoping they didn&#39;t put that hovering mouse razor put up as an April fools joke"}, {"text": "i have the monix avior and it is amazing the best mice for gaming in my opinion"}, {"text": "Whats the keyboard at 3.15 anybody?"}, {"text": "i have the roccat tyon yes it was expencive as shit at almost $100 but if you can afford it i would 1000% recommend it as it has a total of 15 buttons/opperations it is on the heavy side of gaming mice and once you learn to use it the top fin switch its a lot easier to use if you dont put your fingers on it but just push it with the side of your knuckles but yeah its totaly worth the $100 if you can afford"}, {"text": "g402 :D"}, {"text": "Is anyone using the Logitech G602 wireless mouse?"}, {"text": "The logo on the Gladius looks like Team Secret&#39;s logo."}, {"text": "i dont mean to hate on this but i think all the mice on this list shouldn&#39;t be..."}, {"text": "really all those ppl buying a gamemouse for over 100dollars for a bunch of extra buttons yet im here with my 5 euro gaming mouse with 6 extra buttons and it works better then any of those expensive overpriced shit mouses"}, {"text": "HI!!"}, {"text": "i do a ton of different things on my computer,  so i have about 3 mouse plugged in at the ready for each task,  lol"}, {"text": "NONE of pro player switch DPI ... so your MAIN reason of this top is worthless ."}, {"text": "hey guys quick question i am getting a Redragon M601 and i wanted to know if its any good for gaming and how long it would last because i carry my laptop from place to place and need to know if it can take that."}, {"text": "I got a great gaming mouse for 14$ at a store."}, {"text": "This was clearly made by someone with a .5 kd in first person shooters....."}, {"text": "i got g700(idk if this happens to other logitch products) and the mouse setting program keep disappearing from start menu a couple month after you install it (which is the only way to open the program as far as i know) so you literally have to go on their site and reinstall the driver if you want to change the dpi,key binding etc, and it&#39;ll just disappear again a couple month later; but other than that i absolutely love this mosue, it feels nice, durable(trust me, i&#39;ve lost track how many times i have droped it), precise and fast."}, {"text": "I use Razer Deathadder.  Like people shit on razer so much for their shitty products but the deathadder is a great peripheral if you ask me."}, {"text": "Top 5 gaming mice… uses a Mac."}, {"text": "Personally, my favorite mouse isn&#39;t exactly a gaming mouse, but it&#39;s more for casual people. The Logitech Wireless Mouse M325, look up some stuff about it, you might like it."}, {"text": "I am happy with my logitech mx518 I bought in 2008, before that  I had intelimouse 1.1"}, {"text": "Natec Genesis GV44 Wireless Gaming Mouse Giveaway, Ending 16 of august.  <br /><a href=\"https://wn.nr/NEDUg\">https://wn.nr/NEDUg</a>"}, {"text": "No zowie, no steelseries rival or even finalmouse, you must not play video games...."}, {"text": "Gaming Mouse 8200 DPI Pc Sentey® Revolution Pro Computer Mouse Gaming 11750fps Laser Gamer Mouse Mmo Gaming Mouse Rts Fps Computer Gaming Mouse &lt;-------    godly plz review great mouse and affordable at 30$ on amazon"}, {"text": "My g502 is something I can never part with... I cant go back to such low dpi... I always use 3400 dpi at a minimum."}, {"text": "I OWN A ROCCAT TYON &lt;3"}, {"text": "I hate the fact that they sell mice for 100$"}, {"text": "my mizar broke today. so im looking for a new mouse, my mizar lasted normal use for half an year, so my oppinion, dont waste ur money"}, {"text": "Why does no one ever include mice like the RAT9???????? It&#39;s like the same as the logitech but has a lot more to offer ;-;"}, {"text": "where is razor???"}, {"text": "to anyone that uses the roccat tyon or planning on using it. it the a really good mice with a good look as well. the extra buttons help me in cs go with the grenades on them. the fin and the switch doesnt go well for me. the shift is also amazing"}, {"text": "In my opinion I have the Black Web Grim gaming mouse and its awesome I really recommend that one and it&#39;s only 30$ I know its kind pricey but its less then the one in the video"}, {"text": "razer deathadder is so good"}, {"text": "is the Logitech Master MX good??"}, {"text": "What about the razer ouroboros?"}, {"text": "Was there the cyborg R.A.T.7 there? That mice/mouse is awesome!"}, {"text": "Amazing ! I just got 3500 RP code for totally FREE ! Come and download code too <br /><br /><br />&gt;&gt; <a href=\"http://RiotPoint.eu/\">http://RiotPoint.eu/</a> &lt;&lt;"}, {"text": "#1 should be Razer mamba 2015, I hate you...forever..."}, {"text": "actually you should list thru time!  logitech mx series are definately the best i´ve used for over 20 years of gaming ..  mx510 or mx560 with bullet holes made my fps gaming feel really good.. /. rick"}, {"text": "Wow and you didn&#39;t even add the Razer Mcfly."}, {"text": "Old video. But just wanna say, FUCK ROCCAT. Poorly made mice. The adhesives melt from human grip. The mouse becomes a mess. The usb connections start to get dull and require a &quot;wiggle&quot; now and then. Their customer service replies fast but less than useful. Useless brand. NEVER AGAIN!"}, {"text": "No Razer mice? So sad... :( "}, {"text": "Naaaaaaaaaaaahh Kana V2 is good for me."}, {"text": "Customizable weight, schmustomizable schmeight. It&#39;s just a marketing ploy. Mice only need to come it two weights: heavy and light. Beyond that, it is easier and faster to use a mouse for a couple hours and get used to its weight, rather than try out every possible combination of custom weights for a few days each and then you come out not even knowing what exact weight was the best."}, {"text": "I use the G-502, and it has been a worthy successor to the g-500. It is just a teeny bit too heavy, and obviously I wouldn&#39;t use the weights."}, {"text": "What, I&#39;ve got logitech g502 and I didn&#39;t know it was that good..."}, {"text": "Have a g502 and i play call of duty with it for a long time. Best things are the 3 thumb buttons for grenades and for the knive."}, {"text": "wait..in the video they are all using the wrong hand ~silly people  :)"}, {"text": "- Zowie FK<br />- Razer Deathadder<br />- FinalMouse"}, {"text": "Pls anyone help me buying the best and for gaming mouse. :(  i cant choose by myself so i need help as quick as possible from u guys.... :D"}, {"text": "I am searching for a silent gaming mouse! Can you suggest any?"}, {"text": "What keyboard is he using at <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m20s\">3:20</a>?<br />Love the simplicity"}, {"text": "Dude, almost all mice do the job. Sorry to tell you"}, {"text": "I just bought the G502 yesterday and after a few CSGO Competitive Matches I can say for certain I am loving this mice!"}, {"text": "Mad catz r.a.t te gaming mouse, I highly recommend this mouse because it is cheaper than a razer but have the same kind of capabilities, it excels in every aspect of comfort and performance, it has 8200 dpi and 4 settings to make it lower and higher as you go. Keep in mind the mouse&#39;s palm rest is adjustable and it has room for programmable buttons. "}, {"text": "Mionixx Naos ftw. Lesser known, but I loved it so much, I bought a second to use at work. Best feeling mouse I&#39;ve ever used."}, {"text": "Hold up one fucking damn second. Where the hell is the Razer DeathAdder??? Bitch please, that&#39;s the best fucking mouse in the whole shit ass world. Fucking dislike."}, {"text": "I bought the Logitech g502 three weeks ago (July 4, 2015) and they don&#39;t include replacement feet."}, {"text": "No Zowie. Shit list."}, {"text": "After using wireless MX Revolution and G700 w/ hyperfast scroll not even one manufacturer got me interested in their mice. Hyperfast is the best feature ever created and it&#39;s so much easier to move it without cable. I&#39;m also using hyperfast in some games, like Eve Online or some RPGs when there&#39;s a lot of text/menu scrolling."}, {"text": "hmm...2014 and you still mention optical mouse as if there is any other."}, {"text": "What about the UtechSmart Venus? 12 programable side buttons, customizable LED lighting that breathes, DPI switch with indicator, goes up to 16400 DPI, adjustable weight, comfortable grip, comes in freaking gold, and it&#39;s only $40."}, {"text": "logitech 502 &lt;3"}, {"text": "M.M.O. 7.. just saying.."}, {"text": "Hello. Im in the market for a gaming mouse. I play BF4, DOTA2, COD WAW, TF2 and Mass effect series. Im stuck between Razer Deathadder chroma (100$), G502 (100$) and Steelseries Rival (50$). The deathadder would My system has is Red and Black so the Razer would probably fit the best. but in shops i Prefered the other two (in my palm grip) wich would you recomend for a person who mainly plays FPS games?"}, {"text": "Mionix Naos 8200 or the Logitech G502? I really like both mice but don&#39;t know which one to choose"}, {"text": "Logitech G502 Proteus Core Impression<br /><br />I usually spend a lot of time watching / reading reviews when I decide to buy new gear so I thought I&#39;d share my thoughts on the G502 since I&#39;ve purchased one about 3 weeks ago, maybe I can help someone decide over it, so here it goes:<br /><br />I&#39;ll start with what, ultimately, interests me the most when it comes to a mouse - it&#39;s size and shape. I am 1.90 m (6 foot 2) tall and, although I have short fingers in comparison with my height, my palms are pretty wide and this mouse is TOO NARROW (although long enough) for me. And that&#39;s a BIG bummer, because the mouse is actually PERFECT in any other respect. The fact that it offers INCREDIBLE customization (I, for example, have a &quot;night&quot; profile on which I&#39;ve set the default DPI-change buttons to adjust the sound volume and the left and right scroll-wheel tilts to change de DPI), along with the ingenious weight distribution system and its already hefty weight (128 - 145 grams) makes this the mouse I will truly regret (yes, I am seriously thinking about getting a new, wider one).<br /><br />I would suggest watching more detailed reviews, as the customization options DO NOT end here and, if you have average-sized hands, it would actually be a shame to miss such a perfectly-crafted mouse that&#39;s going to satisfy your every single need.<br /><br />Build-quality is of the highest standards.<br /><br />Buttons feel perfect in every way, aside from the scroll-wheel (see below).<br /><br />The scroll-wheel is a little weird, it vibrates in the mouse&#39;s shell and the middle click is mostly uncomfortable and insecure.<br /><br />Other than its size (which is a personal issue) and the scroll-wheel (which will surely bother most people), this mouse is a work of art, very carefully thought out, built out of quality materials, exceptional tracking, good looks and everything.<br /><br />PS: If changing its lighting colors really matters to you, know that this mouse does NOT offer that type of support, the only available color being teal (blue-ish). You can, however, increase or decrease its light and breathing effect levels in tens of increments, which is nice.<br /><br />I hope this helps but, again, you should watch more detailed reviews because there&#39;s a lot more about it than what I&#39;ve mentioned here, and it&#39;s all good stuff.<br /><br />Cheers!"}, {"text": "I use my trackpad for professional FPS"}, {"text": "Logitec mx 518 optical,still the best because its practical,costs little and comfortable. All mice shown in video have ridiculous ligtse and look like Lamborghini."}, {"text": "You missed one... the Razer Naga, I got one haven&#39;t changed it since and i&#39;ve had it 3 years, best mouse investment i&#39;ve ever made."}, {"text": "How about a mouse with a really good sensor and not a bunch of crap all over it? Nvm now I&#39;m just being ridiculous"}, {"text": "razer deathadder ! my choice :)"}, {"text": "I bought my Logitech G402 and it&#39;s good. I didn&#39;t really like the scroll button of the G502 it was a little too fast for me :/<br />also it was 10 euros cheaper and I didn&#39;t need alot of buttons on my mouse. Still a good deal for 60 euros"}, {"text": "Corsair Gaming SABRE RGB or Steelseries Rival Optical Mouse?"}, {"text": "whats the best mouse and keyboard combination ? i need em in red as thats my theme ? thanks to whom replies :)"}, {"text": "im so tired of looking for computer mices, someone please tell me good mice and then i&#39;ll consider buying it"}, {"text": "Any good ( cheap ) Macbook gaming mouse for competitive ( CS:GO ) fps?"}, {"text": "MY RAZER OUROBOROS WILL KILL EM ALL MOUSEE DAEMNNN👿"}, {"text": "Razer Deathadder? No? Ok"}, {"text": "666 views"}, {"text": "M65 Corsair RGB ftw."}, {"text": "UtechSmart Venus 16400 DPI MMO Gaming mouse"}, {"text": "Ayy I got the Roccat Tyon."}, {"text": "I got the g502 recently but i&#39;m going to replace it as its not comfortable for me, ring and pinky finger had nowhere to rest and just ended up aching. I have fairly small hands, could anyone suggest an alternative? thanks"}, {"text": "QUESTION - should i get a Razor Death Adder Chroma or the Corsair Raptor M45<br /><br />(keep in mind that i&#39;m getting a razor mouse pad)"}, {"text": "g502 is the best 100% sure"}, {"text": "subbed, great explanation! love it"}, {"text": "i think there is no actual best mouse, it&#39;s all about preference , some people like alien looking mice, or robotic looking mic, and some people like mice with more buttons, there is no rules for a mouse to be the best."}, {"text": "Try <a href=\"http://www.microcenter.com/product/402309/Level_10_M_Gaming_Mouse_-_Diamond_Black\">http://www.microcenter.com/product/402309/Level_10_M_Gaming_Mouse_-_Diamond_Black</a> - Its confusing at first, but totally worth $75"}, {"text": "Too bad the g502 is so damn heavy, even without any of the weights."}, {"text": "1 - Razer deathadder"}, {"text": "A4tech bloody v5"}, {"text": "@HardwareCanucks What Mousepad would you recommend for the Mionix Naos 7000. Im wanting to buy this mouse, but I want a XXL Large mousepad for it, like the QCK+ or Heavy."}, {"text": "what about razer DA, steelseries sensei, zowie FK? best fps mice (csgo)"}, {"text": "So guys, I have a question. My razer naga just broke, and I&#39;m thinking about the razer deathadder, ss rival, or the g502. I play cs go, and I can&#39;t get a zowie mouse at best buy. I am scared to get the deathadder chroma because of razors quality, as remarked by many, and my personal experience wit he naga, only lasting 9 months."}, {"text": "I still believe there&#39;s a ton of people just jumping on the Razer hate bandwagon for no real reason.<br /><br /><b>looks at his Naga and Deathadder in great condition from 2012</b>"}, {"text": "I really hate your voice!!"}, {"text": "A wireless mouse in a top 5 of best gaming mice? Oo wireless is realy bad, less reactivity,.. <br /><br />For the roccat, there is too much buttons, why not for an MMO but not for an FPS. <br /><br />The Naos 7000 is way too large for FPS (again). For fps you need a mouse that do not take a lot of place, if we use a 40x45cm mousepad it&#39;s not for having a lot of place and a large mouse is slower than a more little mouse, so you&#39;re less reactiv.<br /><br />For the CM storm ok it look like a good mouse. If you can select your DPI with precision. And it&#39;s the same for the logitec one.<br /><br />I don&#39;t understand why the Steelseries Sensei is not in this top :/ it have a simple design but it work pretty well and is one of the most used mouse by professional player in FPS with the steelseries Rival even a lot of players who are not sponsorised by Steelseries use it."}, {"text": "Best mouse for csgo?"}, {"text": "The best gaming mouse is Corsair M65 RGB!"}, {"text": "You guys should check out the zelotes mouse "}, {"text": "what is the keyboard with puple backlighting?"}, {"text": "I have  logitech g502, MASTER RACE"}, {"text": "RAZER NAGA !"}, {"text": "razer mcfly LMAO"}, {"text": "What gaming mouse is good for cs:go?<br />Please answer"}, {"text": "Does anyone know what the name of the keyboard is at <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m12s\">3:12</a> ?"}, {"text": "Funny, were is Razer in all that ? Cus my friends ROG broke a week ago and my naga is older and still rocking the <b>**</b>"}, {"text": "I use a black widow unlimited 2014 with a log g300. They make a good team, you should try it"}, {"text": "What about the Razer Deathadder RGB @HardwareCanucks"}, {"text": "I have to ask, why no deathadder/rival/zowie ec mouse? They are superb."}, {"text": "i got a Asus ROG setup but i don&#39;t like the Asus rog mice. is it any better looking red mice that someone knows about?"}, {"text": "MX518/G400 Master Race!!!"}, {"text": "If your on a budget, get a red dragon m601. Its cheap, and average quality. It has 8 weights that you can take out individually. The side buttons have a nice click and like all gaming mice (I think) has nice and sensitive clicks. It has a 2000 dpi sencer which not the best but it good for its price. Did I mention that it&#39;s only 13 dollars right now on amazon? The build quality should last at least a year. Overall best cheap mouse out there"}, {"text": "I&#39;d like to see a review for the Zelotes 5500 Suppion.<br /><br /><br /><br />MX-510 Master Race"}, {"text": "logitech g9x"}, {"text": "Another vote on logitech g502. Absolutely the best mouse I had. I would like to change few tiny things on it, like pulsating color restricted to blue, but definitely the best one. I had Razer, but that crap gave me more frustration than the games I was failing to play. Razer is a confection, if you need a real mouse, stay away from those crooks. Logitech lasting for 2 years now, it&#39;s like the day one. Razer died right after I got it. Then died again. All the main buttons failed on it, one by one. So - Logitech FTW !!!"}, {"text": "I have the logitech 502 and I have a pretty small hand and its the best mice i have ever tryed"}, {"text": "How does QPAD 5K stand against these mouses?"}, {"text": "Asus gladius or Roccat Kone XTD optical"}, {"text": "I&#39;m so gonna buy the G502"}, {"text": "Worst gaming mice ever..."}, {"text": "G502 master race :)"}, {"text": "to bad that the logitech mx518 is not on the market anymore. it would definetly win the prize by logic standards.<br />there is only the g5 now which has the same shape but very different weight."}, {"text": "poor ppl saying razer mouse are overpriced"}, {"text": "You sound like gumamike but with better accent ."}, {"text": "holy fucking shit fuck pc gaming i built one of these money wasting pieces of shit and now i need a fucking 200 hundred dollar keyboard and mouse fuck this im gonna get a ps4"}, {"text": "is the logitech g502 worth buying for 50 dollars"}, {"text": "its mouse"}, {"text": "Loved g602. hate the g502, it&#39;s good but not for me. I had problems with the wireless aspect of the g602. Anything similar you would suggest?"}, {"text": "Mad Catz R.A.T. 3 Is the best muse for its price"}, {"text": "I just use a basic wireless Logitech mouse when I play. Games I play arnt advanced enough for one of these. But good video! It was good eye candy for me! Lol"}, {"text": "I never got spare feet with my g502"}, {"text": "This list is kind of a joke without Razer, tbh..."}, {"text": "about to hit 600k view on this video (599.5k) and just hit 200k subs! Nice!!!!!!!!"}, {"text": "Should be real and have 3 Logitech on the list. Their quality are much better than the niche players."}, {"text": "on the Logitech mouse g502 you did not talk about how the mouse has a unlockable scroll wheel, and a 3 profile option for multiple dpi customs"}, {"text": "steel series rival.  come on guys most fps pro players use it."}, {"text": "where mad catz at? rat for the win, especially 5,7,etc."}, {"text": "What is that keyboard he was using at <a href=\"http://youtu.be/02X3ZLUsojU?t=3m25s\">3:25</a>"}, {"text": "I&#39;d love to try another mouse but ever since I got the Naga, I can&#39;t get away from upgrading to each Naga that releases. Those 10 thumb buttons are too OP. I thought I wouldn&#39;t use most of them--I was wrong and I hate everything else Razer...<br /><br /><br />If I did switch however, I would go Logtiech. They have been making great gaming mice for generations."}, {"text": "You must be dumb to call them &quot;mice&quot;, they don&#39;t have a word for groups of computer mouse"}, {"text": "I&#39;m surprised no razer xD. But all these mice look swag I have razer orichi 2013 still is my fav mouse"}, {"text": "You missed one <br />Genius X-G500   (<a href=\"http://www.amazon.co.uk/Genius-X-G500-Gaming-500-2000-Buttons/dp/B00DOWYYQ2\">http://www.amazon.co.uk/Genius-X-G500-Gaming-500-2000-Buttons/dp/B00DOWYYQ2</a>)"}, {"text": "I recommend looking up the corsair m65(normal or rgb, either is good), I believe that deserves to be in here somewhere :) I compared to logitech g502 and naga epic), and I ended up liking the m65 more :P"}, {"text": "just bought a Logitech 502 this morning. It doesn&#39;t come with extra feet unfortunately."}, {"text": "Best Claw Grip gaming mouse design, 2015<br /><a href=\"https://youtu.be/7h1a8RFgqXA\">https://youtu.be/7h1a8RFgqXA</a>"}, {"text": "OMG  LOL Buy brayns Dud"}, {"text": "The logitech g300 is alright"}, {"text": "I am very happy with my Mad Catz RAT 3. I recommend any of the RAT releases."}, {"text": "Razer naga<br />"}, {"text": "That sniper button is absolutely useless, if you want lower sensitivity when zoomed in then you can just change it in you config file&#39;s. <br />And any good fps player will tell you that having one sensitivity for everything is better for your muscle memory"}, {"text": "i just bought the g502 and i have only played around with it for around 1 hour, but i can already say that i love it :) can highly recommend it (y)"}, {"text": "Razer Deathadder is a must for RPG gamers"}, {"text": "is it mice or mouse?"}, {"text": "You missed one of the best deals on amazon look up nemesis kane pro its what i use its baclit has a thumbrest right side toggle buttons rope instead of wire easy to press scroll wheel dpi button and more even comes with a backlit keyboard"}, {"text": "Last two are the only ones I would recommend. If it&#39;s not on Grim Fandangos &quot;Mouse Guide 2.0&quot; on Geekhack, I don&#39;t buy it!"}, {"text": "Does anyone have problems with the bottom piece of their g502 being worn out super quick and affecting the preciseness of the senors ?!?!?! Just curious hahah "}, {"text": "I honestly prefer the G602 over the G502. It&#39;s the same in my opinion but wireless."}, {"text": "Has anyone else had issues with the Roccat Tyon driver software? I can&#39;t seem to change any profiles on it or the lighting colors and it is just aggravating seeing as it ruins like half the point of the mouse."}, {"text": "G502 is just the BEST mouse, though its bottom does wear out, but if you use a mat, no problem"}, {"text": "no utechsmart venus 50? come on, it had all that number 5 had and more"}, {"text": "wheres razer?"}, {"text": "Was sitting here Hoping mine would be on here. Shows up at number 1: bragging rights all round :P"}, {"text": "any thoughts on the new Finalmouse? im tempted by it but would like to hear your opinion!"}, {"text": "ahhh not the corsair m65 :("}, {"text": "Logitech G402 is also good, lower version of G502"}, {"text": "None of these mouse r used by pros(csgo)<br />So <br />Midfinger 2 u brah"}, {"text": "I&#39;m thinking between the M65 (Corsair) and G502 (Logitech)"}, {"text": "ime 3.0 master mouse"}, {"text": "im getting that logitech g502 proteus core for free :)"}, {"text": "The Logitech G402 Hyperion Fury is a good mouse for FPS and rhythm games like Osu!... I don&#39;t own one of these mice but I&#39;ve tried one out and they are really responsive, have great accuracy and most importantly... no acceleration!!"}, {"text": "I use the G502, ive had it for about 7 months now, nothing is wrong with it at all, but it is a bit small for my hands but i have a claw grip so it doesnt effect me in any way :D also i do agree with the fact that alot of people think it needs customizable colours, that&#39;d be cool"}, {"text": "I bought Mad Catz MOUS 9 as it had good enough reviews and looks amazing but the experience has been seriously unpleasant. The real China make item is light and feels nothing like the visual hi-tech product onscreen. That wd be fine as lots of electronic products are from China like the awesome power vault from Koar that is &#39;what you see...is what you get&#39;. <br /><br />But the MOUS 9 was a dead mouse on arrival -- the battery compartment itself - the power source - is disconnected from the item. This is a usual fault in a lot of China made cheap battery operated toys and I was amazed Mad Catz quality control did not even know this. <br /><br />So, at this point, I have paid $133.19 for a MOUS9 but had no gratification of using it. I reported the defect immediately to Mad Catz isupport@madcatz.com <br />Ticket ID: 178006<br />Subject: Refer to Ticket ID 177797<br />Department: US Online Store Orders <br />Type: Issue<br />Status: Open<br />Priority: Normal<br /><br />And guess what they did - they refused me a replacement unless I PAY MY OWN RETURN SHIPPING! I debated the point and finally, after making me feel like I deliberately...had nothing better to do.... spoil the MOUS and spend hours requesting support and waiting for a non-existing Live Chat that was always &#39;dead&#39; ...they finally email me a pre paid RMA return to sender label. Mad Catz refused to replace unless they see the item and they refused to pay for the return shipping which any tech support staff knows when you call an item RMA, the company pays the shipping since the customer did not spoil the item yet suffered the delay in gratification after paying more than $100 for a MOUS. <br /><br />Order Summary: (\tWed, Apr 1, 2015 at <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=9m57s\">9:57</a> PM)<br />Mad Catz® M.O.U.S.™ 9 Wireless Gaming Mouse for PC, Mac, and Mobile Devices\t$109.99\t1\t$109.99<br />Subtotal\t$109.99<br />Shipping\t$10.00<br />GST\t$5.50<br />PST\t$7.70<br />Total\t$133.19 <br /><br />You folks look at the date now.... no refunds - no reply from Mad Catz Support despite requests from me - no replacement and they still have my $133.19. I am able to provide all proof of purchase - tix # - emails on print screen.<br /><br />Buy from Mad Catz at your own risk!<br /><br />Cedar T"}, {"text": "Im thinking of buying the razer ouroborous . I like the way that you can customize it and its wireless . "}, {"text": "How about the corsair m65? I find it really accurate and i love how it feel."}, {"text": "<a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=2m18s\">2:18</a><br />one of the most epic editing skills on the whole freaking youtube universe"}, {"text": "Would anyone recommend the steelseries rival?"}, {"text": "What a shitty list.<br /><br />No Zowie AM/FKs<br />No Deathadder 3.5 or black.<br />No Storm alcor<br /><br />NAOS 7000 has terrible angle snapping<br />Any laser mouse are SHIT.<br />g502 is an ABOMINATION , just like any logitech mice (terrible &quot;Ergonomic&quot; shapes)"}, {"text": "The mouse really depends on what games you play... but that tyton looks damn sexy to me as an FPS gamer... But well Madcatz R.A.T 9 best FPS gaming mouse... their new madcatz pro x will be awesome..."}, {"text": "WHERE IS THE RAZER DEATHADDER? razer sucks in all peripherals,but deathadder is the best gaming mouse imo."}, {"text": "steelseries rival or zowie or RIOT"}, {"text": "How about the razer project mcfly "}, {"text": "mx518 or g400 no contest."}, {"text": "I can&#39;t wait for MCFLY will you make a video about it @HardwareCanucks ?  <br /><a href=\"https://www.youtube.com/watch?v=IlCx5gjAmqI\">https://www.youtube.com/watch?v=IlCx5gjAmqI</a>"}, {"text": "Hey, Really looking at the G502... However just slightly concerned about its weight.. Currently just using a Gigabyte M6800... But was looking to upgrade to the G502, Is the weight really a big difference ? Thanks in advance, Reece."}, {"text": "Roccat&#39;s tilted joystick does this mean it controls the rudders of the aircraft for trimming a heading? That is the mouse GOG was offering in a contest about vintage PC&#39;s I didn&#39;t win, of course, so I am considering getting it."}, {"text": "lets talk mice:<br />roccat tyon is too heavy for me :s<br />roccat savu is too small<br />steelseries sensei has a laser sensor (so it has accel)<br />RAT series are weird and feel a BIT cheap<br />deathadder is too narrow for me<br />zowie fk is a bit narrow aswell<br />logitech g series are too heavy for me<br />cm storm is too weird of a shape<br />that is about it XD i still dont know what mouse to buy..."}, {"text": "IMO your old background music is better"}, {"text": "Okay I&#39;ve been a die hard Razer fan boy since I was 11 (I&#39;m now 21) and after my diamondback (which still works btw) my original Naga, Molten Naga and now 2014 model naga I felt like trying something different and when I went to insomnia 54, I tried the Logitech Proteus core mentioned on this list and it&#39;s safe to say it&#39;s the best mouse I&#39;ve ever owned! incredibly comfortable and easy to get used to (I have huge hands btw) Trust me, If you&#39;re considering a Razer or a Logitech, I&#39;d definitely choose this Logitech! :)"}, {"text": "I got logitech700s and it AWESOME"}, {"text": "Zowie best gaming mouse."}, {"text": "Roccat is shit imo, never gonna buy a roccat mouse again"}, {"text": "What keyboard does he use in this?"}, {"text": "I have the Logitech G400s <br />is it bad? :("}, {"text": "I&#39;m just stuck here with my Razer mouse mat, steelseries sensei mouse, roccat isku keyboard and a turtle beach headset... A mixed bag of peripherals and they&#39;re all incredible... "}, {"text": "This is the only place where I&#39;ve seen that the Roccat Tyon is a great gaming mouse."}, {"text": "I&#39;ve got MS 3XME mouse ~ 13-16$ its working perfect for me for 2 years now, if it gets broken, i&#39;ll probably buy the same model again, tho nice vid :)"}, {"text": "i wish the tyon had a optical version :/"}, {"text": "i am on a G502 and its the best for me. there are a few complains but its still the best for me.<br />the mouse weel klick is too hard so i programmed the mouse weel left to it.<br />the precision aim button (useless for everybody trying to train flick shots in csgo) to easy to press by accident left over without any function."}, {"text": "I upgraded my Logitech G5 with G502 and I love it :D"}, {"text": "I am trying to choose between a razer naga and a roccat tyon but I am stuck as both mice have very interesting functions. I am looking for a mouse that can help me cycle through items quickly (eg. Cycling through the grenades in csgo). I play mostly fps games and I hope that someone can help me reach a decision and advice me. :)"}, {"text": "Why wasn&#39;t the ROCCAT KONE XTD Optical featured in this list?"}, {"text": "I use Razer Abyssus 2014 really good nice grip good handfit, overall awesome for 50 dollars."}, {"text": "had Logitech G600, died after 18 months, cant find replacement. Bought Corsair Sabre RGB, thats just piece of <b>**</b> this mouse died after 3 months, it started to do doubleclicks. Going to buy Logitech G700s today probably."}, {"text": "I own and have been using a Logitech G600 and I&#39;m in love with it so good for all games and a user friendly software.."}, {"text": "NOOOOOOOOOOOOOOOOOOO! was waiting for the Razor Naga"}, {"text": "186,700th sub xD"}, {"text": "<a href=\"http://gifts.counter-strike-go.net/4EMnJm\">http://gifts.counter-strike-go.net/4EMnJm</a>"}, {"text": "You forgot the R.A.T 5 or 9 or 8"}, {"text": "Raping a mouse with buttons doesn&#39;t make it good...<br />"}, {"text": "zowie??? why not in here"}, {"text": "also, you dont even mention anything about the actual fucking lasers, which makes me think youre retarded"}, {"text": "no zowie mice. it makes this video invalid"}, {"text": "RAZER AND THE WITCHER 3 GIVEAWAY!! :D<br /><a href=\"http://www.razerzone.com/witcher3-giveaway?my_referral=7b10eccce5d4de108154779bb349a2f1\">http://www.razerzone.com/witcher3-giveaway?my_referral=7b10eccce5d4de108154779bb349a2f1</a>"}, {"text": "top 5 2015 keyboard (gaming)"}, {"text": "Agreed. Black and red is one of the sexiest color combinations for anything. <br /><br /><br /><br /><br /><br /><br /><br />Also, look at my profile picture. o3o"}, {"text": "guys what are your thoughts on the corsair m95? I&#39;m planning to buy one."}, {"text": ""}, {"text": "1-)Logitech G300"}, {"text": "<a href=\"https://www.youtube.com/watch?v=cY-EjJnOi4M&amp;feature=youtu.be\">https://www.youtube.com/watch?v=cY-EjJnOi4M&amp;feature=youtu.be</a> please watch"}, {"text": "  ็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็"}, {"text": "The allienware tactx is great "}, {"text": "<a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m20s\">3:20</a> What Keyboard Is That??"}, {"text": "Why isnt madcatz on the list?"}, {"text": "Where is the R.A.T?"}, {"text": "which mouse is better: roccat tyon or kone xtd optical? will there be an optical version of the tyon coming out and are the weights in the kone really important?"}, {"text": "Howcome there were no Razer mice included? they have the best selling gaming mouse since 2006 and a few other award winning mice that I was hopefully expecting to learn about from you guys"}, {"text": "i clicked with my logitech m175 mouse over 100000 and it still works 80% properly<br />because now its a bit harder to spam the click button"}, {"text": "Best gaming mice are SteelSeries and Razer... Even when I am a bigger fan of SS, i still think these two mice and still one of the best ones"}, {"text": "What&#39;s so special about gaming mice exept for the extra buttons?"}, {"text": "Logitech g402 has a WAY more better and accurate sensor than the g502. Also the g402 has no mouse smoothing at all, linus techtips did a test and absolutely 0 smoothing was found"}, {"text": "Fuck Razer."}, {"text": "i have a small hand and i like to claw my mouse. which mouse is good for me? i usually play dota 2"}, {"text": "RAZER!"}, {"text": "how about the Logitech MX Master Wireless Mouse"}, {"text": "What better? SS RIVAL VS CM STORM MIZAR"}, {"text": "Nah, the best mouse is Mickey "}, {"text": "keep up the good work could use a up grade pc is old"}, {"text": "nice sh*t @HardwareCanucks"}, {"text": "With my old naga i could get like 17 clicks a second but i transferred to a logitech g502 and now i can only get about 10 with my G502 :/"}, {"text": "I suggest the Roccat Kone XTD if you want to save some money. Still just as wesome of a mouse and I love mine."}, {"text": "Why most of best gaming mices are optical no laser? I thought laser is last technology so, cause of that it is better, than optical.<br /><br />Sorry for my terrible english, thx for reply :)"}, {"text": "Muchas lucecitasssssss"}, {"text": "I&#39;m looking for a left handed gaming mouse, may someone help me to find a good one ?"}, {"text": "logitech mx518"}, {"text": "well im soon geting a gaming mouse hope I get a smalller one then my bro"}, {"text": "my favorite is g507"}, {"text": "actually i would suggest the razer deathadder chroma/2013, only difference between these two is the customisable lighting in the chroma and 10000 dpi in the chroma, also it is extremely ergonomic and has a 4g optical sensor."}, {"text": "Hello.Could you help me make a review? This is my email jackbrownbusiness@gmail.com we can talk more here<br />Looking forward to your reply<br />thanks"}, {"text": "what camera &amp; lenses has been used for these shots?"}, {"text": "lol no razer or steelseries? Cheap fucks."}, {"text": "perhaps the E-3lue Mazer II 2500 DPI Blue LED Optical Wired Gaming Mouse by Mazer?"}, {"text": "Would you guys so kind to tell me what is the name of this chillout background music which Dmitry often uses in his videos (and in that video as well)?"}, {"text": "i have proteus core"}, {"text": "You forgot that the G502 is the first mouse with 12.000 DPI"}, {"text": "Whitch one is best for league of legends? "}, {"text": "+1 for not including razer in the list. Because razer simply crappy and overrated"}, {"text": "I have a Logitech MX518 from 2005 and its still kicking strong.  I have had to replace the mouse cable due to my little dog eating it when she was a puppy and more recently I had to get a new shell for the entire mouse.  The original was just wearing out from being used so much.<br /><br />I ordered the Logitech G400s shell for my MX518.  I picked it up on Ebay for $8 direct from China.  The G400s and the MX518 are the exact same size so the shell fits 100% perfect on my MX518.<br /><br />I have probably used my MX518 every day since I got it for a minimum of 4 hours and a max of 12 hours in a day.  Just depends.<br /><br />I have tried replacing my MX518 lots of times over the years. I had all the major brands from Microsoft, Razer, Corsair, Mad Catz, and SteelSeries.  No matter which mouse I bought I ALWAYS went back to my MX518 within a month or 2.  The feel of the MX518 is just so perfect IMHO.<br /><br />Its sad they stopped making the MX518.  I would have just bought a new one instead of giving it a makeover :) :)  Sadly, the only way I am gonna get another MX518 is to order one off of Ebay for $30-$50 depending how much the seller wants since they do not make this mouse anymore and its still pretty popular amongst old school gamers like myself :)"}, {"text": "Roccat pure xtd is best!"}, {"text": "Have you reviewed the Razer Ouroboros?"}, {"text": "n/c this... no deathadder, no rival, NO ec1-a (or ec2-a) ??? SRSLY??? &quot;GAMING&quot; mices, for brainless ppl..."}, {"text": "where is roccat kone razer deathadder  chroma m45....."}, {"text": "What is the name of that keyboard at <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m12s\">3:12</a> ? XD<br />Thankss."}, {"text": "g502 &lt;3"}, {"text": "depends on what ur playing style is and ur hand size i use the razer naga and its perfect for me and my hands r pretty big lol"}, {"text": "G502 is great thus is liked the G9 way more"}, {"text": "20$ mouse - Mazer e-blue. not razor mazer. great 4 dpi settings, 5 programable buttons blue less, and really distinctive scroll wheel steps."}, {"text": "Why did you say that the mice in this video were not listed from best-worst/worst-best then number them? Also you should script your videos before recording, and send the script to someone you know who is a native English speaker. Although I could understand, it was frequently difficult to."}, {"text": "What about razer mices?"}, {"text": "The Tyon looks very similiar to the g700"}, {"text": "Where the fuck is the Deathadder? LOL"}, {"text": "My Azio GM2400 does a great job for its $30 price tag. I have huge hands, and it fits comfortably, even though my friends who try it and have smaller hands are comfortable with it. "}, {"text": "IM NOT HAPPY WITH WITH MY LOGITECH G502"}, {"text": "I use a Logitech Proteus, and I love it."}, {"text": "What i dont like about your reviews is the fact you miss the most important thing... how long will they last before they broke... cool many fancy things but i dont give a <b>***</b> if its only gonna last for 5month.<br /><br />Here&#39;s an exemple. I bought 3 different logitech (im using the g602 right now) each one of them got the problem of double click. And i got it for only 7months. So no more logitech for me...."}, {"text": "I own the G502 and I love it."}, {"text": "I actually recommend the Zelotes Optical mouse. It is used for Gaming &amp; Office. Best mouse I have ever had. "}, {"text": "G502 = Love it...."}, {"text": "If any PC company was half smart they would make a SILENT gaming mouse that is optical with high dpi and appropriate amount of buttons etc etc etc. Instead cheap chinese &#39;gaming&#39; mice exist that are silent BUT are as accurate and poorly put together as $5 mouse from a corner store ffs. Even $40 silent &#39;gaming&#39; mice by Mofii etc are not accurate or they are either laser or some crap catch. Raging that Logitech or Naos or Razer hasnt made an ergonomic, optical, high DPI, silent gaming mouse! Does anyone know how to make the G502 silent? Ive seen a disassembly video of the G502 and it looks like its impossible to make silent.. Ive heard of the G9x being made silent, but it doesnt have enough buttons and its old technology in comparison to some of the mice in this video.. Someone help! What quality silent gaming mice are out there?"}, {"text": "Currently usingh the prodeus coreg502 and personaly I love it and would recomend it to anyone who owns a computer"}, {"text": "Where&#39;s the Sumvision Kane Pro Edition Combo Pack?"}, {"text": "Zowie fk1 (claw grip) and Deathadder 2013 (palm grip) are best for FPS gaming (CS GO). Look no further."}, {"text": "G502 best mouse ever."}, {"text": "Razer Naga Epic Chroma is the best ever"}, {"text": "The Logitech g303 is a great mouse for fps, it has a 12,000 dpi "}, {"text": "How about trying ninox aurora? It&#39;s a mouse that bst (a quake player) has made with the esreality community, discussing and collecting the best parts from mice that are famously strong in some areas (wmo sensor for example). Apart from a few issues from the early builds like a too stiff cable and for some people there was a small difference between the left button&#39;s and right button&#39;s gap to its register and one that probably causes issues for quakers only (right and left button can&#39;t be pressed at the exact same time, it has to have like 10 ms difference) the mouse is pretty neat, the tracking is amazing according to the people, who have bought it. Despite the fact that bst was putting this together all alone, and it&#39;s his first mouse ever, plus i&#39;m sure it will evolve over time."}, {"text": "I used to have the Razer Naga and after owning for about 3 months, the mouse from time to time would freeze in place and didn&#39;t feel natural after a while. That was my first gaming mice. I just bought the corsair M65 RGB, it&#39;s 10x better than the Razer and it&#39;s pretty amazing. Whatever you do, don&#39;t buy a mic because of the looks, I got fooled by the Razer Naga. I wanted the 12 buttons on the side but the mouse overall sucked ass."}, {"text": "No razer naga? D:"}, {"text": "You made me purchase one of these mice... The Tyon... Couldn&#39;t be happier with any other mouse!!!!!! THANK YOUUU xD"}, {"text": "is this the guy from top10meme?"}, {"text": "Just got a G502. One of the best mice I have ever owned. This is from someone who owned 2 deathadders."}, {"text": "Razer deathadder? I have it and it&#39;s a great mouse"}, {"text": "he sounds like top10memes"}, {"text": "The Peregrine glove is sh*t! Do NOT Buy. The idea and form are fantastic. Ergonomics couldn&#39;t possibly get any better. When it comes to functionality and reliability it scores a big 0. If the gloves sensors were &quot;de-localized&quot; it would be much more responsive and accurate. All the tech does is measure the difference in current on the cannel of each finger. I could design better tech for this glove. If anyone from Peregrine reads this, contact me."}, {"text": "Zowie FK 1  ;) Nice video btw!"}, {"text": "No G9X?! I don&#39;t understand."}, {"text": "Logitech-Proteus Core best one for me"}, {"text": "I recommend the TechNet 6D Gaming Mouse"}, {"text": "Wow this was total shit no steelseries or razer? Steelseries makes one of the best mice on the market and so does razer..."}, {"text": "Where is the razer naga?"}, {"text": "i have sold my soul to corsair"}, {"text": "I have Mionix Naos 7000"}, {"text": "R.A.T. 7 ??"}, {"text": "Razer Naga Hex is the best!!"}, {"text": "Have you ever taken a look at, or consideration into the Cougar 700M? I have been using one for almost 6 months now, and I have to say, I really do love it. When I was looking for a new mouse, I took a look at the Razer Ouroboros, but the plastic seemed too light, and it felt too cheap, and the R.A.T. 9 was far too expensive for me, but the 700M seemed to be the perfect mix of price, quality, and style that I was looking for.<br /><br />It sports plenty of buttons for whatever I need it to do, and programming them for other tasks or adjusting profiles is pretty nice with the Cougar software. It does have adjustable weight, which his really nice if you like heavier or lighter mice, and the palm rest on the back is also adjustable or interchangeable. The metal construction is a nice touch, and the plastic pieces feel sturdy, dense, and smooth. It&#39;s not wireless, but it does have a nice long, braided cable that I really like. The lighting isn&#39;t too extravagant, but it definitely is there. There are 4 indicator lights for the DPI setting, which I think was done in a really aesthetically pleasing way, and there is one programmable LED on the front that you can adjust to add a little bit of an accent to your desk in a dark room.<br /><br />I really can&#39;t say how much I like it, and I would certainly recommend it to any person looking for a new gaming mouse."}, {"text": "love my G600... more thumb buttons than i know what to do with... great laser too"}, {"text": "Check out my review of a budget gaming mouse with peak performance for as little as $8! <a href=\"https://youtu.be/LpLqPKhtxTY\">https://youtu.be/LpLqPKhtxTY</a>"}, {"text": "Corsair M98 Mouse is best Mouse"}, {"text": "i have the logitech g502 proteus core gaming mouse and it&#39;s the best i&#39;ve ever laid my hands on. 10/10"}, {"text": "Oh god its funny  how the razer fan bois are saying WHY NO RAZER? xD"}, {"text": "I realy like the microsoft sidewinder x8 old mouse feets, i hope someone out there will implent those feet for other mouses. The new x8 mouse aint as good. I have razer diamondback, razer copperhead, razer lachesis, razer naga, steelseries ikari, roccat kone, logitech g9, logitech g700, microsoft sidewinder x5 and sidewinder x8 last one on its last leg cause after 4-5 years with gaming one of the side buttons have started to give up. Razer mouses still have the same problem where it looks like the mouse is stopping on the screen some say its the driver some say its the mouse, dont know but most of the mouse feets wear down to quick and or you have to find new feet, better with plastic knobs i feel like with sidewinder mouse, cause most mouses have problem with theire feets after a while."}, {"text": "The G502 is really not that great. your fingers slip on the sides, it is really heavy without the weights and the pads below the mouse just come off after a small period."}, {"text": "You should add the Cyborg® R.A.T. 9 Gaming Mouse<br /><br />link:   <a href=\"http://www.amazon.com/Mad-Catz-T-9-Gaming-Mouse/dp/B009PHSDBM/ref=sr_1_1?s=electronics&amp;ie=UTF8&amp;qid=1427047306&amp;sr=1-1&amp;keywords=Cyborg%C2%AE+R.A.T.+9+Gaming+Mouse\">http://www.amazon.com/Mad-Catz-T-9-Gaming-Mouse/dp/B009PHSDBM/ref=sr_1_1?s=electronics&amp;ie=UTF8&amp;qid=1427047306&amp;sr=1-1&amp;keywords=Cyborg%C2%AE+R.A.T.+9+Gaming+Mouse</a>"}, {"text": "Madcatz R.A.T. 9?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=5m19s\">5:19</a> my hands are large...don&#39;t ask why..."}, {"text": "What keyboard is that?"}, {"text": "Logitech G602 is out. It is very responsive and has grip to allow quick movements. It has 6 sensitivity options and and a 2-Setting DPI switch. It also has 6 command buttons that have secondary command settings. This can add up to 42 separate commands divided between the buttons. (I own one that&#39;s why I know a small bit about it)"}, {"text": "Do any of these work on minecraft?"}, {"text": "Review didn&#39;t mention how bad the scroll wheel is on the Logitech mouse. Logitech has really got to do something regarding their scroll wheels, it&#39;s their weak link in all their mice. They all feel cheap and rough."}, {"text": "Razer Ouroboros and deal with it"}, {"text": "FOR ME .. i need usb wireless mouse is better &quot;NOT Wired&quot;<br />i play in my pc with xbox controller<br />i wish will corsair making best wireless mouse in the world﻿"}, {"text": "Which mouse would you buy if you had Quote large Bands?"}, {"text": "Is there a &quot;Best Budget Gaming Mouse&quot; video?"}, {"text": "Subscribe to Teddy DoezStuff"}, {"text": "G502 is tops. :)"}, {"text": "These mice are fucking bad and retarded. MMORPG PLAYER NABSTAR. GOOGLE ZOWIE YOU SCUM."}, {"text": "As a avid gamer with large hands. I can attest that many mice are made for smaller hands (women/men/children). While a selection of good mice are just not there, save a few. And when I say large I mean this excludes any mouse with a small body, slender body, tightly clustered buttons, etc. I will say the best overall I have found and people can hate Razer all they like. At #1 would be the current model of the Death Adder. It fits my large hand snug and comfortably, without making the mouse feel like a small toy. My hands also rest on it with ease without shaping it to uncomfortable and weird hand shapes. #2 Would be the SteelSeries Rival. It has a very similar comfort grip as the Death Adder. My main complaint was that the Rival&#39;s scroll isn&#39;t as clean and smooth as the Death Adder. and when you play games you want this. Otherwise up and down scroll actions get to feeling clunky. They could have relaxed it here a bit to give it an easier glide.<br /><br />In the end get the Death Adder if you can/wish. Otherwise go with the SteelSeries Rival."}, {"text": "razer naga epic chroma. love it."}, {"text": "Sharkk 14 point feels the best and best software "}, {"text": "where is the corsair mouse?"}, {"text": "razer deathadder chroma"}, {"text": "been using my logitech mx518 for 2 years and still doing very well i would reommend it"}, {"text": "Logitech G400s is dead G502 took over :p"}, {"text": "Right now I&#39;m using the Logitech G400S which replaced the MX518, one of Logitech&#39;s most popular gaming mice ever. Performance wise it is a super nice mouse but if you have hands that are on the larger side, your pinky will wave about freely. That is why I&#39;m looking for a neat replacement since I&#39;m upgrading my computer soon enough as well. But this time I want to go all out and get a pinky rest for added stability to my aiming in-game. Right now I&#39;m kind of looking at the Roccat Savu. I&#39;m not sure if there are many options I&#39;m just not thinking about when it comes to mice but as I said, I&#39;d love for my entire man hand to be supported for a relaxed and stable aiming experience. :)"}, {"text": "102, 302, 402, 502 all u need to know"}, {"text": "G502 master race."}, {"text": "Wheres the A4Tech x7 F5"}, {"text": "I have the Logitech 500s. Would not switch it out with any of these, especially the 502.. It&#39;s such a bad build."}, {"text": "Ive pretty much decided on the Tyon. Anything I need to know before buying it?"}, {"text": "what keyboard is that when you were reviewing the monix avior 7000?"}, {"text": "wow name brands like crazy.. No Zowie? Thats sad to see have you ever used a Zowie mouse?"}, {"text": "Check the Rat 7. It has an unique, cool look and is super customizable."}, {"text": "Mouse: steelseries rival .keyboard: steelseries apex .headset: logitech g430 i&#39;m happy whit my set up"}, {"text": "The Final Mouse :p"}, {"text": "Where is razer deathadder. Im not a fanboy (i kinda am) but it should atleast be in top 3 or nr 2"}, {"text": "I have the g502 and i won&#39;t recommend it for youtubers because it&#39;s loud af"}, {"text": "where is razer -.-"}, {"text": "I use the razor naga 2014"}, {"text": "G502 is an awesomely insane mouse. I received this as a gift from my wife for our Anniversary to replace my G500 and right away it was very noticeable how well it performs over my G500.<br /><br />Most Definitely my top pick for gaming mice."}, {"text": "What?! No rat 7/9"}, {"text": " Razer naga hex red version is what I use and it is great"}, {"text": "My two favorite mice, The Anker 8200 DPI mouse, My primary mouse for shooters (FPS, Third person shooters)<br /><br />And the Redragon Peridition, Simply the best MMO mouse I&#39;ve ever used at an amazing price point. It tracks well, But there is a slightly noticeable difference between it and the Anker 8200, Hence my preference to use the Anker for shooters.Both mice feel great in the hand, And both have lasted me quite some time now. The software for both is seemingly flawless. "}, {"text": "the logiteck g612 ist op to gaming"}, {"text": "IN YO FACE RAZER FANBOIS!"}, {"text": "No razers? Meh"}, {"text": "I own and use a G502 and love it. My favorite mouse so far. I love the software that comes with it great profile settings and DPI adjustability. "}, {"text": "sorry but these mice are shit<br />current best mice are the DA 2013, FK1 and the G400, these mice are comfortable enough and have the best sensors, the mice in this video have uncomfortable unnecessary gimmicky macro buttons with some LEDs, and the price is just ridiculous, 100$ for a mouse? "}, {"text": "Razer deathadder 2013"}, {"text": "I use the speedlink Decus Gaming mice. I got it for 35$ and it does the job, looks good and has makros. I like its ergonomics. I&#39;d recommend it for people on budget^^"}, {"text": "Surprised to not see the Death Adder on here. I personally use the Naga for MMORPG&#39;s."}, {"text": "Steelseries rival, perfect sensor, perfect for big hands"}, {"text": "SteelSeries Sensei FOREVAAA"}, {"text": "No M65 RGB? damn"}, {"text": "акцент слишком русский"}, {"text": "Why isn&#39;t the Razer Deathadder in this list?<br />And the ROG Gladius is basically a rip off of the Razer Deathadder "}, {"text": "LOGITECH MAKES BEST EVERYTHING!&lt;3"}, {"text": "this list is so shit..where is deathadder? FK1? etc...you put in flight simulator mice and call it top 5 gamingmouse HAHAAH"}, {"text": "No Zowie mice? "}, {"text": "Lots of middle fingers given to Left-handed gamers by Mouse companies. As usual. We like WIRELESS Gaming mice also. Currently only the $150 Ouboros &amp; one at almost twice the price have that. "}, {"text": "roccat savu ! extremely accurate , minimalistic with 2 side buttons, good ergonomics, a little small but thats how i like it ... hehe."}, {"text": "what key are you using? <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m20s\">3:20</a>"}, {"text": "roccat and logitech were deserving of the spots, the rest were kind of plain. by plain i mean 2 buttons on the side and scroll and dpi buttons on top, in top 5 there should all be at least 3 thumb buttons."}, {"text": "Your accent makes me wet. No homo!"}, {"text": "Just get the logitech MX performance mose XD"}, {"text": "been looking for a good professional review of the top mice for MMO gaming. Was wondering if you guys could do one up?"}, {"text": "I need to buy a new mouse soon Logitech G502 or Razer Deathadder?"}, {"text": "hi.. i watched this video before buying my first gaming mouse, few hours after watching this vid, i get the logitech G502.<br />well since the shop is less than an hour away..<br />this is my first gaming mouse... i don&#39;t know how to set the buttons available in the mouse...<br />is it require to visit an website? or pc installed??? omg im so idiot &gt;.&lt;"}, {"text": "Razer Ouroboros m9"}, {"text": "Razer naga epic"}, {"text": "I have the Logitech G502 and the only thing I don&#39;t like about it is the feet but that is little the main thing is the comfort it&#39;s not the best in that but it is good on everything else "}, {"text": "It&#39;s mouses!"}, {"text": "razer deathadder ?"}, {"text": "i use a razor mouse"}, {"text": "Logitech G700"}, {"text": "Steelseries sensei for me. Used to love the WMO but no dpi/polling rate option on it and cord SUCKS ASS. The steelseries sensei/xai is the closest thing to the wmo in shape but even more comfortable for me, it&#39;s flatter which feels better"}, {"text": "What about Atdoshop Professional 4000DPI 10D LED Sword Master Optical Wired Gaming Mouse for DotA FPS PC White"}, {"text": "I own the Logitech G502. It&#39;s a good mouse but like the video said the feet/grip do wear out over time."}, {"text": "Deathadder Chroma"}, {"text": "Logitech G502 is quite an awesome mouse. it just doesn&#39;t get any better than thing. 10 points Logitech. Love it. Love it. Love it. Well done. "}, {"text": "Check out <a href=\"http://clanshelper.com/\">http://clanshelper.com/</a> - I got free CoC gems here! Get yous too in less than two minutes!! Couldnt believe at first but it really works for CoC!(CPskzHcyBx)"}, {"text": "ur english"}, {"text": "All of these are too expensive! <br /><br />But this video is appreciated."}, {"text": "I&#39;m using the &quot;Razer Copperhead&quot; since 8 years now. Still works like a charm. Sadly it&#39;s not produced anymore. And the new Razer Mice aren&#39;t that great :&#39;( "}, {"text": "replacement feet are now included in the Logitech mouse."}, {"text": "I&#39;ve had the G502 since release now, and I must say that for me it was a bad purchase - this is probably due to the fact that it was my first mouse I&#39;ve brought dedicated to gaming. I didn&#39;t realise different mice accompanied different grips, now I have a finger tip grip (uncommon) and this big mouse doesn&#39;t facilitate me well. I found with the ergonomics and button locations that it was definitely geared to the popular glaw grip.<br /><br />Furthermore the button layout, despite you being glaw grip or not is terrible. To make them less of a strain to reach the back buttons, they should have all been decreased in size and pushed forward.<br /><br />However I did find myself liking the weights, I found that if I added 2 weights, one at the back and one of the left it increased by accuracy.<br /><br />Contrastingly I found that the massive DPI of 12,000 and the &quot;sniper&quot; button (slows down mouse speed while holding it down) are both gimmicks, I never found myself using either. Unless I had a 5K resolution that needed high DPI I may consider it, but even 12,000 DPI is too high then. The &quot;sniper&quot; button actually made it <i>harder</i> to shoot accurately, instead you&#39;d have to adjust quickly to the slower speed, while putting your finger in a awkward position to hold it down.<br /><br />In heinsight I would have gone for a minimalist mouse, with less crap involved and no software."}, {"text": "I LOVE my Logitech G502"}, {"text": "I found one better and for only $40 (the Redragon Perdition)"}, {"text": "Years and years ago when i played savage 1 and fear combat, i had my ancient logitech PS/2 optical mouse which came with the computer. I am yet to feel the same weird sensation again as if the mouse really was part of my hand. In fact i kicked ass so much in fear combat that many times people accused me of cheating. And there were a lot of cheaters because it was a free game, we had to change servers quite a lot.<br /><br />So i did a social experiment and changed my name into a girls name. ...After that i only got compliments and cheers. Fear combat is what truly got me into gaming, and that mouse is still the best i have ever had. Even though its from the 15th century.<br /><br />...Maybe i should buy one of them just for the luls."}, {"text": "I have a CM Storm Devastator the scroll wheel is trash."}, {"text": "Zowie...that&#39;s all I have to say"}, {"text": "I have a question. People at my school say I have big hands, but I don&#39;t believe them. No, it&#39;s no insecurity problem if you&#39;re trying to troll me. I just want the right mouse, with the right sensor, with the right feel, with a comfortable dpi (of which the latter is of course completely up to me).<br /><br />I don&#39;t know if all of the following factors in on what mouse I should buy, but let me just name a couple of facts about me:<br />-When playing games like CS:GO (or any game), I try to play the objective<br />-99% of the time I get &quot;sucked into&quot; the the game and get superhyped (I try to be an MLG tryhard, and I say it without shame... nah, just kidding. I know I won&#39;t be in the MLG anyday, so I just play it for fun, but I do like to think out my strategies &amp; stoof. I know, stoof is such a cool word, isn&#39;t it? <b>pats self on the back</b>)<br />-I haven&#39;t yet had the chance to download whatever game I want, because hard drive space, yaknow? the GB on the disk(s) is two digits, talk about being broke... <a href=\"http://www.youtube.com/results?search_query=%23FirstWorldProblem\">#FirstWorldProblem</a><br />-My hands twitch sometimes, I have no clue why<br /><del>I&#39;m kind of in a phase where I can&#39;t relax unless I&#39;m listening to my favorite song or the song sounds really good (yeah, not just with gaming, but in general. like sometimes I just need to take a walk). so, in other words, i can be uptight sometimes &amp; i know that i need to relax &amp; lay back, but I don&#39;t because-</del> Wait, why the fuck won&#39;t I relax? WHY?<br /><br />What the #&amp;@&amp; does this have to do with a gaming mouse, you ask? Well, I&#39;m just trying to give you some insight on what my needs are and &quot;what&#39;s my zone&quot; when I&#39;m in my zone, so to speak.<br /><br />HardwareCanucks, please let me know what mouse I should get. Now I suddenly realise that this is a phase I might be in now, but it can change soon. Maybe I should think ahead instead of thinking in the short run. Normally I&#39;m relaxed, but I don&#39;t know &quot;what the heck I&#39;ve been smokin&#39; lately&quot;, as the youngens would say. Nah, just kidding, I don&#39;t do drugs. It might be my autism... kbye"}, {"text": "I have the last one"}, {"text": "I really like the logitech g602 its not the newest but for me its really good grip. it can has up to 1400 battery life hours it has 6 buttons on the side and has a max dpi of 2500 and works wirellesly"}, {"text": "I have a Tecknet M133, about £6.99 before christmas and I love it. up to 4000 dpi, two extra buttons in the thumb groove, Changes light colouring according to dpi setting, and I really don&#39;t feel that I have any problems with it."}, {"text": "Razer "}, {"text": "Using the Roccat Kone XTD atm, better than all the mice I&#39;ve used so far in my life, including, but not limited to: Deathadder, Abyssus, Naga, Taipan, R.A.T 7, some of the super popular Logitech ones, Steelseries sensei and Roccat Kova!"}, {"text": "the best gaming mice mouse is the Gigabyte M6980X"}, {"text": "It&#39;s all personal preference, obviously, but I love my Steelseries Sensei Raw. I tried the Rival and just could not come to grips with how big it felt. I snagged the Sensei Raw for $40 during a sale and haven&#39;t looked back. It&#39;s simple and elegant and feels wonderful in my hand."}, {"text": "Is this a good setup (for gaming and school) <br />Laptop: razer blade pro<br />Mouse: razer naga<br />Headset: astro"}, {"text": "I wanna know what is better Deathadder 2013 or Mionix Naos 3200"}, {"text": "Rat 7?"}, {"text": "Logitech G700"}, {"text": "What a joke of a list. Best mice include steelseries rival/sensei, razer deathadder and zowie AM/FK. These are the most used mice by professional players. And not 1 of these mice is on this list. So nice try... Your credibility could not be worst after this video..."}, {"text": "g502 wheel sucks"}, {"text": "I think the Logitech G700s is very good. :)"}, {"text": "Changed out my Deathadder with double click issues after 2 months for a G502. Can&#39;t wait for it to arrive!"}, {"text": "I have the G502 Gaming mouse and it is truly the BEST mouse I have every used so far. I have had it for about 2 months now and I haven&#39;t had a single problem with it yet. I am truly happy for what I got."}, {"text": "Logitech g402 and g502 are the best gamer mouse."}, {"text": "Tyon is so sexy. <a href=\"http://www.youtube.com/results?search_query=%23NerdOrgasm\">#NerdOrgasm</a>"}, {"text": "What keyboard is he using"}, {"text": "I owne a Mionix Naos 3200 mouse and a Mionix Propus 380 mouse pad , I love it , 3200 Dpi is just fine for 1080p resolution up to 1440p"}, {"text": "I currently use the Logitech G502 Proteus Core, I am always 100% comfortable whilst using this mouse, I feel as though this video did not give the credit that is due for this mouse, you focused on the feet which I have not had a problem with  "}, {"text": "No razor?"}, {"text": "You didn&#39;t even put in the Razer Naga, That&#39;s like the best mouse in the world :D<br />And seriously.... What about the AULA gaming mouse?"}, {"text": "Steelseries sensei RAW is affordable and has a great sensor."}, {"text": "1. Tyon is just a big expiriment and is highly speciallized thus can not be the best one out there. Worth mentioning anyways.<br />2. ROG Gladius is a major breakthrough of 2014 on the market of gaming peripherals but it still lacks a lot of things. Though the next iteration of it has really good chances of dethroning the DA.<br />3. Mionix... This top is created by an American right? Well at least it is not &quot;Phoenix&quot; from california lol ^_^<br />4. Mizar - ... Like really? You put a mouse from the bottom of the middle of the list to the top 5? Personal preferences affect your judgement.<br />5. G502 - I just hate it for the amount of marketing crap Logitech pulled out instead of improving the quality of their newer mice. Worth mentioning though.<br /><br />Now the question is: where is the Kone Pure Millitary? Oh, right your rules do not allow to include more than one product per manufacturer.<br /><br />Deathadder is still the best selling out there but I agree that Chroma version is bullshit and doesn&#39;t deserve to be mentioned next to breakthroughs.<br /><br />No great mice from SS last year too. But I guess SS and Razer are going to go full &quot;X strikes back&quot; now that the market was flooded with products some of which are really good and rival such titans as Sensei and DA."}, {"text": "What about the razer deathadder chroma?"}, {"text": "Last week i baught Zelton 550 Gaming Mouse, and it&#39;s freakin amazing in dota where i really need a good mouse.<br />It&#39;s only 11.99$, please check it out <a href=\"http://amazon.com/dp/B00IFRH6JS/?tag=amadealzon-20\">amazon.com/dp/B00IFRH6JS/?tag=amadealzon-20</a>"}, {"text": "Roccat product are great and all, but there advertising is so fucking annoying."}, {"text": "My personal favourite is the Logitech G600, thing fits like a glove and i love the 12 keys on the side."}, {"text": "where is razer?"}, {"text": "The best gaming mice are from cyborg / madcatz for example: the M.M.O.7 ;) just sayin, its like the logitech in your video+with better quality (not stupid plastic) and more macros!"}, {"text": "i love the G 602"}, {"text": "Any know if the Miniox Naos have the same problem as the CM Storm Sent ADV 2, which is the soft rubber peeling in a months usage?"}, {"text": "@HardwareCanucks  at 3 :22 keyboard name plaese ?"}, {"text": "best mouse is steelseries rival"}, {"text": "Where&#39;s Razer Ouroboros? :("}, {"text": "anyone know of a good wireless mouse that is also rechargeable?? price wise. 30-70 bucks would be great"}, {"text": "No Razer Naga? bump"}, {"text": "WHERE&#39;S THE RAZER DEATHADDER!!1"}, {"text": "He sounds so much like top10memes"}, {"text": "Death added and sensei should be on this list"}, {"text": "bloody v8"}, {"text": "What&#39;s the best mouse with a green lighting towards it. The color will match up my setup"}, {"text": "For reasonable price I love Logitech gear, I use the G700 ATM and find it to be a great mouse. The DPI switch buttons are located in a great spot, ergo&#39;s are fine and 4 macro thumb buttons."}, {"text": "razer şok razer wefat razer iptal dafsafdsdfafsdf"}, {"text": "Roccat looks very similar to logitech&#39;s G300 <br /><br />definetly gonna pick it up if my mouse wants to be replaced "}, {"text": "Those mice fucking suck......I have a Logitech G500 switched to a Sensi Raw best mouse  going to switch out the mouse feet for extra glide w/ hotlines feet the best mouse doesn&#39;t look like the best. The key to a good mouse if how fast you can pound on the OMRON switches sensors come into play too. mouse pad makes a difference your chair and table I have my table angled like 5 degrees down from flat."}, {"text": "What do people think of the Death adder? especially the 2014 Chroma edition?"}, {"text": "thanks for the info and some good mice i subscribed "}, {"text": "What is the name of the keyboard? @ <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m16s\">3:16</a> "}, {"text": "dude u shouldeve put the M.O.U.S 9 thats like my favorite and the best in my opinion"}, {"text": "G600."}, {"text": "thats fuckt up if u think that logitec shit mouse is good^^ not really for gaming/cs!"}, {"text": "I have the G 502 and iam very happy with it. It´s an amazing mouse: :D"}, {"text": "But you have to ask your self, What do you play most!(game type) And than take the one that fit you best. Buying a BF4 mouse for MMO, well The first one (roccat will work). But it different from people to people/ hand to hand."}, {"text": "G502 shouldn&#39;t be in there. Too many problems which is what you get when using cheap components."}, {"text": "Decus is really cool as wel. "}, {"text": "which is the best steelseries mouse??"}, {"text": "RAZOR DEATHADDER 2013, very light 6500 sensor and you wouldnt ever want more."}, {"text": "zowie ec1 tho????"}, {"text": "Razer Deathadder 2013...Just the best &lt;3"}, {"text": "you cant get a better gaming mouse then mad catz R.A.T "}, {"text": "very nice feeling mouse i got the g502 good button placement but the back bad on the bottom clipped up causing scratching on the mouse pad, had to remove it, then it worked great again"}, {"text": "None from the R.A.T. series? List fail."}, {"text": "LOL gaming mice"}, {"text": "I would put the Corsair m45 up on that list for a good but cheap mouse under $50<br />I&#39;ve been told the DeathAdder is real good for cheap."}, {"text": "seriously?? and all the razers?"}, {"text": "After being a Razer fanboy and disappointed in not seeing a Razer product. I immediately wanted to write a comment questioning the absence of my beloved mouse brand. However after reading the comments for this video, I have now become a hipster who have begun to hate what I loved 5 minutes ago in order to &quot;fit in&quot; with the rest of the PC gamers who obviously plays more difficult games such as Starcraft II, Dota 2, and League of Legends."}, {"text": "The deathadder is probably the best selling gaming mouse of all time "}, {"text": "WHERE IS THE RAT ?????"}, {"text": "Still unsing the MX518 by Logitech... everything else i tried just didnt feel right."}, {"text": "Razor Ouroboros! Its the spec ops mouse of all mice! You know its good when you see all the other manufacturers mimicking it&#39;s design...<b>logitech</b> for example."}, {"text": "i have a g502, razer fans are freakin out, razer is good, but their stuff is manily name. does razer excell at any one thing? not really, theyre good mouses, but not as good as real pro mouses. pro gamers use it for sponsors and crap"}, {"text": "Zowie fk1 no doubt"}, {"text": "Do you guys prefer Optical over Laser? And why?"}, {"text": "and street mouse :D"}, {"text": "Sorry I had to give a thumbs down..  it looks like you went to K-mart and picked the list from what they had..."}, {"text": "CM storm Cooller Master Keyboard + Mice?"}, {"text": "As a hardcore FPS player the zowie FK1 is elite, these mice probably would not hold a candle to it. zowie am if you like the wmo. "}, {"text": "ok, so which is best for LOL and WOW ?"}, {"text": "The Logitech G700 is good for those who play all sorts of games, the Razer Naga is definitely good for SC2 and WoW where you press all sorts of keys, but for a CS player like me, you want a DeathAdder or a Logitech G500."}, {"text": "My cheap gaming mice is dying, I am considering getting one of these or stickingn with a half broken button."}, {"text": "I dont like the NAOS"}, {"text": "Where is the &quot;Razer Chroma&quot;?"}, {"text": "corsair vengeance m65..."}, {"text": "What about the razer Abyssus, I think that is truly a budget gaming mouse"}, {"text": "one of my favorite mice is the madcatz R.A.T 3"}, {"text": "Sound-track info. plzzz!"}, {"text": "Hey man can you give an info. about sound-track?"}, {"text": "Depending on what kind of games you play I cant warn you enough to avoid the Tyon. the top 4 buttons are worth less and none of the games recognize the button pushes, not even with macros. That makes the whole &quot;shift&quot; feature useless too. The side &quot;fin&quot; is somewhat useful in games with air craft like the BF series but most will never use it. Sent the Tyon back after 2 weeks, its definitely not worth it."}, {"text": "Roccat kone pure 8200 dpi laser"}, {"text": "My Mizar broke after 3 months, it consistently double clicks, I just bought a new Proteus core today, loving every inch of this thing!"}, {"text": "i freakin LOVE g502, super comfy. but i use g600 for mmo (the only 2 mouses i have atm)"}, {"text": "The mionix is trash really. After a few months of owning mine Im going back to the g500 master race"}, {"text": "The R.A.T 9 needs to be here"}, {"text": "logitech g700"}, {"text": "No Zowie FK1 on the list.<br /><br />Much fail."}, {"text": "Logitech G502 or Tyon?"}, {"text": "DLand Zelotes mouse, It&#39;s 10$ and a good mouse. I highly recommend this for people that&#39;re on low budget, I have a link to find it at: <a href=\"http://www.amazon.com/Professional-DLAND-Adjustable-Function-Notebook/dp/B00QPQZZ62/ref=sr_1_10/185-8569481-9630459?s=office-products&amp;ie=UTF8&amp;qid=1420259934&amp;sr=1-10\">http://www.amazon.com/Professional-DLAND-Adjustable-Function-Notebook/dp/B00QPQZZ62/ref=sr_1_10/185-8569481-9630459?s=office-products&amp;ie=UTF8&amp;qid=1420259934&amp;sr=1-10</a>"}, {"text": "After recently building a computer, I resorted to using my old but reliable Logitech wireless mouse (I bought it a couple years ago and have no idea what the specific model is) until I had saved up enough to buy a new mouse. Around christmas, however, I managed to snag a Logitech Proteus Core and the G240 Mousepad for around 60 bucks, and I&#39;m loving it so far. It&#39;s unbelievably comfortable, and it&#39;s great to have the DPI switching and multiple programmable buttons. Couldn&#39;t be happier!"}, {"text": "Logitech MX518/G400<br />BEST gaming mouse ever."}, {"text": "Surprising that the Steelseries Rival or the Razer Deathadder aren&#39;t on this list."}, {"text": "top 5 mice to shoot rape porn with"}, {"text": "<a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=1m58s\">1:58</a> ILLUMINATI CONFIRMED"}, {"text": "Can you do Top 5 Keyboard ?"}, {"text": "My favorite mouse is the Steelseries Rival. The sensor is amazing and there is no acceleration. Perfect for CSGO! The best part is that I picked it up for 45$ at Best Buy!"}, {"text": "top 5 expensive mice..."}, {"text": "The CMstorn mizar has an optical sensor not a laser"}, {"text": "e blue m cobra is the best, cheap looks awesome"}, {"text": "the corsair m65 rgb is the best mouse i have ever used. i is great in the hand for medium to large hands. (if you clawgrip/glawpalm) "}, {"text": "Epic Naga"}, {"text": "Top 5 best MMO gaming mice please !!!!"}, {"text": "WTF happened to racer mice!?!?"}, {"text": "where is razer ouroboros?"}, {"text": "Top 10 MECHANICAL keyboards!<br />And could you guys take a look at Qpad perephirals. (Sorry for bad english)"}, {"text": "since they release logitech g9 laser at 2007 never give me problems and the best mouse ive ever had ,but today the scroll is dead  ,if i can found another with a good price i bought it one again ,,and its funny i found it the g9 laser on ebay its more then 120 euro ,,so i go for logithec g502 or which one you recommended to me no expensive"}, {"text": "OMG NO RAZER!!!!!!!! YEES!!!!"}, {"text": "I preffer my logitech g700/g700s over the g502... Just because it has those really nicely positioned thumb-buttons and an overall really comfy, ergonomic feel. I also preffer it&#39;s weight (it is quite heavy!)"}, {"text": "Razer naga"}, {"text": "Razer Ouroboros??"}, {"text": "I feel as if the G402 hyperion fury was left off for no reason, I love mine. It&#39;s so easy and nice to use. I love the sniper button, quick switch dpi keys, macros and just the ultimate fit. I will however mention how long and sleek it is, though this might not be a bad thing."}, {"text": "Where is the deathadder ? lol . totally the one of the all time best mouse."}, {"text": "lol no razer naga? okay then..."}, {"text": "Is Razer Ouroboros good? TIPS"}, {"text": "idiot the best is RAZER OUROBOROS"}, {"text": "noganet stormer st-334"}, {"text": "G502 kick ass no more hand cramps and its so smooth and precise "}, {"text": "the adx firepower v.02 is quit comfortable and you dont need to do that much to make it personal. I got it as a Christmas present and with the mouse pad its pretty damn amazing"}, {"text": "Really happy with the G502 Proteus Core!"}, {"text": " Taipan is really good to me. It&#39;s just ergonomics overdone. It&#39;s such a good mouse, it could&#39;ve been an honorable mention if you were to put it in here."}, {"text": "Where is R.A.T 7!?"}, {"text": "My Rating  2,679 people would kill 72 people for not liking this video. Lol Great Videos Keep It Going Hardware"}, {"text": "I tried the Avior 7000 for 3 weeks and I had to return it because of how uncomfortable it was to use, didn&#39;t matter the grip. I will be trying the G502 next since it has a more ergonomic design and seemingly well-designed gaming buttons for my minimalist DasKeyboard Model S."}, {"text": "include or review &quot;CYBORG R.A.T 9&quot;"}, {"text": "What about the Logitech G600? that mouse is amazing, and the last couple would serve better as a door stopper"}, {"text": "Do a top 5 gaming keyboards please! I&#39;m looking to upgrade and I&#39;m sure others are looking for good ones too. &lt;3"}, {"text": "Nice vid . Big like!<br /><b>I found this Razer thing mouse at amazon , is it any good? I found it very cheap</b> <a href=\"http://amzn.to/1sTjzf9\">amzn.to/1sTjzf9</a>"}, {"text": "No steelseries mouse.. I guess its expensive and overrated?"}, {"text": "I own both the g502 and the zowie fk1... both are extremely awesome if you have small hands....  the g502 fits a little more better than the fk1 due to its shape, but both are flawless mice with damn good sensors"}, {"text": "In my opinion, the best mouse I ve ever owned is the Razer DA 2013.  I bought the G502 along with the DA, but my hand is too freaking big, my thumb feels extremely uncomfortable with the crappy &quot;sniping button&quot;. So i sold it as second hand after 5min.<br /><br />I have also use other products, like the Roccat Kone pure (Very comfortable design) slightly light and small in my opinion. Will try to get my hands on the Tyon some days (very expensive in AU, lowest price starts at $150+)<br /><br />I also have the sensei (raw) which broken down after 3 long year (Satisfied Product, not much ergonomic design, but feels extremely comfortable on hand)<br /><br />Also own a Razer Imperator, didnt quiet like it, as to the Logitech G9x as well as the Abyssus.<br /><br />So, for those who have a relatively large hands and happen to like Palm grip, will recommend you to get a DA 2013.<br /><br />Will try to get my hands on the ROG mouse<br /><br />:)"}, {"text": "I feel that the Corsair M95 is a great mouse, especially for the price. While the overload of buttons on the side might not suit everyone, the mouse has great ergonomics for right handed users. If you&#39;re looking for a mouse similar to the M95 but with less programmable buttons, the Corsair M65 would be a good alternative. The M65 and M95 are essentially the same thing, except the M95 has better ergonomics and more buttons."}, {"text": "I got The Logitech G502 Last Birthday and it&#39;s amazing in my Hand! I&#39;m very happy to have it:D"}, {"text": "Which of these mouses can I access 1, 2, 3, 4, 5, 6, 7, 8, and 9 without adding macros to the mouse? TY"}, {"text": "Please go see a speech therapist to reduce your accent."}, {"text": "Why not Razer Naga? Its a great mouse and if anybody wants to argue then they can stick their microsoft mice up their ass because i have had Naga for over 8 months and i am very satisfied with the ergonomics and everything. I reciently recieved Razer BW Chroma which is also amazing product, and yeah for some of you BW is maybe too expensive and some people think its dumb paying extra just for some lights, but personally i dont mind having my products look really kick ass."}, {"text": "Not a Gamer, but i use the Logitech G502 Proteus Core, for 3d architectural designing and visual content creation. The dpi shift is quite handy, even dho i never go above 6000, and all the buttons are great for short cut keys. the rubbers feet have been slightly damaged even dho i use a logitec hard mouse pad"}, {"text": "The Roccat Tyon is bomb. Really love it!"}, {"text": "I want a wireless Mouse for gaming AMD work but nothing too expensive like the Ouroboros or the Sensei Wireless<br />Any one?<br />Can&#39;t change the confort of getting wireless for a Wired Mouse even knowing that it will be better and less expensive"}, {"text": "I got like the loudest mouse ever"}, {"text": "ahhh my logitech :D love that mouse"}, {"text": "Hi Dmitry, A big HC fan from Sri-Lanka. A huge thumbs up for all the awesome and informative reviews you guys do. I enjoy the production and quality of your videos. Very Sleek &amp; Streamlined. No BS!<br /><br />On the subject of mice. Would be really cool if you could do a review of the new Logitech G402 &quot;Hyperion Fury&quot; and the latest release. G302 &quot;Daedalus Prime&quot;. It would be great for holiday buyers to have a little HC insight since the market seems to be flooding with these new &quot;gaming&quot; peripherals in the &quot;affordable&quot; price ranges. Hopefully Logitech was able to recover from the blunder with the G502 mouse feet issue."}, {"text": "G402 is the model below the 502 and it really good if you cant get the 502"}, {"text": "I bought the g502 a couple months after it came out and i have had no wear and tear problems what so ever."}, {"text": "I have a mionix naos 8200. I dont know if it has the same ergonomics as the naos 7000 but it is way too low down so much so that i am replacing it. After long use it can be very uncomfortable"}, {"text": "No zowie mice?"}, {"text": "no corsair m65?! :&#39;("}, {"text": "new subscribe i like it.."}, {"text": "I have a Logitech G500, beast mouse! I am now thinking of getting a G502. BTW the G500 is very durable and can last a long time. I also spilled juice twice on my G500 and it still was working fine."}, {"text": "Gaming Mouse   - Phoenix -<br /><a href=\"http://www.ebay.com/itm/Gaming-Mouse-Phoenix-/181614323655\">http://www.ebay.com/itm/Gaming-Mouse-Phoenix-/181614323655</a>?"}, {"text": "i have g710+ mechanical keyboard,g502 proteus core as weill as a g240  gaming pad and i think its a killer combo,now the only thing i need to replace is a headset because i have those Aerial tank storm and sadly there is no mic on them"}, {"text": "What&#39;s the best mouse for less resistance aka faster clicking?"}, {"text": "What keyboard do you use?"}, {"text": "I have the g402. Love it."}, {"text": "I hate mouses with to much on it I use all that stuff on keyboard, stuff like the Sensai raw is good"}, {"text": "@Logitech G502 is the best mouse I&#39;ve ever used. Very well build, incredible sensor, buttons are so many and yet so easy to reach, the software is solid as well. Great package."}, {"text": "How about actually getting to a top 5 for Left handed players. I&#39;d concider some of these, yet they would be less than useless to me."}, {"text": "I have MX518. You had MX518? No more questions."}, {"text": "Yo! Thanks for this Review bro, by the way, i&#39;m currently looking for a new gaming mice, i currently have the Corsair M65, it&#39;s great since i always play FPS (far cry, GRP, etc.) I&#39;m looking to get the DeathAdder Chroma, is it any better?? I mean i&#39;d like to partner that mice to my AlienFX :) (I got the Alienware 17 BTW, thank to your Vid it convinced me to buy and go for Alienware, i don&#39;t have the slightest regret on getting it."}, {"text": "i have the fancy cybhorg mmo it wont rack right anymore."}, {"text": "What  gaming pc parts should i get with 1300??"}, {"text": "Nothing compares to <a href=\"http://amazon.com/dp/B00BFOEY3Y/?tag=youtubeaz-20\">amazon.com/dp/B00BFOEY3Y/?tag=youtubeaz-20</a> I&#39;ve been using the G700 for home and work - first for home exclusively, then for both home and work, and now just for work. I was able to use it for both because of its portability, especially the BUILT-IN MEMORY - a very important feature which I&#39;ll discuss below.﻿"}, {"text": "I use the Naos 8200 (One up in dpi, but I generally don&#39;t use it that high anyway)<br />Can say it&#39;s great for people with big hands. The support on the right side is great since I always found in previous mice dragging to the right would cause it to get stuck when my palm caught on the surface. One thing to note though is that the rgb lighting glitches when changing dpi, but I&#39;m using stock drivers since I bought it so it&#39;s not been that much of an issue."}, {"text": "Nothing compares to <a href=\"http://amazon.com/dp/B00BFOEY3Y/?tag=youtubeaz-20\">amazon.com/dp/B00BFOEY3Y/?tag=youtubeaz-20</a>\nI&#39;ve been using the G700 for home and work - first for home exclusively, then for both home <b>and</b> work, and now just for work. I was able to use it for both because of its portability, especially the BUILT-IN MEMORY - a very important feature which I&#39;ll discuss below."}, {"text": "I have the G502, and I rip through all the scoreboards because of that single sniper button."}, {"text": "I just got the roccat tyon will return it. To big for my hand. Best gaming mouse for small hands like myself is logitech g300. Used to be $59 but now went up to $99 on amazon!  "}, {"text": "you should put the razer ouroboros on the list, it is an amazing gaming mouse"}, {"text": "I&#39;m surprised the MMO7 or RAT9 wasn&#39;t on here"}, {"text": "Tyon is the best mice for gaming and key maping and its very user frendly!!! TRY IT OUT"}, {"text": "I just ordered the Roccat Tyon and Corsair K65 rgb keyboard for a christmas present to myself. HO HO HO!"}, {"text": "Logitech G502 is extremely great"}, {"text": "i got a razor naga 2014 and it works for me is it great probly not but for the games and web surfing i do it is great for me"}, {"text": "хороший обзор, спасибо!)"}, {"text": "Bought a G502 having used a M60 ever since release.<br />The mouse has no support ring and pinky fingers so it is very awkward to hold. Due to the curvature, you really have to grab the mouse while on the corsair, you rest your hand on the mouse, and effortlessly move it. First couple days it really strained my fingers as I over reacted and tried to hold it tightly. <br />The G502 was the only option for me as it was the only mouse with more buttons that had a layout that fit me."}, {"text": "Whats the background music? D: its too fucking chill"}, {"text": "What about the Tte sports theron "}, {"text": "Problem with such reviews is that they don&#39;t show how devices perform during long term usage. I saw insides of ASUS Gladius and scroll wheel seems to have mechanical &quot;sensor&quot; exactly the same A4Tech uses in their mice. I have had experience with 3 new A4Tech mice, 2 of them was X7 series and in all 3 cases scroll wheel stopped working after less than 1 year of daily usage. So what can I expect from Gladius mouse if they use exactly the same mechanical scroll instead of contactless solution with diodes A4Tech used to use years ago. The problem was mice used to last for years of daily usage and people were not buying new ones."}, {"text": "guys razer deathadder chroma :@"}, {"text": "Why was the R.A.T.7 mouse not in this review. It has more customization than the mice shown. Do you actually research for products or  just ask what your friends have?"}, {"text": "@HardwareCanucks and you didnt have the DeathAdder in your list? really?  its the mouse of choice of most csgo e-sport pro players.....is this a real top 5 mice list? or just display of sponsored products?"}, {"text": "Im looking for a mouse that has softrare for it to customize the lighting no need for effects just color"}, {"text": "How is the purple keyboard called ?"}, {"text": "Is the Mionix Naos 3200 a good mouse ?"}, {"text": "Speedlink is best"}, {"text": "Stop the BS. I own both the G502 and a Razer mamba, but I use a 15 dollar mouse instead. All that garbage software that comes with the new mice creates massive latency problems, especially if you are trying to play older games. How about finding actual good products instead of making money making commercials on youtube."}, {"text": "Anybody have any experience on Monix Naos etc? Really would like that kind of body shape on a mouse with only 2 buttons on the thumb. All the logitech/razer variants have 10-20 buttons on the thumb that i cant stand."}, {"text": "i still love my RAT 7<br /><a href=\"https://www.google.com/search?q=rat7&amp;espv=2&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ei=O919VP6QMoK2aZH6gvAF&amp;ved=0CAkQ_AUoAg&amp;biw=1920&amp;bih=936\">https://www.google.com/search?q=rat7&amp;espv=2&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ei=O919VP6QMoK2aZH6gvAF&amp;ved=0CAkQ_AUoAg&amp;biw=1920&amp;bih=936</a>"}, {"text": "I genuinely liked your clip.  We are just beginning our channel as a parent and child gaming team.  Any chance you could check out our Youtube channel and give us some feedback?  By the way, what kit do you use to produce this?"}, {"text": "I genuinely liked your clip.  We are just beginning our channel as a parent and child gaming team.  Any chance you could check out our Youtube channel and give us some feedback?  By the way, what kit do you use to produce this?"}, {"text": "I prefer this cheap mouse for $45 it&#39;s a corsair m45raptor and it has adjustable weight and doing and fells very nice in medium hands "}, {"text": "Lol. He sure love mice with bells and whistles. My top 5 FPS<br />1. Razer Deathadder CLG edition<br />2. Logitech G402 Hyperion Fury<br />3. Corsair Vengeance M65<br />4. Roccat Kone Pure Optical<br />5. Razer Taipan<br /><br />Im not a Razer fan but i always love their product and they give me free Razer Surround Pro code. But i highly recommend G402 and DA CLG. Cause the CLG has smoother coating but still Sweat resistance compared to 2013 edition"}, {"text": "The steelseries rival should have taken the place of the Mizar. Or even the sensei."}, {"text": "where is my gamdias zeus gms1100  ):"}, {"text": "Where is the A4 tech X7 XL-740k? Best value budget gaming mouse..."}, {"text": "Ive got a corsair M95, its pretty damn good. <br /><br />I think i&#39;ll go for a logitech when it dies though"}, {"text": "logitech g400 is imo the best gaming mouse it has everything you need"}, {"text": "I have the Razer Ouroboros, it&#39;s the best mouse I ever used by far. I previously used the RAT9, but had problems with it and it was unconfortable to handle, despite its customization options"}, {"text": "Corsair m95 white &lt;3"}, {"text": "One of the best mice ever made, in my opinion. The Logitech MX518!"}, {"text": "i&#39;ve had a g502 for about a week now and the feet are still okay. i hace a steelseries qck mousemat"}, {"text": "if i have 12.000 dpi and another one have 6.000 dpi and i setting my all mouse with 500 dpi.<br />did i get better accuracy or precision if i have 12.000 dpi? or its the same accuracy and precision?"}, {"text": "@HardwareCanucks Where is my Steelseries Sensei? I think is the best, at least, better than many."}, {"text": "Logitech g502 is the best i ever have. Very sensitive to whatever surface type you use to but very accurate as well and no acceleration. Its a small mice so i can see people with big hands would not like it. I am 5&#39;3&quot; and I can easily use it palm grip style. At first i was using claw grip for it was too small for me because i was so used to with the deathadder but the size of the g502 is actually just right for me that is why i learn palm grip in a few days of using it. "}, {"text": "&quot;Top 5 over priced mice for your dude bro gamers&quot;"}, {"text": "I am a Logitech G502 owner and I don&#39;t have that mouse feet problem, so yeah I&#39;d say it is the best gaming mouse for me personally. However, I&#39;m intrigued to try out that Roccat Tyon because the button layout reminds me of the Logitech G300 which is also a very good mouse for claw grippers like me."}, {"text": "what about the logetic G602?"}, {"text": "We need to stop saying optical and laser. It should be LED and infrared as both tech are optical lol<br />Anyways, surprised to see 2 laser/infrared mouse in this top 5.<br />Here is a good list missing some of the newer mouses though:<br /><a href=\"https://geekhack.org/index.php?topic=56240.0\">https://geekhack.org/index.php?topic=56240.0</a>"}, {"text": "luverly"}, {"text": "Didn&#39;t you guys review the G600 from logitech? I can&#39;t seem to find it on your channel."}, {"text": "I&#39;d remove the Gladius and stick in a Razor deathadder.<br /><br />The two occupy the same bracket for me, except the build quality of the Gladius felt cheap and badly made. I reference NCIX&#39;s own review as evidence although I had the same issue. <br /><br />Honestly, I&#39;d argue that the Deathadder is one of the top 5 easily anyway."}, {"text": "monix? wouldnt it be Mionix?"}, {"text": "I really like my Razer Deathadder!"}, {"text": "Hey can you do a video on the Zowie FK1? :)"}, {"text": "I use the logitech G600 mmo gaming mouse. I think its getting old (generally) and losing its popularity.... It&#39;s a great mouse. It has 12 programable buttons at the right side and it can rest the two last fingers. It might not be as ergonomic as other mice but the 12 buttons, the ability to rest the two last fingers and the 8200 dpi sensor, make it my favorite."}, {"text": "ROCCAT Kone XTD. Nothing else applies."}, {"text": "corsair m65?"}, {"text": "g9x best of the best"}, {"text": "why dont u guys talk about small companies making THE BEST mouse? <br />A4Tech Bloody V7 is THE best mouse i have ever used, and i have used Deathadder and G series from Logitech..."}, {"text": "I&#39;m looking at the CM Storm Spawn. I play claw and I&#39;ve heard it is a good mouse for that."}, {"text": "Logitech G9. Since 2009 my trusted mouse."}, {"text": "The corssair M65 i would recomend greatly! it is my daily driver and i love it "}, {"text": "I would like to see you list the MMO7"}, {"text": "what about the deathadder???"}, {"text": "i have a g502, and since i have quite small hands it fits my hands perfecly and im really happy with it, i just whished there was an rgb light in it so i could use it on my secondary rig aswell (which is red accented)"}, {"text": "1st one. Perfect Diablo mouse"}, {"text": "Had my G502 for a couple of minutes and returned it.<br />Build quality was so extremly poor!<br />I am with the Func MS3 r2 now and I love it"}, {"text": "1. Kone XTD<br />2. Kone XTD<br />3. Kone XTD<br />4. Kone XTD<br />5. Kone XTD<br /><br />Honorable mention: Kone XTD"}, {"text": "Nice work !"}, {"text": "SS Rival is fantastic for its price."}, {"text": "#1 should be zowie fk1 this video sucks."}, {"text": "I think it&#39;s worthwhile to include a wireless mouse or two in there (I know, there&#39;s hate, but the feeling of a cord giving resistance to certain directions of movement is personally very annoying). I personally really like the Logitech G602, as it has amazing battery life, a lot of macro buttons, adjustable DPI, no acceleration, and very little lag due to the 500mhz polling rate. It is a HUGE mouse though, and even I (I have unnaturally large hands) had to get used to the initial size of it, as you cannot claw this mouse.<br />All in all, quite worth it for $50, although I personally have a hard time justifying any more than that for a mouse."}, {"text": "8200 dpi? That could turn my character 8200 degrees "}, {"text": "G600 is really good too. Specially for mmo games"}, {"text": "number 1 has mouse acceleration, that alone makes it a non-gaming mouse."}, {"text": "Sooo much bullsh*t in this video. The reviewer has no clue whatsoever. :D"}, {"text": "Loving my Razer Naga 2014!"}, {"text": "the G502 honestly blew my mind when i first got it. the mouse itself is incredible to hold and the button layout is amazing. best mouse i&#39;ve ever used"}, {"text": "I have the G502, and it&#39;s absolutely brilliant. Ergonomics are perfect, button layout is very easily accessible, and is great quality. Plus you get Logitech&#39;s legendary customer support should anything happen."}, {"text": "no theron from thermaltake?"}, {"text": "I&#39;ve had my protheus core for 2 months now. Great mouse no issues the best mouse i have ever had."}, {"text": "i love my g602 not switching mice for a long time i think"}, {"text": "I hate Razor products.... I really need to try out some Logitech mice."}, {"text": "i need a wireless mouse. any suggestions?"}, {"text": "What about the cheap A4Tech ZL5 ?"}, {"text": "No DeathAdder, G400 or FK1?"}, {"text": "Slight regrets coming in after I heard that Logitech was releasing a new mouse just when I got my Razer Taipan."}, {"text": "For the gamer on a budget I would recommend the Logitech G300. Although it is small, it is comfortable in the hand and suitable for both left and right handed users. The reason I like it is that all nine buttons on the mouse are programmable and has three presets."}, {"text": "Pls review Ducky Shine 4 Mechanical Keyboard"}, {"text": "&quot;MONIX AVIOR 7000&quot; lol, you meant MIONIX right?"}, {"text": "Chipmunks can you review the Asus ROG G751-DH71? Thanks. I wanna buy and keep me up 4 years and to equip it with ROG NOMAD and ROG Gladius."}, {"text": "Razer Naga 2014 is my daily driver for gaming and I really appreciate the full keypad on the side with surprising comfort "}, {"text": "<b><i>Review the MadCatz MMO TE</i></b>"}, {"text": "would you rather buy the Roccate Tyon or the Logitech G502 ?"}, {"text": "The only good one was logitech g502"}, {"text": "i use the Zowie fk1 and it is amazing."}, {"text": "I&#39;m in love with my G502, but as an MMORPG player I also use the G600, which has served me very well for over a year now."}, {"text": "No love for deathadder"}, {"text": "my gaming mouse:<br /><br /><a href=\"http://i.imgur.com/8IkbP6F.jpg\">http://i.imgur.com/8IkbP6F.jpg</a>"}, {"text": "Hi Dimitri, would you please review on HP Envy 13 x2? And maybe do comparison with Surface Pro 3?"}, {"text": "I picked up a Naos 8200 for $60 on sale over at Newegg when I built my system. Easily the best mouse I&#39;ve ever owned. But it&#39;s only suitable for people with larger hands that prefer palm gripping. Any claw grippers out there would be better off with a different style. The only other mouse I&#39;d consider over the Naos would be the Func MS-3², but only because it has an even more ergonomic shape designed for larger hands and palm gripping; not to mention a few additional buttons in comfortable spots. But until I start having issues with my Naos, I probably won&#39;t bother getting it. By then I wouldn&#39;t be surprised if an even more appealing mouse came out."}, {"text": "<br />Is this a decent rig and can it handle Battlefield 4 with above 60FPS on ultra?<br /><br />Intel Core i5-4460 3.20GHz (Haswell) Socket LGA1150 Processor<br /><br />Gigabyte H97-HD3 Intel H97 (Socket 1150) DDR3 ATX Motherboard<br /><br />8GB (2x4GB) Corsair Vengeance Jet Black Low Profile 1600MHz CL9 DDR3 Dual/Quad Channel Kit<br /><br />Asus Radeon R9 290 DirectCU II OC 4096MB GDDR5 PCI-Express Graphics Card<br /> <br />1TB Seagate Barracuda ST1000DM003 3.5&quot; SATA III Hard Drive - HDD<br /><br />LiteOn 24x Internal SATA DVD RW Drive [IHAS124-14]<br /><br /> 500W Corsair Builder Series CX500M 80PLUS Bronze Modular Power Supply<br /><br />Standard CPU Cooler"}, {"text": "Zowie FK One has one of if not the best sensor available right now, ambidextrous and driverless as well. I have owned Razer Mamba, Steelseries Sensei and G9x and I would say the Zowie is better by far, check it out fo yoself."}, {"text": "Dmitry, please review the PSB M4U 1 Over-Ear Audiophile Headphones. Heard they were the best in the market, wanted it to get through you first before jumping into things."}, {"text": "I&#39;d like to see more Razer products please?"}, {"text": "claw grip master race"}, {"text": "I own a Logitech MX518 and a Logitech G502.<br />Both are great mouses, but the MX518 with its increased size and finger rest-able left and right mouse button and space between the thumb buttons. Is superior to the rather small G502 where you can NOT rest your fingers on the buttons if you have adult man hands.<br /><br />I can recommend both, but its dependent on hand size because while I try to use both at times. (Logitech dont use the same mouse drivers for their mouses so you wont BSOD like I did with the Corsair M95 when both mouses are connected). I really feel that I get more tiered using the smaller G502 and accidental presses, because of lighter left right click and no space between thumb buttons, happens a little more often.<br /><br />As for Logitech DPI buttons.<br />The software is great and the same gui is used for all Logitech hardware of these types and all the DPI buttons can be remapped for other functions. What I do is I set the front DPI changer to x and set the back DPI changer to cycle dip rather than just down. Then I change the dpi settings from 3 selectional speeds to just 2, fast / slow. This enables even the MX518 to have 6 (fast access) ingame buttons.<br /><br />The new version of the MX518 is called the G400-S and I am actually going to get that one when my.... 6 years old and still fully functionally MX518 eventually breaks."}, {"text": "Corsair M45 and Razer Deathadder are not on this list. Seriously?"}, {"text": "I absolutely love my naos 8200. Been my daily driver since the start of the year. The wide body is just something I&#39;ve come to love and expect on mice but is sadly barely on any."}, {"text": "G502!!!!!!!!!!!!!!!"}, {"text": "I use a Logitech g402. It&#39;s only $60, and is basically a g502 without custom weight, 3 less buttons (8 total on the g402), and a super scroll wheel. The feet on my mouse are still in great shape and I&#39;ve had it for 3 months."}, {"text": "No Zowie FK? <br />This is disappointing.. "}, {"text": "Best mouse out there? Still die Logitech MX518. ;) Using two of them for about 10 years now and they are perfectly fine. No useless lightning, no useless anything, very robust, ... "}, {"text": "Ok. But whitch is the. 5 best mousepad? This is the question!"}, {"text": "Should have included spec info right under the names for each product + retail price .<br /><br />7/10"}, {"text": "Personally I love my Genius DeathTaker. "}, {"text": "What? No Ss Rival?"}, {"text": "I am currently using the Tecknet X9800 and for £22.50 it is amazing! I have used Logticech mice, cm storm and RAT&#39;s but the X9800 has them all beat.<br /><br />For £22.50 you get 8200DPI, intricate macro settings adjustable to all of the 9 keys, on the fly DPI switching and Macro recording. To top it all off you get customizable LED&#39;s and weights. I would recommend anyone checking this out before you spend double to triple the amount on a mouse with the same features."}, {"text": "I have a Mionix Naos 8200, couldn&#39;t be more happy with it, probably the only peripheral that I wouldn&#39;t dream of replacing. Mechanical keyboards have exploded in popularity...but I do not like them, the spacing between the keys is more than twice as wide as I am used to with chiclet keyboards, I regret buying both of my mechanical keyboards. "}, {"text": "SteelSeries Sensei RAW wired Laser 5700 dpi gaming mouse. Bought it on sale for $35.32 on 6/11/13. Best looking, most comfortable and durable mouse I&#39;ve ever used. It has worked flawlessly since day one and still looks brand new. I thought the black glossy finish would be a problem with fingerprints and keeping it clean but the glossy finish actually makes it easier to clean.  "}, {"text": "Logitech does it all!"}, {"text": "I&#39;ve heard this back ground beat in some of your other videos and really like it. I suppose I&#39;ll try asking one more time lol.<br /><br />What&#39;s the name of this awesome music!? "}, {"text": "There is also a new Mionix Naos 8200. You should do a review on that."}, {"text": "Can you review UtechSmart US-D4000-GM High Precision Optical Gaming Mouse<br /><a href=\"http://www.newegg.com/Product/Product.aspx?Item=9SIA2690UV7444\">http://www.newegg.com/Product/Product.aspx?Item=9SIA2690UV7444</a><br />I use it and it is awesome"}, {"text": "The Zowie FK1 would have to be the most underrated mice. No drivers required and equipped with the Avago 3310 sensor. The FK1 is highly regarded in the competitive Counter Strike and BF4 scene. Coupled with any Artisan mouse pad makes for a great combination. "}, {"text": "So was the Tyon or the 502 the best mouse? I couldn&#39;t tell what order you were going in."}, {"text": "Missing the Zowie FK1"}, {"text": "What about FUNC MR3 - 2? Is this better than Roccat Tyon to suit my big hands?"}, {"text": "I&#39;m quite happy with my G502, has the best sensor I&#39;ve used yet and fits with my fingertip grip."}, {"text": "Can you guys please review the corsair m65 rgb. Ive recently purchased it and i want to see if it was a worthy purchase. I also have seen almost no reviews on youtube and i think others would like to see a review by a channel who (in my opinion) does some of the best reviews in youtube."}, {"text": "Went from my trusted 7 yr. old MX518 to the Steelseries Sensei RAW and it&#39;s just pure wicked. I do miss my levels of CPI changes though(Steelseries allows only two)."}, {"text": "Was surprised not to see a steelseries mouse like the rival in the list, but I guess its preference; ive used and tested many mice and for playing cs:go on a rather higher level the sensor is awesomeness."}, {"text": "What&#39;s the best mouse for large hands and bf4 type games"}, {"text": "The Logitech looks rather similar to the RAT..."}, {"text": "could yall review the Red Dragon Perdition?   <a href=\"http://www.amazon.com/Redragon-Perdition-Precision-Programmable-Cartridge-profiles/dp/B00GU8W5AE\">http://www.amazon.com/Redragon-Perdition-Precision-Programmable-Cartridge-profiles/dp/B00GU8W5AE</a>"}, {"text": "What is with razer they have some good mice too<br />"}, {"text": "commenting when <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=1m30s\">1:30</a> in the video<br />OH HELL I LOVE YOU<br />its incredibly crucial for me to know how hard is the middle click button,<br />and I love that you also concern yourself with this fact!"}, {"text": "You should do more of these top 5 or top 10 products hardwarecanucks, as i would trust your word any day of the week!"}, {"text": "Make vid on headsets, including audiophile"}, {"text": "I have a G500, I see no cons to this mouse, only pros !"}, {"text": "Using the Roccat Kone Pure optical and it&#39;s great, I&#39;s not a bunch of buttons all over, but with the easy shift you can still have loads of functionality ;D I&#39;d give it a 9/10 just because unlike the laser version you can not adjust the liftoff on the optical... meaning you&#39;re stuck with what I believe to be 5mm liftoff distance :P Not a huge deal but it takes some getting used to..."}, {"text": "Disappointed to not see the G700 on here."}, {"text": "my g502 has no problems with the feet. then again i use it on a soft mouse pad."}, {"text": "Will this all work together? -&gt; <a href=\"http://uk.pcpartpicker.com/p/dJMCgs\">http://uk.pcpartpicker.com/p/dJMCgs</a><br /><br />NO I AM NOT BRAGGING I HONESTLY DO NOT KNOW"}, {"text": "Mionix is spelt incorrectly a around <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=3m25s\">3:25</a> ish in the video :)"}, {"text": "Naos 7000 user. I love the smoothness of the sensor, the build quality, the lightning and software, but I find the shape uncomfortable for lifting and certain grips. Also, my previous mouse was a Logitech with multiple buttons that I now miss on the Naos. The G502 wasn&#39;t available when I was in need of a new optical mouse and I would have probably bought that one if it were available. For me, the perfect mouse is the Roccat Tyon with the same sensor as the Mionix 7000. I&#39;ll probably pick up a G502 to compare, but I&#39;m still waiting for Roccat to come forward with the perfect optical mouse."}, {"text": "Mionix Naos is the best. I have it for almost 2 years now(the 5000)."}, {"text": "No deathadder? I&#39;ve used a lot and it&#39;s certainly in the top 5. It&#39;s what almost everything is compared to together with the g400"}, {"text": "They all look good, but I have a problem, Why the mice, now a day, are so expensive??<br />$99 for a mouse is really stupid.<br />I have a Microsoft IntelliMouse Optical 1.1A, White - for the past 12 years that never faded and never had any problems period with it and at the time I paid it $35 and  I am very very happy with it, Just hope it would come with 1 or 2 more buttons.<br />I understand the new RGB technology in it, but they use cheap LED so it shouldn&#39;t be that much more expensive.!!<br /><br />What you guys think?"}, {"text": "I really really want to buy a gaming mouse, but i already kick ass with my cheap $10 Microsoft optic mouse, i know i want a new one, but i know i dont NEED it. =/"}, {"text": "I love my Naos 7000 and i had no issues Dmitri had with the usb connector. My only wish is for at least 2 more buttons in future versions and maybe a little more features in the Software suite. Don&#39;t really care about the custom weights missing, used to like them in my Logitech but i&#39;m accustomed to this mouse now. It just fits my hand perfectly."}, {"text": "Corsair M65. Best mouse for around 50 bucks."}, {"text": "Love the quality of your review videos. Keep up the great work man. My Logitech G500s has been having a really annoying high pitched whine (I think it came like that out of the box but I didn&#39;t notice right away because it is very high pitched) I have big hands and use a palm grip. What would be the best mouse for me to replace it with? "}, {"text": "no Func MS-3 :("}, {"text": "@HardwareCanucks Hey Dmitri, can you do a top 10 mechanical gaming keyboards? Would love it!"}, {"text": "Could yoy review the ninox Aurora? <br />None on YouTube atm and its highly revered/hyped by many quake gamers "}, {"text": "i recomend the funck ms -3 "}, {"text": "I think razer deathadder is worth mentioning!!:)"}, {"text": "You should try out the G602, I really love it! :)"}, {"text": "razer deathadder 2014 is my favourite mouse so far, it just fits perfectly and honestly, you don&#39;t need all these fancy buttons. "}, {"text": "What? No Razer Deathadder 2013 edition? Handa down, the best mouse I ever used."}, {"text": "Zowie FK1 or RIOT"}, {"text": "Wheres Razer Deathadder 2014?? Yes its by razer but its so comfortable, good looking and performs amazingly :D"}, {"text": "Steelseries Rival is much better than the cm mizar."}, {"text": "Would love for you guys to make this video but with keyboards! Stil amazing video!"}, {"text": "I just cant replace my func Ms-3 - nothing comes close in terms of comfort"}, {"text": "i love my TT eSports Level 10 mouse."}, {"text": "Logitech G502 should be the first place. great senser, great deisan, the best butten layout. and the feet dont ware off. you guys just had bad luck."}, {"text": "for $30 the Anker® CG100 should be in this list as a budget option. "}, {"text": "CM Storm Reaper"}, {"text": "no razer ??"}, {"text": "evga torq x10"}, {"text": "Naos is the most comfortable mouse for right-handers, period..."}, {"text": "Still love my G9x. I&#39;ll probably just use it until it dies."}, {"text": "Just got  a Cougar 700m mouse today, only used it for a few hours so far &amp; loving it, also got the Cougar 700k keyboard &amp; it is also fantastic :)"}, {"text": "good vid"}, {"text": "Using the G502. No issues till now. Even for the bottom feet. Excellent mouse. Best one i&#39;ve used till now. Fits me perfect. But then again, there are many mice out there. There&#39;s not a best one, only one that fits a user best. "}, {"text": "Need thought about m45 raptor.?"}, {"text": "maybe the right title is best FPS mouse!"}, {"text": "TOP 5 GAMING HEADSETS!!!! I actually don&#39;t know, because all of them have so big flaws!﻿"}, {"text": "Found a Razer Copperhead for $2."}, {"text": "Do top keyboards do more keyboard reviews :)"}, {"text": "There are million of options here... Sensei, Rival, FK1, G400s... but personally, i&#39;ll stick with my MX518."}, {"text": "of course legendery razer deathadder"}, {"text": "what do you think about SteelSeries Kana V2 ?"}, {"text": "These guides are pointless, just look at what the best esport pros use. And look at each mouse to find what&#39;s best for you. If you&#39;re in to MOBAs and MMOs look at what the best LoL and Dota players use and if you mostly play fps look at what the besy CS pros use."}, {"text": "I have the steelseries rival, it fits in my hand good. I chose this mouse because I have big hands, therefore a big mouse. I&#39;m very happy with it and I recommend it to others with big hands"}, {"text": "Top 5 keyboards??"}, {"text": "Steelseries Sensei and Razer Deathadder is not on the list... oh well, time to change my mouse again. JK! as a laptop guy mouse is really important to me in terms of gaming. "}, {"text": "Mionix Naos&lt;3"}, {"text": "Best gaming mice are right here: <a href=\"http://geekhack.org/index.php?topic=56240.0\">http://geekhack.org/index.php?topic=56240.0</a>"}, {"text": "If you want a serious business  no bs fps mice for claw and fingertip grip the FK1 is the best option."}, {"text": "are these the best mice you reviewed or the best mice in generall?"}, {"text": "top 5 keyboards next? "}, {"text": "My Logitech mx518 is yet to fault me, no need for fancy illuminated mice "}, {"text": "No one is available in my country.. Fuck"}, {"text": "Congratulations on 400 videos, 400 top quality videos!<br /><br />Mionix Naos 3200, ♥ it. Strange to not see classics like the Razer Deathadder or Logitech G400s on the list.<br /><br />Will the &quot;Ghetto Quartet&quot; intro music sneak back into Hardware Canucks videos? I know you had the file Dmitry as I&#39;ve seen videos produced when you came onto the HWC team with this music in the background. Where is The DAM Good Show? Time zone difference too great?"}, {"text": "G600 for us who need the side buttons"}, {"text": "Hey Love all videos. Can you do some top 5 Gaming mouse pads videos as well. Thanks! Keep up the Great Work."}, {"text": "Que razer fanboys raging because the death adder wasn&#39;t in the list."}, {"text": "I own a Hama uRage Illuminated.It is an RGB mouse with a 3.6000 CPI Avvago 5050 optical sensor and 5 fully programmable buttons.It also has got a beautiful design and it costs 15 euros."}, {"text": "Logitech G 602 is a great mouse as well i love it. It feels good in the hand I have no problems with it being wireless because i don&#39;t see any difference in with wired mouses. It has a lot of macro buttion that are easy to reach. I use the DPI switch keys for music switching. It&#39;s kinda built for everything."}, {"text": "No steelseries mice :(<br />The cheap steelseries kinzu V2 is verry good while cheap and using one of the cleanest sensors on the market with no accel or jitter."}, {"text": "They&#39;re all just stupid mouse that are made to look good.. If you want a real mouse, the chances are that it is gunna be ugly such as the Steelseries Sensei Pro or the Microsoft Intelimouse 3.0"}, {"text": "The Roccat Kone Pure series is great. No rubber, but still easy to grip. Additionally it has easy to use buttons and scroll wheel. It is light and has RGB lighting that you can&#39;t really see because your hand covers the light. It also has solid driver support that is easy to use, but they were a pain to install correctly with my Roccat Ryos MK. However, if you have a tight budget, you can&#39;t go wrong with it. I had to really nitpick for negatives (except for the driver thing, that bugged me), and the mouse meets expectations. "}, {"text": "Roccat xtd optical is a+ the tyon would be better if it was changed to optical ( well I would by one the day it was released)"}, {"text": "No deathadder? Wtf"}, {"text": "Best gaming mouse ever in my opinion is the G400s, sells for £28 on amazon and trumps the deathadders and Rival."}, {"text": "No razer! Nice, someone finally not include those overpriced, bad quality stuff on top lists"}, {"text": "Orobours is the best"}, {"text": "An unorthodox suggestion for MMO gamers: Steelseries WoW Cata mouse<br /><br />Price:<br />Comparatively cheap, compared to other options. I picked up mine for roughly $50 USD. In comparison, a Saitek MMO7 costs roughly $170 USD locally.<br /><br />Layout:<br />2 main buttons, a clicking scroll wheel (no side tilts), and 11 macro-able buttons<br /><br />Aesthetics:<br />Subjective. I personally hate the appearance of it, however some may like it (especially if you&#39;re into WoW). I&#39;ve owned / own a fair few beautiful looking mice (some Zowie models, some Saitek models), and this doesn&#39;t have the material quality or finish that others do.<br /><br />Build quality (YMMV):<br />It has stood up to 3 years of punishment. In the 1.5 years prior, I broke 2 Naga&#39;s and 4 Saitek MMO7&#39;s. The WoW Cata buttons still click reliably, however some of the paint looks quite horrible now.<br /><br />Performance:<br />Tracking is based on a medicre laser sensor. Do not use this mouse for FPS titles or Moba skill shots. Macro performance is great; hardware level profiles can be saved to on-board memory so that you don&#39;t need any software installed. The software macro tools are quite in-depth and allow for precise timings and various levels of automation. Macro&#39;s can also be tied directly to WoW, with in-built preset macros that are based off pre-existing keybinds you&#39;ve made in the client (eg: you can set a programmable button to &#39;use [specific skill]&#39;, or &#39;target focus target&#39; without manually specifying which keybind you have set to use that specific skill or which keybind you&#39;ve bound to target focus target).<br /><br />Conclusion:<br />If you want a cheap, indestructable mouse for MMO gaming, that excels in the areas that matter to the genre (reliability and programability), it seems like a solid choice."}, {"text": "What about the G700s? It&#39;s the best!"}, {"text": "mizar wtf???<br /><br />for MSRP $59.99 FUNC MS3 V2 is so much better"}, {"text": "I really love my G502. Amazing feel. Also, the scroll wheel is awesome."}, {"text": "lol no deathadder 2013"}, {"text": "I love my 2013 deathadder.  If it wasn&#39;t for the synapse software, it would be perfect (imo).  "}, {"text": "the G300 is nice for 30 euro"}, {"text": "My &#39;like&#39; is for 400 more videos, and then more. Cheers!"}, {"text": "No deathadder, pfft"}, {"text": "maybe 5 worst mice  .."}, {"text": "using mionix naos 8200 and its great XD"}, {"text": "I&#39;d like to see a &#39;&#39;&#39;Top 5 laptops&#39;&#39; but also not only gaming, but also ultrabooks. Like three cateogories, budget, ultrabook and gaming. Have a nice day :-)"}, {"text": "The new Corsair sabre looks awesome!?"}, {"text": "Why no RAT?"}, {"text": "i currently own a g502 proteus core, probably the best choice in a mouse i&#39;ve had so far. definitely one of the best on the market."}, {"text": "Im using a R.A.T 7<br />Its ok...<br />There isnt more to say :/"}, {"text": "great video, some suggestions for future videos. <br />1. top 5 mechanical keyboards / tenkeyless mechanical keyboards<br />2. top 5 audiophile grade headphones<br />3. top 5 pc chassis&#39;<br />4. top 5 graphics cards for the money you spend<br />5. top 5 laptops/tablet for productivity <br />any of these lists would be awesome to see from you guys! :D"}, {"text": "I love my Madcatz Rat 5. Its made of aluminum with great build quality for $50, and after using it, several of my friends bought variants of it as well. It has lasted me over a year and a half and is still going strong."}, {"text": "Logitech G402 <br />Logitech G700 ( Owner of this mouse , so far the most Perfect mouse for me atm ) "}, {"text": "I own a logitech G602 and I love it! "}, {"text": "Anyone here have any thoughts on the corsair M95?"}, {"text": "Do the top 5 gaming keyboards"}, {"text": "The Deathadder would be on here if you guys had reviewed it. I love ROG but they ripped it of with the  Gladius."}, {"text": "No Razor made the list? Naga mouse are in a league of their own still I guess. I love my naga hex and enjoy my games less w/o it.<br />"}, {"text": "Not putting the SS Rival in there is a crime."}, {"text": "I got the NAOS 9200 and I absolutely LOVE it!<br /><br />The largest downside: the software to configure the mouse is not available on OS X. But, if you create profiles using a Windows machine and then plug it in to a Mac, the profiles do work without any issues. So I guess it&#39;s alright."}, {"text": "Maybe one of the biggest problems with the reviews I&#39;ve seen concerning mice is that not everyone uses the same grip and not everyone has the same handsize.<br /><br />There are three main ways of holding your mice: fingertip claw and palm. Seeing I have a fingertip grip and have relatively small hands, most of the buttons with mice like the roccat tyon simply are out of reach for me. <br /><br />Just a suggestion, but could you, when reviewing, show the size of your hand (cm/inches, whatever) from wrist-tip of middle finger and show the different grips on the mouse to show where abouts our fingers/hand will be when using the mouse. <br /><br />I really <b>really</b> miss that in mice reviews (not just here, pretty much everywhere). Hope you will take this in consideration and keep up the great work"}, {"text": "OK probably that will be odd  but I love my Naga 2014. Normally I don&#39;t like Razor stuff, but I was WoW player and I bought it because of the extra buttons, The fun part is that I no longer play any game, but I use the buttons for macros. It is great what you can achieve with extra buttons on you mouse and yes it is s**t when you start using it, but after 3 months it is amazing."}, {"text": "I still love my Corsair M95 though :D"}, {"text": "Using a M45. Got it for $50 and it fits my hand like a glove. "}, {"text": "I believe CM storm inferno is a good contender. With its many customisable buttons it&#39;s great for MOBA, MMO and sometimes even FPS games. DPI is customizable too, making it a great mice "}, {"text": "Gladius FTW"}, {"text": "Using the black Taipan for nearly the year, only think I want now is to change the color. Its perfect, doesnt become dusty after months, software sometimes isnt the best, u have to reinstall, if shit happens)"}, {"text": "The Tyon is as expensive as the Corsair 380T here."}, {"text": "Razer naga hex rocks the most "}, {"text": "400 000 more!"}, {"text": "I have a G502<br /><br />I&#39;ve been extremely happy with this mouse, only downside would be the pinky finger and ringfinger being a bit off, but all other things in this mouse are really good.<br />I didn&#39;t expect to buy a logitech mouse due to their boring appearances, but once i got to G502, i started to like it&#39;s striking form and i fell in love with the scroll wheel.<br />Coupled with the price that i got it, 49€, it was a deal i couldn&#39;t ignore<br /><br />I&#39;m not even concidering switching mouses, this&#39;ll probably drive me until the bitter end or a second PC set, but i am concidering coupling this mouse with a sidekick just for fun: ZALMAN ZM-GM4<br />That thing looks like a futuristic tank!"}, {"text": "Where does the Cyborg Rat 9 come in here? "}, {"text": "What&#39;s the song name plz?"}, {"text": "How about the Zowie Fk1?"}, {"text": "corsair m45?"}, {"text": "I own the G502 and got it for 60$ in AUS, The best mouse I&#39;ve used in a awhile! Awesome for Counter Strike and other FPS,  there is NO ACCELERATION at ALL! Beast of a mouse! I dont have any issues with the feets, I use the steel series QCK+ mouse mat, so yeah. Don&#39;t let the looks decieve you, this thing has almost perfect ergonomics. g8 m8, i r8 8/8! LOL But in all honesty, Logitech never fails on peripherals."}, {"text": "top five mice, no steel series. roccat / . CM wtf. gross"}, {"text": "Please do a top 5 m-atx cases!"}, {"text": "Can&#39;t wait for Top 5 Gaming Keyboards!"}, {"text": "I&#39;m using the Mionix Naos 5000, it&#39;s practically the same as 7000, only it has customizable weight and less lighting colour choises :P"}, {"text": "What do you think about the Roccat Kone Pure?"}, {"text": "what about mice specifically designed for the claw grip? i love the shape of my cm storm spawn but ive had a lot of problems with it"}, {"text": "i have the g700s from logitech. I can&#39;t say i love it though. The good things about it are the well placed and customisable macro buttons which for me, makes day-to-day work really easy. the switches are great and the ergonomics suit me very well. the build quality is great and the option to plug it in and use it wired is a bonus. however, the cord is really annoying. it&#39;s a really stiff rubber and the way it&#39;s inserted into the mouse, creates a lot of drag making it a bit awkward to game with. My device is sometimes glitchy as it will shut off mid game and restart itself for some reason. "}, {"text": "can you do a top 5 laptop mice next? I was going to get the Logitech Anywhere but since they made a v2 release the build quality is shocking &amp; the components barely last a year due to phantom double clicks instead of single<br /><br />Now I simply can&#39;t decide :/"}, {"text": "I hate to be that guy but you spelt Mionix wrong from <a href=\"http://www.youtube.com/watch?v=02X3ZLUsojU&amp;t=2m40s\">2:40</a> onwards. Also the Logitech G600 is very good if you want an MMO mouse"}, {"text": "Corsair M65/M45?"}, {"text": "Deathadder all the way!"}, {"text": "I just returned to my 15 year old MS Optical. Bought a Corsair but had to send it back as it was jumping in the scroll."}, {"text": "Want that Tyon for Leftys :l"}, {"text": "Fantastic video."}, {"text": "Logitech G700s"}, {"text": "My favourite is the Razer Deathadder mouse. I&#39;ve had the original mouse for several years and I seriously can&#39;t appreciate it enough. Ergonomic and perfect size for my hand."}, {"text": "i&#39;ve used Taipan forever and love it, and also use logitecs mmo mouse for well.. MMOs ^^ "}, {"text": "Congratulations on surpassing 400 videos. The HardwareCanucks team produce the most professional video reviews I&#39;ve seen in the Youtube PC-related stuff; the amount of effort that goes into each video review is truly remarkable. I truly wish you hit the 1 million subscriber remark because you truly deserve it. Keep on the awesome work."}, {"text": "Currently use the G502, I very much agree it would be perfect for smaller hands, but i&#39;m getting used to having to grip it a bit awkwardly."}, {"text": "I have a Roccat mouse and don&#39;t like the accleration.. How do you fix it? You said you could in the software"}, {"text": "Great vid, any great MMO mouses out there, besides razer ones? :D"}, {"text": "I&#39;ve tried both Naos 8200 and Avior 8200. I switched straight back to my MX518, most likely going to get the G502 in the near future."}, {"text": "how about G402? i&#39;m thinking about getting one, because i think G502 has too many buttons.."}, {"text": "Logitech G402 and G302 recently released, or the G302 is fixing to be released, would love to see reviews on those. Keep it up!"}, {"text": "well atleast g700s didn&#39;t get on the list"}, {"text": "Nice Video!"}, {"text": "First!"}]