[{"text": "I can&#39;t play the tune that much :-)"}, {"text": "<b>*crying*</b> yessssssssssssss!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"text": "Thank you, I love it"}, {"text": "Realmente amo seu tutorial, muitíssimo  obrigada, é muito bom aprender com vc! Bjos"}, {"text": "nice"}, {"text": "как мертвая"}, {"text": "Hello, I&#39;m not sure if you could do this for my daughter; she would love to work on Rachmaninoff  &quot;prelude b minor op 32 no 10&quot; . Thank you in advance ♥"}, {"text": "I love you &lt;3"}, {"text": "I think you&#39;ve done a great job with this...i am a drummer wanting to try and spread my horizon a little...i couldnt even tell you what note the keys are but 3 days of really trying to get it nailed and im there so thank you very much...testament to a great tutorial video"}, {"text": "@Catpeople Sorry, can&#39;t help you in this case. The Lascia is a classical piece in public domain. Coldplay is not."}, {"text": "Love this. Can you send over the sheet music like you did for Lasica Ch&#39;io Pianga.<br />You make us musicians soooo happy when you do this slow especially for me as their are only 3 wanna be.........:(where I live. Passion and money are not the same."}, {"text": "Very good stuff, you&#39;re the reason I started learing how to play, keep up the good work.  I donated you ^_^"}, {"text": "oh me encantan y amo tus tutoriales graciaaas....! :D"}, {"text": "yes, many are learning without needing to read. but reading will help as you advance :)"}, {"text": "have not heard of those -- not requested yet. thanks for writing."}, {"text": "Cool! Got the chords down! (and that C thing) (don&#39;t need sheet music if I&#39;ve got the chords!! lol)"}, {"text": "good job!"}, {"text": "good luck, and you&#39;re welcome."}, {"text": "Must be good, i will try it! Thanks to post\n\n"}, {"text": "it would be easier if you learn to read music :)\n\nfyi, the main reason I started this project is to motivate reading music. if if someone always reads to you, why bother learning to read, right? I hope you make the right decision. can start with my 3 intro lessons."}, {"text": "it would be easier if you dictated the keys"}, {"text": "glad to hear you do use sheetmusic. any sheet info would be on the song&#39;s webpage (description link)"}, {"text": "Hey! Good tutorial! Do u have the sheet paper? Because I get lost sometimes with the right hand . Thanks!!"}, {"text": "you&#39;re welcome. good luck with it"}, {"text": "nice and slow,... i just need practice and repetition :-)  thanks"}, {"text": "thanks... glad it helped"}, {"text": "Very nice peice of work...its helped me a lot\n"}, {"text": "thanks back :)"}, {"text": "really nice work!! I just subscribed. THANKS! "}, {"text": "you&#39;re welcome. thanks for writing :)"}, {"text": "thanks for what you doing"}, {"text": "So what he has skinny hands.You probaly have fat hands and you wish that they were like his.Stop eating at mcdonalds and maybe your hands will be like his.You probaly can&#39;t even play the piano."}, {"text": "glad it helps. you&#39;re welcome :)"}, {"text": "That&#39;s a helpful tutorial! Thanks alot!"}, {"text": "oh let&#39;s go back to the start :D"}, {"text": "to slow dude the tempo"}, {"text": "Great. You&#39;re welcome."}, {"text": "Got it.  Thanks."}, {"text": "thanks :)"}, {"text": "you have a wonderful channel to learn piano! I&#39;ll use it for sure."}, {"text": "Enjoyed your cover. Thanks."}, {"text": "Great tutorial! I did my piano cover of this song.. check out my channel!!\nthanks"}, {"text": "thank you :)"}, {"text": "Excelenty job!! Congratulations"}, {"text": "it is difficult to convince that at tempo tutorials are educational. copyright issues abound. i dare not do at tempo versions now."}, {"text": "Thank you very much but I think will be better if end of the videos you&#39;ll play original (faster) version."}, {"text": "thanks. btw, those skinny hand comments don&#39;t bother me. please don&#39;t use foul words under my videos. :)"}, {"text": "i don&#39;t recall whether this is a piano solo version. publishers do make piano accompaniment versions for singers."}, {"text": "Hey!  I want to play this song but, if I want to sing it too, should I repeat te same chords with my right hand ta once?"}, {"text": "there are plenty others who do that. use theirs!  :)"}, {"text": "you&#39;re welcome :)"}, {"text": "Ty so much :D "}, {"text": "ever heard of aspect ratio?"}, {"text": "your hands...ever heard of marfan syndrome?"}, {"text": "you&#39;re welcome :) you might be interested in my 3 silly lessons on reading music. just adds a little insight. the rest is all practice."}, {"text": "I am trying to teach myself to read music (30 yrs old so a lot harder than when I was a kid) and these tutorials are a fun &quot;break.&quot;  Thank you for taking the time to do this.  "}, {"text": "ok thanks, i will do :3 "}, {"text": "pls follow request instructions in website (link﻿ in description). one request per person to be fair."}, {"text": "please im beging u can u do fix you ? :("}, {"text": "was that necessary?"}, {"text": "Omg 2 skinny!!"}, {"text": "estube exelente me ha alludado en mucho gracias ,.... "}, {"text": "Muchas gracias!! Thank`ssss!!!!  Muy buen tutorial. Nice tuto.  Un saludo desde Chile!!!  :)"}, {"text": "Thank you very very much =D\n"}, {"text": "feel better?  :)"}, {"text": "booooooooo\n"}, {"text": "lol, glad to disturb you"}, {"text": "the song is transposed"}, {"text": "ask a friend who can watch you play?"}, {"text": "ah, in that case, might be wiser to start with an easy and shorter piece that you like. learn to read music too. I made 3 silly lessons to get you started. have fun and good luck."}, {"text": "proves having perfect pitch is not always a blessing :)"}, {"text": "please follow request instructions (channel or website link) to a T :)  good luck!"}, {"text": "Could you make a tutorial of &quot;Somebody&quot; by Depeche Mode,please? . I would like to see the positions of the fingers,Thanks! Here is the Sheet Music:   wwww . popsynth .com/somebody."}, {"text": "your teacher asks whether you are a piano teacher? are you giving her a hard time? :)\n\nas for me, no, I am a math teacher, not a piano teacher. but many have learned to play piano from me. and some piano teachers tell their students to refer to my tutorials (so as to see what not to do? lol)"}, {"text": "i dont think this is the correct version when i play with the song some chords some off n its not my piano;s tunning because i am using soft synths and virtual pianos"}, {"text": "are you a piano teacher that&#39;s what my teacher says repeatably at me!"}, {"text": "sorry, neither..."}, {"text": "@Dreadlifeful observing is not enough. have to try to to play the notes at the same time. just learn the first 3 notes. focus on my fingers. listen. imitate. if you can do that, it means you can learn the rest. best however, is to follow the sheetmusic. I made 3 silly lessons to get you started on reading music. if you really wish to play piano, that&#39;s the way to go."}, {"text": "@arvesa582 pls look for and follow request instructions"}, {"text": "good video\r\ncould you do a tutorial with the song green eyes??"}, {"text": "thanks for sharing this. it helps me a lot. :)"}, {"text": "your hands are beautiful and so delicate while pressing the keys\n"}, {"text": "undead playing on piano? -.-"}, {"text": "claudiarabbit2007 is just a spoilt brat who has a hissy fit when things are not done exactly how she wants, makes me laugh!!! Nice tutorial much appreciated "}, {"text": "@Glable24 the art of observation can be learned. compare the size of the black keys with my fingers. ah! what do you say now? ;)"}, {"text": "You have massive fingers/hands... We all know what that means ;) but seriously great work :D "}, {"text": "@FredFlintstonesMum I talk only when necessary. watch my fingers and do what they do. the method uses your mirror neurons."}, {"text": "@MaivNtsuabXyooj the person who made the request sent it"}, {"text": "Hey. Where do you get your music sheet?\n"}, {"text": "I didn&#39;t have idea that this song was very easy (: thank you so much for the tutorial"}, {"text": "@Thel4zyd0g oh, the opposite of what the term implies  :)\nnot much to play for accompaniment, just skip the RH? or send me the sheets, request link is on profile. good luck."}, {"text": "@bbdhrggl yea i meant as this is for solo playing since it has the melody of the vocals. I was looking for the accompanient piano for band playing :)"}, {"text": "@Thel4zyd0g never heard that term, you mean accompaniment? I&#39;ll put it in the video description, but not the title. "}, {"text": "this is a vocal tutorial, please specify in the title!"}, {"text": "@bbdhrggl thank you (: "}, {"text": "@zanuxiite choose a short section, play it with both hands, as SLOWLY as possible. use a metronome. when no mistakes, increase the speed a TINY bit. repeat until you reach tempo. your brain will build new neurons."}, {"text": "aghr... I know the left hand and the right hand, but I can&#39;t put them together... :( "}, {"text": "Great stuff. This was à great help to me"}, {"text": "@JorgeGELP sorry, don&#39;t understand your comment. if that is a request, see profile link."}, {"text": "hello, your video is very good, but often you do it all, you prune Asher another of the same song but for some or stanza, thanks"}, {"text": "@sambartz I take requests, see profile for link"}, {"text": "Amazing:)"}, {"text": "@bbdhrggl oh ok"}, {"text": "@kichukdave sorry, discarded the sheets long ago. this one is history :)"}, {"text": "could you do this one a little sped up?"}, {"text": "i just noticed something you play F in all the chords"}, {"text": "@TheRez627 thank you. comments such as yours more than negate the rude ones. :)"}, {"text": "Thanks so much for this! You&#39;re videos are great, and you have such a variety of them! It really is quite helpful.\n\nAlso, I would like to apologize for a lot of these idiotic comments that some of your videos have received. Some people can just be so discourteous and rude."}, {"text": "Bad!"}, {"text": "this is the easy version, the real versions uses your right hand for the chords and ur left hand for the bass."}, {"text": "@pinky09punk google  &quot;mirror neurons&quot;. we were born with this learning ability."}, {"text": "@bbdhrggl Okay thanks for the tip :)"}, {"text": "@Be11ie2 you&#39;re welcome, however, no tutorial is too slow. try to focus on the fingers, not the keys under them. you can touch your nose w/o looking, if i touch mine. same principle."}, {"text": "It&#39;s a little bit too slow if you ask me.. And sometimes I can&#39;t follow it becauce I can&#39;t see which notes you play.. :S\r\nBut you helped me a lot so thank you :)"}, {"text": "muy clara y lenta para poder ver bien cada nota que tocas. mil gracias!\ngenio!"}, {"text": "Omg, thank you for taking the time to make this video. I have not touched a piano in my life, nor will I ever take lessons. lol but this song, this song made me want to try the piano out, and now I am getting interested into playing it. It only took me 5 minutes to learn the intro and the verse, and now I&#39;m trying to get the chorus down. Thank you again for making such a wonderful tutorial. I really love this song."}, {"text": "great tutorial, thanks. i had no problem seeing the notes. \nkeep making tutorial&#39;s, you&#39;re great.\n:)"}, {"text": "esas no son las notas que todo el mundo pone en los turoriales!! "}, {"text": "the fact that this is so slow makes it easier to learn great job."}, {"text": "GREAT TUTO, but i was waiting for more faster part\nwhatever the video is cool thnkz"}, {"text": "thank you:)"}, {"text": "@xxxWUVZHORSESxxx38 nope"}, {"text": "@animeLo comment deleted only due to foul language"}, {"text": "thank you very much. don&#39;t worry about what other ppl are saying. your doing a great job"}, {"text": "@claudiarabbit2007 okay, I stop making videos for you. :) \n\nthe world owes you a lot, doesn&#39;t it."}, {"text": "@claudiarabbit2007 do you realize i did more than my share? i made this for the one person who requested it.  :)\n\nyour having to play it back takes much less effort than my having to say the notes while playing. I started lessons on reading music. take advantage of that too?"}, {"text": "great tutorial"}, {"text": "@oMisFiTx so in your opinion, I&#39;m not allowed to defend myself  for making &quot;a most boring video on youtube&quot;? I was going to write something funny, like, you ain&#39;t seen nothing yet, for I&#39;ve done a lot worse. which is true."}, {"text": "@oMisFiTx  Ah, ever hear the saying, &quot;only the bored get bored&quot;? ;)"}, {"text": "@Daphne9222 Thank you. This makes the most sense!  :)"}, {"text": "It&#39;s Coming up tails. You can tell by the song meaning. A scientist has to choose between love and science. He flipped a coin and it came up tails. Heads was a science apart."}, {"text": "@PARISTEXAS78 without sheets, this tutorial would not exist"}, {"text": "stuff sheets, this is perfect for the non-trained, who just want to play the songs they dig"}, {"text": "@mrabdallahaldashti That makes the most sense!  :)"}, {"text": "@00einhalb You are absolutely right. I couldn&#39;t play a thing without sheets. That&#39;s why  I encourage my viewers to read music. :)"}, {"text": "@koriplays Thanks, but my application was denied.  Most songs I made tutorials for are still under copyright."}, {"text": "THANK YOU SO MUCH&lt;33333"}, {"text": "@manateeTV most people complain tutorials are fast, so for someone who&#39;s trying to learn the song it&#39;s better for it to be slow. You can speed it up once you know it."}, {"text": "Thanks for the Tutorial"}, {"text": "thank you, love how you teach :)"}, {"text": "haha. i wouldn&#39;t mind if uTube pays. thanks. like being helpful. adds meaning to living."}, {"text": "16:9 para 4:3  entender? xD"}, {"text": "can you please tell me where to get the sheet music?"}, {"text": "Thanks.  :)  \n\nI can barely reach 10 notes. That&#39;s probably below average for a classical pianist. Rachmaninoff can easily reach 13. I surmise 8 is ideal for most."}, {"text": "I guess you have the largest hands in the world!!! GR is calling you right now lol\r\nGreat tutorial, cheers!"}, {"text": "omgomgomgmog lolololololz"}, {"text": "FINALLY THE MELODY PART I THINK"}, {"text": "yah...the first chord is supposed 2 be a dm7...so u should add the c underdeath the d"}, {"text": "Mazing! *-*"}, {"text": "thanks so much!!!"}, {"text": "yep cheers just what i was looking for"}, {"text": "thanks really helpful x"}]