[{"text": "Hi, Jane, I have finished Czerny 599, can I learn this?"}, {"text": "Nao Gostei ,porque ela nao explicou nada e tocou so para ela mesma ,pena ."}, {"text": "Thank you!"}, {"text": "Jane é a melhor professora de piano no YouTube. Eu amo suas aulas. Jane I love your classes, You&#39;re the best teacher."}, {"text": "thank you so much this is helping me learn this song better!!"}, {"text": "Guaao thanks  for tha tutoria   My dedicado a dar esa intension tan linda   God bless you 1000 time"}, {"text": "Very Beautiful Jane. Thank You for all you do."}, {"text": "There aren&#39;t the stops"}, {"text": "I started studying this music"}, {"text": "Jane, please can you make a video from the song “the crave , Ennio Morricone” please🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼"}, {"text": "no talking part. AMAZING"}, {"text": "Excelent, 1 new sub for you, thanks"}, {"text": "Very  good"}, {"text": "Thank you for your videos!!  You have helped me so much.  A lot of my questions have been answered by watching how you play.  Not everyone knows all the technical terms these days.  I asked several of my friends who play and they had no idea.  So glad I found your videos."}, {"text": "I love how you play the piano in this tutorial because I can follow you .I love this song. Bravo and thank you."}, {"text": "Hi Jane, I am new at your channel. I am an adult beginning learner without a teacher.  I ran into your tutorials a week ago. I am thankful for your tutorials. They helped me to correct some of my mistakes. I am going to do your sight reading program and learn the scales too. Thanks again. Your tutorials are indeed very useful to anyone who want to learn piano. By the way, I look forward to watching your other tutorial videos, especially Beethoven 5th Symphony part 3. Oh I almost forgot to say how I love this video&quot;chopin Nocturne Op.9, No.2&quot;  You play beautifully. I hope that I will be able to play it one day."}, {"text": "I was triggered after hearing such a accurate song he played the person who played is the best person ever I heard"}, {"text": "It&#39;s still slow at 2x speed"}, {"text": "Hi Jane, great work, any chance of john field nocturn number four in A? Thanks!"}, {"text": "Muchisimas gracias Excelente ayuda"}, {"text": "How to use the sustain pedal in nocturne ? Tell me jane :("}, {"text": "I&#39;m just wandering why such good and generous video has dislikes from someone, what are they actually thinking about?"}, {"text": "Hello Jane, <br />Thank you so much for all the videos you are doing! Fantastic ! <br />Is it hard to learn this piece ? I can play la lettre à Élise ( original) and all the Satie’s gnossiennes. I always thought Chopin was too hard for me ..."}, {"text": "Thanks for this video but if you can, could you please make a tutorial explaining it? it would be totally amazing"}, {"text": "I lve this song a lot"}, {"text": "I wish i could play this but I&#39;m only grade 3"}, {"text": "<a href=\"https://www.youtube.com/watch?v=r6WXTNhh0iw&amp;t=0m38s\">0:38</a>  C#  D  C# B C#.....C# oct"}, {"text": "I appreciate your taking time out of your day to post this for us.  You&#39;re very kind.   : - )"}, {"text": "Sorry, the tutorial might be fine, but the sound of the piano is horrible."}, {"text": "Left hand is hard for me🙄"}, {"text": "Awesome lesson thank you"}, {"text": "Siiiiii....yeeeeeeesss.<br />Thank you thank you thank you so much. God bless you...."}, {"text": "What a great tutorial ! Thanks to those videos I have mastered three classic pieces in a few months time ! This nocturne is one of them ! Fantastic job, Jane !"}, {"text": "Hi Jane. I have less time in piano, i was up to 4° GM in conservatory with basson. Now i love piano but I know very less, however i can play the Nocturne n° 20 (except irregulars groups), think you that I can play this piece or its to much level? thank you so much, amazing work, pianist!"}, {"text": "I don&#39;t know how to play piano...but I&#39;m trying hard to learn it..and this will be my first song"}, {"text": "lol I am only like 3 seconds into the  video (when he starts playing) and I am already confused"}, {"text": "thanks for this great tutorial! Is this nocturne harder to learn than Chopins &quot;nocturne in C sharp minor&quot; ? thanks so much!"}, {"text": "Thank you, Jane! Amazing!!!! 😍😍😍"}, {"text": "Hey, what are you doing with the pedals? I&#39;ve tried all three pedals, but I can&#39;t seem to get the same sound as you!<br /><br />Thanks,<br />Lukas"}, {"text": "Are you guys listening out there?<br /><br />Jane has asked us all for a $1 contribution to help a young penniless young man to buy a digital piano to help him developing his extraordinary skills so he does not have to pay rents to work on classical works he treasures.<br />We all know what we all ow to Jane’s daily dedication for making tutorials for tastes and all levels of piano music.<br />The figures can’t lie : 112 656 subscribers  74 093 753 views… That tells a lot. Doesn’t it?<br /><br />Dozens of us have requested tutorials from Jane and where very pleased when she duly delivered them.<br />Many have expressed their thanks. Meaning many of us owe much much more than $1 worth of gratitude to Jane.<br />Any objection?<br />So please guys, now is the time to show your gratitude to Jane. The money is not going to fill Jane’s wallet. Instead, it will help a very deserving young man to perfect his skills the same way many of you are lucky enough to do with the piano you owe.<br />No act generosity there. This is will only show your gratitude to Jane.<br /><br /><br />GoFundMe page: &quot;HELP SEAN GET A PRACTICE PIANO&quot;<br /><br /><a href=\"https://www.gofundme.com/cffmp-help-s..\">https://www.gofundme.com/cffmp-help-s..</a>.<br /><br />Many thanks in advance."}, {"text": "Hey Nice tutorial ! Love it!"}, {"text": "hi Jane. i found your video help me  in learning this song. thanks."}, {"text": "thanks, one maybe could not be a professional player, but if you just can play one or two of chopin&#39;s songs, it would be enough, thanks for clearing the path for amateurs like me"}, {"text": "PERFECT! Thanks for helping us!!"}, {"text": "thank you jane!! you sound amazing!!"}, {"text": "Hello please can you send me all the notes of the left hand as I always have great difficulty trading them <br />Thank you so much <br />Regards Barbra Jacobs.   U k"}, {"text": "bellissima e stupenda."}, {"text": "@Jane.hi Jane I really need advice for the fingering or just in general advice for the 4ths page bar 24 I can&#39;t get the quick bit which plays An B Bn C C# D G F E E I just can&#39;t get it to the ugly speed please lend advice? Thanks in advance -Brandon"}, {"text": "Thank you so much, I have a question: I&#39;ve played few very beginner pieces, I&#39;ve not technique, but I really want to learn this piece, I love it so much. Is it possible for me to start learning it?"}, {"text": "Amazing tutorials. Please keep them coming"}, {"text": "thank you thank you thank you thank you thank you thank you thank you thank you very very very MUCH¡¡¡¡¡¡¡¡ I love you¡¡¡¡"}, {"text": "Thank you so much for this video ! Could you, please, put the music sheet of this piece in the description ? I cannot download it with this link... :("}, {"text": "les meilleurs tuto !!! propre carré clean !!! bravo"}, {"text": "Maravilhoso !!!!!"}, {"text": "This is a great video! I have been playing the violin, albeit inconsistently, for 10 years now. I just started learning scales on the piano a couple months ago and I decided that I&#39;d like to dedicate more time to learning the piano. You&#39;ve answered a simple question I had: can I learn classical piano with 62 keys?"}, {"text": "Thank you for sharing this Jane! I&#39;ll be patiently and earnestly follow this one ;) <a href=\"http://www.youtube.com/results?search_query=%23cantReadNotes\">#cantReadNotes</a>"}, {"text": "Thank you so much Jane for this incredible gift to us all!  I&#39;m a beginner adult (on my own) and can&#39;t even attempt to learn this jewel at this time.  But may I ask, I tried to learn Moonlight Sonata but my fingers are too short and I cannot reach some of the 3 notes...let alone 4 notes!  If there&#39;s some trick for this I&#39;ll appreciate it a lot to let me know?  Also, do you teach in NYC by chance?  Thanks very much!<br />P.S.  Can this piece be converted to C Major as someone did and is selling the music sheet?"}, {"text": "Hi Jane, I think there is an error at <a href=\"http://www.youtube.com/watch?v=r6WXTNhh0iw&amp;t=1m07s\">1:07</a>. The LH chord should be Bb Eb Ab, but you play Bb Eb Bb."}, {"text": "Hey guess what? You just earned another subscriber. :) <br />I just learned Maple Leaf Rag cause of your videos. <br />I&#39;ll be working on this one next."}, {"text": "Listen it  x2  LoL"}, {"text": "I was struggling with the trills but this helped a lot, thanks a bunch jane"}, {"text": "nice"}, {"text": "Thank you Jane. :)"}, {"text": "쇼팽음악??"}, {"text": "혹시피아노선생님 아님교수님??"}, {"text": "I can&#39;t do trills very well. How can I make quick and precise trills? Maybe you can advise me in this area?"}, {"text": "Hello Jane,Thank you so much for your great job.Could you let me know how many years of practise I will need to play this piece ?Best Regards.Marc Alexandre"}, {"text": "Very nice ! Your hands are beautiful :)"}, {"text": "Are the left hand keys exactly like the sheet music?"}, {"text": "Congratulations Maestro ..."}, {"text": "Es buena para relatar la mente"}, {"text": "This is impossible to study...I will try my best...I am a 13 year old practicing for 2nd year for Trinity College Exam.Playing this piece is my everlasting wish.But I can&#39;t do it."}, {"text": "i love that tune"}, {"text": "Thanks the left hand chords were giving me trouble"}, {"text": "Jane, thank you so much for doing a tutorial that I can actually learn from. I play by ear &amp; have played other instruments, but reading music is beyond my ability especially with my double vision. I am going to learn this beautiful music withyour help."}, {"text": "Where can I get the right sheet music for this song? I&#39;ve downloaded a terrible version"}, {"text": "this tutorial is very helping me! thank you very much jane :)"}, {"text": "Hi Jane, can you instruct me something about music theory to be able to play by myself. thank you so much for it and i am so appreciated for your teaching. Sincerely"}, {"text": "Finally, I am playing my most beloved Nocturne! With you and only with you, I was able to learn it, it turned out to be so easy. Thanks to you, it&#39;s doable. Thank you very much, I adore you !"}, {"text": "my hands are too small for this :&#39;("}, {"text": "Good tutorial. The only problem is we can not see very well with note you press... I thinks it&#39;s the camera and the light together. thanks."}, {"text": "Thank you very much for this lesson!!!)"}, {"text": "I would love to play like you, I &#39;m still learning , I love your work!"}, {"text": "Thank you for this post!  It was very helpful to see the fingering."}, {"text": "I am so thankful for you Jane! You made me a better pianist! I learned pieces I never thought I would be able to play because of your videos."}, {"text": "What is the reason to start the melody with 2 - 4? Wouldn&#39;t it be more natural to play 1 - 4 or 1 - 5?"}, {"text": "thanks a lot for you video. I hope that your finger will be completely true to Chopin&#39;s  piano sheet. Because i learn a lot from your videos. Sincerely"}, {"text": "Thanks for your work."}, {"text": "This tutorial could not have come at better time. I  was able to use may of your left hand suggested fingerings to eliminate unnecessary transitions by slight changes to my wrist angle and placing my fingers more towards the back of the keys. I don&#39;t have a teacher to being able to watch you hands so closely is a godsend! Thank you so much!"}, {"text": "I recently completed this piece and was told by my teacher that it was Level 9.  I checked with RCM and saw that it was listed among the Level 9 pieces there as well.  I am just curious to know why you have it at Level 5.  Thanks!"}, {"text": "@Jane  The trill in about <a href=\"http://www.youtube.com/watch?v=r6WXTNhh0iw&amp;t=1m51s\">1:51</a> start on the upper note or it doesn&#39;t matter ?"}, {"text": "Excelente tutoriales me ha ayudado mucho gracias"}, {"text": "Wish I could see it full speed from you... Really nice played !"}, {"text": "@Haralampos Tiros  Thanks Haralampos, but it concerns me that your hand is hurting. You must rest, ice it? Please take it slower, there is no rush to learn, is there?"}, {"text": "God bless you for doing this. - I&#39;ve learned 50 seconds of this - The left hand hurts so much from practicing T.T - IL GET IT. BY THIS SUMMER ILL GET IT."}, {"text": "Nocturne Op. 9 was my dad&#39;s favourite Chopin piece, we always used to listen to it together, and after he passed away, I promised myself I&#39;ll learn to play it. So thanks to you Jane , Im doing it.<br /><br />So thank you!!"}, {"text": "gracias :D me ayudaste un monton!! yo sabia la cancion pero me costaba porque no sabia bien como colocar los dedos, pero gracias a este tutorial pude terminar de aprenderlo :D MUCHAS GRACIAS ^-^"}, {"text": "well done Jane.  I answered my own question, you set your metronome to eighths.  Your fingering is different than what I am using, but that is ok.  I think you know better than me."}, {"text": "I need a teacher like you Jane..."}, {"text": "u Keep the beat really really well....<br /><br />Amazing...and so clearly.."}, {"text": "Thanks a lot Jane very helpful by the way those who criticise probably can&#39;t hold a tune."}, {"text": "Lovely, thank you for this! This is the first pre-recorded song on my piano and I love it. Didn&#39;t know the name of the song until recently when I realised that the the piano came along with the scores for all the per-recorded songs. But everything in there seems so...difficult. It helps a lot seeing it in slow motion. It makes me think I can be able to learn playing it.<br />I also found on your site other songs that I like and have scores for: Arabesque, The Entertainer and Fur Elise. :)"}, {"text": "hi Jane ive learned so much from your tutorial, a million thanks to you how i wish i can play tjis piece, my favorite!"}, {"text": "@Martin Ivan   Fingering is not etched in stone. We must be adjusted to fit our hand structure. To read about fingering, click my name &gt; website &gt; search box &gt; fingering"}, {"text": "Great tutorial, but that right-hand fingering drives me crazy, why do you make it so complicated by switching fingers for no reason? :)"}, {"text": "would love to hear this in tempo"}, {"text": "Wow, what a rendition!! Take a bow Jane..you deserve it :)"}, {"text": "Hi Jane, thanks a lot for your time in recording this very useful tutorial video"}, {"text": "Thank you for this one.  How is this level 5 is beyond me.  I have ARCT performers diploma but is just coming back to the piano after a 18 year hiatus, and this is still taking a while."}, {"text": "Thank you for everthing"}, {"text": "Hi Jane,i follow all the songs you play.I love your videos,Thank you so much.Would you please upload a tutorial of Schubert &#39;s der Müller und der Bach"}, {"text": "Trata dejarlos en español son buenos"}, {"text": "Good job, my friend."}, {"text": "@ <a href=\"http://www.youtube.com/watch?v=r6WXTNhh0iw&amp;t=5m27s\">5:27</a> the B should be a B flat"}, {"text": "I really appreciate it!! I love this piece that I ve always wanted to play it on my own yet I have no idea abt note reading.<br />Thank you so much!!"}, {"text": ""}, {"text": "thank you! wow! i am so pleased to have found this,,,after searching all over for this melody the only one i still remember from my childhood lessons and forgot the name of it .hunted thru all chopin youtubes and still couldn&#39;t find it! now i will relearn it ,,,,,"}, {"text": "Hi Jane, it upsets me to see people think negatively of your tutorial. I mean, what&#39;s wrong with them? You spend your own time playing this, video recording it and sharing it so that people like me, who love this tune and do not sight-read, can try to learn to play it. Some people still find the audacity to criticize your &quot;donation&quot;. That&#39;s revolting. Besides, i am aware that it&#39;s not that easy to play a tune slowly with the intention of using it as a tutorial. That requires real focus. But hey, I thank you so much for this video. I can&#39;t tell you how much I love this tune. It always arouses my deepest emotion when I hear it, and even more when I see someone play it. Good continuation. Regards"}, {"text": "good tutorial"}, {"text": "Thank you so much ! :)"}, {"text": "WOW, amazing, Thank you so much.  I love this piece since I was a little girl.  It reminds me of my parents and bittersweet time as a child growing up in the Philippines.  I have always wanted to learn it and now you have given me the vehicle to learn it at 65 years old.  <br /><br />Thank you, I will get to work and learn it now.  My dream come true."}, {"text": "what did you set your metronome to on this one and how did you count it?  Have you ever did a tutorial on op. 66 C#minor, Chopin  &quot;fantasie impromptu?&quot;  I will check.  That is some hard $%*@!"}, {"text": "how are you counting this and setting your metronome?  You do it different ways.  I like all the ways you count, I just want to know how you break this down.  "}, {"text": "WOW! Bravo"}, {"text": "is this song you played at temple?"}, {"text": "I hear ringing phone all time."}, {"text": "On bar 12 and 13 do you use petal? because the petal sign is not in there and whenever i used pedal its sound so dry. Could you help me out? thank you and what does poco /rall. mean?"}, {"text": "thank you so much. "}, {"text": "Been away for a while and its a pleasure to be back to your lessons. Your such a talented and kind person for sharing, for free, your love of music via the piano. Thank you very much x"}, {"text": "please watch my fingers move, not the keys. to learn the various music symbols, enter the word &quot;accidental&quot; in the wikipedia search box. good luck."}, {"text": "can you explain me what do you excatly do at 0:37? I have the notes but I&#39;ve never seen this sign upon C before, so it would be very useful for me if you told me what does it mean :) thank you"}, {"text": "thank you. good luck and enjoy."}, {"text": "Beautiful! Am going to incorporate your video into my practice sessions.\nThanks very much."}, {"text": "you&#39;re welcome. glad they help :)"}, {"text": "Wow, these videos are a fantastic help. Thanks so much!"}, {"text": "yes, the setup is so much better than before. thanks to our handyman Robert. hope I can continue making tutorials so his work doesn&#39;t go to waste."}, {"text": "The lighting made the pressed keys so much clearer thanks lots I finally got the last part of the piece from your video hahaha!!"}, {"text": "looks like spam. no video of such nature found."}, {"text": "that&#39;s nice, you&#39;re welcome :)"}, {"text": "i love this melody , thanks !  "}, {"text": "you&#39;re very welcome :)"}, {"text": "Thank you very much! "}, {"text": "Glad it helps. Thanks, Humberto, for writing."}, {"text": "Very helpful to watch the fingering in all the turns and trills and the odd polyrhythms. \nthanks, Humberto Cruz"}, {"text": "saw your posted request after I wrote. good luck :)"}, {"text": "thank you! :)"}, {"text": "yes, it is one of the most popular Chopin pieces."}, {"text": "btw, if you post your request under my request video, others can vote for it"}, {"text": "you certainly caught my attention :)  which country are you from?\n\nOp. 17, No. 4  is my next Mazurka tutorial, because viewers from 3 different countries requested it."}, {"text": "thank you, again :)"}, {"text": "Muito bonito ! obrigado."}]