[{"text": "Could I use normal dark chocolate chunks to add to the dough?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=1m48s\">1:48</a>"}, {"text": "Hey Gemma, I made brownies twice with this exact same recipe except replaced eggs with flax egg, but unfortunately both the time it stuck to the paper and also was really chewy and quiet a bit buttery. Could you help point out a possible mistake? Really looking forward for your reply. Thanks 😊"}, {"text": "I made these today … and went Bigger Bolder by subbing chocolate malted milk powder for the extra 2 Tablespoons each of the brown/white sugars and cutting back a Tablespoon of the flour. AMAZING!! Just had one with a glass of cold milk. Thanks so much for this recipe, Gemma!! &lt;3"}, {"text": "Hi Gemma , written recipe page is not getting open"}, {"text": "I have a question will it still be fudgy if i don’t use chocolate chunks?"}, {"text": "Can I use compound chocolate chunks"}, {"text": "I made these and they are delicious. They’ve been out of the oven for barely an hour and my family has nearly scoffed them all!"}, {"text": "I&#39;m a Spanish speaker and I&#39;ve spent lots of months looking for the perfect brownies recipe and I didn&#39;t know it was in English, thank you, you&#39;re amazing!"}, {"text": "Can I add macadamia nuts to the recipe, and if so how much can I add? I really like nuts added to a brownie"}, {"text": "I tried baking it last night following her recipe, and it turned out perfectly!! So chewy, thick and fudgy!! Forget other recipes, this recipe is easy enough to follow but tastes amazing."}, {"text": "Do we need to chill the batter before baking them?? What is the reason?"}, {"text": "Loved the video, u r really sexy... keep up the good work babe &lt;3 &lt;3 &lt;3"}, {"text": "I don’t know what I did wrong but in the oven the butter separated from the rest of the batter and started bubbling. Does anyone have any ideas as to what may have went wrong?"}, {"text": "What should I use for an egg alternative? Please comment if you have any idea of what to use. Thanks!"}, {"text": "Honestly Gemma, I still cannot believe that these are the best and at the same time the quickest and easiest Brownies I have ever made. I make them so often, it is insane. Thank you for he recipe!!"}, {"text": "Hey Ma’am just want to ask you a question why we need melted butter in a fudgy brownie?  Your reply will be highly appreciated.❣️"}, {"text": "Questions<br />Can I use chocolate chips<br />Also if I want to replace brown sugar how much white sugar will I add?"}, {"text": "I&#39;m baking these today! So excited!"}, {"text": "Loving the egg substitutes!"}, {"text": "I discovered your channel not too long ago. I’ve been watching many of your recipes and I better get baking.  I’ll be able to start early for Christmas.  I made your recipe for homemade butter and cream cheese. They are awesome, so delicious.  You have a subscriber forever.  I love your channel and I think that you and your husband do a fantastic job. 👍💕🇨🇦 🤩"}, {"text": "Can i leave chocolate out?"}, {"text": "Hi Gemma. Could the dark chocolate chunks be substituted or mixed with other types of chocolate in this recipie?"}, {"text": "Hey Gemma. I made the brownies. They are fudgy inside but they didn’t form a skin like brownies have on top it’s more like a cake ???"}, {"text": "I would like to make these brownies but she didn&#39;t give any measurements how do I get them?"}, {"text": "If we want to replace butter with oil then plz tell me how much oil can use?"}, {"text": "Can I use a 20cm x 20cm square pan for this recepie? :)"}, {"text": "Hi mom .Can I use non stick pans to bake this brownie???waiting for your reply mom."}, {"text": "Liked the brownie recipe not so keen on the advertising fluff"}, {"text": "I have tried it earlier and gonna make them now also they are always a super hit 😘😍"}, {"text": "Lol I was about to say that I wanted to use hot chocolate powder until you said that I&#39;m not allowed to and now I have to go and buy some lool hehey"}, {"text": "I made these few days back and the brownies were a hit. This was my first awesome brownie experience. I used dark cocoa powder as u suggested In the recipe and I loved the result. Thanks a lot for this great recipe. Ur best ever recipes are awesome!"}, {"text": "Sorry, but how much ingredients do you use of each?"}, {"text": "Can I use a 10*10 inch cake pan to bake this recipe? Will the baking time also need to be reduced."}, {"text": "Mine came out very cake-y and not at all fudgy or guuuuey (isnt 1 cup flour 2 much?). Help!"}, {"text": "If I cook this tonight and put to fridge after how long will it last?"}, {"text": "Can I use almond flour instead of all purpose flour?"}, {"text": "I&#39;ll be making these amazing brownies to enter in the New Mexico State Fair next week because I enter to win! I&#39;m doing as many &quot;bucket list&quot; things as possible because the cancer I have been arguing with for 7 years  is back and more hateful than ever.  Hospice nurses will be my trial judges before the official entry day next Monday. Thank you for the recipe AND a helpful video...I will report back with the results! <br />By the way, Brian Ziegler&#39;s comment made me laugh right out loud."}, {"text": "The recipe link isn&#39;t working :("}, {"text": "I made this and it&#39;s turn out so good 💓 thank you for such a good recipe 💓"}, {"text": "how many tsp salt?"}, {"text": "Thanks so much gemma this recipe is amazing!"}, {"text": "This is my go to recipe for brownies now I know you always say it but what happens when you replace coco powder with hot chocolate powder"}, {"text": "Can I use almond or coconut flour instead?"}, {"text": "I can&#39;t wait to try this recipe! I&#39;m over here drooling. lol You ask in the video what you should make next. How about cannolis or cream horns? Biscottis would be good too."}, {"text": "Can&#39;t wait to make these! I&#39;m over here drooling right now. lol You ask in the video about what you should make next. How about cannolis or cream horns?"}, {"text": "Your recipes are very easy to follow. I tried your brownie recipe for the first time but they turn out to be little bitter. I followed step by step instructions and cannot tell as to what would have cause them to taste bitter. Could you please help me with this."}, {"text": "I&#39;ve been watching Gemma bake for more than 4yrs. now and I still see the same baking tools like her cute measuring spoon! They&#39;re lovely 😊❤"}, {"text": "Can Nature Box could deliver in the Philippines? Or by any means, a flagship store?"}, {"text": "I can&#39;t wait to try this brownie recipe! I have a go to recipe that I want to compare to tjis one. I&#39;m not a big fan of the advertising but every blog that I&#39;ve been on is flooded with ads. The worst are the videos tjat put adds in the middle of the instructions! So I can&#39;t complain too much. Everyone has to get paid right?"}, {"text": "I made it twice and it&#39;s the best brownie i have ever tasted! :D"}, {"text": "Hi gemma, i love this recipe thank you. Do you have a recipe for lemon brownies as all the recipes i find are in cup measurements and not grams which i never seem to conquer the correct weight"}, {"text": "These are the BEST EVER!!!! I have found my go to brownie recipe and am looking no further.  Gemma you are the best!"}, {"text": "Hi Gemma! I wanted to try this recipe of yours but first I need to ask these questions and I hope you&#39;d be glad to response 😊<br /><br />1. Can I just use all brown sugar instead of putting a bit of white as per recipe? I&#39;m afraid it will be too sweet if I use white?<br /><br />2 . Do I still bake it the same time if my baking pan is an 8x8 square pan?<br /><br />3. I only have a convection oven at home, is the temperature that I&#39;m gonna use still the same?<br /><br />4. You mentioned you let it cool for 2 hours, is it the minimum time required to cool it down?<br /><br />Sorry for these queries, I just wanna make sure I do it right :) Thank you and God bless you!"}, {"text": "I just ran out of white sugar today. How can I substitute white sugar with brown sugar? Does substituting a part of white sugar with brown sugar change the texture of this brownie?"}, {"text": "if i don&#39;t have brown sugar do i need to double the white sugar? or keep the same amount?"}, {"text": "Hey gemma... It&#39;s actually best ever... Finally it turned out being just awesome!very 1st time i tired ur recipe... Thn I just kept on trying dozens of recipes in a year and finally came back to conclusion... Gemma Stafford is the best!"}, {"text": "hi Gemma<br />can you plz plz make tastycakes the tandykakes the ones wth peanut butter"}, {"text": "2 minutes of nature box at the start is a bit much in my opinion none the less I love the Brownie recipe thank you"}, {"text": "Really the Best Brownies I ever tried coz I&#39;ve tried so many recipe but this one is the perfect for me. Thank you Chef Gemma, Godbless."}, {"text": "Hi Gemma. Can l halves the recipe and make it in a 8x8 inch pan? How long should l bake it? And can l reduce the sugar without affecting the fudgy texture if l halve the recipe? How many grams of sugar should l use? Thanks Gemma!"}, {"text": "Hi Gemma. Absolutely love your recipes. My only doubt is don&#39;t we need to add some baking soda or baking powder in this recipe."}, {"text": "Can I use almond flour or coconut flour instead of normal flour?"}, {"text": "Hi Gemma, I have a basic question. Can I use aluminum foil tin for baking in oven?"}, {"text": "I am not a cook but I made these and they came out delicious! They are very chocolates to say the least. I enjoyed making them and my family highly enjoyed eating them :)"}, {"text": "hi gemma i tried this today and my brownies tasted so good but i can’t figure out the baking time, the problem is i don’t have a pan as big as yours so the baking time must be different. i didn’t realize that until my brownies came out set and perfect on the edges but totally runny in the middle like when you pull out a cheesy pizza slice. i let them cool for about an hour tho, i really want to try again and nail those next time. should i refrigerate them after cooling down?"}, {"text": "Hi Gemma, may I know how much does this recipe weigh?  <br />I mean, is this a recipe for 1/4 kg(250g) or 1/2 kg(500g) or 1 kg(1000g) brownie ?    Please let me know"}, {"text": "❤️ I love brownies and one day I have too try this recipe because honestly these brownies were looking BOMB! How could people dislike this video, NO WAY!!"}, {"text": "The best recipe I’v ever tried! Thanks gemma!!"}, {"text": "I tried this brownie recipe and it turned out great but it was a little dry, I think I did something wrong 😅"}, {"text": "Hi, what size baking pan I can use if I don’t have 7x11?"}, {"text": "This looks absolutely mouth-watering Gemma.  Just one question:  if you wanted to add nuts to it, when would you, just whenever?  After you sift the flour &amp; cocoa powder, I&#39;d guess."}, {"text": "I have made Brownies but they never turned out good . This was an AMAZING recipe and it was DELICIOUS . I couldn&#39;t stop eating these brownies. Thank You so much for sharing this recipe 💜"}, {"text": "I made them today and they turned out to be fudgy moist gooey . Guess what I’ve used avocado instead of butter but only half of it’s quantity and yoghurt instead of eggs !! <br />Should increase baking time . <br />Thank you Gemma"}, {"text": "Hi Gemma.... Love ur recipes.... I have one question- can i use dutch processed cocoa in this recipe?? and if ur answer is yes, then should I increase/ decrease the amount sugar or should I keep it the same?? love u &lt;3 &lt;3"}, {"text": "Is there really any need for the two minute ad at the beginning of the video? Gemma, you sold out! Let your baking speak for itself. People are losing respect for you by all the advertising."}, {"text": "I just made them and turned out very yummy!"}, {"text": "I hate how they advertise in <a href=\"http://videos.at/\">videos.at</a> least do it at the end."}, {"text": "Very easy to make and perfect brownie thanks Gemma 😃👌"}, {"text": "I made this a few months ago and I love it! Gonna make it again this Friday for my nephews birthday party.. So yummy!"}, {"text": "I made this today .it was perfect.Added 1 cup coconut and 250g butter."}, {"text": "Small steps helped me alot it is an up and coming yt channel  recommend to go check her channel just write small steps curry or small steps fruit cake to get the channel she deserves more subscribers for the quality for her vids"}, {"text": "How can I increase shelf life of the brownies for a week at room temperature. Would appreciate your response."}, {"text": "Is it important to use brown sugar? And do you really have to use dark chocolate??"}, {"text": "Hey Gemma, I&#39;m in process of making these brownies but Im a bit Confused atm! Can I use vegetable oil in place of vegetable glycerin as we do not consume alcohol which is found in vanilla extract. Or can I use vanilla extract which doesn&#39;t has alcohol in it.  Also can I use white sugar in place of brown sugar? Please let me know!"}, {"text": "United Kingdom"}, {"text": "i want to know do i beat the chunks of chocolate or let it be there?"}, {"text": "I&#39;ve tried this recipe and I just love it! One of the best brownies I have ever eaten!"}, {"text": "Made these the other day. So gooood!"}, {"text": "I made these and they turned out quite dry :("}, {"text": "This recipe is amazing!!! I tried it today and it tastes like baked fudge, it’s incredible. It’s super rich but well balanced. Thank you Gemma for this recipe! ❤️❤️❤️"}, {"text": "My brownie turned out soo bad and I followed the recipe"}, {"text": "Soooooo why the hell arnt you giving us measurements<br /><br /><br /><br /><br /><br />Ok that makes sense"}, {"text": "Salted butter? Brown sugar? No melted chocolate? I have to try this..."}, {"text": "Thank you for this recipe Gemma! My first time making brownies and they are the best I have ever had. How long would they keep in the fridge?"}, {"text": "Looks like yummmy lovely.."}, {"text": "I wonder how yall make the brownie when she didn&#39;t actually leave a measurement of ingredients"}, {"text": "Hi Gemma!! Thank you so much for this recipe. I made it today and it turned out awesome! Since I personally don&#39;t really enjoy butter I replaced all the butter with unsweetened applesauce. I also measured the amount of sugar according to my own taste and it was bomb. I recommend this recipe. Super fudgy outcome!"}, {"text": "This the BEST brownie recipe ever!! 😍😍"}, {"text": "I just recently found your channel and wanted to say that I made these brownies, following your instructions to the letter. Boy, they are just as you described, fudgy, chocolately and beyond delicious! I tried to post this on your website but couldn&#39;t do it. Just kept taking me to the bottom of the page with nowhere to type. Anyhow, decided to write it here! Thanks for the recipe which is now my go to for brownies! 🙏❤"}, {"text": "i just had dinner and now i just wanna eat again"}, {"text": "Hi Gemma, I wonder why my brownie only put in for 20 minutes. It turned into Cake? 170 degree 20minute. I tried twice😥"}, {"text": "Hi gemma, <br />How much does this brownie recipe weighs?"}, {"text": "Never liked brownies that much and definitely never baked them before since I&#39;m just learning how to bake. But I had a strange craving for good brownies for months and decided to try a recipe because at worse case, I could just dump them if they weren&#39;t good. I followed this recipe and I&#39;m kind of ashamed of how many of these I ate in one night. They were fantanstic, my brother stole half of them and they didn&#39;t last 2 days at his house. Thank you so much for sharing."}, {"text": "Tasted sooo good thank you!!"}, {"text": "Great recipe!!!! Just one question tho .....how do i alter the oven timings if i need to halve or double the recipe"}, {"text": "Perfect! Made them and it tastes great! A tip I might add is add a tsp of almond essence, it gives it a little extra kick of flavor 😉 great brownies Gemma! These are my go-to brownie recipe now! Haha"}, {"text": "This is really the best recipe ever! Made this today and they are so delicious! Thanks Gemma!"}, {"text": "Yum"}, {"text": "R we suppose to store brownies in fridge or its okay if kept in store for a week or so?"}, {"text": "Hey... <br />I don&#39;t know what&#39;s wrong with my brownie it turns out to b hard after baking... N breaks down... What shall i do?"}, {"text": "I&#39;ve made this recipe twice now. It&#39;s really good. Chocolatey, not too sweet and perfectly fudgy"}, {"text": "I ate too much chocolate today, but I still want more 😂"}, {"text": "What if u don’t use brown sugar does that effect anything????"}, {"text": "Can someone tell me the measurements for all these ingredients???"}, {"text": "Would I be able to use self-rising flour?"}, {"text": "I made this and I put some homemade dulce de leche on the top of it and it was delicious"}, {"text": "Can I half the recipe? Instead of like 1 cup butter and 4 eggs, can I just use 2 eggs and 1/2 cup butter.. Like completely half all the ingredients? Will I still get the same results?"}, {"text": "I&#39;m going to make these for my friend&#39;s birthday :)"}, {"text": "Thank you i like your reciepe😋"}, {"text": "Can we use white instead of brown sugar"}, {"text": "What can I do if I don’t have cocoa powder?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=4m10s\">4:10</a> <b>She read my mind 😂 I was going to use chocolate powder, but then I bought the cocoa powder.</b>"}, {"text": "Amazing amazing it is. I make it every time my friends love it. Tysm Gemma. But eat it next day for better taste cz next day it tastes like heaven...."}, {"text": "How did it blow up without baking powder or soda?"}, {"text": "Thank youu so much i tried it and it was so yummy 😍"}, {"text": "Why isnt baking powder added??"}, {"text": "Hi Gemma 😊 I do this delicious brownie today (saturday) and I will take them to school on monday. So how should I keep them? 😊🙏🏼"}, {"text": "Would dutch process cocoa powder work???"}, {"text": "Gemma，I love ur brownie recipe so so much. But I got a question here. If I can’t finish all them in one day. How should I store them? And how to eat them the next day?"}, {"text": "Where is that &quot;When do I add weed ?&quot; comment? :D"}, {"text": "Mine were too bitter."}, {"text": "Mine turned out cakey first time so I changed the method a little now they are amazing!!"}, {"text": "Thank you for this brownie recipe. I love how much you enjoy preparing them. That joy seeps into the emotion revolving around the recipe, making it extra special. I&#39;m going to try these for my birthday."}, {"text": "Shared. Love this and flourless recipes."}, {"text": "Gemma I can&#39;t thank you enough for this recipe. I have literally tried around 5-6 these so called &quot;ultimate brownie recipe&quot; but I was never satisfied.  At last I tried this recipe with not much hope but it turned out freaking goooodddd.. 💋❤"}, {"text": "I fucking love you! Thank you 🙏🏽"}, {"text": "I just made it, it’s vvvv delicious"}, {"text": "Baking starts at <a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=1m45s\">1:45</a> :)"}, {"text": "Can you please mention the measurement of the ingredients"}, {"text": "Please mention masurment too how much yor add everything"}, {"text": "This is the best brownie recipe I&#39;ve ever made. Thank you."}, {"text": "I’ve got a 7x7 inch square baking tray thing will that be fine for this recipe x"}, {"text": "I made the same with yogurt as substitute...n since I didn&#39;t have oven I preheated a vessel n later kept it in medium to low flame for 35-40 min..later wen I saw it was cooked but it was crumbly...could you tell what went wrong?"}, {"text": "I can&#39;t wait to show off this delicious recipe for our Church pot luck Thanks, Gemma. 😋👏"}, {"text": "I’d say Brownies are my second favorite dessert, sweet treat (Tiramisu is First!) and once again, these were so easy to make and absolutely delicious!! I love how you always warmly and generously explain everything in detail without sounding condescending, that’s a skill. Also appreciate all the alternatives you offer, too! Thank you for making baking fun, easy and so dang delicious!!!"}, {"text": "I tried this recipe...and that was the best brownies recipe I have ever tried your tips always makes it easier to bake.. Love your recipes love the way you describes.. Thanks for making our food more delicious.. Love from Pakistan 😊"}, {"text": "I made this today but it turned out cake-like..<br />Any ideas to why it turned out like this ?"}, {"text": "I typically hate that stupid expression &quot;Best ever blah, blah,&quot; because if you haven&#39;t had every &quot;blah, blah&quot; there is, then u don&#39;t know what is the &quot;Best ever blah, blah&quot;. But for the first time ever, I am going to say it, &quot;That is the Best Ever Chocolate Brownie!!!&quot;"}, {"text": "Gemma, man,I love ya but you don&#39;t mention the amount of each ingredient your adding....."}, {"text": "Write down Ingredients"}, {"text": "Can you do a video on how to crack eggs without getting shell in the mix?"}, {"text": "These brownies were so tasty. I made them yesterday and everybody loved them. I m 12 years old and i love trying new recipes just like u. U r helping me to make my cooking even more better."}, {"text": "Could u kindly give the measurements of the ingredients."}, {"text": "hi Gemma, id like to make these in cupcake form, what is the baking time i should use?"}, {"text": "Can the cocoa powder be replaced with a 70% dark chocolate bar?"}, {"text": "Did you used salted butter?it&#39;s unclear what you said on the video.😃😃"}, {"text": "Light brown sugar or dark brown sugar"}, {"text": "Gemma Gemma Gemma! You have created a monster! I now even bake these brownies for our Priest, my Dive Master and my friends!"}, {"text": "Made these today and everyone LOVED them. So gooey and delicious! 5 star recipe &lt;3"}, {"text": "Simply best brownies! No chocochips needed! Chunks of chocolate only!"}, {"text": "Hi Gemma..is that brown sugar and white sugar? Can I  use any kind of chocolate? Thank you.."}, {"text": "I made this Sunday, and must I say, &quot;the best!&quot; Thank you."}, {"text": "Indeed the best ever brownies... I made this yesterday and did another batch soon after finishing the first batch... My family and friends love it... Thank you for this recipe... I&#39;m planning to buy brownie boxes so I can make this as gift..."}, {"text": "These are so much better than Jamie Oliver brownie recipe! Turned out so moist and rich👌"}, {"text": "Hlo.. i am urs new subscribers  ..from india. . <br />Very good .."}, {"text": "Ifi wanted to make these as keto fudgy brownies what switches would ypu suggest? Erythritol for sugar and almond flour fir white flour? Anything else different? Thx"}, {"text": "Hi, ms gemma I love you brownies. Question, if I use 1/2 cup of brown and white sugar, is there any difference with the output? Because I don&#39;t like it when its too sweets.thank u. I hope you will read my comment."}, {"text": "What kind of oil is Flavour less?? Or can I get it somewhere. I’m confused. Help me pls someone"}, {"text": "Hi Gemma 😊<br />Do I have to use 4 eggs or can I use less?"}, {"text": "These are truly the best ever brownies gemma😍 made them twice and they are delicious and fudgy and easy to make. You cant go wrong making these❤"}, {"text": "Hi, may I know the quantities of each and every ingredients"}, {"text": "Hello Gemma ,tried you recipe today and its wonderful,my Hubby loved it..... Superb Love from Pakistan am your Fan now"}, {"text": "Hands down the best brownies I’ve ever tried and made! This was the first time I made brownies and they were THE BEST!!!!!! Thanks a lot for this recipe my family loved them ❤️"}, {"text": "I love her oven mits!"}, {"text": "Hi! I have  mixed powedered sugar, cocoa powder &amp; all purpose flour. Can I use them for this recipe? If yes, then how much sugar i still need to add?"}, {"text": "I know this video is a year old but I have to ask what coco powder do you recommend?"}, {"text": "Just made this. It put only one cup of brown sugar and half a cup of white sugar. I used avocado oil. Love this brownies. Thanks"}, {"text": "Hi Gemma! Thanks for this and your other recipes. I&#39;ve followed a few of yours including successfully making buttermilk and icing sugar.  These are my brownies following your recipe. Came out nice and gooey but there&#39;s an overpowering cocoa bitterness to them.  Would using less cocoa powder in future fix that? I used inexpensive dark chocolate bars as well but they&#39;re only around 50%, so it must be the cocoa causing my issue?<br /><br /><a href=\"https://i.postimg.cc/qvF1Hw8W/20190213-104203.jpg\">https://i.postimg.cc/qvF1Hw8W/20190213-104203.jpg</a><br /><a href=\"https://i.postimg.cc/rsg9nNVn/20190213-104339.jpg\">https://i.postimg.cc/rsg9nNVn/20190213-104339.jpg</a><br /><a href=\"https://i.postimg.cc/qBGQv4ss/20190213-104344.jpg\">https://i.postimg.cc/qBGQv4ss/20190213-104344.jpg</a>"}, {"text": "Hey Gemma! Okay so is this brownie fudgier than the brownie recipe in your previous video ? I tried this recipe ND it was just amazing 😍 my family loved it!"}, {"text": "I just made this over the weekend and they are sooooooo very good! No more boxed brownie mix for me!"}, {"text": "Hi from Iraq.I made these two weeks ago and wow they were great,todas my hubbys birthday and a side im re-doing these brownies..Thanks Gemma!!"}, {"text": "I&#39;ve just made it, I followed your recipe but mine don&#39;t have that pretty shiny crust, why? 😢"}, {"text": "Will a 13 inch by 9 inch baking pan work or is that too large?"}, {"text": "Any alternative for brown sugar?"}, {"text": "I halved the recipe because I wanted to make a small batch. Let&#39;s see how it turns out!"}, {"text": "Do we have to melt the sugars completely in the butter or will do if some remains unmelted?"}, {"text": "Why don’t u show the measurements in the video itself it will become easier"}, {"text": "I&#39;ll be trying it soon. Thanks for the vedio 👍"}, {"text": "how sweet was it with 2 cups sugar an 1 cup APF ?"}, {"text": "These look so delicious!  I can’t wait to try these!  One question:  how much salt should I use if I’m using salted butter or should I leave it out?"}, {"text": "YUM! I am totally going to check this out tomorrow. Thanks!"}, {"text": "Gemma can I use Nesquik?"}, {"text": "Yummm ! <br />Thanks mam ! <br />Really i must thank u ! <br />Looks like Best Ever Recipe ! <br />i will definitely give it a try . <br />Too good . 😊👌👌👍"}, {"text": "Plz let us know the quantity you are using in this recipe"}, {"text": "Can you please tell what are the measurements"}, {"text": "How long should I bake it if my pan is 9x9? Can I just use 1 cup of brown sugar? Or do I have to use 1/2 brown 1/2 white? I think 2 cups of sugar is too much sugar for me :(<br /><br />Thank you!!"}, {"text": "This recipe is a definite keeper !  The video was great to watch and the brownies did not disappoint.  Everyone loved them....especially the big chunks of chocolate...thank you Gemma !"}, {"text": "Can you please write the ingredients"}, {"text": "I made these today and they were AMAZING! I had followed everything to the T and it came out perfectly fudgy, and rich in chocolate 😍  Thank you Gemma for this!"}, {"text": "Is the white sugar granulated?"}, {"text": "hello,can i bake this recipe into a 10*10 baking pan?"}, {"text": "if I wanted salted caramel fudge brownies how can I incorporate caramel in this recipe??<br /> do I drizzle it before baking then swirl it around in the batter then bake??<br />or do I pour half the batter then caramel then rest of the batter then bake??"}, {"text": "I like your accent 😮"}, {"text": "I followed this recipe oh God...  My kids and 1 yr.  Old son always say  hmmm...  Yummy momy i love it... Here from  Philippines  thank Gemma"}, {"text": "Hi Gemma,I just came across you on Youtube!As a Man of Irish descent i`m proud to come across a fellow Irish <a href=\"http://woman.you/\">Woman.You</a> did such an excellent job on teaching us how to make the <a href=\"http://brownies.you/\">Brownies.You</a> spoke clearly and moved at a pace that we could follow.Gemma, Have you`ve ever made a Lemon Anniseed Pound Cake and if you have could you please put the video on Youtube? Thanks My Friend."}, {"text": "Hi gemma. Question when you put sugar in melted butter is hot or you let it cool for a second? Is there any changes? Thank you hope you reply"}, {"text": "salted butter and add more salt?"}, {"text": "I love you! A Mexican Chocolate brownie would be amazing"}, {"text": "How much butter or everything you don’t say how much 😔"}, {"text": "Hi Gemma today I made some brownies. The texture and it’s taste was a bit sugary and a slightly tough and I was baking for 35 minutes and after 2 hours of resting I found that my brownie is not so moist what happened?"}, {"text": "Hello Gemma<br />It&#39;s a wonderful recipe <br />I will be trying it with flax eggs...as we are vegetarians <br />Please guide me on timings...I would like to try just half the quantity to start with.<br />Will wait for your reply<br />TYSM GEMMA"}, {"text": "Good morning Ms. Gemma can I use unsweeted chocolate instead of bittersweet?"}, {"text": "Hello there ! Where can I get the exact measurements?"}, {"text": "hello. can i add the sugar immediately into the hot melted butter?"}, {"text": "Thank you so much,I tried doubling the measurement , it&#39;s amazing,<br />And I have a question, don&#39;t you use baking powder in it?"}, {"text": "I was wondering if I double the amount of brownies I want to make do I double amount in all the ingredients??"}, {"text": "Hello again Gem-ma!<br />I have to tell you that I have tried other &#39;best&#39; recipes,  but I still come back to yours! It really is &#39;The Best Ever&#39;!<br />Thank you!"}, {"text": "Can you show how to make barbie doll cake I told you a couple of times but you told me that you don&#39;t know what is that  ?<br /><br /><br />Plzzzzz can you show"}, {"text": "Just made those ! I&#39;ll let you know what they taste like Really tasty !"}, {"text": "Omg love her love the way she Cooke"}, {"text": "I Made this for today, this is AMAZING! THE best brownie recipe😍🤩🌸"}, {"text": "Hi Gemma<br />Do you have recipe for brownies without egg. Because . Thanks."}, {"text": "I just did it , amazing 😍"}, {"text": "I baked this and it turned out so good!! However I used 45% cocoa solids chocolate and it was a little too sweet. I don’t have 72% cocoa solids chocolate where I’m at so how should I adjust the measurements of the sugar so it’s not overly sweet?"}, {"text": "Thanks for recipe nervous/excited to try it out! Can I add more chocolate chunks, including white and milk? Also chopped up candy bars like mars?"}, {"text": "Can i bake this into a 9x9 pan? How long will i bake it then?"}, {"text": "Please tell me how to make flax eggs, roasted or not?"}, {"text": "If I want to replace eggs with flax eggs then the flax seed powder must be roasted or not?"}, {"text": "my brownies arent really coming out like yours. they are not really coming out all that fudgy"}, {"text": "I need the measurements"}, {"text": "Can I substitute the butter with oil, or cream??"}, {"text": "Hi Gemma! Can I beat the eggs here so there&#39;s more air and fudge in the brownie? And I bake in a toaster oven, I baked this few months ago and went burnt in a toaster oven, one that does not have any temperature button thing, it just has 3 buttons that sets the top heat, bottom heat and both top and bottom heat. How many minutes to be baked perfectly? And what type of temperature should I use?"}, {"text": "I tried this today but i dont understand why it taste salty???"}, {"text": "Gemma, what would be a good combination for an eggless brownie? I have watched you video about making one but am unsure about what process to take?"}, {"text": "They actually are the best ever brownies, i just made them and it was amazingg, the best, this is the first time ive baked anything and its sooo good<br />Love you Gemma, thank you sooooo much<br />Kisses From India❤"}, {"text": "What oven do u use?"}, {"text": "Half a kilo if sugar?? Craizy!!"}, {"text": "I’ve just started my baking business (less than a year) and I use ALOT of your recipes. I’ve never gotten a bad review ❤️❤️ thank you so much!"}, {"text": "You didn’t tell the amount of ingredients"}, {"text": "If I add some baking powder will they be a little less gooey?"}, {"text": "Can you add Cherry’s Gemma?"}, {"text": "I like so much all the dessert you make!! I made the brownie already and it was delicious 😋😋 thank you."}, {"text": "Oh god help me Gemma. I have to make four lots of these brownies in two days!! 😨 I&#39;m going to be all BROWNIED-OUT!!! 😰"}, {"text": "tried it but mine came out a  little cakie not sure where i went wrong"}, {"text": "What kind of white sugar should I use? Granulated??"}, {"text": "Fan or not fan? 😁"}, {"text": "i put salt and salted butter oh gosh its too much what should i do now"}, {"text": "Made these today. So rich and fudgy. Excellent recipe."}, {"text": "I must give this video a thumbs down, you don&#39;t give the measurements in the video or the video description, I had to follow your link buried at the bottom, the website has a problem and crashed Firefox so thanks for wasting 15 minutes of my life."}, {"text": "Hi please share the details ingredients with measurements"}, {"text": "Can I skip chocolate chunks and substitute peanuts instead mix in batter ?  ☺"}, {"text": "Omg, I must try this. It looks so delicious!"}, {"text": "Can you please mention the selector of otg too for every recipe..<br />I tried this recipe in two rod fan selector on otg but it didnt happen😔"}, {"text": "Can I drop this batter into microwave?"}, {"text": "I want them in Pakistan plz plz plZ"}, {"text": "These won&#39;t last long in our home!!!! Going the store &amp; picking up the dark chocolate to add that&#39;s all  I&#39;m missing!! Yum!! We are Brownie Junkies!!  Thank You for all your Yummy Recipes,,,"}, {"text": "D E L I C I U O S 👏😍"}, {"text": "Can i use washed sugar for this?"}, {"text": "Gemma hi these turned out soooooo nice they really are the best ever brownies<br />In fact I ate all most half the batter by itself without baking it 😍<br />Whoever disliked this vid is envious and jealous of your phenomenal and artistic baking skills <br />Or they don&#39;t like brownies which is despicable rudeness to the brownies <br />Lol 🤣😎"}, {"text": "do you use light or dark brown sugar?"}, {"text": "I baked one today (for the 1st time) and indeed, this is the best brownie recipe ever! 👍 I followed the instructions and the taste turned out so rich and good. TBH the recipe was a bit too sweet for me, so maybe I&#39;ll cut down the sugar a bit next time. Also, I didn&#39;t follow the baking time of 35-40 minutes and instead baked mine for 25-30 mins (my oven is small), any more than that would have overcooked/burned my brownies. Anyways, thanks for the recipe, Gemma! 😊❤️"}, {"text": "Can i double or triple this quantity..I am planning to make this for my dinner party"}, {"text": "You are a god sent gift ❤️i love your recipes your true to your words too 👌"}, {"text": "You&#39;re so cheerful and enthusiastic and your recipes are always so good. Love your channel :)"}, {"text": "I love this girl!"}, {"text": "I tried this recipe yesterday and it is sooooo good thank you gemma 💓💓💓"}, {"text": "your voice is soothing"}, {"text": "can I make a banana chocolate brownie by adding at extra banana to the recipe or should I reduce an egg in the recipe and add the banana"}, {"text": "Hi I&#39;ve tired these and I can say there one of the best brownie recipes I&#39;ve used"}, {"text": "Ok i made these twice now and they are bloody amazing! Only thing i do differently is i beat the eggs for a good 5-10 mins to create some volume and i added chopped walnuts as well! AMAZING! Thank u Gemma ❤️🙌🏻"}, {"text": "I tired this , my husband loved it"}, {"text": "Amazing video!! Would love to try them but I&#39;m always confused with chocolate when it comes to baking. In the UK what chocolate is considered bittersweet?"}, {"text": "Hi Gemma I don&#39;t eat chocolate but baked these brownies. They came out outstanding. Thank you for the recipe."}, {"text": "I just made these brownies but they turned out more like a chocolate cake than brownies, they weren’t moist and gooey like the ones you showed. Idk if I cooked them for too long I baked them for 40 minuets exactly. Maybe it’s because I didn’t put brown sugar? I used regular sugar instead because I’d run out of my brown sugar, but I was kinda disappointed. But I mean at the end of the day the still taste great and maybe next time I could do something different"}, {"text": "When i first used your recipe, i actually succeeded but my mom told me to lessen the sugar nxt tym cuz it was too sweet for her taste.... So when i lessen the sugar, i notice that my brownie ended up being cakey and the i ended up trying again but it also ended up with the same texture...pls help me..i dont know what to do anymore. All i wanted was to lessen the sweetness but it always ended up to be a fail and ingredients are so expensive here😭"}, {"text": "I went to a bake sale and bought some wait for it Jaffa cake brownies and mint and Oreo brownies could you make a batch ?"}, {"text": "Why no quantities with your  ingredients on your videos?"}, {"text": "Where are the measurements"}, {"text": "Made this. .... excellent Gemma and Kevin.  👍"}, {"text": "Can I skip the chocolate chunks??"}, {"text": "Cant open the website."}, {"text": "Best brownies"}, {"text": "Can i use groundnut oil here?"}, {"text": "Make a pound cake"}, {"text": "Wheres da measurements"}, {"text": "I want measurement for ingredients"}, {"text": "Would this work in an 8 by 8 tin?"}, {"text": "Wow! I definitely try this brownie recipe. Thanks Gemma for the wonderful recipes."}, {"text": "Hi gemma! Can I use this recipe for two 8x8 baking pans? The more the merrier right? Haha I am planning to make this for holloween for my family and friends. Btw I supeeeerrrr LOVE ♥ your recipes."}, {"text": "How long can these be kept at room temperature"}, {"text": "I made this brownie recipe and I can say, it&#39;s better than store- bought brownies. Thanks for sharing your recipe. ☺️"}, {"text": "What’s the point of doing tutorial videos if u don’t give the measurements"}, {"text": "Could I halve the ingredients"}, {"text": "Hi. Do you need to preheat the oven to a certain degree? I’ve been baking brownies but it turned out as a failure all the time😞"}, {"text": "tried your recipe, turned out soooo goood. I&#39;ll  stick to this , thanks miss gemma 😘😘"}, {"text": "Hi Gemma... I made this today, and it came out delicious, yummy... and very chocolaty 👌😍... thank you!"}, {"text": "It will be good if you mention the proportions/ Measurement s here. We loose interest when you ask to visit your website. Your recipes are the best ones. Good luck."}, {"text": "can you do a substitute for baking sheet"}, {"text": "How do the brownies become soft without baking soda or powder??"}, {"text": "Made them..... They were grand 🤠"}, {"text": "why do I look at her not the bowl?"}, {"text": "I&#39;ve made brownies using this recipe and they turned out perfect! My husband is addicted to them. Thank you for sharing Gemma☺"}, {"text": "Hi gemma, if u see this comment plz reply, can u make a brownie recipe with no cocoa porder plz?"}, {"text": "What if you used half of the ingredients? Do you have to bake it for 35-40mins?"}, {"text": "i just made these brownies and i think they are too dense and overly sweet."}, {"text": "smile less"}, {"text": "Am I the only one who ended up with a cakey brownie😭😭😭😭"}, {"text": "350F/180C for 30-40 minutes also when i use electric oven?<br />sorry for too much asking. Hehe. This is my first time to try to bake 😅 and im so excited to try this one! it looks so yummy 😍"}, {"text": "The best recipe so far for brownies"}, {"text": "Made these for the first time yesterday and they were great."}, {"text": "Hello Gemma, just made a batch today and they are incredible. I had a slight issue with the pan size, I just had two 7 x 7 pans though they came out great, however, if I can&#39;t get a 7x 11 pan is there any way I can pour equal amount of batter in my 2 pans? I just want a consistent outcome every time. Would really appreciate your reply."}, {"text": "I am sad that I don&#39;t live in  USA"}, {"text": "These look Devine omg"}, {"text": "First of all I would like to thank you for replying on my comment.Second I saw your hole video,and the way you made brownies it so yummy."}, {"text": "Gemma, what if I reduce amount of sugar for twice? like 92 g of brown sugar and 122 g of white sugar? Will it change the texture? I just don&#39;t like when it&#39;s too sweet."}, {"text": "Hi Gemma after long months.I &#39;m keeping in touch with you.I want to ask you.Can I put chocolate chip instead of dark chocolate."}, {"text": "Gemma they are the best ever brownies...my Boyz loved it...<br />Love you thanks for sharing 💕"}, {"text": "I am making half of the brownies. Do I need to reduce the temperature?"}, {"text": "Amazing recipe !! I added walnuts and some chocolate bits half way through baking.. but this one is delicious.. truly best ever brownie!"}, {"text": "&quot;i let these rest for around 2 hrs&quot;<br />why are u using oven mitts 😂😂 no hate tho i tried this recipe it tasted so good i do recommend trying these out cuz theyre worth it"}, {"text": "I’m making the brownies right now for a friend’s birthday and I hope that they turn out well c:"}, {"text": "Hi Gemma..I tried your recipe with all the correct measurements and followed each and every instructions..my brownie came out really gooey fudgy n sooo chocolaty ..I used Dutch processed dark cocoa so my browine is muchdarker  everything was good but I find it too sweet. Love all your recipes Gemma u r my inspiration..Thank you.."}, {"text": "Hey Gemma...you are too good and i really like your recipes! But please do mention the exact measurements of the ingredients. ☺️"}, {"text": "may i know the measurements of the ingredients?"}, {"text": "what kind of oven did you used? can i use electric oven?"}, {"text": "My oven usually bakes unevenly. Usually when i bake cookies, the right side of the cookie will burnt but the left side will stay uncooked. Do you know how to solve this? What will happen if i bake the brownie with this oven?? I&#39;m afraid that it will be overcooked at one side."}, {"text": "hi ...<br />What if the batter is thick??? Can we add lil bit of milk??"}, {"text": "which rack should be used for brownies in case of Microwave cum OTG? high rack or low rack? please suggest baking time and degree as well."}, {"text": "I always struggled making nice, rich, fudgy brownies. They would always come out burnt, cake-like, too thin, too think... Just never right. So, I thought I will give it one last go and if it doesn&#39;t work, I will never cook brownies ever again. I decided to trust you 100%, and just follow the recipe exactly like it is. I could not believe the result!!! The brownies were absolutely amazing!!! They came out flawless, I&#39;m so chuffed with this, thank you, Gemma! It is indeed the best brownie recipe. I know this for a fact, I tried like 100 different brownie recipes before I found yours :D"}, {"text": "I used xylitol instead of brown sugar because I&#39;m diabetic. Tasted great."}, {"text": "wow this recipe is super delicious. thank you for this. i have a query can i mix all the dry ingredients in a bowl and then ad all wet and bake these brownies? will the result be the same?"}, {"text": "Gemma can I bake this one in a microwave? I don&#39;t have an OTG :("}, {"text": "As soon as I think to myself that mixing in Milo will be ok as I don&#39;t have good cocoa powder, Gemma cuts me down with a blunt warning about how that is a big no-no!<br />Well, I guess its back to the drawing board...🤔"}, {"text": "exact measurement of this yummy brownies  pls....thanks"}, {"text": "I made this today. This aren&#39;t my first time baking brownies using this recipe, I&#39;ve made three times before and everyone loves it. The fact she give ingredients measurements in grams too, instead of just cups makes it easier for me to follow this recipe. One of the best cooking channel in YouTube for sure!!"}, {"text": "Hi Gemma, is it alright if I leave out white sugar? Will the texture be the same?"}, {"text": "👏👍👏👍👏👍👏👍😍😘"}, {"text": "Gonna make these this week. X"}, {"text": "I made them and the look great but I put a toothpick in and they are pretty gooey and that&#39;s after the 40 minutes. You said not to do more so I&#39;m not but just wondering if this is okay"}, {"text": "I dont have brown sugar can i use white sugar ?"}, {"text": "Could u add d quantities of each ingredient"}, {"text": "PEOPLE , I MADE THIS RECIPE AND ITS HORRIBLE. I FAILED THE FIRST TIME , I THOUGHT MEH WHATEVER I DID IT AGAIN AND IT WAS THE SAME OUTCOME! I do not recommend!"}, {"text": "Omg!! Me too...i love salted butter for baking😀"}, {"text": "I made this few months back and omg sooo good you guys.. sooo good.. you need to cut it to small pieces cz f  its rich chocolate flavor.. thank you thank you.. one of the best recipe so far."}, {"text": "Can i leave the chcolate"}, {"text": "Hi gemma!<br />My brownies seem to be little oily..  Can you tell me where did i go wrong?"}, {"text": "can it bake in microwave?"}, {"text": "Can coconut oil be used instead of vegetable oil?"}, {"text": "Can I make the brownie batter at night and baked it at the morning???"}, {"text": "love your channel. Definitely making choc brownies tonight. I&#39;m looking for a easy rusk recipe which I can make in different ways. thanx again for a great channel and awesome recipes"}, {"text": "Can you make them in a microwave? I checked you microwave brownies but I wanted them fudgy and not chewy."}, {"text": "can you please upload a short video on difference in baking in oven and steamed cake...and how to bake in a convection mode or in a microwave oven...what really is the difference...also please say what else can be substituted for brown sugar"}, {"text": "Gemma and people of Ireland .. if ye see this comment please upvote!! Gemma please recreate the Teatime Express Chocolate Layer Cake ❤️❤️❤️"}, {"text": "I will definetly try this recipe today!"}, {"text": "I absolutely adore all your recipes 😋 and I have also tried almost all your mug recipes. If you don&#39;t mind, I suggest to also add in melted chocolate along with the chunks to achieve a more chocolaty flavour and hit the pan on the counter very hardly when it&#39;s half cooked. I saw these tips from tasty and I also made the brownie form buzz feed tasty&#39;s recipes. Now I&#39;m not saying their recipe was better as I haven&#39;t tried yours yet ( but sure will next time ). Be sure to get some inspiration from other channels, it&#39;s nothing to be ashamed of. 😊"}, {"text": "Do we have to butter the tin?"}, {"text": "I&#39;m looking for a super dense chewy brownie. Don&#39;t like moist and fudgy ones as much. Anyone have a recipe?"}, {"text": "Tried this recipe. Truly the best ever brownies!"}, {"text": "Hello gemma! I definitely love this brownies and it&#39;s very tasty! 😊😊 I have a question, is it possible you can cook this brownies in a waffle maker? If so, how many minutes for this brownies to cook? Lots of love from PH! Xoxo"}, {"text": "Hey Gemma,you have an ardent follower here! I tried making these brownies following your egg substitute chart and I replaced the eggs with buttermilk and they turned out awesome! However, can I add baking powder and baking soda to obtain a little lighter texture for someone in the family?"}, {"text": "Thanks Gemma for this recipe <br />My coworkers, family &amp; friends loved this best ever brownies 😍"}, {"text": "these brownies came out perfect!!!"}, {"text": "I love how you always smile it makes my day even when I am sad and your recipes are so easy and tasty like if u agree"}, {"text": "Best brownie recipe ever ! Tried and tested !"}, {"text": "I made this now, I used dark cocoa powder, and I got the best ever dark chocolate brownies 😍😍😍 oh my God! The taste and texture is awesome!!! I felt that I’m floating in the clouds when I grabbed a bite😍😊😍(no kidding and I’m not exaggerating 😊😍)<br />Anyone who will try this recipe I guarantee that u’ll not regret it. Gonna make now a vanilla ice cream to put on top of my brownies, yum yum yum 😋 😋😋<br />Thanks for the recipe, Godbless<br />More power😇❤️"}, {"text": "First time making brownies from scratch and it came out delicious so gooey and chocolaty. This will definitely be my go to brownie recipe from now on. Thank you! Also I posted a pic of my finished product on your site. Looking forward to making more of your recipes!"}, {"text": "Just subscribed - great recipe!  Just one question - on your website it says 1 cup plus 2 tablespoons for both brown and white sugar, but the oz and grammes are different in each case?  Is there a typo?"}, {"text": "Tried and tested this evening. Easy to follow and turned out amazing. Thanks for sharing xx"}, {"text": "Are you Irish?"}, {"text": "yummy yummy 🌹👍"}, {"text": "so I made these and added coffee ... bruhhhh my boyfriend was in love with me all over again lol"}, {"text": "What are the measurements for ingredients 😅"}, {"text": "Hi Gemma! I love your recipes and often try them! I want to ask if I can bake these brownies in my microwave since I do not have an OTG."}, {"text": "I could watch you cook all day &lt;3"}, {"text": "If I were to reduce the amount of sugar in it and any other cake recipe, do I need to alter the other ingredients?"}, {"text": "I think you don&#39;t have to eat healthy snacks because that butter and sugar in the bowl already giving you a heart attack"}, {"text": "Gemma, I made your best ever brownies, and they are squidgy heaven! I wasn&#39;t sure I could make brownies, but your recipes are so easy to follow, I was able to. 👊 Thank you! Another best ever recipe...? hmmm... do you have a recipe for a fluffy Victoria sponge, or a marble cake? 👍😀🍰☕️🍪🍫💕"}, {"text": "I&#39;ll be using 13 x 9 inch pan, slightly bigger than yours. Should i reduce cooking time?"}, {"text": "Tried this and came out great. Love it.."}, {"text": "Is that really 4 teaspoon of vanilla?"}, {"text": "If we use white sugar so it will be round about 2 cups?"}, {"text": "Do you have a recipe for making your own baking chips such as butterscotch peppermint or peanut butter btw the brownies look amazing ❤❤"}, {"text": "If i use 2 bananas(equal to 4eggs),will the batter not thicken ? If it thickens, what can we add to make it of this consistency? Milk?"}, {"text": "Very nicely explained each and everything so clear that I am ready to make them"}, {"text": "I’m not really a fan of dark chocolate or cocoa , could I use unsweetened or sweetened cocoa powder instead?"}, {"text": "Absolutely  amazing recipe ! Tried it and it&#39;s a hit!"}, {"text": "Do you use dark or light brown sugar ?"}, {"text": "hi gemma! can we put this in the fridge? will the middle get hard if we put it in the fridge long enough?"}, {"text": "Gemma Stafford Thank you so much. I made this recipe a few days ago and the Brownies came out perfect!"}, {"text": "Hi I was wondering if someone could help me!<br /><br />Ive tried making this brownie twice, and both times they just end up being a cake with burnt edges...<br /><br />I feel like I followed the recipe exactly.....does anyone know what I&#39;m doing wrong, or what might be happening ?"}, {"text": "Can i make brownie cups? Would i need to adjust anything?"}, {"text": "I used this recipe today and the brownies were absolutely delicious! I will definitely be using this recipe every time!"}, {"text": "I love that you literally answered all of my questions in this video without me even asking them :P"}, {"text": "What about baking powder?"}, {"text": "Hey Gemma, can I replace the eggs with 1cup of buttermilk?"}, {"text": "If replace eggs what to use"}, {"text": "can you use light brown muscavo sugar thank you"}, {"text": "Used this recipe last week and people almost didn&#39;t believe me I made those brownies when they tried them, because I&#39;m awful in the kitchen."}, {"text": "Thank you soo much gemma.. I tried this recipe today and it came out very tasty and fudgy.. also i substituted flax seeds instead of eggs as you said and it worked very well.."}, {"text": "Hi gemma! How would you recommend the amount of ground coffee to add if I&#39;m going to make it into espresso brownie?"}, {"text": "i don&#39;t know how hard i try but i would never able to make these kinds of perfect brownies."}, {"text": "So it&#39;s Jame-ah not Game-ah ..."}, {"text": "Can we add walnuts? If so at what point and how much? Thanks."}, {"text": "Where are the ingredients ??"}, {"text": "Can u use plain flour as well?"}, {"text": "My coco powder turns black after baking. Wat to do?"}, {"text": "Has anybody ever tried adding instant coffee and/or espresso to brownies? I love coffee and chocolate together."}, {"text": "May I ask ingredients and the measurements"}, {"text": "Hi Gemma i&#39;m from brazil and I really wanna try this recipe and I have ALL the ingredients but the chopped chocolate, so can I omit it?"}, {"text": "ok,i made this recipe last friday....it was AMAZING!!! i baked them for 35 minutes,it was like lava cake,next time i will bake them for another 5 minutes..."}, {"text": "Facebook social"}, {"text": "Hi what is the difference between chocolate cake n brownies"}, {"text": "Guess someone&#39;s gonna make brownies today"}, {"text": "Hi Gemma.. Ingredients pls...tq"}, {"text": "I can&#39;t get the recipe from website 😥 .. can anyone help me with the recipes please"}, {"text": "I just made these today and they did not disappoint they were so good and rich and not overly sweet with all of the dark chocolate it really balanced out the sugar. I topped mine with a simple homemade cream cheese icing and I was in heaven. This was my first time making brownies from scratch and I&#39;ll never go back these were truly decadent."}, {"text": "I omitted the chocolate chunks (I didn&#39;t have any) &amp; they still turned out good."}, {"text": "is it okay if i use milk chocolate chips instead?"}, {"text": "Is there any substitute for the butter?"}, {"text": "Indeed the best brownie ever! Thank you Miss Gemma for sharing your amazing recipe with us. I have tried this recipe today and my family loved it. I&#39;ll make sure to bake another batch again tomorrow to share with my friends. More power to you and your channel. God bless! 💜"}, {"text": "plisd help"}, {"text": "wat is all purpose flour"}, {"text": "Can you use raw sugar instead of brown and white?"}, {"text": "Awesome looking Brownies Gemma! Can you tell me what the exact measurement is for the Cocoa? Is it half cup or 1 cup?"}, {"text": "What a GREAT VIDEO!!! An Irish lass, free snacks, AND the brownie recipe I&#39;ve been looking for. Thank you so much!"}, {"text": "Please reply with measurements? Thanks :)"}, {"text": "You sound like Celine Dion."}, {"text": "What is flavorless oil?"}, {"text": "these are literally best ever brownies!!<br />they came out sooo well!"}, {"text": "This recipe is amazing! I added chopped hazelnut and almonds and it was delicious! Thanks!"}, {"text": "i love these"}, {"text": "M a big fan of ur baking..<br />Love love love ❤❤"}, {"text": "these brownies taste so good. I am going to tell all my friends."}, {"text": "Hi I made a couple of substitusions and here are my results:<br />1. I used flax eggs instead of regular eggs and i had a little problem with mixing it but it turn out fine!<br />2. I replaced butter with a mix of coconut and vegetable oil: don&#39;t do that! the oil kept boiling in the oven and brownies had lots of little indents which didn&#39;t look too appealing<br />3. i used 1 cup of sugar instead of 2 and im happy i did cause i dont like a lot of sugar in my cake but that&#39;s just me<br />4. i used almond flakes instead of chocolate chips and it was yummy!<br />5. i actually doubled everything because my pan was twice the size of what gemma used but baking time was the same!<br /><br />next time im just gonna use butter but overall im pretty happy with them!!"}, {"text": "How about best ever crossaints"}, {"text": "Do you still stick to the 1 tsp of salt even if you use salted butter?"}, {"text": "I just made these brownies!! They didn’t come out as moist and gooey as your’s for some reason they came out more cakey but they’re very delicious!"}, {"text": "I could practically taste and feel the exquisite texture of these little bombs of flavour."}, {"text": "My brownie taste like a cake , should i reduce the flour?"}, {"text": "Hi Gemma!<br />Can I use glass tray instead of the tin... Will it work perfectly ? And do I need to vary the baking time or ingredients in that case ?"}, {"text": "You are amazingggg!"}, {"text": "Hey Gemma,i tried this recipe and these  literally are the Best Brownies ever!"}, {"text": "Hey Gemma, on your website the recipe says 1 cup for cocoa powder but in the brackets it says 4 oz  which is 1/2 cup, so is the cocoa quantity 1 cup or 1/2 cup?"}, {"text": "Glutton and wheat free dairy free .. recipes thankyou <br />Hey I’m coming to join you for a coffee ... 😂😂😂😂😘"}, {"text": "I totally love your recipes <br />💐"}, {"text": "They don’t have nature box we’re I live is there an alternative please"}, {"text": "Gemma buon giorno from Italy <br />You are so beautiful I try all your recipes wow so lovley <br />I’m going to try these brownies ... <br />yum 😋"}, {"text": "You&#39;re right, it is the best ever brownie. I just made it today. And it is the first time I&#39;ve ever made a brownie. And the chunks of the dark chocolate are the best and I&#39;m typing this while I&#39;m eating it. Thank you for the brownie recipe. Even my mom loved it."}, {"text": "Definitely making these!!"}, {"text": "I just made this brownies this morning. I cut down both sugar to 1,5 cup combined. It turned out fudgy, shiny, cracked on top, not too sweet, just the right kind of brownies I&#39;ve ever wanted, and was a beautiful satisfying brownies I&#39;ve ever made. My brownies recipe hunting was over, this one is definitely going to be my treasure recipe to pass on to my children. Thank you!"}, {"text": "I have 16*11 form..can i make these brownies with the same measurements???"}, {"text": "I made these last night and they were so good. Thank you for the recipe. Always looking for a great brownie recipe and this is definitely it."}, {"text": "Sadly, this recipe didn&#39;t work out for me. Too much cocoa powder, the brownie tasted kind of bitter. I love dark cocolate, but a brownie shouldn&#39;t be bitter. Won&#39;t make it again."}, {"text": "Being on a diet and see it&#39;s s bad thing.."}, {"text": "Hi gemma. I want to make this into 8x8 pans would this fit in two 8 inch pans?"}, {"text": "Gemma! These brownies were amazing, I crushed up some graham crackers and put some marshmallows on top and tossed my brownies under the broiler for a little after baking. They were so moist, and I served them up at one of my internship events and my fellow co-workers always compliment how great they were!."}, {"text": "made this,n if u on diet,don&#39;t ever make this brownies recipe..this is sooo good. my family crazy about this brownies. so thanks gemma."}, {"text": "Absolutely the BEST brownies ever, if not the best chocolate anything ever!! So easy to make as well! I cut down on the white sugar and they still turned out amazing."}, {"text": "Hi Gemma!! Can we add walnuts or pecans to these??"}, {"text": "Hi jemma! I tried these cookies and they&#39;re simply delicious! <br />Thanks for the wonderful recipe!<br />I wanted to know if I canake these brownies in smaller bathes?<br />And what would be the quantities like?<br />Coz this gave me a good 16 brownies"}, {"text": "2hrs rest time..ooh thats a tough one when you have brownie lover kids that digs into everything that comes out of the oven in seconds"}, {"text": "I made these twice now!! My fam loves them"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23Browniegasm\">#Browniegasm</a><a href=\"http://www.youtube.com/results?search_query=%23Goosebumps\">#Goosebumps</a>"}, {"text": "THANK YOU SO MUCH!! <br />THIS WAS AMAZING!<br />I failed on 2 brownie recipes before I tried this one. It is the best recipe ever! Thanks ones again. <br /><br />I love your channel and I&#39;m so happy that I found your channel. Keep it up :-) You deserve more Subscribers :-)"}, {"text": "i love ur recepies but can you add the measurements to the ingredients???"}, {"text": "Superb recipe.. Brownie tastes yum."}, {"text": "if i bake them in a silicone pan do you think they will stick?"}, {"text": "What are the measurements"}, {"text": "please write exact quantities in description box.."}, {"text": "will it be as good if i don&#39;t add dark chocolate chunks?what will happen?"}, {"text": "can we avoid butter?  if yes what can we use?"}, {"text": "Can I leave the chocolate chunks out?"}, {"text": "I just finished making this and let me say it was DELICIOUS 🤤 😋"}, {"text": "they stick on the paper"}, {"text": "I made your brownie recipe on a baking competition and I win. Thx gemma"}, {"text": "Can you cook these in a microwave??? Love your videos gemma i have been subscribed since 200,000 subscribers"}, {"text": "The quantity of ingredients is missing."}, {"text": "Nice!!!love you Gemma"}, {"text": "I&#39;m impressed!  Watched over 10 video&#39;s in the past 2 days, trying to get a great recipe.  This looks like the winner to me.  I really like the size of the brownies at the end."}, {"text": "The only oil I have is olive oil what could I do Jemma can I miss them out?🤔"}, {"text": "I want nature box in india"}, {"text": "Will it be ok to put lesser chocolate chunks and put some peanuts?"}, {"text": "When I kept my brownie inside the oven it was bubbling up...can u plz tell me what to do now I think it&#39;s not done properly plz help"}, {"text": "What about high altitudes"}, {"text": "Hey Gemma, how do you get those shiny crispy surface on the brownies?"}, {"text": "I wanted to know what brown sugar do you use"}, {"text": "Hii!!! Can you please tell the quantity of the ingredients pls??"}, {"text": "This with vanilla ice cream 😭👌🏽"}, {"text": "what are the quantities? so confusing"}, {"text": "I like baking chocolate brownies"}, {"text": "i love her Irish accent. I could listen to her talk all day long.."}, {"text": "Can I cook it in microwave?  How long do I need to set the time?"}, {"text": "Can I change the dark chocolate to milk chocolate? I don&#39;t like too much dark chocolate n dark cocoa"}, {"text": "Do i need coca powder?"}, {"text": "Your one of the best recipe <br />Awesome vedio again miss Gemma<br />Can we use condensed milk in it"}, {"text": "I am 13, and I am gonna make them tomorrow. (:"}, {"text": "I made those <br />They were very good 😍"}, {"text": "what you do when you don&#39;t have an oven? will microwave will have the same results?"}, {"text": "Best Brownies Ever!!!"}, {"text": "Hello Ms. Gemma! I tried out this recipe and love the taste of the brownies - I only have one question, I used a slightly smaller tin, but even after 40 minutes of baking, the batter still looked almost liquid (tried testing the batter with a pick and nothing got stuck on it, only liquid), so I extended the baking time and ended overbaking them, so they ended up with an almost caramelized top part (not with the lovely chocolaty bits as in the video). So my question is - is the batter supposed to be liquid-ish after 40 minutes and then settles down when left to rest later?"}, {"text": "Hi Ms. Gemma! May i ask if it is possible for your best ever brownie and cookie to combine and make a brookie? If yes. What size of pan for your recipe and bake time do you recommend? Thank you"}, {"text": "Thanks ? Just wanted to be confirmed by you. Thanks again."}, {"text": "Hi gemma.I saw your video again the way you made Brownies from outside the it was mind blowing and from inside chunky chocolate.Can I put chocolate chip instead of chocolate pieces."}, {"text": "Hi Gemma! What if I don&#39;t have brown sugar? Shall I double the quantity of white sugar?"}, {"text": "Can you still make these without the chunks of dark chocolate?"}, {"text": "Tried this.. And it turned out to be best brownie I ever tasted.. So fudgy and gooey. I am never buying brownies outside.."}, {"text": "HI Gemma what do you use instead of sugar for the diabetic in your recipes"}, {"text": "How many minutes would you recommend to bake these in the oven for, if I were to use a 13×9 pan?"}, {"text": "tried this yesterday and it turned out amazing! highly recommend this recipe"}, {"text": "I just saw TASTY&#39;s fudgy brownie video and I am very confused.<br />The recepy is the same<br />Who copied who?"}, {"text": "Why my brownies taste so bitter?"}, {"text": "Would it be alright if I used semisweet chocolate chips instead of bittersweet chocolate chunks?"}, {"text": "How long can you store the unbaked brownies?<br /><br />Refrigerator or freezer?"}, {"text": "ONE LONG ADVERT.... GREEDY BITCH. TAR AN FEATHER YE, LIKE.! RITE MATE...! BOUT YE."}, {"text": "can i just skip the brown sugar?"}, {"text": "Do u have to use coco powder"}, {"text": "omg I want it right now :((("}, {"text": "Mine didn&#39;t turn out gooey :( and the top had small holes instead of the crusty cracked top it should have had. Why do you think was this the case?"}, {"text": "Emma could you please say what the weights are when you bake as you talk many thanks"}, {"text": "Hey it looks great.<br />But can you give the absolute measurements of things that used?"}, {"text": "Can I swap out the butter for oil?"}, {"text": "My God those look amazing def gonna try and make em"}, {"text": "Is using cocoa powder better than the chocolate bar? How about brute cocoa powder?"}, {"text": "Hey gemma !!!! Loved the video . Just one querry ... how long should i bake it if i halve the recipe????"}, {"text": "Hello dear what should be the temp mad time details in a convection microwave"}, {"text": "Can I make this in my toaster oven?"}, {"text": "How many cups or tbsp? What’s the measurements?!"}, {"text": "Can we use ordinary chocolate instead of baking chocolate?"}, {"text": "WAIT 2 HOURS TO COOL DOWN?!?!?!"}, {"text": "Gemma I want to try it today with half of the recipe but the problem is I will bake it in electric oven with bread pan .Can you temp and timing for that?"}, {"text": "She doesn’t give us the measurements on purpose so that we are forced to go on her website 🙄"}, {"text": "Gemma! I need help! Whenever i bake brownies or blondies they turn out too greasy/oily. Tried baking then longer but still . Almost 3/4 of the bottom soaked with butter. I cant eat them. 😭😭 help"}, {"text": "If you don’t have bittersweet chocolate chunks can you use milk chocolate instead"}, {"text": "Hi Gemma. <br />Can you please upload a video of classic Victoria sponge cake please?"}, {"text": "Hi Gemma, if 7x11 is not available, could i use 9x13 baking pan? And baking temperature and timer duration still use the same one?"}, {"text": "What changes are required if we half the recipe? Can we cook them in a round pan?"}, {"text": "How do you tell the brownie is cooked? I burnt my brownies the last time"}, {"text": "Hi Gemma! Can i replace butter with margarine for this brownies?"}, {"text": "Why don&#39;t you give measurements of ingredients ?"}, {"text": "I tried your best ever cookies and they were amazingly!!! Totally trying this"}, {"text": "Definitely the best brownie recipe ever!! 😁😁😁"}, {"text": "You are the god recipe"}, {"text": "is that fan assisted oven?"}, {"text": "World&#39;s best brownies 😃"}, {"text": "I really dislike the in-video ad, where the person doing the video all of a sudden goes into a sales pitch in the middle of the video and ssays the video is &quot;sponsored.&quot; I find it irritating. There are already enough ads as it is."}, {"text": "Hi if you have any Keto backing recipes please share it with us . Thanks in advance"}, {"text": "I tried it today , they taste soo YUMMM  . My family  loved it . Thanks  Gemma 😊 &lt;3"}, {"text": "Nice measurements.... some flour...and the recepie is wehere..?"}, {"text": "Thanks"}, {"text": "I like your recipe but problem is, you’re not asking the measurements perfectly like how much sugar, how much chocolate, how many eggs. If my measurement and your measurement will not same then it’ll be horrible. Please mention measurement of each ingredients we’ll be helpful. Thanks"}, {"text": "Tried this recipe. It turned out amazing! Thank you for the recipe Gemma. 💜 These are definitely the best brownies ever! 😍😍😍"}, {"text": "Can i use duche cocoa in baking brownies?"}, {"text": "Im sad my brownies dont look like that😢"}, {"text": "WHAT ABOUT MEASUREMENTS!!!"}, {"text": "I made this during my mom and dad&#39;s anniversary. Thank you for this amazing brownie recipe. They loved it 😍💕"}, {"text": "I love your recipes"}, {"text": "I made them, just felt a little too bitter for me 😞"}, {"text": "Can I use sweetened cocoa? I cant find unsweetened ones"}, {"text": "they were delicious"}, {"text": "I don&#39;t like dark chocolate cocoa could you use milk chocolate cocoa"}, {"text": "Hi Gemma, the recepie is wonderful. However I faced an issue.. I first tried it with applesauce..But it did not bind at all. Then tried with flaxseed and it did not came out. I followed the measurements u gave on your website. Please help me with this. Thank you"}, {"text": "Would these Brownies be more fudgey or cakey?"}, {"text": "The snacks are only available in US or Canada, but you sound Irish"}, {"text": "Hey Gemma ! i am a huge fan &lt;3 I had a request that if you could teach us to make brownies in a microwave . Your recipes are superb &lt;3 All the best for the future."}, {"text": "THAT LOOKS SO GOOD GEMMA COOL"}, {"text": "They&#39;re baking in the oven right now but I&#39;m a bit worried because the oil seems to have risen to the top and is bubbling"}, {"text": "Gemma I followed the recipe to the T and they are the best brownies I have ever tasted Thank you for sharing the recipe🍀🍀"}, {"text": "Can i swirl some peanut butter on top of it? :D"}, {"text": "can i use aluminium foil in place of parchment paper? please help me out."}, {"text": "hey, i have a convection microwave oven... could you please guide me on the temperature? thanks"}, {"text": "I just made this brownie and it turned out really really good. And its so fudgy! Thank you so much for the recipe!"}, {"text": "Can we have <a href=\"http://naturebox.com/\">naturebox.com</a> service in India"}, {"text": "Can I use normal Lindt chocolate or is cooking chocolate better? Thank you."}, {"text": "Thanks for sharing it. I&#39;ll have to try it sometime. I was planning to surprise some students in the seminar I teach with brownies and this seems pretty simple as I do have many of the ingredients in my pantry."}, {"text": "how can I substitute eggs with condensed milk in this recipe? please reply."}, {"text": "Can u tell the timing for baking them in microwave"}, {"text": "My mouth is watering"}, {"text": "What can I use instead of eggs?"}, {"text": "Hi Gemma!<br />I would like to make the brownies one day in advance, should i leave them at room temperature or in the fridge?<br />Thank you and have a great day!"}, {"text": "Oh my goodness!!! These are actually the BEST EVER BROWNIES!!! I just tried this recipe for the first time and I just took a small chunk of the brownies and they taste AMAZING!!! This will always be my go to brownie recipe. It&#39;s quick, simple, and once again (just for good measure) TASTES AMAZING!!!"}, {"text": "I made these! They turned out so good! 😍"}, {"text": "Oh my goodness Gemma. I just mixed up these brownies and tested the batter and oh man is it good!  I can&#39;t wait for them to come out of the oven and cool! Once again you nailed it! Gemma,  you are the best Irish baking sister EVER!"}, {"text": "Hi ms. Gemma i want to try baking using your best ever brownie recipe. But i dont know if i need to open both top and bottom of the oven when baking. Thank you."}, {"text": "hello Gemma :).. can i bake this recipe with rice cooker? because i don&#39;t have my oven yet..."}, {"text": "What are the measurement? Thanks"}, {"text": "This video is just such a treat for the eye (I&#39;m sure it also is for the taste buds but I won&#39;t be able to try it bc I don&#39;t have an oven :/) and also this is my most favourite video of you coz I discovered your channel through this video"}, {"text": "melted botcher?"}, {"text": "Can I bake it in a round tin as that is all I have at the moment ?"}, {"text": "For how long can I keep these brownies?? I mean- what&#39;s their shelf-life?"}, {"text": "Thank you for your wisdom on folding😊 I beat my batter to death today😯 and they did come out a bit tough😂"}, {"text": "Made this in 13x9 glass pan and had to omit the oil cos i dont have that at  the moment and it still turns out amazing. I think this will be the only brownie recipe i will use from now on cos it&#39;s so easy and delicious."}, {"text": "No matter how much I try, the base gets burnt and the whole thing tastes of burnt stuff. Plz help."}, {"text": "Hi gemma may i ask u something? <br />How many ml of butter do u use and grams of sugar &amp;brown sugar, grams of chocolate powder too? I want to try baking but im not sure with my measurement😅"}, {"text": "bcoz I m dying to bake them"}, {"text": "plz tell about the ingredients ratio"}, {"text": "I made them they r lovely especially with chopped Cadbury Bourneville . I also made your cinnamon rolls. I love all your recipes"}, {"text": "Could you please do the maple danish pastry in coming days if possible ? amazing tips from your videos"}, {"text": "I made these today and just went to heaven 😍"}, {"text": "Wow! This is the best brownies ever! Thank you so much for sharing!"}, {"text": "You are a baking genius !!!<br />I love all of your recipes so have you earned a subscriber! !!!!!!!!"}, {"text": "Can you swap coco powder with nutella?"}, {"text": "How could possibly anyone dislike this vid<br />Its disrespecting brownies"}, {"text": "You splved my prob! I was just thinking of putting in hot choc like you read my mind!!!!!!!"}, {"text": "Hi Gemma<br />Could you please do a video on how to make maccarrons. Thanks"}, {"text": "hi gemma! do you think i could use cake flour instead of all purpose flour for this recipe? 😊😊"}, {"text": "Hi Gemma. I enjoy very much watching your videos but let me tell you, I am not a good backer!!! But I am very exiting to try this recipe!!! My question is, can I use just granulated sugar?! Because I don’t like the brown one. Thanks 😍"}, {"text": "Why do you ruin you recipes by doing the ads in your videos"}, {"text": "Hie Gemma,  your brownie looks absolutely amazing! Unfortunately I&#39;m vegan :( I am trying to make a vegan brownie and I was wondering if I can replace the butter with margarine? Or would you recommend almond/soy butter?"}, {"text": "You say best ever, and I was a bit skeptical because all of the brownie recipes that I&#39;ve tried have turned out really sweet, and really grainy......<br />But I decided to try your recipe and I DO NOT REGRET ANYTHING!!!!! They have the perfect amount of sugar, and chocolate and are lovely and chewy. Bye bye box mix!!!"}, {"text": "THIS BROWNIE TURNED VERY SUGARY ANY IDEAS ON WHAT I CAN DO?"}, {"text": "I&#39;m trying your Irish Soda Bread as we speak.  Will let you know what happens.  Hope its as good as we had in Dublin."}, {"text": "LOVE LOVE LOVE this recipe!!"}, {"text": "This recipe turned out perfect! Absolutely the best ever brownies.. my family loved them. Thanks for the great recipe Gemma!"}, {"text": "Thanks for the brown sugar recipe! :) <br />But do i use the dark brown sugar or the light brown sugar for this brownie recipe? Thank you"}, {"text": "Did anyone actually make this? 9oz chocolate to 1 cup sugar?"}, {"text": "If i don have dark choclate can i use milk choclate?"}, {"text": "Can u plz tell me substitute for 184 gm brown sugar used in this recipe??how much white sugar can i use instead of brown sugar?"}, {"text": "Help :( I tried making this, my brownies are currently in the oven but for some reason when I added the flour and cocoa powered the mixture became really stodgy and not flowy like yours... what could I have done wrong?  Thanks!"}, {"text": "After trying so many brownie recipes to find the best one , yours was truly the best ever brownie I ever made ! Love from Pakistan 🇵🇰"}, {"text": "Can I replace butter with vegetable oil or MCT coconut oil"}, {"text": "I am Reem , and I want browines mix please"}, {"text": "Can the flavourless oil be coconut oil??"}, {"text": "Hey Gemma ! ☺ <br />I tried out this recipe last night but i didn&#39;t know the exact amount of the ingredients so it was kinda hard 😁 could you please tell me, where I can find the exact amount? <br />thaank you ❤"}, {"text": "I made the brownies using this recipe and cooked for 40 mins but they were runny when I cut into them 😓"}, {"text": "I tried doing this yesterday and it ended up really delicious! It was my first time baking! Thanks for this wonderful recipe."}, {"text": "I made this and it was literally, literally the best brownies I&#39;ve ever had❤️❤️ thank you for this"}, {"text": "When you can master the flour trick of not over mixing and most importantly not adding too much then you are good to go!!!!! <br />P.s. I LOVE BAKING !!!!!!!!"}, {"text": "You look like a little bit. Tom cruise."}, {"text": "Chocolates are very costly in our country. Could you please give the recipe of homemade chocolate. Thank you. Best of luck."}, {"text": "<a href=\"https://www.youtube.com/watch?v=Ti2pA5JgrMI\">https://www.youtube.com/watch?v=Ti2pA5JgrMI</a>"}, {"text": "dear gemma. thank you a million for sharing this video and recipe. its my first time baking brownies and i decided to try you best ever brownie recipe... the result is every bit that i had hoped for in my brownie.. crispy on the top, soft and chocolaty, fudgy on the centre, chocolate chunks melting here and there ... followed your recipe and instructions to the T. it tastes amazing. you were right! not too sweet.. not too bitter. just the right note all the way. you are a genius ! thank you so so much. i shared your recipes to my friends n family.. now we have a new favorite go-to recipe. this is indeed the best ever brownies recipe!"}, {"text": "dang these brownies are the best ever"}, {"text": "I tried this yesterday. And It was 😍😍😍😍😍 I love it superrr."}, {"text": "Measurements?!"}, {"text": "This is TRUUULLY THE BEST EVER BROWNIES RECIPE😍😍😍😍<br />Tried it and taste it 😋"}, {"text": "This would be lovely served with vanilla ice cream."}, {"text": "Where is the recipe ?"}, {"text": "People have the right to dislike the video whether because of the commercial she did at the start of the video or because the recipe is not to what they like. That is their right. But women can’t see this fact especially when chocolate gets involved in the matter!"}, {"text": "Oh my god!! Home made ice cream and brownie ice cream sandwiches"}, {"text": "How much of the ingredients"}, {"text": "Made these with my niece and nephew...they really enjoyed learning how to bake. They loved the finished product too! Although I was left with their mess to clean up! Lol<br />It was really easy to follow and they tasted great! Recommend it 1000%!! It was my first time making brownies that weren’t from a ready made mix bag. Will never need that again! Freshly baked always! Thanks Gemma!"}, {"text": "Hi Gemma I was going to make these brownies but I was wondering if they will still be delicious without adding chunks of chocolate 🍫 btw love your channel"}, {"text": "Can I make this in microwave?"}, {"text": "Gemma what brand of butter that you usually use ?"}, {"text": "4 eggs in the recipe.<br />According to the chart 1 Egg = 4 TBSP <br />THAT MEANS, to replace 4 eggs in the recipe we need to put 16 TBSP of yogurt ?????"}, {"text": "You copy tasty"}, {"text": "Gemma can you make a video on 4 boxed brownies vs. my own brownie recipe! I would love to see that"}, {"text": "Just made this. I found I had to add more liquid at the end, about 3 tb of water. Soooo delicious though! I will never buy boxed brownies again!"}, {"text": "Where are the measurements"}, {"text": "My favorite baking channel.:)"}, {"text": "here using melted or room temperature butter...will it make any difference?"}, {"text": "I made it yesterday.. love it ... It&#39;s so good n deliciously yummy.. full it got finished in a day... Thanks Gemma..<br />Will be making it many more times.."}, {"text": "yum"}, {"text": "I have made this and it is indeed the best brownies ever like I sworn by it. Thank you so much Gemma!"}, {"text": "Is dark cacao powder same as dark cocoa powder? Can i use dark cacao powder?"}, {"text": "&quot;because that&#39;s my job&quot;"}, {"text": "Hi!<br />How long do the brownies stay good for at RT?<br />Or do they have to be refrigerated?"}, {"text": "Just made these and can’t stay away from them! They definitely are the best ever! 🤤"}, {"text": "please be my mom<br />I love your desserts!"}, {"text": "hi gemma, I have noticed in your brownie recipe .you did not include  the baking powder or bicarb soda. please , can you explain the reason ? thanks ."}, {"text": "hello gemma, I love your show and admire your beautiful attitude of your presentation and cooking . brilliant job."}, {"text": "I bet your mom&#39;s taste good"}, {"text": "Hi! i was wondering if i can add a little bit of coffee in this recipe if I don&#39;t have dark bittersweet chocolate. Thanks! Excited to try this one"}, {"text": "Wow! Thanks for the great fudgy brownie recipe! :)"}, {"text": "Will these nature box things be free in Dubai (uae)????"}, {"text": "i can use all whole wheat flour? or do I need to do like half AP, half whole wheat?"}, {"text": "What dos diy mean"}, {"text": "Gemma, how is it that these brownies have neither baking powder nor baking soda?"}, {"text": "Mmm, these brownies were delicious! So fudgy and rich, I&#39;ll definitely have to make this recipe again! Thanks so much for the awesome recipe, Gemma, you&#39;re the best!"}, {"text": "I smellucinated whilst watching this. Like, I could actually SMELL the chocolatey decadence as you were making them. They look amazing!! 😋"}, {"text": "Nice video, I love the way you made those brownies.<br />I just have one small question about the recipe:<br />At which moment should you add your Cannabis?"}, {"text": "I agree best brownies ever"}, {"text": "Hi Gemma,I tried your recipe the best ever brownies and my   whole house is smelling great with the aroma of these brownies ,I just reduced the amount of white sugar in it as I used sweetened chocolate and they tasted out of the world thanks for recipe 👍"}, {"text": "Make fruit tarts!"}, {"text": "hey!!!!....how can i divide the recipe into half and do i need to decrease the oven temp and time if the recipe is decreased to half ?"}, {"text": "What can substitute eggs other than Bananas? I hate them."}, {"text": "Speak slow, smile more.... :)"}, {"text": "Gemma you are the best I love all your recipe and I am starting my own bakery bisnes and I am soo happy to learn it from you..  May I know how long this beautiful brownies will last?  Thank you 😊"}, {"text": "Can you please do a video of nogaut recipe and its variations. Thanks"}, {"text": "who wants Gemma to make DIY wendy&#39;s Frosty  Reply and like my comment!"}, {"text": "This is the best ever brownie recipe indeed! I made a big batch  this weekend for some of my boyfriend&#39;s relatives and friends and all of them agreed that these where the best brownies they ever had. I added chopped walnuts and served it warm with a scoop of vanilla- caramel ice cream. Even room temperature they&#39;re great. Thanks for the recipe, greetings from Spain! 💕"}, {"text": "Hi Gemma! Chocolate with 50% percentage cacao is good to use ?  184g of brown sugar + 244g white sugar it won&#39;t come out to sweet?"}, {"text": "I love hot brownies and top it with vanilla ice cream oh my goddd 😋"}, {"text": "can I use Cadbury dairy milk chocolate?"}, {"text": "I just made these they are the best brownies I have ever had!!! Thank you! ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️"}, {"text": "Hi Gemma,<br />I made this recipe and it was absolutely delicious, you weren’t lying when you said best ever!! However for some reason the middle didn’t cook? I used an 8x8 inch pan but the middle was still liquidy? Do you know how i could fix this? Thanks:)"}, {"text": "Baking isn&#39;t my moms forte so whenever I am baking, I go to you and your videos for guidence. Your are my mentor when it comes to baking and I can&#39;t imagine baking with out you guiding me along a recipe."}, {"text": "Gemma, do you mind if I ask you something? How do you manage to eat all these delicious sugar loaded desserts and not put on any weight?"}, {"text": "You&#39;re an amazing baker and brilliant teacher...i just wanna know why you didnt add baking powder?"}, {"text": "Can u write down how much of the ingredients you add in"}, {"text": "These look so yummy!!!!! 💓💓💓💓💓💓💓💓😍😍😍😍😍😍🍫🍫🍫🍫🍫🍫🍫🍫🍫🍫🍫🍫"}, {"text": "Tried these and they were very dry do you know why?"}, {"text": "yes, yes, yes!! omigosh!!"}, {"text": "Are u irish I am"}, {"text": "Hi Gemma ...can u give me the written recipe of ur brownies??cus im.pLanning to try it and maybe sell..😊 thankyOu somuch"}, {"text": "OMG these seriously are the best brownies I HAVE EVER HAD"}, {"text": "I never believe to these recipe videos because the outcome is never close to the video. However, I prepared this recipe yesterday and it was really good. The brownie wasn’t cakey at all. It was wonderful. You should really give it a chance."}, {"text": "Using salted butter and salt??"}, {"text": "Can you make this by mixing done cake with chocolate chip?"}, {"text": "BEST EVER IS RIGHT! So chewy..."}, {"text": "hello, can i use margarine instead of butter.Thank you"}, {"text": "can you show a French toast recipe because I love French toast I would like to make it thank you"}, {"text": "I tried The Frugal Chef&#39;s Brownie recipe and they did not turn out well at all! I cannot wait to try yours out on the weekend!"}, {"text": "Lol I love her expressions at the brownies more than the recipe 😂"}, {"text": "where to get the recipe?"}, {"text": "no baking powder?"}, {"text": "These were excellent! I couldn&#39;t stop eating them :)"}, {"text": "CANT YOU SAY HOW MANY GRAMS OF EACH INGREDIENT PRECISELY????.. I FOLLOWED YOUR INSTRUCTIONS AND IT WAS A DISASTER... WASTED MY TIME AND MY MONEY... 8+MINUTES OF BLABBERING.. STUPID VIDEO AND RECIPE.."}, {"text": "Just by looking at the video I can tell that they are fudgy and gooey. Just what I love in a brownie. I might make this if I get the chance"}, {"text": "I made this awesome recipe and my family love it very much.<br />Thanks a lot from Indonesia, dear Gemma."}, {"text": "Lovely Gemma! I just tried this recipe last night and added some reese&#39;s peanut butter chips and now it&#39;s almost half-way finished by my kids and myself, of course! Thanks so much for the awesome recipe!!!  I&#39;m baking them again for my giveaway to my friends on Chinese New Year."}, {"text": "Can you add walnuts to this recipe?"}, {"text": "Egg substitute??<br />1cup yoghurt (240 gm) ?<br />Is this correct ??<br />And where do we include them in the recipe??"}, {"text": "I just love u"}, {"text": "Hello Gemma! I am very happy to see your lovely recipes especially this best-ever brownies. I have already tried this recipe many times and my friends just love this. Thanks for sharing your recipes. EXCELLENT!"}, {"text": "I followed the directions exactly as written, and I must say these are litterally THE BEST brownies that I have ever eaten."}, {"text": "you let it sit in the same tin that came out of the oven for another 2 hours even if the tin is hot ?"}, {"text": "OMG! I will do it now...what is better? cocoa powder or melted chocolate?"}, {"text": "Using flax seeds instead of egg made the mix immiscible"}, {"text": "Hi Gemma Thanks for this awesome recipe! I just had mine out from the oven, cant wait to devour them 😅"}, {"text": "Can you write the ingredients and measurements into the video description so we can watch and bake the same time as you"}, {"text": "Hello Gemma, Can I use Oven toaster?"}, {"text": "Hi Gemma, I used your recipe and it was a hit :) question tho, I am playing with the idea of using this recipe but adding Kahlua in it. How should I incorporate that in the batter without messing up the consistency of the brownie? Let me know, I would greatly appreciate it! Thank you :)"}, {"text": "You remind me of my welsh french teacher. Thank god I switched."}, {"text": "Should I reduce the bake time if I am halving the recipe???"}, {"text": "Can I use buttermilk instead of egg"}, {"text": "Do u think I could use cacoa powder ???"}, {"text": "Hi Gemma! My brownies were not fully baked in the middle while it was crisp on the outer edges! And it was too crumbly..I was not able to cut it properly. please help! although it tastes super yummy!"}, {"text": "can any one tell me why i use a light brown cocoa powder but after cooking turns coal black?,no sugar powder"}, {"text": "I did these today and they turned out SO DELICIOUS. So glad you put the measurements in grams in your website it made the process much easier!"}, {"text": "Do something with Nutella"}, {"text": "Gemma..just a quick question..what tempertaure should i put my brownies in the convection microwave? And for how much time? As you experimented cake in a microwave you must be knowing how less time it takes..so i need a suggestion for baking brownies at perfect texture. Revert Soon! Love❤️"}, {"text": "😍😍😍😍😍😍😍"}, {"text": "What&#39;s the measurements for ingredients"}, {"text": "hi gemma ...I tried this brownie ...it was really good ....I used margarine instead of butter because it is less expensive ...these are melt in ur mouth brownies. I have definitely replaced my old recipe wit this one ...thank you"}, {"text": "Starts @ <a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=1m45s\">1:45</a>"}, {"text": "These are fucking delicious"}, {"text": "Can we use ghee instead of butter?<br />Can we check brownies with tooth pick to know it&#39;s fully baked or not??"}, {"text": "Would have been nice if she included the AMOUNT of each ingredient to use.   To say that she uses brown sugar, etc, and not say how much to use makes her recipe kind of useless."}, {"text": "You don&#39;t have quantaties?"}, {"text": "Hi! Gemma<br />Your recipe it’s amazing!!!<br />It’s a first time baking brownies.<br />I followed your recipe but reduced a bit of sugar.<br />OMG  I got a lot of compliments, all my friends love it! Thank you so much."}, {"text": "MM! BROWNIES!"}, {"text": "I tried so many recipes before about brownies but now i stick to this recipe. What i like about this recipe you only need cocoa as base for brownies but still its so rich and you have the option of not to spend much on chocolates especially if you were just starting a small business as what  im doing right now."}, {"text": "Why no exact measurements"}, {"text": "can i cook this through steamer?"}, {"text": "Me and my sisters are gonna have a bake off competition on Xmas eve and I’m gonna be making Xmas reindeer brownies so this recipes is a definite for me 👍 instead of adding the chopped up chocolate could I replace that with chopped walnuts"}, {"text": "Hi gemma i luv u ur all recipe can u plz make sizzling brownies 🙇‍♀️<br />Thanks"}, {"text": "Would adding nut change the end product?"}, {"text": "Thanku so much! Ur the best ur recipes are the easiest♥"}, {"text": "Hi Gemma, i would like to make this brownies as a gift, mixing the dry ingredients in a jar with all the chocolate chips etc.. how would you suggest that I pack it as you need to mix the sugars to the melted butter. thanks"}, {"text": "Hi gemma what is the kind of oil u added ?"}, {"text": "Can i use margarine instead of butter,  on any of these recipes??"}, {"text": "Skip the sales pitch and go straight to the recipe at appx <a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=1m50s\">1:50</a>"}, {"text": "<a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=7m24s\">7:24</a>🤣🤣🤣🤣🤣"}, {"text": "i only have 8 by 8 inch pan how can i adjust the baking temperature"}, {"text": "<a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=4m11s\">4:11</a> i really don&#39;t know why i feel the way you say &quot;don&#39;t do it&quot;  to be cute. Like i have seen just that part about 50 times..."}, {"text": "may I reduce the sugar? since I&#39;m not gonna be using unsweetened cocoa powder."}, {"text": "You make the Best videos!"}, {"text": "Just made these, Gemma, and they&#39;re fantastic!I never want to go back to box mixes again!"}, {"text": "I made this few days ago. It&#39;s so lovely. I LOVE this recipe. It&#39;s best !!! Thank you so much Gemma. I love your channel. 😘"}, {"text": "<a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=1m47s\">1:47</a> video starts with instructions on the brownies"}, {"text": "The least that you could have done is mentioned the quantities for the ingredients used for the recipes rather than focussing on what alternatives could be used."}, {"text": "Gamma, I don&#39;t usually comment but I made this recipe but also added roasted chopped almonds, they came out DELICIOUS. Thank you so much for sharing your recipes and I will continue to look forward to your Best Ever recipes!!"}, {"text": "what if your eggs have two yolks? does that count as 2 eggs or still 1 egg? this happen to me often"}, {"text": "Hi Gemma, I love your videos.<br />I have a question. Why didnt you use melted chocolate like in your other fudgy brownie recipes? What are the differences? both look super tasty. I dont know wich one to make.<br />Greeting from Mexico"}, {"text": "hope i can make it too its so yummy thanks for sharing"}, {"text": "Hi Gemma I made these brownies today and they turnout great.. My dad and little brother loved it.. usually they dont give much compliment on my baking but this time they really praised me so thanks a lot.. now i have to try again but without eggs.. 😊"}, {"text": "If I use white sugar instead of brown, do I still need to add MORE white sugar like you did?"}, {"text": "Eggless version would be very much appreciated."}, {"text": "I made this!! It&#39;s a success! However, it tastes a bit too sweet to my liking and I will make sure to use real chocolate on my next attempt instead of compound chocolate. Can I omit white sugar and use just brown sugar? I will modify the amount of sugar next time. Thank you for this wonderful recipe!"}, {"text": "Should we ever tap the mix when it&#39;s in the tray???"}, {"text": "Just tried making the cookies. It turned out so delicious. Thank you!"}, {"text": "I usually don&#39;t like ads, but those snacks sound so good!😍"}, {"text": "How can i turn all purpose flour to cake flour? Is it possible?"}, {"text": "Hey Gemma, could I use milk chocolate chunks instead of dark chocolate chunks just because I&#39;m not a huge fan of dark chocolate :)"}, {"text": "Can I use milk chocolate instead of dark chocolate"}, {"text": "hello! I would like to know how many minutes will it take if I use a 9x13 pan? thanks!"}, {"text": "Do the chocolate chunks stay soft when the brownies get cooled or they get hard ???"}, {"text": "Is there a way to replace all purpose flour with cake flour?"}, {"text": "I&#39;ve been looking for a brownie recipe and you never disappoint but I was wondering do we have to have chocolate"}, {"text": "I really love your brownies... Love both of you Cupcakejemma and Gemma Stanford for sharing incredible recipes. i done a little bit of twist on your brownies recipe to added good texture in our weather and keep it more moist and stable for longer period of time. LOVE LOVE and thanks again for sharing your videos....."}, {"text": "all your videos and recipes are all superb.another thumbs up for this.I love gemma stafford"}, {"text": "These look lovely, plz share a eggless recipe"}, {"text": "Awww I was actually thinking of using hot chocolate powder 😂😂"}, {"text": "can i used vegetable oil instead butter ?"}, {"text": "Just made these for my family and they loooooooved it! For those who don&#39;t like overly sweet brownies, I advise you to cut down on the white sugar. THANK YOU GEMMA FOR THIS AMAZING RECIPE 😍❤"}, {"text": "Hi..<br />Tonight I made this brownie and the recipe says no baking powder or soda so I was little worried but the outcome has made me spellbound..the texture the taste is too good..thank you for the recipe..I substitute eggs with buttermilk as suggest by you."}, {"text": "Can you use self raising flour"}, {"text": "Thank u much it turns out to be awsum"}, {"text": "hi..<br />would you please give me a recpie to make chocolate from cocoa..<br />I need it desperately 😣"}, {"text": "I cannot see the recipe on your web page or anywhere ?"}, {"text": "Hello I have tried this recipe once more and I loved it and now when I tried to do it again the measurements are not on your website anymore how can I get them?"}, {"text": "Hey Gemma. I baked this recipe. It tastes great. But at the same temperature and given time, it has sort of burnt at the base and is little wet inside. Where do you think I have gone wrong."}, {"text": "I love your recipes but can you please specify measurements also....I am learning to bake and not sure about the measurements..TIA"}, {"text": "Hi can use the small chocolate chips ??"}, {"text": "Hi can use the small chocolate chips ??"}, {"text": "Another amazing video Gemma! :) Do you have a best ever chocolate chip cookie recipe?"}, {"text": "I love that recipe &lt;3"}, {"text": "Witch kind of chocolate do you use milk or dark ?"}, {"text": "Hi Gemma!! I have been following your videos for long but this is my first time commenting. I tried these brownies both with and without egg. The egg one turned out to be amazing but the one without egg (I substituted it with flax egg) didn&#39;t hold its shape. Can you please point out what are the possible mistakes I could have done?"}, {"text": "How much of both sugars you use you never said how much ingredients you use?"}, {"text": "Fudgy!"}, {"text": "I want to be a pastry chef<br />as <a href=\"http://well.it/\">well.It</a> looks so much fun<br />and also that I love these kinds<br />of food.And I love your videos,<br />they&#39;re very helpful and entertaining :)"}, {"text": "Hello Ms. Gemma 😊 Can you make  no bake brownies. Thank you! ☺ my name is artish from philippines. 😁"}, {"text": "What a doll she is."}, {"text": "Can  use margarine instead of butter"}, {"text": "Best brownies.."}, {"text": "ohh well thanks"}, {"text": "i make this yummyy love this"}, {"text": "That accent kills it.. I can&#39;t understand most of things she&#39;s saying...  And people make fun of Indians and Pakistanis"}, {"text": "I like that her ingredients are always basic and  pantry available ingredients"}, {"text": "I’m making this today! The best part is that it’s all in one bowl. All the brownie recipes I have used in the past make you melt the butter then add in the cocoa powder then do the dry ingredients. SO. ANNOYING. That’s why this recipes is AMAZING!!!!🤩"}, {"text": "I made brownies out from the box but I applied Gemma’s tip by not whisking the batter and it came out really fudgy! Tnx Gemma"}, {"text": "where are the mesure ments??????????????!????"}, {"text": "How can there be haters for brownies"}, {"text": "Thank you for sharing this recipe with us. At my first attempt the brownies were perfect. At secon they weren&#39;t so moist because I didn&#39;t added the oil, so oil matters. And I used crane sugar instead of brown sugar, so I needed to add more than 184g, ca. around 200-210g. My next step is the croissant."}, {"text": "Melted butter.... how much?<br />Brwon sugar... how much?<br /><br />Useless video!"}, {"text": "there are no measuremens"}, {"text": "I just made them today and everyone loved it. but lot of them said it was too sweet. other than that it was okay. I think next time I will reduce the white sugar maybe. I loved it. Thank you"}, {"text": "The dislikes probably have chocolate allergy. Poor them."}, {"text": "Hi gemma just want to ask if the brownies are too sweet or not? If so,can i reduce the sugar? Thanks in advance...."}, {"text": "Maan 2 hours to rest.  I cannot wait 😭"}, {"text": "watched this recipe yesterday and made the brownies straight away with half the quantity and half the time, best ever brownies I&#39;ve ever had. really fudgy and moist. wish I could make the trifle with these from your recipe but I&#39;m lacking ingredients :&#39;("}, {"text": "Hi Gemma, I was wondering if the amount of sugar has any effect on the outcome of the brownies apart from taste? Would it have any effect on the texture of the brownies (or other baked goods) if I altered the amount? <br /><br />Thanks, Sam"}, {"text": "Can I substitute other chocoleit ?"}, {"text": "Omg I made these last night...hands down 🤗🤗Best ever recipe!! Thank you for this recipe 😘💜!!"}, {"text": "Wooo came out nice but abit too sweet for me. Next time i will cut down the sugar. I used unsalted  butter and didn&#39;t have vanilla essence at home. Thank you."}, {"text": "Hi Gemma, I will try ur recipe tomorrow but I don’t want to use sugar because I have a diabetes... what would I put instead of sugar? Pls help, thanks."}, {"text": "I need to do these dairy free,I hardly dare ask if they would be any good using dairy free Marge!"}, {"text": "Can I bake it in a loaf tin"}, {"text": "Hey,<br />Since you mentioned that you use salted butter in your recipes, then why do you add the extra salt?"}, {"text": "I really want to try this but I hate dark chocolate and don&#39;t like brownies that are too bitter."}, {"text": "I will try this recipe, I&#39;m kinda disapointed on Laura vitale Nutella brownies the sugar the Nutella....."}, {"text": "What kind of chocolate chips did you use?"}, {"text": "Love it.. but you haven&#39;t added any baking powder or soda..why? Is it not needed?   Without it, will it be soft?"}, {"text": "Haha I did dat mistake one time except coco i added hot chocolate powder and dat was turn disaster"}, {"text": "Hi Gemma! I only have an 8” square baking pan. Please tell me how many minutes shall i bake my brownies if i use that. Would really appreciate your answer. Thank you, dear!"}, {"text": "what are the measurements?"}, {"text": "I LOVE FUDGY BROWNIES"}, {"text": "Wow these brownies turned out really well <br />It&#39;s a little bit hard but not really hard but I can say simple and I took about an hour or less <br />This was a nice vedio <br />Thanks for suck recepie😊"}, {"text": "Wow...i love this yummy fudge brownie ...looks awesome dear"}, {"text": "Hardcore brownies xD I will say it: it has to be fudgy, otherwise it&#39;s a chocolate cake!<br />Brilliant recipe and I love your Irish accent :)"}, {"text": "They turned out amazing 😍 I skipped the extra 2 tbsp of both brown and white sugar and instead used chopped up milk chocolate in the end rather than dark chocolate.  Can&#39;t wait to make them again!"}, {"text": "You did not said how many is the ingredients"}, {"text": "Hi Gemma! At last, i was able to bake my version of your recipe best-ever brownies....it&#39;s really so good, so yummy!! Thank you!"}, {"text": "These were the best. Wouldn&#39;t have to settle for store bought ones anymore. :)"}, {"text": "I Love Brownies! They are a fun part of baking.  Gemma,  Yours ones really seem to be Best-Ever!  I was wondering if you could make up a Best-Ever Chinese Platter. I hope you take it into account."}, {"text": "I made these for the first time last night and took them to a church fellowship and they were ALL GONE within 30 minutes of being there! Mind you, there was a lot of store-bought baked goodies. My husband also really loved them. He said &quot;he went to heaven for a minute&quot; while eating a piece :D Truly, a great brownie recipe!! Thanks again Gemma!! &lt;3 &lt;3"}, {"text": "i&#39;ve tried it and the whole family love it so much! Thank you for the recipe! :)"}, {"text": "I just made these and they are the absolute best! Thank you, Gemma!"}, {"text": "I tried this today, followed every instruction. My brownies looks good but the 1/2 cup dark pure cocoa powder seems too much ,plus the dark chocolate bits. 😞 The bitter chocolatey taste is so strong - that a single bite is enough.  I think I would cut my cocoa powder into half or even make it 1/4 cp. Nice recipe though."}, {"text": "Should I make these brownies for my birthday tomorrow? No. Am I definitely absolutely going to make these brownies for my birthday tomorrow and swirl in some dulce de leche, too? Absolutely."}, {"text": "how much of everything do we put in?"}, {"text": "I have never seen her this happy/excited in a video, it&#39;s infectious! :D"}, {"text": "I want to see your recipe for best ever lemon bars!"}, {"text": "Can u make these a day ahead????"}, {"text": "Can this be baked in small cups to make individual dessert?"}, {"text": "Hello, I have a vanilla pod and want to use the beans/seeds inside the pod in a couple of days. How can I use the the beans instead of the vanilla extract for making your best ever brownies?"}, {"text": "Hi !! Please share proportions for each ingredients....As I m new to baking... Brownie looked really delicious... Thanks"}, {"text": "I want to start a baking business and I&#39;m so proud that I&#39;m learning it from you. You have amazing recipies. ❤❤❤"}, {"text": "I made this last night and its amazing! Fudgy it is! Thanks gemma!"}, {"text": "Can i use self raising flour?"}, {"text": "Hi Gemma!<br />I&#39;m going to try this recipe. It looks amazing❤<br />I will be baking this in the convection mode of my microwave. What should be my temperature settings and for how long should I bake them?<br />It&#39;d be great you could help.<br />Thanks much!"}, {"text": "Some flour? Some cocoa powder? Shes a baker and mentions no weights of ingredients? Clueless"}, {"text": "what are the measurements"}, {"text": "I am mad about brownies and Americans are my favourite"}, {"text": "Gemma u r just amazing"}, {"text": "can u please tell the measurements also ..."}, {"text": "Hi, Gemma! This is really the best ever brownie. Thank you for the recipe."}, {"text": "Your tin is dirty give it a wash"}, {"text": "Gemma, can you make me a best ever eggless coffee cake? I don&#39;t need it iced. Just a tea time coffee cake."}, {"text": "fabulous recipe Gemma"}, {"text": "This is exactly how I Love my Brownies, that rich dark gooey middle. This will be my go to recipe."}, {"text": "Please get them to deliver to Ireland"}, {"text": "Salted it unsalted butter???"}, {"text": "OMG Gemma, these came out as perfect! Thank you so much for this amazinggg recipe"}, {"text": "I am making it wowowwowowo"}, {"text": "Found it!! Tq so much.. going to make an attempt if doing this in the microwave...you think it&#39;ll work out?"}, {"text": "I love how passionate you are! 😄 looks amazing! 😍"}, {"text": "I am really bad at baking but i tried out your recipe for brownies- they are insane"}, {"text": "How can you make it without chocolate or cocoa powder"}, {"text": "I read the recipe in the description and I was wondering can I use canola Oil instead of vegetable oil?"}, {"text": "THE 183 people who disliked this video are complete idiots<br />who doesn&#39;t love brownies???!!!"}, {"text": "These turned out super amazing! So much BETTER than box brownies! Thanks a lot! Love you! xx"}, {"text": "Hi Gemma! one technical question, can I melt the chocolate before adding it in my batter? I really want to try your recipe. thanks in advance. nice brownie, btw. 😄"}, {"text": "Hey gemma! Thans fr this awesome recipe 😊😊 i have 2 questions:<br />1. Will the measurement be same if i replace all purpose with whole wheat?<br />2. Can i use normal chocolate or should i use compound only?<br /><br />Please reply. Thanks 😊"}, {"text": "Gemma I made this brownies today and they were so goood"}, {"text": "I made some brownies with Cadbury chocolate yesterday 😀"}, {"text": "do you think if I reduce the sugar, it will make the brownies, best ever?..:)"}, {"text": "im starving"}, {"text": "Hi Gemma, I wanted to ask if I can use less eggs than 4? I don&#39;t mind if it doesn&#39;t become chewy/gooey. Just fearing that eggy taste."}, {"text": "just by looking at this, I already feel so addictive &lt;3"}, {"text": "How much will the result change if the butter in the brownies are replaced with oil?"}, {"text": "Can you add nuts?"}, {"text": "I made these brownies and eating them now as I type.  They are really good. If you&#39;re looking for a dense, moist, not overly sweet brownie, then this is it!"}, {"text": "Can I make them in the waffle iron?"}, {"text": "Perfect! Love to watch you bake, and I specially love to hear you speak. I love your accent!"}, {"text": "Thank you for this classic recpie. I have tried this and turns out really good. 😍"}, {"text": "I made this and it&#39;s soooooo good. Seriously the best brownies I&#39;ve ever had."}, {"text": "I made this recipe today ......It&#39;s so yummy my kids finished it withing a hour 😂😂....Thanks fr the recipe"}, {"text": "You don&#39;t need baking powder/soda for this?"}, {"text": "Wow looks yummy...do we really need brown and white sugar together? because I only use brown raw sugar at home. Is there any replacement for that?does it matter while baking?"}, {"text": "I want measurements"}, {"text": "Ohhh myyyy"}, {"text": "Can I use coconut flour instead ?"}, {"text": "Something about Gemma just makes me love her."}, {"text": "How about Your best ever  Oatmeal cookie please😍"}, {"text": "i love your brownies super moist chocolatey and fudgy"}, {"text": "Are these chewy I&#39;ve been searching for so long for some chewy yummy brownies every time it fails and either turns Into cake or it doesn&#39;t bake it just stays dough ;-; also do I have to use the chunks? Or is it opinional"}, {"text": "Hi Gemma, I love fudgy brownies but my mom likes a little more cake brownies what can I do for get this combination?"}, {"text": "I wish u reach 10 million really really soon....!!!"}, {"text": "Hi Gemma, please make a ginger cake or ginger squares."}, {"text": "Your video donot match your recipe and i was so confused making it .... plus my batter came so less while your is way more ???"}, {"text": "Those are the cutest oven mitts 🐻 where did you get them? I want a pair!"}, {"text": "Can i skip chocolate chunks? Reply as fast as u can gemma"}, {"text": "Have made brownies using this recipe twice now. They are the &#39;BEST-EVER&#39; Brownies."}, {"text": "Those look amazing I shared to facebook I have to try these I love fudge brownies my favorite :)"}, {"text": "It is the best brownie recipe ever."}, {"text": "Thanks so much my lil sister loved these when I made them for her birthday"}, {"text": "Hi Gemma. The brownie looks really good! I don&#39;t like unsweeted chocolate. Do you think that I can leave that? I&#39;m thinking about milk chocolate, but I&#39;m afraid it might be too sweet.....I have to try..."}, {"text": "can I replace flour with corn starch?"}, {"text": "Needs to come to Australia"}, {"text": "Love your oven mittens Gemma!!"}, {"text": "Made these yesterday and they were delicious, I also added some walnuts and the combination of textures was incredible! I will be making these a lot. Thank you for this incredible recipe"}, {"text": "Where do you find the cocoa powder you use?"}, {"text": "Thank you Gemma for your awesome mug meals and recipes! I&#39;m a new mom and rarely have enough time in the day for a full meal but the mug ones are just perfect! :D Love that I can make them quickly and with ingredients I almost always have on hand. Keep up the awesome work :) - Best wishes from Canada"}, {"text": "I have some big question... how much difference it makes to use melted chocolate and cocoa powder instead of just cocoa powder???"}, {"text": "🤤🤤🤤"}, {"text": "Gemma, I made the brownies tonight for our extended family Sunday dinner and they were a HIT! THANKS SOOO MUCH!!!"}, {"text": "When would you make it available in India Gemma!!!!"}, {"text": "Can you not melt the butter"}, {"text": "I wonder who the hell dislikes a brownie recipe video. I mean, what terrible life choices have they made that led them on to this point where a brownie displeases them?"}, {"text": "chewy brownies  are really good"}, {"text": "I have tried this recipe at home , and the result was amazing . That is the best fudgy brownies ever ! Thanks gemma for sharing ur recipe ."}, {"text": "What is a replacement for butter"}, {"text": "Hi Gemma, I enjoyed yours recipes a lot, but I just started cooking this year. I would like to know if I can substitute regular flour for rice flour. Thanks 😃"}, {"text": "Hi! I only have 9x9 and 10x10 tray. Can i use one of them? If yes, how long should i bake and in what temp? 😊"}, {"text": "Gemma, can  i bake these in microwave ovens ?"}, {"text": "If I have a smaller tin I bake for more time right"}, {"text": "Or can I leave the batch out or put it in the refrigerator"}, {"text": "Can I still bake at the same time without the chocolate also I like how you reply to question"}, {"text": "why am I even watching these videos when I don&#39;t even have an oven..."}, {"text": "Can you put measurements me description box"}, {"text": "Make chilli"}, {"text": "I made these yesterday! They truly are the best. Couldn&#39;t wait two hours to eat them though!"}, {"text": "you should have a cookbook"}, {"text": "You can tell she loved this"}, {"text": "it said in the video 180 c but in the written recipe it says 175 which one should i use"}, {"text": "Anyone else salivating?"}, {"text": "Made this yesterday and it turned out great! The best brownies I&#39;ve ever had and everyone loved it. :)<br />I followed the recipe exactly, except that I reduced the sugar and butter a bit because I didn&#39;t want it to be too sweet. barely made a difference, it was still a total delight. Whoever&#39;s thinking of making this go ahead :)"}, {"text": "can you do more cakes"}, {"text": "hii gemma quick question .if i don&#39;t have coco powder is there anything else to change  it?"}, {"text": "Thanku so much Gemma Stafford for such a gr8 recipe❤️ it turned out perfect.. My husband loved it... much love..."}, {"text": "OMG! I was like &quot;oh i wanna bake something... &quot; &quot;typing Gemma Stafford on youtube...&quot; I am making these now! 😍😍😋"}, {"text": "Looks delicious! I&#39;m gonna go make it myself and update on how it turned out!"}, {"text": "Can you use melted chocolate as well as the coco powder or does it make much of a difference? Thank you !!"}, {"text": "Oh dear Gemma, I made it twice, and let me tell you 😩💜 they&#39;re amazing! I loved them, my sisters loved them, my friend loved them and she doesn&#39;t even like sweets 💕💕💕"}, {"text": "Best ever carrot cake, best ever chocolate cake, and best ever whipped chocolate frosting!"}, {"text": "The cake wasn&#39;t yummy atalllllll😑"}, {"text": "aysha i even started baking cake i am too 12"}, {"text": "Hi gemma, I love your channel. And just made Brownie with your recipe. Its indeed best ever.keep up the good work."}, {"text": "Hi, Gemma! How can I adjust a recipe based on my prepared size or quantity? Please help me.."}, {"text": "I have got to make these brownies. Before I die. Fudgiest brownies that I have ever seen. It&#39;s food porn!"}, {"text": "Stahp...you&#39;re making my mouth water at 12 in the morning!!!!!! Esp. When you were talking about the cocoa powder!!!!!"}, {"text": "Nature box!!!!!! Wahoo!!!!!"}, {"text": "I made these and they were seriously the best brownies ever! Thank you Gemma"}, {"text": "I did this recipe today and it was perfect thankyou very much ❤️❤️❤️💖"}, {"text": "I just realized that this recipe doesnt require doubleboiling of chocolate. Seems very easy! Gonna try making these soon! Thank you Gemma!"}, {"text": "I made these and they were delicious 😋"}, {"text": "Hi Gemma. Do you think you would be able to use coconut flour instead of white flour?"}, {"text": "How many brownie does this recipe make？"}, {"text": "My mouth got sooo watery🙊"}, {"text": "Gemma stafford I have one question: Can i bake the brownies in  a  microwave because i am currently in India and I do not have a oven I only have a microwave . Can you pls pls pls reply to this because it would be a real help."}, {"text": "Baking this right now with my twin daughters. They&#39;re 9. They&#39;re so excited!"}, {"text": "I tried this recipe and loved it! Made it for my hubby as a thank you and he loved it as well! Thanks so much for sharing💜"}, {"text": "hi gemma my older brother bakes and he loves watching you and he told me about you and it is so fun waching you☺😊☺☺☺🐴"}, {"text": "I just made a half batch of these brownies. Yummm!<br />I used a silicone pan. No parchment paper necessary, and so easy to remove! "}, {"text": "Ms gem can I have this recipe baked in toaster oven!? Pls reply"}, {"text": "Video starts at <a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=1m48s\">1:48</a> your welcome"}, {"text": "I love how if you don&#39;t or can&#39;t have something she always gives you an alternative!❤️💛💚💙💜"}, {"text": "gemma i want to ask how to make nesquick cereal i really want to know how to make it"}, {"text": "I love your recipe. Am from Trinidad and Tobago"}, {"text": "I made these a few days ago for my fiance&#39;s Pot Luck day at his workplace. They were delicious, all I did differently was use less chocolate pieces and added a load of chopped pecans. A great go-to recipe, thanks for sharing, Gemma! xxx"}, {"text": "I feel so lucky that i ended up here! You have a new subscriber!!!"}, {"text": "I tried this recipe with yogurt instead of eggs but it did not come off good .<br />It was king of sour and the brownie was half uncooked and half burned"}, {"text": "These brownies are epic! I replaced some of the chocolate with little lumps of caramel and added a bit more salt (not quite enough though) and they are just amazing! If I did them again I&#39;d probably use a bit less sugar though, this recipe is a bit too sweet for my taste."}, {"text": "Do you happen to have a recipe for chewy brownies? Every &quot;chewy&quot; brownie recipe I&#39;ve found and tried has resulted in fudgy brownies, which are still good but now what I&#39;m looking for."}, {"text": "Wow, this is really the best ever brownies. I usually make my brownies follow BBC&#39;s &quot; Best-ever Brownies&quot; recipe, but after make your recipe, it will be replaced forever. Thank you very much!"}, {"text": "Mine 🖤🖤 🖤 🖤🖤 🖤 🖤"}, {"text": "Gemma I have 8oz of unsweetened chocolate, so can I use this for brownies??????"}, {"text": "This is not only the best ever brownie recipe this makes the best gluten free vegan brownies!!"}, {"text": "Love this recipe Gemma. I am currently on the hunt for some good quality cocoa powder in Ireland, do you have any particular brands that you recommend?"}, {"text": "Can anyone tell me how the brownies (with this recipe) tasted? <br />I once made fudgy brownies (Martha Stewart&#39;s recipe) and they turned out to be quite bitter &amp; hard/dry. The bitterness was due to my own doing; I decided to use less sugar because I thought it would be too sweet &amp; I didnt know at the time but I was using a 64% bitter cocoa chocolate, so there was very little sweetness. I personally dont mind bitter cocoa flavored stuff but my family want sweet brownies. <br /><br />Someone I know, made brownies that are sort of fudgy at the bottom but the upper part of the brownie is soft (?) and this makes up for a great texture. In my opinion, those are the best brownies I&#39;ve ever had. Im not in contact with them anymore so I cant ask for the recipe. Does anyone know a recipe that results in such brownies?"}, {"text": "i like how you explain to us what type of flour,cocoa powder etc.We need so we are not confused most people just tell us what they are using."}, {"text": "hello gemma ! love your recipe and the channel. while baking the recipe should the toothpick come out clean or still have some brownie batter on them ?"}, {"text": "I made these and It was soo good! But I Dislike the dark chocolate i used :c"}, {"text": "oh my god!  this looks AMAZING!!!"}, {"text": "I feel like everyone prefers fudge brownies.<br />I like cake ones more -.-"}, {"text": "why cant we melt butter and chocolate on direct heat?"}, {"text": "I made these yesterday and they turned out excellent! Would highly recommend 👌😊"}, {"text": "Hi Gemma! I&#39;ve been watching your videos for a long time and until now I hadn&#39;t been brave enough to try a recipe of yours. I say &quot;until now&quot; because I just made these brownies! They were very easy to make and smell delicious, they are cooling right now and I can&#39;t wait to eat them!"}, {"text": "how do you know if the brownie is fudgy and gooey or if it is just uncooked?"}, {"text": "And also can it be salted butter"}, {"text": "Do you have to add in the chocolate chunks"}, {"text": "I&#39;ll be reducing this recipe by half. What changes should I expect?"}, {"text": "I made these yesterday.. and theres only 1 piece left! They r sooooo good! Thank u soo much!"}, {"text": "I love how excited she sounds😂"}, {"text": "Whenever somebody says that they have a &#39;best ever&#39; recipe, I wonder just how good that recipe is. I tried it and, yes they are amazing and easily the very best recipe I have ever tried. Thank you Gemma."}, {"text": "I baked it today and my partner loves them so muchhhhh, normally I offer some to my neighbor but my partner actually did not let me do so! <br />Thanks Gemma for the great recipe"}, {"text": "You are right! These are the ebst-ever brownies. It&#39;s hard to find a good brownie."}, {"text": "I&#39;m making them now!  Hey, what about Birthday Cake Brownies? Is that possible?"}, {"text": "Love your channel😊😊😊"}, {"text": "So i tried these brownies, followed your recipe down to the tee.<br />They looked great, tasted great too (just a little more to the bitter than the sweet side) but they were sooooo oily! I followed the exact butter and oil quantity as youve mentioned in your recipe but the oil was literally floating in the baking tray after they came out of the oven 😭"}, {"text": "Gemma, you should make a best ever buttercream cake!"}, {"text": "oh no! I burnt my brownies<br />😭😭😭😭"}, {"text": "Can i get 0 likes seriously"}, {"text": "Hey Gemma, I love watching your videos! Recently I tried some of your recipes out and they turned out so good. <br />I was wondering though, since I don&#39;t like the bitterness of dark chocolate, is it possible to use milk chocolate instead?"}, {"text": "Heyyy Gemma! I really loved your recipe. I tried it out and it turned out pretty well and my family really enjoyed it❤❤ Cheers to you dessert queen😄❤"}, {"text": "Hi Gemma plz help me out I don&#39;t hv 2/3 and 3/4 cup so hw can I substitute in table spoon or cups .let me know"}, {"text": "why i don&#39;t have the crust on top?"}, {"text": "Baking these atm! I&#39;m so excited when it&#39;s done! ❤❤❤"}, {"text": "Gemma should enter into Masterchef"}, {"text": "i think this video has literally changed my life"}, {"text": "JUST TRIED BAKING THESE AND YES INDEED SO FAR THE BEST BROWNIES EVER THEY ARE."}, {"text": "Hi Gemma i dont have any brown sugar but  can i use dark muscovado sugar instead"}, {"text": "I wear soo much about NatureBox but i live in finland so we dont get it😣😣 i alsi hust wanna say jemma if you ever read this you made me get into baking so that you i fav recipe is your oven baked churros😍😍😍"}, {"text": "I ALWAYS MAKES BROWNIES. .. AM ALWAYS LOOKING FORWARD FOR NEW RECIPES. . LOVE YOU"}, {"text": "If I just make half of the batter, how much time I will have to bake it for?"}, {"text": "So how do I always end up here when I&#39;m hungry."}, {"text": "Hii.what is the procedure to make this brownies in stove?"}, {"text": "What? No nuts??"}, {"text": "I keep looking for fudgy brownies and I&#39;ve tried a few recipes. The last one I used I didn&#39;t use any cocoa powder, but instead 7oz of melted semisweet chocolate. I&#39;ll try yours next and see the difference :)"}, {"text": "These really are the best ever brownies. My family loves them so much and keep saying how good they are❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️thank you Gemma"}, {"text": "I made this brownies and it&#39;s delicious😍👏🏻"}, {"text": "Love the look of them brownies gemma they are so amazing thank u so much for pulling up a videi o brownies thank u"}, {"text": "OMG!! I JUST TRIED THIS RECIPE AND IT IS THE BEST BROWNIES RECIPE I HAVE EVER TRIED!! THEY ARE SOOOO DELICIOUS !! THANKS GEMMA"}, {"text": "Wow it&#39;s so good yummy i will try to make it and <a href=\"http://www.youtube.com/results?search_query=%23loveyourvideos\">#loveyourvideos</a> 😍😍😍😍😍😍😍😍😍"}, {"text": "Gemma, you have the best recipe of the land. Trust me when I say that I&#39;ve compared yours to the rest of the youtubers and yours work every time without fail. And it&#39;s sooo Soo good. Thank you."}, {"text": "I really don&#39;t know what went wrong. I did everything EXACTLY like in the recipe and only a few hours after I baked them the brownies are stonehard... They were in a box overnight, but not in the fridge. Others were left just in the kitchen without any storage...<br />I am really sad :("}, {"text": "Nature Box sounds so delicious! Too bad they only ship to the U.S. and Canada😭😂"}, {"text": "I made these last night with white chocolate chips and they are amazing!!!!!!! ❤️❤️❤️"}, {"text": "Will i have to change anything if i use a 13x9?"}, {"text": "Hi Gemma, can I reduce the amount of sugar i put in the brownies?"}, {"text": "can you make cinamen bun"}, {"text": "*hates"}, {"text": "who hats the word moist hahaha meet"}, {"text": "@gemma darling do we not add any baking soda or baking powder?"}, {"text": "great brownies! thanks! oh yeah, and where did you get them oven mitts?! they&#39;re awesome! bear paws!"}, {"text": "Which can be the BEST substitute for this recipe ??"}, {"text": "Can I use demarara suga instead of brown sugar."}, {"text": "Hi gemma... this brownie really looks yummy... I know all the ingredients... can i know the measurements too ... thanks so excited to try this"}, {"text": "OMG... GEMMA I LOVE U N THANK U A MILLION FOR THIS RECIPE N TIPS... my brownies came out PEEERRRRFECTTT❤❤❤❤LOVE U SOOOO MUCH U R MY FAV BAKER FOR SURE"}, {"text": "What will happen if i bake cake or brownies without parachment paper in pan"}, {"text": "hi!!!! i tried this recipe it came dam well and i substituted egg wit buttermilk its really d best brownie i ever tired"}, {"text": "Hi Gemma, can I use microwave to bake this?"}, {"text": "L"}, {"text": "Hi Gemma, the brownies turned out to be really good. I replaced the eggs with bananas but the brownies had a very strong flavor of the banana. Any suggestions for the same? Also the texture was amazing♥️"}, {"text": "Emma Stafford+ This recipe looks amazing!! I cannot wait to try these myself. keep up the good work xx"}, {"text": "Yummy! I love it so much!👍"}, {"text": "I&#39;ve got a half batch of these in the oven right now--can&#39;t wait!"}, {"text": "I halved the recipe hope it turns out good 😃😃"}, {"text": "I decided to make this recipe yesterday and OH MY GOD!!! You were not lying when you said these are the best brownies ever! They came out amazing. My husband loved how fudgt they were inside!!"}, {"text": "hi Gemma i did this on Sunday it was a win win with my family they love it !! i would like to ask if i can do it with sweet chocolate too? THANK YOU!"}, {"text": "Hey chef i m from india ☺ love the way u bake ... i love ur recipes"}, {"text": "Hi Gemma! The brownies look amazing! I am totally making these this weekend:) I tried using the nature box code but its not giving me the free snacks. Is their website not working? Or am I just doing it wrong? Thank you! Anna~"}, {"text": "Wow so fudgy😍You look so much like taylor swift"}, {"text": "Can you use a 13x9 pan? (recipe says 11x7)"}, {"text": "i want naturebox to come to indiaa"}, {"text": "Please let me know when nature bax can deliver to india...."}, {"text": "Wow the brownies look delicious... !<br />Would definitely like to try them @Gemma Stafford - can we bake them in a microwave &amp; what time &amp; temp ?"}, {"text": "Gemma tried these.. it was my first hand at baking. Everyone just loved it... Just yummmm... Want to check what&#39;s the shelf life or storage instruction?"}, {"text": "Where is she from?"}, {"text": "Great recipe looking forward to trying it! Wanted to ask whether adding the extra chocolate is necessary?"}, {"text": "If I wanted to add walnuts to this, would I have to alter anything?"}, {"text": "Can we bake it in a pressure cooker"}, {"text": "Yass"}, {"text": "Made these today... oh my word they are amazing"}, {"text": "I have an old fashioned gas oven. Quite often my cake came out under cook. Should I still stick to 40 mins?"}, {"text": "Best ever cake rolls"}, {"text": "Loving her recipes 😘😘"}, {"text": "great recipe <br />hey, <a href=\"http://www.youtube.com/results?search_query=%23Gemma\">#Gemma</a> can you please make white chocolate brownie...:)"}, {"text": "I love to watch your videos because I can always learn so much with you ... thanks to share your knowledge ... Regards from Colombia ! :)"}, {"text": "a new video??"}, {"text": "Why did you change your previous brownie recipe is this one better than the other one. I love the other one I use it every time and ends up amazing love the decadent melted chocolate on the other one please tell me which one is better <br /><br />Greetings from Venezuela 😍😀"}, {"text": "How can I tell if it&#39;s a good quality cocoa?"}, {"text": "i like all recipe"}, {"text": "Gemma  plz make microwave things but with a twist don’t do it with a mug"}, {"text": "These are everything😍They are great and so rich👌I put white chocolate instede of dark chocolqte and its delicious❤<br />Thank you rof this recepie💓"}, {"text": "I made eggless brownies using this recipe. Instead of eggs, I used 1 cup of yogurt. Turned out great"}, {"text": "Do you need the chocolate chunks or Can I use walnuts instead?"}, {"text": "I made it with half the amount of sugar and butter and yet it was so sweet !!! I thing this recipe is way too fat"}, {"text": "You are the best chef in the world thank you very much"}, {"text": "Will nature box deliver stuff to INDIA??????"}, {"text": "iam gonna try it cuz it look yummy and Gemma can you try some Pakistani dessert recipes like kheer or shahi tukray"}, {"text": "How do u know how much u put in it"}, {"text": "Can Naturbox provide snacks to Poland?"}, {"text": "Gemma I Want To Make Whipped Cream With Milk Only How Can I Make It"}, {"text": "yum looks amazing"}, {"text": "Made these today and they are definitely the best ever brownies!! I put semi-sweet chocolate in the batter and 70% chocolate on top and they&#39;re amazing!! :)"}, {"text": "OMG, I need those in my life. Like right now!"}, {"text": "Does this have a crackling top?"}, {"text": "Can I use 90% dark chocolate? Or do you know any recipes for it ?"}, {"text": "I still need to get myself  some dark cocoa nom noms!!!!!!"}, {"text": "Gemma, is it just me or is your website not opening properly? I&#39;ve been trying since yesterday. I thought it might be my browser, so I tried a different one, but to no avail."}, {"text": "Thank you so much for this incredible recipe. It is so simple! I made it this afternoon with gf-flour and it tastes ridiculously good. I had a big peace and am stuffed but it&#39;ll be my go-to recipe from now on. I seldom had a glutefree cake that actually tasted this good. I wonder if it could also be adapted to make a great blondie..... Hmm.... 😊 Thanks again!!"}, {"text": "Can I use all brown sugar?"}, {"text": "Hi Gemma, is it possible to bake this in a microwave without convection mode?"}, {"text": "Hi Gemma, I&#39;m from Brazil and I love your recepies!!! I made the brownies and they turned out delicious, but the top did not turn smoth and crunchy like yours apear to be....What do you think could be the cause?"}, {"text": "I love anything chocolate.  But I don&#39;t like anything too sweet.  So I would always cut down on the sugar in cookies and cakes recipes.  Is it ok to cut down on some of the sugar here... or it&#39;s better not to ?<br /><br />Also, can I freeze the leftovers for later ?  Would that change the texture ?<br /><br />Thanks !"}, {"text": "Gemma you&#39;re my favorite chef really"}, {"text": "Could you make best ever chocolate chip cookies?"}, {"text": "Best ever oatmeal scotchies ( oatmeal cookies with butterscotch morsels) that is the recipe I need, those are one of my favorite cookies and I have tried making them before but they always fall apart after I try to take the off the baking sheet."}, {"text": "Hi Gemma 👋🏻 You have a recipe for the best ever blondies? 🙏🏻"}, {"text": "yum I love your recipe&#39;s"}, {"text": "Could you make a healthy snack/meal series"}, {"text": "can you use an electric mixer?"}, {"text": "Nice recipe, love you Gemma !"}, {"text": "You should totally go Food Network. Do a competition or something. That would be great!"}, {"text": "The chunks of molten chocolate look so incredibly delicious! A best ever vanilla cupcake recipe would be wonderful as well!"}, {"text": "Hi Gemma!! 😄 can this be baked in an 8x8 inch pan?"}, {"text": "Please ask nature box to deliver to the uk!!!"}, {"text": "So I made it tastes super amazing a bit heavy bjt amazing .. and my brother liked so thats a bonus 😂 but the chocolate sank down and got burned a little what do I do to prevent this 😕"}, {"text": "Do I just double the recipe if I&#39;ll be making them on a 9x13 pan? cause I want to get the same kind of thickness and texture after they&#39;re baked. :) "}, {"text": "LOVE THIS!!! making it as i type...i shouldn&#39;t be doing that ...hope it comes out great !!! LOL thanks Gemma ❤️"}, {"text": "in microwave convetion mode in what temp and time we sud cook"}, {"text": "What should I replace eggs with?"}, {"text": "Love the video! One of my inspiration to cook. That brownies looking so awesome. Can&#39;t wait to try it at home."}, {"text": "Mango and strawberry jammm ....plllzzzz"}, {"text": "Hi Gemma💕 i really need your help with the free snacks😭 ,i am from the US."}, {"text": "&quot;Only available in the US and Canada&quot;<br /><b>shatters heart</b><br />But on the other hand, THANK YOU FOR GIVING ME THE EGG REPLACEMENTS!!! "}, {"text": "can you suggest some alternatives for whipped cream for making cakes...."}, {"text": "Be sure to try the cheddar caramel popcorn if you try naturebox guys, its to die for."}, {"text": "I always watch these videos but like when I come to try it they just taste nasty and go so wrong😂"}, {"text": "wow! so yummy."}, {"text": "To make it eggless, should I replace all 4 eggs with apple sauce? Is it still gonna work when you have that much eggs?"}, {"text": "Gemma which cocoa powder are you using"}, {"text": "Gemma please tell me which cocoa powder are you using . Please help me out I am just a young teenager who is in search of good cocoa powder"}, {"text": "This is not related to the video but I recently made Gemma&#39;s brownie cheesecake and for some reason the cheesecake texture was more like a pudding. I did everything according to the recipe and I just want Gemma to see my comment because I love her and her recipes have ALWAYS worked. So I really want to know what could&#39;ve gone wrong because the flavour was perfect except it was more like pudding and less like a cheesecake. If anyone else could help me out I would be REALLY REALLY grateful. Please like this comment so that gemma can see it. Thanks"}, {"text": "Hey Gemma can u plz tell me which cocoa powder are u using pleeeeeeeeease"}, {"text": "i made them delish!!!"}, {"text": "I just purchased from nature box! Thanks Gemma for the discount using your name, I&#39;m excited to try their snacks!"}, {"text": "OMG I have been waiting for this Best Ever video! Thanks for posting Gemma! 💕"}, {"text": "Please Gemma reply . My eyes were popping  out when I saw u use such nice dark cocoa powder. 😢😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭please I literally feel like crying  like  the Emoji Gemma I am subscribed to u  through  my father&#39;s account  but that  mobile isn&#39;t  working so I am using my mom is 1 the reason I am not subscribed  to u is I never touch my mom&#39;s  phone . For the last time Gemma reply today I am going to the supermarket  to by cocoa  powder  . Oh Gemma plz I am just a young teenager  who is in search for good cocoa powder  so plz reply.🙇🙇🙇🙇😭😭😭😭😭😭😭😭"}, {"text": "Looks absolutely yummy!! Gotta try it"}, {"text": "luv u Gemma...... awesome recipe..I ll surely try this...."}, {"text": "Happy birthday"}, {"text": "How about best ever no-bake cheese cake?"}, {"text": "&lt;3 OH I am needing to try these! Thank you!"}, {"text": "do you think you could engineer a diabetic version, using stevia in place of sugar, and perhaps almond or coconut flour?"}, {"text": "Can I lessen the sugar?"}, {"text": "can u make oatmeal cookies please love you!!"}, {"text": "I&#39;ve just realised watching you make these brownies that I have every ingredient needed for this recipe! I don&#39;t know whether to be euphoric or very, very scared. :D"}, {"text": "Are there any Butter replacements?"}, {"text": "thanks so much for this recipe gemma... the brownies turned out so fudgey and delicious... will use this recipe every time.... the best part was my 5 year old son helped in baking them and really enjoyed eating some... it really  made his day... thank you xxx"}, {"text": "Hi, Ukraine 🇺🇦 is watching you) please tell us how much is your cup in grams? Thanks! Great recipes! Love them!!!"}, {"text": "love your baking so much but can&#39;t really bake something here cos I can&#39;t find the ingredients in my country"}, {"text": "I just made these today, and they are the BEST! Now I can stop buying those brownie baking mixes from the store, and start making them from scratch! :D"}, {"text": "Yummy!!"}, {"text": "Finally A brownie recipe that does not call for by 8 x 8 pan but instead an 11 x 7"}, {"text": "Looking absolutely delicious and yummy..! I Will definitely try this tomorrow. Thanks gemma for sharing this gorgeous recipe."}, {"text": "yes gemma stafford back with the hell of a video"}, {"text": "Hey Gemma Can you please make lime and white chocolate ice cream! ☺️"}, {"text": "Do a collaboration with Ro"}, {"text": "Omg can&#39;t wait to make them"}, {"text": "I did not mean what I said , sos , I subscribed , keep up the good work"}, {"text": "woooooooow that brownie is amazing"}, {"text": "Hotel? <br /><br /><br />Trivago"}, {"text": "Plz do some more savoury bakes ! Or something like protein bars or shakes ! "}, {"text": "Definitely what I needed! I hate when I try a new brownie recipe and it&#39;s cakey :-( This gooey fudgey recipe was made for me!! Thank you sooo much Gemma! I&#39;ve tried so many recipes and now I finally have a go to!!"}, {"text": "No baking powder?"}, {"text": "What brands of cocoa powder would u recommend?"}, {"text": "Thanks Gemma! Can&#39;t wait to bake these!"}, {"text": "Gemma why are u so up your ass , u are not gordan Ramsay are u ..."}, {"text": "You&#39;re super giddy for this episode, I love it!"}, {"text": "gemma, how do you keep your fitness so good? I just love love your recipes andyour style"}, {"text": "The brownies look awesome, but I have an unrelated question: What is your accent?"}, {"text": "thank you for including all the measurements in cups AND grams on your website, so helpful!"}, {"text": "I have a question: when whisking the sugars and butter, does the sugar needs to be &quot;dissolve&quot;?"}, {"text": "Would Dutch cocoa powder work for this? Or would it be too dark?"}, {"text": "Gemma I can never open up ur website. Every time a problem occurs with the page."}, {"text": "Scrumpalicious recipe gemma! But you know what will take it to the next level......some crunch like from  some macadamia or cashew nuts. Don&#39;t you agree?"}, {"text": "Plz mention proportion in cups"}, {"text": "mam you are so cute and so sweet  .love you so much😍😍😍😍😍"}, {"text": "love it"}, {"text": "These look so good but I can&#39;t hav dairy 😢"}, {"text": "&lt;Crunch&gt; omkay &lt;crunch&gt;&lt;crunch&gt; now vat mrmph he amrmphd is ot of mrmph &lt;crunch&gt; way, mets mit &lt;crunch&gt;&lt;crunch&gt; talkmrmphing about browmrmphies.<br /><br />&lt;crunch&gt;&lt;crunch&gt;"}, {"text": "Nice ad at the beginning. -_- But very delicious recipe. Thank you!"}, {"text": "what accent is this???"}, {"text": "Gemma! Please do various flavours ice cream bread recipe next! 😍 Ice cream bread is just flour n ice cream :)"}, {"text": "Thank you so much, Gemma. Just made this brownies, really really delicious. BEST EVER BROWNIES!!!"}, {"text": "Please can u make a chocolate lava cake"}, {"text": "I just found ur channel but you&#39;re amazing. I love how many details and are so into the video. I find cooking Channels  boring but yours is so entertaining and I just subscribed!"}, {"text": "Please do a best ever shuffle 🙏🏻💥😍"}, {"text": "Gemma will the texture change if i didnt add chocolate chunks?"}, {"text": "I love how excited you get about brownies"}, {"text": "Hi"}, {"text": "<b>OREO BROWNIE</b><br /><b>RED VELVET BROWNIE</b><br /><b>CARAMEL BROWNIE</b><br /><b>CHOCOLATE MINT BROWNIE</b><br /><b>S&#39;MORES BROWNIE</b><br /><b>CHOCOLATE SHIP COOKIE BROWNIE</b><br /><b>BIRTHDAY CAKE BROWNIE</b><br /><br /><br />You should make a crazy brownie batter series."}, {"text": "Just when i&#39;m about to think of putting hot chocolate powder , Gemma said &quot;no, don&#39;t do it&quot; haha it got me xD"}, {"text": "Iv&#39;e just started to watch your videos and may i say you are a AMAZING chef,I would love naturebox i live in england,Much love kayleigh xoxo"}, {"text": "Looks scrumptious! Best Ever BBB brownies indeed ♥"}, {"text": "Hi Gemma. Can I bake<br />this brownie in a round pan and put it in between two layers of cake? Its my nephew&#39;s birthday on the 23rd and I&#39;ll be making a campfire cake for him. Much love from the Philippines. Thank you."}, {"text": "I don&#39;t like dark chocolate. can I replace the dark chocolate with something else?"}, {"text": "Looks like another winner!  I will definitely try this one, I AM a chocoholic!"}, {"text": "Hi, what brand of cocoa powder did you use?"}, {"text": "Please make some gluten free stuff😊😊 ilysm😘😘"}, {"text": "Hi can you add dessicated coconut to the mixture?"}, {"text": "Can these b made in microwave"}, {"text": "This looks delicious!"}, {"text": "hey Gemma, please make blondie, its brownie less popular counterpart after all"}, {"text": "What will you choose between Red Velvet Cake or Brownies?"}, {"text": "- - -u really deserve more sub. I really like all youre recipe.. stay healthy😄.."}, {"text": "Gemma, I was wondering if you could use any chocolate you like because I don&#39;t like dark chocolate. thanks. Xxx"}, {"text": "Hi Gemma!<br />Thanks for uploading this recipe..just a quick question  ...Can I use natural cocoa powder  instead of dutch processed, as its difficult to source in India?<br />Also, can I use non dairy whipping cream for your ice cream recipe...the one without ice cream maker? dairy whipping cream is also something which is extremely difficult to get<br />BTW.....love your videos and recipes<br />Your single serve cookie recipe was such a hit with my family!!!!<br />"}, {"text": "YUMMMMMMMMMMMMMMMMMMMY."}, {"text": "was too excited for it since i saw your insta story.....in your channel its always more than expected!"}, {"text": "Gemma, I made brownie a couple times from the recipe at your website, it&#39;s so delicious &amp; fudgy, what&#39;s the difference between the old recipe and the new one?"}, {"text": "Loved this video as always satisfaction"}, {"text": "Salted butter and more added salt?  I accidentally used salted butter to make sugar cookies once...threw the whole batch out cuz it was too salty."}, {"text": "Can you please make a best ever red velvet cupcake with cream cheese frosting?"}, {"text": "These look AMAZING! I&#39;d have to use dairy free spread as well as gluten free flour so I don&#39;t think they would come out as well, but may give them a go someday! <br />I&#39;ve found that gluten free cakes etc dry out quite a bit so what I&#39;ve started doing is putting an oven-proof bowl of boiling water into the bottom of the oven (not sure if it&#39;s a true Bain Marie), letting it steam for a bit, then putting my cakes etc into the oven, leaving the steaming water in there (making sure the bowl doesn&#39;t become dry). I find the cakes etc come out a bit more moist! They still aren&#39;t as moist and springy as non gluten free cakes, but they are improved!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=6bLAIYHOLwA&amp;t=1m42s\">1:42</a> <b>c r o n c h</b>"}, {"text": "Oh my god! I love this recipe so much!!! I can&#39;t wait to bake it myself. Your videos are really helpful, you mention every lil detail &amp; I absolutely love them! 😘😁❤"}, {"text": "inspired from India as just 16"}, {"text": "WOW amazing brownies!!<br />could i use rice flour instead of all purpose or wheat flour?"}, {"text": "These are soo good!"}, {"text": "Hello,  tell me one thing  I heard many times that cocoa powder is  better than chocolate but I notice each time I used,  with chocolate the taste is better. In my opinion cocoa powder give a beautiful brown colour but for the taste use chocolate is better and after you just have to reduce the sugar. I don&#39;t no exactly is brown sugar I use cane sugar  ( I m no sure of  the traduction) because I as a West Indian  I think that white sugar have no taste .  I sorry for English but I  m French from Martinique  and french Guyana i m not good in English so i already have to some recipes because some ingredient are expensive like. Whatever thinks you&#39;re  for all your recipes  ."}, {"text": "can you please show us how to make madeleines??"}, {"text": "I didn&#39;t freak out,I was like wtf are these,they look like poop"}, {"text": "When I make brownies,I put 1 tblsp of instant coffee,it will enhance the flavor of the chocolate flavor :)"}, {"text": "What will happen if I use less eggs?"}, {"text": "In this video..... You are very excited??? Bcz of your best ever Brownies!???"}, {"text": "And you deserve alot of subscribers...... Aloooottttttttttttttttttttttttttt of..... Stay blessed and keep it up"}, {"text": "Gemma u really do deserve more love n support ! I&#39;m always there for that :)"}, {"text": "Thank you gemma for uploading. For brownies do you bake it at d top rack or middle rack?"}, {"text": "Do you even use salted butter in your frostings ? And i also i really like your recipes , they are the best i ever tried and they always turn out sooo good. You are an inspiration!"}, {"text": "Young bold baker squad 🙋🏽❤️"}, {"text": "Anyway these Brownies look great. Something worth trying out for my next New Year Party!"}, {"text": "Im looking for more vegan &amp; no bake dessert options"}, {"text": "Love the channel .  Just wish you would tell how much ingredients u use. ty"}, {"text": "NATUREBOX?? WHOS SHE SHE WAS LIT LIKE 12 AND A HALF BILLION YEARS AGO"}, {"text": "How are you still skinny after baking and eating so much treats?"}, {"text": "Yumm yummm yumm ❤️❤️"}, {"text": "Fantastico"}, {"text": "Can someone tell me if Gemma&#39;s brownies or mycupcakeaddiction&#39;s brownies r better?"}, {"text": "Ur my all time favourite tutor for baking.. u show easy recipes n that&#39;s d reason that after seeing so many of ur recipes i have actually started baking🤗 n now it&#39;s time for me to make this yummy brownies😍😍😍"}, {"text": "Gemma i cant find the ingredients and their quantities of these brownies"}, {"text": "If these are the best brownies, I&#39;m obliged to try them. But I really like chewy ones and I&#39;ve tried so many recipes byt haven&#39;t found a good recipe yet.  😊"}, {"text": "So glad I&#39;m watching this on a Friday night...weekend plans sorted"}, {"text": "I remember getting nature box when I was in England. It was great! Unfortunately we don&#39;t have it in Russia and will probably never have :(((((("}, {"text": "wowww is it sunday already"}, {"text": "Brownies are my favourite and these look to die for!!😱😍"}, {"text": "how about cooking in microwave. ..how long we have to keep??"}, {"text": "send them to me in the UK please 😭"}, {"text": "loved it! And your Gloves are so cute :p"}, {"text": "Hi Gemma. I&#39;ve been making the brownies you&#39;ve made in past videos that you also described as the best, and OMG they&#39;re AMAZING. But this recipe is different, so which recipe is better?"}, {"text": "Also, Could you do a Best-Ever fudge recipe? Or maybe Best-Ever pho?"}, {"text": "lovely... you are great i  have tried 2 of your recipe nutella brownies and  pizza out of crazy dough  they were amazing 😙😙😙😙 thank you soooo much !"}, {"text": "Which egg substitute do you recommend except bananas or apple sauce?"}, {"text": "They look amazing!! Definitely will try this instead of being lazy and using a box! Love your show Gemma! - Illi"}, {"text": "Gemma, since you use salted butter; do you do a salt discount?"}, {"text": "I can tell that you love your brownies. Over the years my family has come to the concensus that box brownies taste better than homemade. But when I make these I think that will change!"}, {"text": "Yum😍😍😍😍😍😍"}, {"text": "Could you take the time once to show how you can tell when the flour is mixed in the right amount?  Whenever I&#39;ve tried to get it &quot;just mixed in,&quot; I&#39;ve ended up with a couple little balls of flour in the finished product."}, {"text": "I need a piece like right now!"}, {"text": "Question: I always thought if you used unsalted butter you can control the salt that goes into your food. If I used salted butter, is it still necessary to add salt? Won&#39;t it make it more salty?"}, {"text": "Best ever tiramisu please 😋"}, {"text": "Is this the same brownie recipe you used for your raspberry trifle?"}, {"text": "I am salivating as I watch this! Definitely making one with some experimenting on Japanese Chocolate bars! :3 Thanks Gemma! I am gonna have the NatureBox snacks shipped from my aunt in the Us for now! They should have one in the Philippines too! &lt;3"}, {"text": "😍😍😍"}, {"text": "I made your best ever chocolate cake for christmas and WOW! Chocolate cake isnt normally my thing but it tasted amazing. I will definitely be trying this one! Thank you 💕🙌🙏"}, {"text": "If you made the batter ahead of time, refrigerated it, and baked it a day or two later, would they turn out the same? Thanks!"}, {"text": "Few lovely peoples in world, &amp; you r one of them."}, {"text": "these look AMAZING!! definitely going to try them!!"}, {"text": "What about &quot;chewy&quot; brownies? Those one&#39;s that are in between and kinda cracked on the top and really soft but not cakey. I would love a recipe for those"}, {"text": "Best Ever Upside Down Pineapple cake Gemma! My grandma may she rest in peace used to make one!"}, {"text": "😍😍😍😍😍"}, {"text": "I&#39;ve never seen such fudgy brownies"}, {"text": "I tried making these today and they turned out very yummy. I was looking for something to make to take to a sleepover my friends and I are going to have, and my friends will love this. Thanks for sharing this recipe!"}, {"text": "Omg where&#39;s tasteevision when you need it"}, {"text": "YUM!!!!  Can you make a best ever lemon meringue pie please!"}, {"text": "New subscriber here 😊<br />You had me at brownies 🤗"}, {"text": "Thank you so much joanna!"}, {"text": "So so chocolatey and yummy...👌👌😍"}, {"text": "Can I use jaggery instead of brown sugar?"}, {"text": "Gemma could you recommend a good oven thermometer, because every time my mom tries to make brownies from a box they get rock hard around the edges and, small pizzas from the store are almost always lukewarm. even though the temperature is set right.  but when she cooking dinner like chicken or roast the food is cooked well done and piping hot."}, {"text": "Ohh its just looking lovely and tempting"}, {"text": "Definitely, the ULTIMATE BROWNIES EVER!!!!! You did it again Gemma😍😍😍😍"}, {"text": "Would you recommend baking them in a cast iron skillet? If so for how long? I would love to try these tomorrow but all I can use is a cast iron"}, {"text": "Gemma you teaches really well <br />Lovely dear"}, {"text": "Are they chewy too??"}, {"text": "These look like EPIC brownies!!! I have requested this before, so I have decided to beg you. Please, will you make alcoholic ice cream flavors? I live in Louisiana and it is hot hot hot! I love your recipes and I think it would be AMAZING if you could create a strawberry daiquiri ice cream, white Russian ice cream, limoncello ice cream, mudslide ice cream, pina colada ice cream, and maybe a brown butter bourbon/whiskey ice cream. THANK YOU!"}, {"text": "These brownies look amazing, but I&#39;m wondering if u don&#39;t have the dark chocolate chunks can u leave them out?"}, {"text": "love all your recipes Gemma. .."}, {"text": "thanks aunty for Ur delicious recipe . looks amazing will try..."}, {"text": "Im going to bake it tomorrow!!!!!"}, {"text": "Gemma, you are so awesome!  I&#39;m going to make these, lock myself in my bedroom and eat them all!  LOL!!  Great recipe!  Thank you!!💕"}, {"text": "Am gonna try soon looks delicious Gemma...<br />Also could you tell me please the diff between dry yeast and active dry yeast."}, {"text": "Oh my gosh I love your mittens, they&#39;re so cute."}, {"text": "But how much of each ingredient?"}, {"text": "Dear Gemma next time could you please add on how many tablespoons, teaspoons ext thanks😛😜"}, {"text": "Who else is feeling hungry while watching this?"}, {"text": "amazing brownies!! when are you going to introduce you to your crew?"}, {"text": "We need naturebox snacks in Mexico,please Gemma tell them we need them 😯😍"}, {"text": "My favorite brownie is fudgey in the middle but have a chewy edge. Do these get a chewy edge at all?"}, {"text": "will you do a blondie recipe please?! These look amazing!"}, {"text": "ARE THOSE BEAR PAW OVEN MITTS???? ohmygosh those are so cute!<br />Those brownies look too good to be true"}, {"text": "Those brownies though. I wish I had brownies like that 😞"}, {"text": "This video was like a getaway for me from &quot;tasty&#39;s&quot; so called molten cake."}, {"text": "Are they the type of brownies that are too dark and rich or are they just right just wondering as I might make 😊"}, {"text": "@Gemmastafford For the cocoa powder could I use Bournville cocoa powder (as I&#39;m living in the uk)"}, {"text": "Gamma you don&#39;t use baking powder right?"}, {"text": "hi, do you think it will not the yummy nest if I reduce the sugar,?"}, {"text": "I love your accent, please make a cake, and decorate it with something katy perry. Please please please."}, {"text": "these look fab. Will make these for  my family. can I use raw cacao powder or does is need to be the darker processed cocoa powder? many thanks"}, {"text": "We&#39;re trying these tonight....... 🐨👍🏼"}, {"text": "I tried them and they are REALLY DELICIOUS<br />Thank you Gemma for your amazing recipes"}, {"text": "Nature Box is a pain in the ass to cancel jsyk"}, {"text": "Oh my word!!!! These look scrumptious!!! Thank you so much Gemma!!! 😊"}, {"text": "Girl mouth watering sooo good I can taste them 😮wow lol!!! &amp; gemma I had the Nutella. Its good but nothing. Like these brownies I. Drink. A lot of coffee. Too 😕😀"}, {"text": "I&#39;ve always used one recipe that I thought made the best ever brownies but these look SOO  delicious! I think it&#39;s time to try something new😄"}, {"text": "The most work is to chop the chocolate. A messy job. Do you have a good advice to do this &quot;professionally&quot;?"}, {"text": "Rich, dark, sweet, has a little bit of bitterness in them.. my future husband"}, {"text": "Omg I need to make this! Only thing is I&#39;m worried I might EAT them ALL!"}, {"text": "I love how these brownies came out! I&#39;m inspired to make them too, but I&#39;m curious, will adding a teaspoon of espresso coffee make the chocolatey flavor stronger?"}, {"text": "👍✳️👍✳️👍✳️"}, {"text": "Gemma do you have a recipe for key lime pie?"}, {"text": "I&#39;m bothered by that one tiny egg shell"}, {"text": "I love how she includes options we can use if we can&#39;t eat a certain ingredient in her recipes"}, {"text": "Too cute Gemma when you said these are hardcore brownies..😅"}, {"text": "Please dont get boring putting those annoucements in the beginning of the videos!"}, {"text": "Yay! Nature box is available to more countries now!"}, {"text": "Naturebox seems sooo amazing and I&#39;d love to have it in Sweden too. Btw, Gemma, those brownies look gorgeous!! I have to try them!"}, {"text": "Gemma can you please do a rocky road recipe please I can&#39;t find a nice gooey rocky road recipe anywhere love ur videos"}, {"text": "Hi Gemma!<br /> Those brownies🤓looks  delicious.Thank you for your recipes. -  love all what you do for us!! ❤ 🖒."}, {"text": "I woke up early to watch your lovely video."}, {"text": "hi Gemma my nephew is allergic to a lot of food items but would love to eat cookies and cakes any suggestions to replace sugar butter and eggs as he&#39;s allergic to these.Hes just four years old.waiting for your reply. Thanks"}, {"text": "Hi Gemma, I live on Guam we are a U.S. Territory. Can they mail here,?"}, {"text": "You&#39;re  really the best baker on YouTube. Thumbs up from Asia."}, {"text": "Omg I&#39;ve been craving chocolate so bad. I halved the recipe bc it&#39;s just going to be for me and my boyfriend. It&#39;s in the oven right now and I can&#39;t wait! 😛😛😛"}, {"text": "Where&#39;s the written recipe?"}, {"text": "Thank you for this video, I&#39;ve been waiting for it❤"}, {"text": "Best ever apple crumble :D"}, {"text": "Gemma I visited the website of the nature snacks thing and it wasn&#39;t free"}, {"text": "Can you melt dark chocolate chunks and butter together at the start rather than adding cocoa powder?"}, {"text": "When your sitting on your couch and u straight up know that your far too lazy to make anything but your starving!!!!"}, {"text": "Can you tell the exact measurements please"}, {"text": "Hey Gemma,<br />I love your videos and recipes. Can you use a individual square silicone baking pan to make the  brownies in. They look so good☺"}, {"text": "Can I add walnuts to this recipe?"}, {"text": "Omg I want to try some of that right now 😍👌🏼 that brownie isa must make recipe."}, {"text": "Why don&#39;t you put melted chocolate in your brownies?"}, {"text": "Brownies are life!!! Gemma&#39;s best-ever brownies are too much life!!! Brownies and muffins are my favorites sweet foods (repostería)!!!!"}, {"text": "Can you use unsweetened coco power?"}, {"text": "Thanks a lot for this yummy recipe hon I already love your brownies 😍😍😍😍😍"}, {"text": "This is very similar to nigella lawsons recipe. I&#39;ve made her recipe and beat the shite out of the flour into the batter and the brownies have turned out amazing.  My children are constantly asking for them. So, folding flour sometimes is a waste of time."}, {"text": "Hi gemma! Your best ever brownie makes me hungry! I hope you bake your best cheesecake next time. ❤️❤️❤️"}, {"text": "W E T"}, {"text": "What brand of cocoa powder do you use? Thanks for sharing!"}, {"text": "They are in the oven as I write this, they smell wonderful! Can&#39;t wait to try them! Thank you for the recipe and God Bless!"}, {"text": "Are they better than the ones you already have lol. I love that you pick up the coffee cup even though you say you&#39;ve had enough coffee lol."}, {"text": "I live in England so Can i get the naturebox snacks"}, {"text": "Thnx u so much for this video Gemma, I remembered asking u and u actually did I&#39;m do happy when I make it next I&#39;ll be sure to send u a pic 😊 Much love from Trinidad 💕"}, {"text": "really interested in naturebox but unfortunately i live in germany :,)"}, {"text": "Yummmm..😋"}, {"text": "Do a q/a video"}, {"text": "is the chcolate at the end necessary?(the chocolate chunks)"}, {"text": "Can I make them with melted chocolate instead of the cocoa powder??"}, {"text": "Wait... no baking powder? How did they rise? (sorry i&#39;m a noob)"}, {"text": "They look soo good!! I&#39;m gonna try them soon without egg and with whole wheat flour. Also I use Xylitol instead of Sugar. :)"}, {"text": "Amazing brownies!! You always make such a tasty recipes :)"}, {"text": "OMG!! I&#39;m gonna make these tomorrow I cant wait to eat these chewy and fudgy brownies😍omnom"}, {"text": "I grew up on box brownie mix, and they came with a yummy chocolate icing/ glaze. What recipe would you use to recreate that?"}, {"text": "I just tried out your recipe Gemma, and these are to die for! Literally had one spoon and the richness of the cocoa hit me! Fantastic! First time ever trying a bigger bolder recipe! ❤️❤️"}, {"text": "I like Brownie"}, {"text": "The best brownies are the St-Hubert brownies... NOOOOO now I want some :&#39;("}, {"text": "The choco bits didn&quot;t sink to the bottom, AMAZING!  I usually have to dust them with flour first,  so they won&#39;t sink! <br />You did it again!!"}, {"text": "Mmm...those brownies look gorgeous. I&#39;m such a sucker for baking and sweets. Wonderful job as always, Gemma. ❤"}, {"text": "I love how thick the brownies are. Another awesome recipe Gemma."}, {"text": "I have these brownies in the oven right now and they are smelling delicious! If the taste of the batter is any indicator of the finished product, these are definitely a winner ;)"}, {"text": "I live in Turkey and l would love to get the NatureBox :)"}, {"text": "I wish you were my mum"}, {"text": "I love you can you plz follow me on Instagram"}, {"text": "Gemma u should do a meet and greet! Come to Toronto so I can see u 😁"}, {"text": "Can you try to make Tahinopitta? It&#39;s Greek or cypriot desert (or both, not sure) check online if you never tried it"}, {"text": "Amazing recipes♥♥♥♥♥ The recipe is a thumbs up for me♥♥♥♥♥"}, {"text": "Please a collab with Rosana Pansino from neardy nummies♥♥♥♥♥♥♡♡♡♡♡♡♡♡☆☆☆★★★★:-D:-"}, {"text": "!!!!!!!!!"}, {"text": "My mouth is watering right now"}, {"text": "Gemma yes please do a <br />Q/A video and a collab with Rosana Pansino please My birthday is coming up soon so please a collab with Rosana Pansino ♥♥♥♥♥☆☆☆☆love you"}, {"text": "Hi Gemma, looks delicious, will have to give his a try. I noticed that in a lot of your videos lately you are wearing lots of floral print shirts. They look so stunning! It&#39;s winter over here in New Zealand. But every video I see with you wearing your beautiful tops, it making me crave summer!"}, {"text": "Oooh! These look so delicious and unbelievably fudgy! Yum, I&#39;m craving these brownies now! 😍😍"}, {"text": "Thanks for saying that we can use white sugar instead of brown! (btw isn&#39;t salted butter enough salt for the brownies?)"}, {"text": "Lovely"}, {"text": "Yummy...Gemma they are nice with a bit of chilli I&#39;m.yhem served warm with vanilla ice cream"}, {"text": "Amazing - I can always rely on your recipes !"}, {"text": "I laughed along with you when you lifted out that brownie, because OMG!! Gemma, you&#39;re a super star! ♡♡ Also, please please please hold an international giveaway!! ♡ :)"}, {"text": "Hi Gemma,<br />Brownies look so very yummy!<br />I really wanted to share this with you. Came up with a real, nice eggless spongy chocolate brownie cake in the microwave. I do eat eggs but just tried this. <br />9 tbsp flour+5 tbsp cocoa powder+4-5 tbsp gran. sugar+1 tsp baking powder+1/2 tsp baking soda+pinch of salt+4-5 tbsp milk+4 tbsp oil+2-3 tbsp water (water if needed to make the batter a bit loose)+ IN THE END thoroughly mix in 1.5 tsp white vinegar+chopped dark chocolate on the surface. 9-inch round glass pie dish. Highest power in the microwave (900 for me) for 3-4 minutes, checking after 3 minutes. It came out so good. I was surprised myself. I use 1/3rd of this batter for a single serving mug cake. Mug cakes - learnt it from the best - YOU. Hope you get to try it :-)"}, {"text": "I love brownies 😍😍 thank you Gemma!! You&#39;re the best!!"}, {"text": "Thank you gemma!"}, {"text": "I think I&#39;ve asked this question before but does sunflower oil count as flavourless?"}, {"text": "Your oven mitts are so cute! Where did you buy them from?"}, {"text": "Hey Gemma! Been a loyal follower of your videos. Absolutely in love with your recipes! Just a quick question. - Since Brownie batter is usually made with Melted Chocolate instead of cocoa powder, could we use melted chocolate? since original brownies have the main ingredient as melted chocolate, any specific reason we&#39;ve not used them in this one? Usually we use cocoa powder in cakes and what makes brownies so special is the melted chocolate, i was wondering why that hasnt been used. I love the taste of it so would really love if I could know how to replace cocoa powder with melted chocolate, please? Thank You in advance :)"}, {"text": "What brand of chocolate do u use?"}, {"text": "Hello! Could I use an egg alternative for this? If so, which do you recommend?"}, {"text": "Gemma, do you ever use yogurt or mayannise instead of butter in your baking? I know some baker use them in their baking."}, {"text": "I live in Denmark, and when I go to the supermarket I can only choose one kind of coco powder: Normal coco powder. In Denmark we don&#39;t have unsweetened and sweetened coco powder. If I ever should find unsweetened bitter coco powder it would be one hell a expensive."}, {"text": "Gemma...I live in Solvang CA and was wondering if you have ever thought of opening a bakery or restaurant up north like Santa Barbara or the Santa Ynez Valley??? This is a HUGE wine tasting area and we would LOVE  to have a new dessert or pastry shop here! These brownies look like they are just what we need! I would be your biggest and best customer! You and your yummies are so awesome!!!"}, {"text": "are the chocolate chunks optional?"}, {"text": "I would be thankful if NatureBox could deliver their products to Sweden!"}, {"text": "I wish I could travel. It&#39;s too expensive T~T"}, {"text": "I do have white sugar but no brown sugar so if I&#39;m adding only white sugar then should i dubble the quantity of white sugar ???? So i mean shall i put 2 cups and 4 tablespoons of white sugar??"}, {"text": "This video should not be named &#39;GEMMA&#39;S BEST EVER BROWNIE&#39; it should be called &#39;THE WORLDS BEST EVER BROWNIE&#39;.Comment down and like if u all agree.😘😃😘😃😘"}, {"text": "Look&#39;s Great"}, {"text": "Looks YUMMMMMMMMMYYYYYY!!"}, {"text": "can i use nesquik chocolate powder or it wonot work?"}, {"text": "Next mug vid an egg free brecfast muffin with flour sugar milk and coconut oil solid."}, {"text": "I love brownies and I bet these will beat any brownies. 10/10"}, {"text": "Gemma please show us a recipe of an eggless dense chocolate cake! Pleaseeee.. Thankyou"}, {"text": "Adopt me please"}, {"text": "Please make a mug cakes in a microwave episode gemma"}, {"text": "They look 👀 so nice"}, {"text": "Foodporn-Intro &lt;3"}, {"text": "early"}, {"text": "I love you your videos"}, {"text": "Love love love for your brownies 😍<br />But i also want that snacks to try from india 🙁"}, {"text": "I make this recipe a lot and I love it! But I remember it having melted chocolate in the batter?"}, {"text": "Can I use Margarine instead of butter? I Know that in cookies using Margarine will make them spread,but what about in brownies? Comment down what you think"}, {"text": "They look so amazing! 😍😍👍<br />I really wanna make those but I only have 9x13 and 9x9 to bake it in. Which one would be better and how long would they have to stay in the oven?"}, {"text": "I am just so shocked that you only have 1 million subscribers....you deserve at least 5mil! Im sure you&#39;ll get there soon, your content is always 10/10."}, {"text": "I love you sooo much 😍😍"}, {"text": "You are not just a good cook,but a great host and enterpreneur also."}, {"text": "When is <a href=\"http://naturebox.com/\">naturebox.com</a> going to come in India?"}, {"text": "I love brownies. Another great recipe."}, {"text": "Can you make a lava-cake? I LOVE LAVA-CAKES! 😅❤️😍"}, {"text": "LOVE FROM TURKEY 💜💞🇹🇷 WE LOVE YOU GEMMA  ❤❤ YOU ARE OUR FAVORITE CHEF 💕💜💞"}, {"text": "Yum! They would be so good if you replaced half of the chocolate chunks with cacao nibs. Equally as chocolaty but with some added texture. Ooo or a little bit of raspberry jam swirled in. Great base recipe! Thanks for sharing!"}, {"text": "Plss make oreo mousse"}, {"text": "I am a type 2 diabetic please stop sending me recipes and take my name off list. Thanks"}, {"text": "I like to see other recepies made in a crock pot lika the gingerbread puddig you did a year ago. As a Finnish follower it would be lovely to see you, as the best baking channel on Youtube, do something with  liquorice. &lt;3"}, {"text": "Gemma, would you recommend changing anything about this recipe for high altitude??"}, {"text": "plz.mention quantity of all ingredients.. cx baking need proper measurements."}, {"text": "Thank You so much for this Gemma. Have been waiting for this too long😍😍😍😍😍😍😍"}, {"text": "Love it !!!! Can&#39;t wait to try it"}, {"text": "Hey gemma u are awesome my wife never forget to watch ur videos"}, {"text": "Also I had a question, can we bake it in microwave? What are the specifiations please? would be great if you reply"}, {"text": "Also I had a question, can we bake it in microwave? What are the specifiations please? would be great if you reply"}, {"text": "They look amazing,definetely  gonna try them😍😍<br />Thankyou sooo much Gemma for such amazing recipes ❤️"}, {"text": "Such a mouth watering recipee😍, will defenitely try these ! 💝 Amazing recipee, gemma✨"}, {"text": "Thank you Gemma for this one. Have been waiting for this one for so long...😍😍😍😍😍😍😍"}, {"text": "please stop ;_;<br />am sooooo hungry rn....."}, {"text": "Thank you Gemma for this one. Have been waiting for so long...😍😍😍😍😍😍😍"}, {"text": "Thank you Gemma for this one. Have been waiting for so long...😍😍😍😍😍😍😍"}, {"text": "OMG my mouth is watering, it looks so good! I&#39;m definitely trying this out this weekend! xxx"}, {"text": "And also that brownie looks  so good"}, {"text": "Gemma plz tell me which  brands cocoa powder are u using or u use"}, {"text": "Gemma your videos just make my day.. can these brownies be used for your ice cream sandwich recipe???"}, {"text": "This was the best recipe ever! What about a best ever coffee or any drinking sort of stuff! Anyways this was great! Cheers"}, {"text": "To he honest, I&#39;m not so sure those are fully cooked in the centre. They look very raw."}, {"text": "I&#39;m SO glad you use salted butter! I always do for all my cakes, but I see most people use unsalted. I tried it a few times but the flavour was just not there... btw these look awesome! I&#39;m so going to try them! Thank you for sharing 😁"}, {"text": "💖 looks yummy. i will try my best ☺ could u pls make a chocolate mousse in next video💖"}, {"text": "these looks so yummy and chocolaty,😱<br />definetly going to make these 😍"}, {"text": "I just made these and i baked them for 37.89 minutes and they weren&#39;t fu*gy in the middle. i am terrified"}, {"text": "Oh my God , they look amazing . Wish I had somebody to help me make those Brownies . Recipe looks real simple dunno 🤷‍♀️ if I could really make them"}, {"text": "You should make a brownie cake that will be amazing"}, {"text": "To turn them into blondies can I substitute the cocoa powder with the same amount of flour? Thanks Gemma! Brownies and blondies are 😍"}, {"text": "this looks so much better than the boxed stuff!!"}, {"text": "Can&#39;t wait to make them 😍😍"}, {"text": "Gemma also give us some savoury or spicy recipes .<br />I have  become ur big fan in less than a mnth duration from pakistan.U are the best baker."}, {"text": "These brownies look so delicious and tempting! No words for these. Just absolutey love your creativity in the kitchen, Gemma."}, {"text": "This looks AMAZING, I&#39;m going to have to try this!"}, {"text": "looks so yummy 😍"}, {"text": "This had me drooling 🤤 ❤️"}, {"text": "Omg! The brownies look sooo fudgy!!! Can I put walnuts in them?"}, {"text": "Do you need to sift the dry ingredients? I don&#39;t think I have a sifter"}, {"text": "Please show us how to make brioche!! :)"}, {"text": "Looks good"}, {"text": "wowwwwwwwwww!!!! looking so yummy and texture was awesome and the top layer is perfectly cook and inside sooo good"}, {"text": "I just woke up and now I have to go to the market and buy these ingredients !! 🤤🤤"}, {"text": "Pls make best ever donut recipe"}, {"text": "Waaao Gemma that is super hit recipe 😋 gonna try soon . Love the idea of adding chocolate pieces in brownie 😚😚"}, {"text": "Oh my Gemma !!! Now I really got to go bake this brownie !! I&#39;ve cooked your Victoria Sponge cake last week as am testing cakes for my wedding :p Am doing my own cake and OHHHHH YESSS ! My man said he doesn&#39;t want any cake but this one !! Will thus do your naked wedding cake in less than 1 year :p"}, {"text": "Definitely making these:)"}, {"text": "It looks so sinful and divine.😍 Will surely try. I am new to baking so would love to ask what is the difference between cake and Brownie. <br /><br />Also difference between cupcakes and muffin.<br /><br />Have read several things on Internet but can&#39;t come to a conclusion. Please help."}, {"text": "Finally! I&#39;ve seen this recipe on  your website. It&#39;s good to have a video for the brownies! Thanks Gemma!"}, {"text": "I have been waiting for this recipe for a long time! I&#39;m so excited to bake these! I&#39;m definitely stopping at the store today."}, {"text": "Seriously Best everrrr😘🙌...Gemma u r d best👑💃"}, {"text": "Brownies have to be one of my favourite sweet treats (gooey ones are my preference!) however I&#39;ve tried tonnes of recipes and I can  NEVER get them right! I&#39;ll definitely try these and get back to you Gemma!"}, {"text": "When you&#39;re on a diet but these look too good.."}, {"text": "The BEST👊👊👊"}, {"text": "I love your channel so much and thanx for the great recipes! I love your cooking energy😊.. Can u pls teach how to make Tiramusu pudding?"}, {"text": "im baking them right now❤from slovenijaa❤"}, {"text": "Hugs and kisses from  Ireland"}, {"text": "Hi gemma his is sejal your best ever browine look very yummy and very good and amazing"}, {"text": "Gemma, what do you think of NatureBox&#39;s Pumpkin Seed Pralines? I love them so much~!"}, {"text": "I saw brownies, I clicked on the video."}, {"text": "Hi Gemma! These brownies look absolutely amazing! Sadly, I can&#39;t consume dairy :( What can I use to replace the butter?"}, {"text": "Do you have a gorgeous recipe for blond brownies, I am not a chocolate fan, I only crave it when I am low in Magnesium , but I love blond brownies.."}, {"text": "To bad we have too listen to a commercial, and then have too somewhere else too find the recipe."}, {"text": "<br />This is heaven ! Yum :D . Finger licking good. Gemma can I put some raising agent in there ? Because I want it cakey. Also could I fold in some whipped up egg whites ? To incorporate the air."}, {"text": "Gemma you are looking very happy in this vedio. amazing brownies you have made."}, {"text": "You should try The swedish cake called &quot; kladdkaka&quot; it&#39;s so much better than brownies 😍😍"}, {"text": "Gemma Stafford can you make a carrot cake with cinnamon and coconut? My mom is making it and the taste is very delicious just take some carrots and sprinkle it with some cinnamon and coconut and just make vanilla cake and put the carrots inside the vanilla cake and bake it and very yummy cake is waiting to eat😋<br />"}, {"text": "Totally going to try it <br />Look delicious 😋"}, {"text": "oh my goodness 😍 I love how fudgy these are. xxx"}, {"text": "I&#39;d love to see you make &quot;&quot;Lunchbox Goodies.&quot; Bolder versions of classic school lunch snacks like Fudge Rounds, cereal bars and zebra cakes. Would be a fun way to make classic lunch room snacks but with the kids!"}, {"text": "I Love this one..... soo much...... I will definitely try this one😄....... Love you and your recipes"}, {"text": "Hi Gemma. I&#39;m really curious to know how to get the shiny and crackling top for  brownies? Some recipes that I&#39;ve tried doesn&#39;t give me the appearance as I want it. Is it my oven temperature or my way of mixing?"}, {"text": "Wow I must have waited forever for this recipe and it&#39;s finally here!!!I&#39;m definitely trying these brownies this weekend."}, {"text": "Been waiting for this!"}, {"text": "Even though I don&#39;t eat brownies I will make them cause I have tried Miss Gemma &#39;s recipes and they always turn out to be awesome"}, {"text": "Hi Gemma, i will try this for sure, i have several different Brownie recipies up my own sleve, but this one seems to bring it all together.<br />Also would you be interested in doing a traditional &quot;Tiroler Nusskuchen&quot;?<br />It would fit right in with your style of bold baking, and i know you would love it.<br />I have a link to illustrate what kind of cake i mean:<br /><a href=\"http://www.chefkoch.de/rezepte/780521181141380/Tiroler-Nusskuchen.html\">http://www.chefkoch.de/rezepte/780521181141380/Tiroler-Nusskuchen.html</a>"}, {"text": "I&#39;m drooling! Must make these this weekend! Thanks. 😋"}, {"text": "Yummy!! These look delicious!! I love you so much!!😘😘😘"}, {"text": "the brownies look so yummy gemma!!! definetly goona make them!! Q: can i put powdered vanilla? <br />if put the mix in a rounded tin? ❤👌👌"}, {"text": "Please let it be available to deliver in Trinidad and Tobago soon<br />Most snacks and healthy packages are delivered to most countries besides Trinidad and Tobago<br />Please let it be available soon!"}, {"text": "you should make  sizzling brownies"}, {"text": "Making these right now😍😍 they look amazing❤️"}, {"text": "Popsicles please !"}, {"text": "Can we use just white sugar in place of brown sugar?"}, {"text": "wow really was wanting this❤tnku"}, {"text": "Yummm but gemma i tried your brownies for salted caramel triffle but it didn&#39;t turn out good and fudgy "}, {"text": "So you&#39;re saying this one&#39;s BETTER than the one you already had?<br />oh my"}, {"text": "next cookies"}, {"text": "Marvellous recipes, Gemma! Can&#39;t resist to watch these mouth watering and decadent recipes. Tried so many of them, wonderful as always, all thanks to you. Lots of love from India!"}, {"text": "Can you do a chewy brownie pleeeeeease??"}, {"text": "It&#39;s so embarrassing to actually drool on your screen.  That money shot with the finished brownies....heaven!  Definitely making these the next time we&#39;re craving brownies...ha...that implied there&#39;s no time I don&#39;t crave brownies."}, {"text": "So glad I came upon this channel! Been trying your recipes for a while and every single one of them have given me amazing  results !"}, {"text": "Making. This. As. Soon. As possiiiibbbllleeeee. 😋❤️"}, {"text": "Hi Gemma can you please do a muffin mix please I used to work in BB&#39;s coffee &amp; muffins here in the U.K."}, {"text": "Gemma,are you married ?"}, {"text": "They&#39;re definitely big and bold... for sure- Gemma Stafford 2017."}, {"text": "THESE ARE AMAZING!!!!!!"}, {"text": "Oooo yes ! Food is life 😋😋😋😋"}, {"text": "I love u! Your ice creams are amazing, we have beeb trying some of them this summer. And the crazy dough too! 😘<br />I will try this brownies next, but now, my husband asks if there could be a recipie for blondies (he doesn&#39; like chocolate 😱). I wish you lots of love and more success ❤"}, {"text": "You look extra happy in this video, i love it😀 this brownie recipe makes anyone happy, they look to die for😍😍 yum yum!!"}, {"text": "Thanks Gemma!!!!<br />We really love your recipes  continue making them ....<br />All the best"}, {"text": "I would love to bake this but I don&#39;t have cocoa powder! I was going to use Starbucks hot chocolate powder but then you stopped me. :P Anyways, the brownies look delicious!"}, {"text": "It&#39;s weird how brownies are one of the basics yet it&#39;s hard to find a good recipe. Thank you this looks delicious 😍😋"}, {"text": "Yummmy"}, {"text": "Hello Gemma. You were able to tell by looking at the batter is is going to be really delicious. BT just watching I can tell it is awesome! Also I hope to see a smores mug cake"}, {"text": "these look so delicious😍😍"}, {"text": "If you say it&#39;s the best ever, it has to be the best ever, hands down :)"}, {"text": "The look itself shows how rich and moist these brownies are! I never really do this but these brownies are definitely gonna be baked by me! Lots of love for the hardwork you&#39;ve put into that! 💜👏"}, {"text": "This is funny because I saw that pic of your brownies the other day and tried to look for the recipe. So I just had to google one lol."}, {"text": "I am so eager to try these! I am obsessed with your original &quot;best ever brownie recipe&quot;, I can&#39;t even imagine how these will taste!"}, {"text": "Gemma u are @wesome n so are your recipes......... Please add Asian recipes and deserts too😙"}, {"text": "I tried to bake some and according to my husband &quot;they were cake brownies &quot; I&#39;m confused what&#39;s the difference?"}, {"text": "Can u microwave it instead of baking it?"}, {"text": "So, I looked around YouTube a bit, and I don&#39;t know if it&#39;s possible to make, but I got an idea for a really evil devil food cake.<br /><br />A dense, fudgy devil food cake with chocolate chips or chunks in the batter, chocolate frosting, topped with nuts.  Basically, like a giant brownie that&#39;s so chocolatey it will destroy your teeth."}, {"text": "How do you know when a brownie is done? I like mine a little less done and less chewy. Sorry if this doesn&#39;t make sense. Thanks! These are amazing!"}, {"text": "hey guys is there any way i can prevent the chocolate from sinking to the bottom?"}, {"text": "Amazing... definitely making these today!! Thanks for sharing this mouth watering dessert."}, {"text": "I&#39;m totally getting the naturebox thing"}, {"text": "Best ever cookie"}, {"text": "I just checked the written recipe and there&#39;s huge amount of sugar in this recipe, in fact in all brownie recipes I&#39;ve found online. And everytime I follow a brownie recipe it turns out extremely sweet it gives me a headache. What do I do? How do I know how much sugar to reduce?"}, {"text": "That is looks so good 😋😋😋😋and the pizza recipy I made it for my friends and they loved it🍕🍕"}, {"text": "I love Brownies so much ❤️ can&#39;t wait to try this"}, {"text": "These brownies look so good, thank you for making this video Gemma"}, {"text": "can you show us how to make speculoos cookies?"}, {"text": "G"}, {"text": "SnAAAAcks"}, {"text": "Hi Gemma! Any recommendations for brands of cocoa powder? I never know which to buy. 😆"}, {"text": "Can I use vanilla essence instead of vanilla extract?"}, {"text": "also gemma can you do a live stream it would be so fun"}, {"text": "hi Gemma! i would love to make these brownies but i have an allergy to dark chocolate, can i put milk chocolate chunks in instead of dark or will it make it go funny?"}, {"text": "These look amazing!!"}, {"text": "It really gets in my nerves when youtubers do &quot; percent off &quot; or give aways and they&#39;re only in the USA or Ina certain country. If ur gonna do a giveaway or discount make it international ffs 🙄"}, {"text": "Ohhhhh hhhhhhhhh yum gonna bake this for my church coming week"}, {"text": "Hi gemma I am your big fan what kind of cocoa you used in the recipe sweeted or unswweted"}, {"text": "I&#39;m going to mix all the dry ingedience in a mason jar so I&#39;ll have my own homemade vrownie mix ^^ these look awesome!"}, {"text": "DIVINE!! 😍 LOVE FROM INDIA! LOVE YOU GEMMA 😘"}, {"text": "Gorgeous"}, {"text": "so good"}, {"text": "I love seeing how excited she was for these!"}, {"text": "Like before watching"}, {"text": "Can i add walnuts to the brownies?"}, {"text": "weed brownies"}, {"text": "Were do I wright your. Ame because I&#39;m getting confused"}, {"text": "How to get the chalky part on the top.... I never that bit correct"}, {"text": "I&#39;ve been craving brownies forever! So happy this came!"}, {"text": "If I wanted to make a cake with this batter would adding 1 more cup of flour and 1 tsp and 1/2 of baking powder do and milck? (i want to make a cajeta and brownie cake cover with darck chocolate fudge for my birthday,  I know you have a brownie cake but I didn&#39;t like the tipe of brownie cake I got afther adding extra flower and milck, I want to be realy dense and chocolaty but not super dense or caky)"}, {"text": "In every video I want to subscribe to you again!😍 (not joking, I am writing this comm becouse of this) ❤️"}, {"text": "yummmmmmmy !!!"}, {"text": "Brilliant i even tried ur nutella brownies they were damn delicious"}, {"text": "heyy gemma, plzz make an airy moist butter scotch cake"}, {"text": "Yummm I really want to try it"}, {"text": "Yummy!"}, {"text": "Hi Gemma I simply love your cooking ❤️😘"}, {"text": "Not too late to watch your video. Love u so much"}, {"text": "I was waiting for this video!"}, {"text": "THAT LOOK SO DELICIOUS &lt;3"}, {"text": "Yummmmm<br /><br />Love from India ❤❤❤❤"}, {"text": "Wow this looks amazing Gemma!"}, {"text": "wow just wow!!!!! Gemma."}, {"text": "I put in an order with Naturebox using your code! :) I know I&#39;ll love it. <br />Also, these brownies are amazing looking!!"}, {"text": "Superb and mouth watering brownies<br />just thinking to make brownies and ur video is there:-):-)"}, {"text": "Everytime i watch your video, Celine Dion&#39;s face comes in my mind 😅"}, {"text": "what cocoa powder brand did you use Gemma?"}, {"text": "They actually look like the best brownies 😍😍yummy 💙 Gemma  what can be used as a substitute for egg whites ?"}, {"text": "I just got a kitchen aid mixer yesterday and so excited to try one of your recipes!! Lots of love!!!😊😊"}, {"text": "More ice cream flavors Gemma! Caramel fudge brownie flavor!"}, {"text": "I&#39;m definitely gonna try this recipe!!  by the way, what if I don&#39;t have any white sugar??"}, {"text": "Nature box come to south africa"}, {"text": "Can I use white sugar instead of brown?"}, {"text": "I love your recipes. They are always the best. I am 13. And you inspire me so much."}, {"text": "Hi , can u make walnut pie recipes?"}, {"text": "It looks fantastic...Can&#39;t wait to try..."}, {"text": "I love your accent and especially your best ever brownie recipe! Thanks for sharing your recipe ❤❤❤ Also I don&#39;t think I have a 7x11 pan. Can we use another size pan? If so, what size would you recommend? I&#39;m sure baking time will be different too?! Thanks Gemma!"}, {"text": "I can&#39;t wait to make these!!!"}, {"text": "Can you make choclate plzzzz"}, {"text": "Gemma i have a bigg doubt i dont have an oven what shall i do!! Can we use microwave one or anything else plss reply i wanna try this soon it looks amazing!"}, {"text": "milk chocolate will work or can i skip adding chocolate?"}, {"text": "Hey Gemma! I wanted to ask if I can use dark Dutch processed cocoa powder in this recipe? If so, will it be the same quantity because I find that dark cocoa makes cakes very black. Plz do reply"}, {"text": "Please do bake without microwave/oven"}, {"text": "Plz do a collab with Rosanna Pansino .."}, {"text": "Hi Gemma! I can&#39;t wait to make these brownies, they look so good!"}, {"text": "I love your way of expressing recipes and you too 😗 you are so cute."}, {"text": "Great to know we can make brownie without melting chocolate+butter+sugar together first and all done in one bowl."}, {"text": "👌"}, {"text": "Can u divide this recipe in half for me cuz not alot of peole eat sweet stuff at my house. I kind of suck at dividing recipes could u pls do that for me"}, {"text": "🙃really looks delish!!!!!!!  Thanx"}, {"text": "Sooo cute 😍😍😍😍 . Where do you got those bear claws ????"}, {"text": "Hi lovely gemma"}, {"text": "Ohh I will definitely try it tomorrow and father went to buy those ingredients of brownies :-)"}, {"text": "Gemma try sizzling brownie I hope u will love that"}, {"text": "i love your videos so much!!"}, {"text": "I love your channel Gemma.  I was just wondering how you would make these a bit less gooey?"}, {"text": "Looks so good!! Do you have to add chocolate chips? I sometimes see brownies without them."}, {"text": "i love you Gemma. i love all of your recipes &lt;3"}, {"text": "I was looking for a brownie recipe to make today,but l couldn&#39;t find any good one ,and just then my notification came and l knew it was a video of Gemma and when l saw the title went crazy.And by you,it is a win win.Thanks for sharing the recipe. I am going to make this right now."}, {"text": "Tastyyyyy.... Yummm"}, {"text": "Love your vids <br />Please do a tropical  themed sweets"}, {"text": "💗"}, {"text": "YASSS GEMMA !!!!🙄"}, {"text": "Woah!!! Those are really big and bold!!! Make a no bake nutella cake or maybe cheesecake combined with nutella?"}, {"text": "Hi Gemma your videos are so colourful and i am everytime exited for your  new video 😍😘<br />Loved it 😍"}, {"text": "Oooh garlic pistachios! Yummyyy"}, {"text": "So tasty I will try the best ever brownie in the work by my fav chef love you"}, {"text": "Wow!!!! Love you loads !!!"}, {"text": "Hi Gem😘😘😘!!! (Bcoz you r a gem)You inspired me to bake.(I am only 12)Love u so much.<br />                      -Aysha from Dubai 😍"}, {"text": "Oh Gemma they r decadent gorgeous brownies yum yum thank u for sharing great job 👌"}, {"text": "Gemma, can you show us how to make twinkies because in Dublin I can&#39;t find them and everyone&#39;s saying they taste great. I never tasted them"}, {"text": "early 😊😊😊😊❤"}, {"text": "OMG SO GOOD"}, {"text": "Hi Gemma"}, {"text": "My mouth is watering...😍😍"}, {"text": "I hope the next video will be about samosas😍"}, {"text": "I had to watch this in HD. THIS IS SO TEMPTING"}, {"text": "Wow i always prefer fudgy Brownies so this is awesome!!"}, {"text": "Gemma how about a best ever tiramisu? 😊<br />Love your videos! Thank you for the delicious recipes, and I will make these brownies this weekend since I&#39;m a chocoholic and I absolutely just love brownies! My favorite dessert by far."}, {"text": "Gemma where do you get your baking utensils my birthday is coming up"}, {"text": "And another question since when you started this channel"}, {"text": "i thing this is the best ever brownies i have ever seen thanks gemma"}, {"text": "I love your videos so much! Could you make more Starbucks Frappucino videos?"}, {"text": "Thanks"}, {"text": "its only been 9 mins and so many likes wow"}, {"text": "its only been 9 mins and so many likes wow"}, {"text": "Omg💜 this looks amazing😍...<br />Btw..can we use chocolate chips instead of chocolate chunks??"}, {"text": "I love brownies, especially chewy ones😊"}, {"text": "Dark coco nom noms xDDDD It sounds interesting😂😂 BROWNIES! Wooooo when a chocoholic sees Gemma baking a chocolaty brownieeeeeeee~ Im DEEEAD！ A must try recipe!! Btw, i&#39;ve sent you some photos of the goods that i made with your crazy dough through instagram and my name is xxcherriefoxyxx. Hope you&#39;ll take a look at it!❤❤"}, {"text": "I finally have a good brownie recipe that actually seems good. I&#39;ve been craving brownies for some time now.....mmmmm"}, {"text": "I could listen to that accent all day, love the way you say &quot;lovely&quot; lol"}, {"text": "I&#39;m Too early today"}, {"text": "Soooooo hungry"}, {"text": "finally"}, {"text": "This looks yumilicious. ..please make a marshmallows ,corn  syrup,corn starch free edible clay please all recipies on YouTube has all of these please I want to make it for a birthday on next Sunday please"}, {"text": "In the last video i mentioned bout brownies n here u r gemma;)) I know tht this video ws nt filmed cause of my comment bt u read minds:* N ull always be my inspiration😄😄 Love from India😜😍"}, {"text": "¡¡Hola Gemma!! I was wondering that since next month in September is Mexico&#39;s independence day, you could make a short series about Mexican drinks like tamarindo, horchata, Jamaica, etc and some desserts such as flan, pan dulce, arroz con leche etc. It&#39;s ok if you don&#39;t have time but I thought it might be a cool idea. Gracias😊"}, {"text": "***comment"}, {"text": "i was third in commen again yay"}, {"text": "You know Gemma I hate your channel I&#39;m just 10 I can&#39;t bake"}, {"text": "Sad news for me.....<br />I really like the garlic pistachios but as I am from India I won&#39;t be able to enjoy the street <br />But never mind I will really try your best ever brownie these are really best ever"}, {"text": "OMG I&#39;m always looking for a good brownies recipe. Now I know we&#39;re to find it💖"}, {"text": "WOW... a &quot;must try&quot;recipe!! TYSM for sharing this fantastic recipe..😘"}, {"text": "Woooow. Gonna make them right now!!!"}, {"text": "Oh yum!! Please do a collab with Rosanna pansanio! Please 😘💝love the brownies"}, {"text": "I absolutely love Gemma&#39;s channel!!!"}, {"text": "Gemma since when you start baking"}, {"text": "Yum yum yummy"}, {"text": "These look SO good! Thanks for the recipe 😉"}, {"text": "I clicked the video right away when I received the notification. Brownies is ❤❤❤. Thank you for this recipe Gemma. Much love from the Philippines."}, {"text": "OMG! Ive never been so early!!!❤❤❤"}, {"text": "Oooh~  I just LOVE brownies!!!"}, {"text": "Even though I don&#39;t like brownies, I&#39;m still going to watch the video and I&#39;m going to give these brownies a try. Greatings from Croatia."}, {"text": "I love your channel so so much Gemma!!! Love your recipes"}, {"text": "gemma can i ask u a qs what is ur hobby"}, {"text": "Gemma I can&#39;t wait to see your gemma eats series I live in Dublin and very few people that are on YouTube are Irish"}, {"text": "I &#39;ll definitely try this gemma and would of course share my views on it .....thank you for all the best recipes till now...m a huge huge huge fan of urs dear love you and love from India...☺"}, {"text": "Gemma I think I am early I am here before 10 views"}, {"text": "these brownies are amazing!!Gemma you should do a Q/A session"}, {"text": "Im so hungry from looking at these brownies!!!"}, {"text": "Thank god I&#39;m one of the first ten people....... 6th, by the way its my birthday, can I get at least 50 likes and a comment from Gemma ?????"}, {"text": "Looks amazing!"}, {"text": "love brownies! can u make some gummy candies gemma?"}, {"text": "🎵Brooooooowniiiiiiiies! Brooooooowniiiiiiiies! IIIIIIIIIII loooooooooooove brooooooowniiiiiiiies!🎵<br />Thank you, Gemma."}, {"text": "Lots of love from lebanon💛<br />Can&#39;t wait for you to reach 2M subs😍❤"}, {"text": "heyy!! this is soo good!!!"}, {"text": "jemma these brownies look delicious yummy ur the best i will make them"}, {"text": "YAS!!!! Finally!!! Thx Gemma🍀"}, {"text": "Gemma please make coffee cream frosting which is made with eggs and please also make pakistani/indian gulab jamun 🙏"}, {"text": "Hi Bold Bakers! These are the ultimate brownies so I really hope you make them (recipe here: <a href=\"http://bit.ly/GemsBestEverBrownies\">http://bit.ly/GemsBestEverBrownies</a> ). And I hope you enjoyed my Trip to Ireland video ( <a href=\"http://bit.ly/GemsTriptoIreland\">http://bit.ly/GemsTriptoIreland</a> ). Get ready to travel with me in my new Travel Food Show, Gemma Eats... beginning this Monday, August 7th at 8:30am PT. Enjoy!"}, {"text": "Yossssss was waiting for dis!!!"}, {"text": "6 views 53 likes???😕😕"}, {"text": "Hello"}, {"text": "Deliciouss...😍😍"}, {"text": "Hi Gemma !!! Wow ! Best brownies!!!!❤️❤️❤️"}, {"text": "I make it ice cream come today they turn  out perfect....pls reply"}, {"text": "Sixth view"}, {"text": "Amazing"}, {"text": "iam third again"}, {"text": "Soo early 1st time"}, {"text": "Looms yummy 😋"}, {"text": "So good❤️❤️"}, {"text": "I&#39;m definitely making these"}, {"text": "first"}, {"text": "Hi"}, {"text": "very early 😅"}, {"text": "Yay! I am first but about lemon cookie dough?"}, {"text": "It looks yummy 😋"}, {"text": "ayyy im the first one to commmeeeennnntttt add me on snap: fadumd50 :)"}, {"text": "first"}, {"text": "I&#39;ve never been so early for a video in my life"}]