[{"text": "love you bro"}, {"text": "Still selling this tv?"}, {"text": "Vc é BR?"}, {"text": "Is it Oled?"}, {"text": "what is the name of the game that you run ?"}, {"text": "my tv is also curved. did it recently after the falcons lost superbowl"}, {"text": "Weird to see a white guy with my name 🤣"}, {"text": "does it have built-in  chromecast?"}, {"text": "Answer: NO <br />You are welcome"}, {"text": "I have an LG 55&quot; OLED 1080 3D curved TV and the picture is awesome! I especially like that I can sit on the side and it looks just as good as sitting directly in front. ...i&#39;m looking unto getting a bigger TV (70&quot;) and I want to stay with my current format of LG OLED and possibly upgrade to 4K... Great review but I do love my curved LG OLED..."}, {"text": "rip NCIX"}, {"text": "I just bought a 65 curved samsung but now I&#39;m thinking a flat 70 lg . What should I do?"}, {"text": "Can someone please tell me....I dont have home internet but iv got unlimited data on my ph that I use for everything. I&#39;m wanting a smart TV to mirror my phone to watch my movies. So can I wirelessly connect to netflix on the TV, thru my phone? Like my bluetooth?"}, {"text": "great for a small room, but not so much for a room 400 sq ft or bigger"}, {"text": "I wanna buy a 55&quot; nsansui 4k tv is it advisable to buy it over 43&quot; LG"}, {"text": "Nice I have a 55 Ich Samsung curverd TV and I like it"}, {"text": "I like my curve, because every tv is flat and it&#39;s been like that for years."}, {"text": "That curve thing ..just a fad  -probably gone in 5 years."}, {"text": "what is the game please ??"}, {"text": "sony ZD9 all the way"}, {"text": "just came 2 day with led"}, {"text": "Why my television never clear like this i have the same tv"}, {"text": "I&#39;ve got tha1"}, {"text": "This tv have hdmi 1.4? if this have 2.0 it can do 4k 60hertz whith hdmi 2.0....."}, {"text": "Thank you."}, {"text": "how does image quality compare to the sony 800 series?"}, {"text": "Does the tv have screen share with your laptop and phones?"}, {"text": "I don&#39;t know why everyone says the curve reduces glare. I found that in the store it made the overhead glare much worse. To clarify, the flat didn&#39;t even have a glare and the curve had it all the way across in 2 places so that the center of the picture I could hardly see over the overhead lights. Lmfao. I would just stay away from the curve unless you watching in a dark room at night or have a corner to stash it away."}, {"text": "Curved TVs and monitors distort and stretch literally all content. It&#39;s just a marketing gimmick that barely makes any sense, to keep idiots buying new screens. If you&#39;re buying a 4K Sammy, just get the flat model."}, {"text": "I&#39;ve bought Samsung curve tv 4K, had it for less then two years and faulty signal popped up saying &quot;problem with cooling fan and to will switch off&quot;.  Manufacture warrantee is only 1 years which mean I&#39;m F**ked,  sorry just upset.  I suggest you think twice do your research what are the most common problem with curve TV before you purchase one.  Otherwise TV it self is a great TV."}, {"text": "Wtf irs such a wast of tume"}, {"text": "For cereal"}, {"text": "No thanks curve tv last only 1to2years maybe less very fragile I rather watch my crt flat screen 32inch lasted 20years the screen is solid like a rock even remote tennis ball anything throw at it won&#39;t crack while curve tv screen break easily suck 2thump down"}, {"text": "Does it have an optical out option"}, {"text": "Get to the point.   bla bla bla bla bla  we don&#39;t need to listen to all the nonsense bla bla bla  get to the point and tell the difference between flat and curved.  that&#39;s all     2 thumbs down."}, {"text": "I just bought the qn55q8camfxza Samsung Qled 4K 240hz monster. I&#39;m literally hard as a rock waiting for this thing to come in:)"}, {"text": "I got one of these my mom brought it"}, {"text": "thanks. why are 4k tvs typically 60hz and not 120hz?"}, {"text": "Trine is such a beautiful game"}, {"text": "So... is it 4k or not ?"}, {"text": "Curved monitors are amazing, curved TV&#39;s are shit (unless you live alone)"}, {"text": "Does it has built in free WiFi ???"}, {"text": "What is the name of the spartan/roman looking game that you were playing?"}, {"text": "show more of the tv not u n i will enjoy it more"}, {"text": "Honestly curved is autistic. Would you pay 55&quot; for $1200?"}, {"text": "is good for ps4?"}, {"text": "What game is he playing on there?"}, {"text": "That&#39;s the tv I have but I don&#39;t have that control"}, {"text": "I had a 48&quot; curved samsung tv and I really loved it, the immersive experience is fantastic!"}, {"text": "So curve is worth it right,?"}, {"text": "can someone reccomend best settings for Picture ?"}, {"text": "Corney review🤦‍♂️"}, {"text": "Love this tv. I have the same."}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=0m44s\">0:44</a> UHD, 4K and 2160p are all the same thing"}, {"text": "limited at 30 hz ??? man get a better one i play in 4k 60 hz !!!!!!!!!!!!!!!!!!! nothing is limited !!!! check your settings uhd colors must be on for consoles on pc i never had a problem it direct went to 60 hz asson as i conected the tv   3840 x 2160  and 4096x2160 both run in 60hz"}, {"text": "Where did you get the keyboard from"}, {"text": "hello<br />whats the name of the game that was you played on it?"}, {"text": "I got a curve in my johnson"}, {"text": "👌👌👌👌"}, {"text": "He sounds like a gta YouTube stunter"}, {"text": "Wondering about the refresh rate at 3840x2160, all the specs indicate that it&#39;s capable of 60 Hz at that resolution. Could it be that the reviewer was using cables specced at less than HDMI 2.0?"}, {"text": "Thank you so much. Helped me loads. Was about to waste my money. In the Bahamas there is not a lot of 4K content available. This is not a good buy for my bedroom wall. Wow. Didn&#39;t think about that stuff. Again, thank you."}, {"text": "WHaaat ??? Go curved and you&#39;ll never go back end of story... The same goes for 4K... if you want to save money, don&#39;t buy TV!! WTF"}, {"text": "@HardwareCanucks , Can you plz tell me the title of Game u were playing in this video (The first one) ??"}, {"text": "Can anyone please tell me, which game was he playing??"}, {"text": "SHOULD I BUY THE 55INCH SAMSUNG CURVE TV OR NOT ....."}, {"text": "Where do you get the freaking money for this stuff?"}, {"text": "How much is it"}, {"text": "please help. My samsung 4k Curved Smart TV model U55HU7100UXX keeps tripping off every 10 minutes and coming back on. What is the problem. What component part is responsible that I need to change?"}, {"text": "curve is not worth it unless it&#39;s a monitor."}, {"text": "I just purchased a 65&quot; Samsung Curved SUHD 4k 9500 and it&#39;s the best picture I&#39;ve ever seen, I know there&#39;s nothing in SUHD yet but it&#39;s nice to be ahead of technology."}, {"text": "samsung always has a fake look to the picture sony is way better color their more natural"}, {"text": "i bet you this dumb ass has a hdmi 1.2 running  from his pc which does not allow 60fps at 4k only 30 theres no way the tv doesnt run 60 fps that makes absolutely no sense"}, {"text": "Finally a good breakdown."}, {"text": "you look like an european version of Chris Pratt"}, {"text": "Et j&#39;ai un problème comment on enlève le song de la télé Samsung 4K courbé et maitre du song quand on va sur Google ou YouTube avec la télé bien sur"}, {"text": "what is that footage starting at <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=4m50s\">4:50</a>???  I want to go there..."}, {"text": "Should of got a 5500 4k series it&#39;s cheaper than curved 8500 series"}, {"text": "The lack of 4K at 60hz is enough to not bother with it."}, {"text": "was going to buy this until he said it&#39;s not true 4K, looks like im going to have to keep on looking."}, {"text": "Can someone tell me which Camera he is using for this video?"}, {"text": "This looks like a really nice TV.  I&#39;m limited to the size of TV i can put in my setup currently.  So I went for the 43&quot; Sony XBR-43X800D, and it also has the HDR capabilities.  As far as  samsung curved displays I picked up two smaller monitors a 27&quot; and 24&quot; for my computers.<br /><br />I think the curve is better suited for a computer monitor then a TV, but either way look good in both environments.  S;peaking of Android TV, the sony runs it.  Overall it&#39;s been a good experience.  I use external set top boxes for the most part."}, {"text": "can you adjust the black bars on either sides when using it as a pc monitor?"}, {"text": "can you adjust the black bars on either sides when using it as a pc monitor?"}, {"text": "Plasma forever"}, {"text": "Does anyone know if it has cinavia protection? ??"}, {"text": "I find 60FPS movies on a 4K TV too fast and the only time it helps is during shaky cam movies like in the Bourne series. This wouldn&#39;t be an issue for me. Of course the more FPS when gaming the better but not necessarily for movie viewing or even TV shows. I hate that soap opera effect."}, {"text": "Could this replace a PC Monitor?"}, {"text": "4K like lol"}, {"text": "Great design flat tv i guess"}, {"text": "which android game u r playing on ur tv pls rply"}, {"text": "4k are not in 60 fps??? Damn this sucks"}, {"text": "cyka blyat idi nahui?"}, {"text": "We just got our first 4K TV today, a 65 inch curved Samsung 4K UHD smart TV.  Can&#39;t wait to get it set up later!"}, {"text": "im need the tv please"}, {"text": "what the camera?"}, {"text": "I love that your playing Trine 2 in the demo ;)"}, {"text": "I also bought the new 2016 Samsung  9.1 surround sound 65&quot; it connects to the Samsung via Bluetooth.  No wires.   It&#39;s pretty awesome"}, {"text": "I only paid $100 extra for the curved version of the 2016 Samsung One connect"}, {"text": "Samsung one connect is the best tv for 4 K.  You never will have to buy another tv.  U only need to replace the one connect box when they upgrade to 5 K 6K or 10K.  I love that part."}, {"text": "Beware of ultra flix.  They stream 4 K in STEREO.    NOT 5.1.  to me it&#39;s a joke how ultra flix claims to have the largest library of 4 K movies yet they don&#39;t know how to stream in 5.1 SURROUND SOUND."}, {"text": "Hell yeah. It&#39;s worth it.  I got a 2016 one connect and took it back for the curved version for $100 more.  Totally worth it"}, {"text": "trickster"}, {"text": "muzammil niyazi"}, {"text": "does this support mirror casting off your android device?"}, {"text": "Is he Russian and American?"}, {"text": "my TV is also curved (outward) CRT though 😂"}, {"text": "Excellent review.<br />One of the better on Y/T.<br />Thank you"}, {"text": "Uhd video"}, {"text": "I have the older model samsung uhd9000 and it is working on 60hz on my ps4, u can also make it 60hz on pc by playing with some options. Make sure to turn on game mode."}, {"text": "Is this tv for gaming ?"}, {"text": "what was that game with ROME warrior ?"}, {"text": "When you connect your PC to the TV, how do apps(e.g. Photoshop) and text appear? Are they legible"}, {"text": "Dmitiri = Russian;accent is Russian guys."}, {"text": "whats the differencr between uhd and 4k"}, {"text": "а почему не сони? он лучше?"}, {"text": "i hate the way you talking. it is not fit at all. some sort of sissy tune. sorry i was just being honest"}, {"text": "for cereal guys"}, {"text": "Pals one This work truly    sounds m~thicblvideo   .."}, {"text": "love your accent, where u from dude?"}, {"text": "this is why i got a stand that can change the angle of the tv I have almost the exact tv just not 3d"}, {"text": "What would be the exact same tv model but non curve?"}, {"text": "used this model, but had to sell it after 4 months.. Curve is a gimmick.. feels gives the bow tie effect and causes alot distortion from different angles,  Samsung yet again markets it as a new Technology when it isnt and is more or less a cosmetic gimmick.Also the upscaling isnt very good compared to other brands..namely Sony"}, {"text": "What game were you playing? Looks great"}, {"text": "what is the name of the game on <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=5m40s\">5:40</a> ?"}, {"text": "I don&#39;t really care about 4k, hell I still watch regular DVD&#39;s but I do want a smart TV with a good UI, responsive and some decent apps. Been looking at the UN55JU6700FXZA"}, {"text": "What game were u running??"}, {"text": "Is the apple TV worth it if you have a smart TV?"}, {"text": "Does it make any difference if one uses an UHDMI 1.4 or 2.0 or they are about the same shiznit?"}, {"text": "whats the point of buying a 4k tv when most games aren’t in 4k?"}, {"text": "try out seiki  u vision cable hdmi cable  su4kc1 model  it healps out lot for money and  budget  for best out  of any 4k tv picture quality"}, {"text": "Gimmick. Distortion if your not sitting right in front.<br /><br /> Just something TV companies are using to make people want to buy a new TV"}, {"text": "technically not 4k just uhd so why MY FIRST 4K .... on t name of t vid? ridiculous fk yt liars"}, {"text": "where is the elephant in the room"}, {"text": "Not a real 4K t.v.         Anything less than   4.4.460hz-120hz. Unless u have high end gpu. This is pretend &quot;upscaling.&quot;No hdmi 2.0 ?"}, {"text": "It is possible to game at 60fps at 4K on the new Samsung SUHD&#39;s. They changed it to accommodate the new 4K Bluray players which are able to play up to 60FPS video. Good example is the Samsung UN55JS9000. It doesn&#39;t cost any extra for the curve and it&#39;s gone down considerably in price."}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=1m13s\">1:13</a> you missed a plastic strip. Take it off...now."}, {"text": "A curved version only makes sense if it&#39;s over 60&quot;, it&#39;s meant to have more a theater type effect and you can&#39;t get that with smaller sizes."}, {"text": "not worth it"}, {"text": "I still don&#39;t know how you pay for all this stuff...."}, {"text": "I love my smart TV, but for some reason I can&#39;t connect my MacBook Pro to TV to show power points. I tried HDMI of computer to HDMI of TV but it doesn&#39;t work. Any idea how to fix it. Thanks"}, {"text": "Hello I recently bought a 65&quot; Vizio-D-Series w/ Clear Action 240 and 120hz effective refresh rate with 4K resolution and I have to assure you that watching Daredevil in UHD is phenomenal, I was wondering if there is a difference between this model and the 65&quot; M-Series."}, {"text": "I&#39;m torn between 55&quot; or 65&quot; !! Damn !!! My room size is similar like yours bro !!?"}, {"text": "Not for this one, but Samsung curved tv UE48JS8500 (or larger screens):<br /><br />Very nice display quality ! ... IF you are directly in front (middle) of the tv !!!!<br />Move a bit to the left or right, and you loose a lot of color contrast :-(<br />Also the sound on the tv sucks !! Very mediocre for a tv at that price !<br />My previous tv (Philips 42PFL9732D, 7 years old) has a much better sound and better viewing angle. Also at that time even costed less than this one (UE48JS8500)  :-/<br />Very diasppointed !"}, {"text": "what keyboard is that at <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=1m59s\">1:59</a>??"}, {"text": "curve is shit you&#39;ve got to be sat square onto them"}, {"text": "dude composite and component you know what that means n64 graphics on an ultra 4k hd tv woo"}, {"text": "Has a major flaw, it is curved!"}, {"text": "Hi! Is possible get more apps?"}, {"text": "Is there an English version of this review"}, {"text": "Hey,I just bought a Samsung UN65JU6700F curved screen just 2 days ago.Wanted to upgrade our Samsung 55 inch flat screen TV in our living room.Our children&#39;s 55 inch Vizio plasma,9 years old,pooped out,so we upgraded and giving the boy&#39;s our 55 Samsung. We also purchased the Samsung PS WJ-6000 sound bar to g with the bigger TV. So far the curve in the front room makes a difference from the side view,it is a bit brighter when sitting on the side front of the set and looks good,no glare at all.The picture is good,but still need to plat with the settings,and need to upgrade the HDMI cable from the satellite dish to a Digital high speed cable to accommodate the new TV and the Ultra High Definition. I am sure I will need this as I have just the old HDMI cables from a 8 tear old Samsung,with all the old inputs for all the old stuff.The sound bar will need the digital HDMI cable,with the ARC input to the TV.A regular HDMI will not work,need upgrade...Good luck with this TV,lots of upgrades,may need new cables,and watch your inputs of toys,make sure they will work..Good luck,great TV,will not go wrong,...Fingers hurt,Good luck with your new toy,,,,,Bye for now,,"}, {"text": "<a href=\"http://gofundme.com/vgmmrfwk\">gofundme.com/vgmmrfwk</a>"}, {"text": "Loved the game sample, the one with the knight. Which one is that? ;-)"}, {"text": "I have it it&#39;s totally worth it I have the newest version"}, {"text": "And how do all those suckers who bought the 3D TV&#39;s feel about it? lol  I would think you&#39;d be happier with the &#39;best&#39; 1080X60 you can find and probably save a lot of $$. People get hung up on gimmicks but don&#39;t realize the picture quality can still be compromised."}, {"text": "which game was that ????????????? Please somebody.............."}, {"text": "i don&#39;t like curved tv&#39;s. maybe if you are alone and sit straight in the middle it is great, but with more people and different angles, the view distance to different sides of the tv changes."}, {"text": "So you&#39;re russian-canadian?"}, {"text": "1 4k TV as monitor or 2 27inch 1440p or 3 21.5inch 1080p monitors which is better for programming?"}, {"text": "I gotta get rid of my CRT TV"}, {"text": "name videogames? <br /><a href=\"https://youtu.be/yOwZLfjmysY?t=6m8s\">https://youtu.be/yOwZLfjmysY?t=6m8s</a>"}, {"text": "video game ? pleas 06;05 min"}, {"text": "Gee, no support for xrite color calibration?  I&#39;m disappointed"}, {"text": "Using a monitor as your computer monitor???<br />Don&#39;t buy any monitors until they can actually receive good 4K signals via their inputs. Only buy a 4K monitor that has HDMI 2.0 and Displayport 1.3 inputs. With its superior output <a href=\"http://www.youtube.com/results?search_query=%23s\">#s</a> over HDMI 2.0, Displayport 1.3 is going to dominate over the next 4-5 years.<br /><br />The major manufacturers are dragging their feet on this major connectivity issue. Cheap monitor makers aren&#39;t. Go buy a cheap Asian monitor with HDMI 2.0 or Displayport 1.3 for now, if you really need one. New graphic cards with these outputs are coming within months."}, {"text": "Nice review!   but i have a question, what is this Keyboard ? (min <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=1m58s\">1:58</a>)  XD"}, {"text": "True 1080p looks just fine."}, {"text": "i nought this tv today smd its brilliant"}, {"text": "&quot;For cereal&quot;????? Lololol. Stop trying to be cool by copying others. Stupid words and phrases that come and go just make you and everyone else that uses them, a poser. You lost all credibility as soon as you said &quot;for cereal&quot; Plus you have an accent. Plus you are a computer techno geek. Remember the movie &quot;revenge of the nerds&quot;? Anyone who is this into tech and video games is a man child. You have been dealt the cards of life. &quot;Cool&quot; is not one of them. The sooner you stop trying, the better off you will be. I&#39;m sure all your friends are the same. Tell them to grow up to."}, {"text": "when u pay such a premium , lag is not acceptable , i think i will stick wid my hdmi !!!"}, {"text": "The only reason curved TVs exist is to increase production yields on the panels. The rest is marketing spin only. Flat panel is where it&#39;s at"}, {"text": "What is the name of the game @ <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=4m03s\">4:03</a> ?"}, {"text": "People who complain about audio on a giant, expensive 4K TV annoy me. If you can afford a 55+ inch 4K TV, and a curved one at that, you can afford a $50 set of computer speakers with a subwoofer, or at least a decent soundbar."}, {"text": "what keyboard was that?"}, {"text": "Fuck curved TVs. A lot of the time there&#39;s more than one person watching tv at the same time which means that at least one person won&#39;t be in the sweet spot. Flat OLED TVs are the future! Great contrast, the first time I saw a OLED TV (have had a few OLED Samsung phones) it took my breath away, everything pops. Just a pity they are so expensive but worth the money if you&#39;re already shopping in that price range."}, {"text": "I have it, and I love it. But for some reason, my cable doesn&#39;t play in HD 1080p, it only plays like 360p, while my wii u can play 4k on HDMI 4. Can someone tell me what&#39;s the problem?"}, {"text": "May I ask which camera do you use to record your videos?"}, {"text": "what is the game he is playing????? please help!!!"}, {"text": "I just found out about your videos..<br />and loved it<br />it helped me with choosing  if to get the flat o curved screen<br />thanks <br />good videos"}, {"text": "As a film maker my camera can shoot 4096 x 2160 for display to cinema digital projectors or UHD which is about 1 million pixels less resolution at 3840 x 2160.. not a big deal and another odd choice to try and keep pros separated from hobbyists."}, {"text": "At this point in time I would say the curve is actually the only good option for a 4K tv. Samsung only uses the capabilities of SUHD with the curved models."}, {"text": "@HardwareCanucks How good does Trine gameplay look on the 4K?"}, {"text": "the only thing wrong with this tv is that it is heavy as fuck I would pay twice as much or it if thats what it costed thats how much I i know its worth it and if your a samsung type of guy who has samsung accounts and devices just makes this tv even more badass"}, {"text": "is it worth it yes  pinche pendejo"}, {"text": "I have this model and cannot for the life of me get it to play nice with my Macbook Pro (late 2013) through HDMI. Crazy lag renders it useless for this. Films at 1080p and 4K are absolutely stunning, and the curve is awesome for immersion. Just wish I could hook it up to my macbook lag-free for Ableton sessions :("}, {"text": "That tv looks sick"}, {"text": "Dmitry I would have to say comparing a matte PC monitor to a glossy TV panel isn&#39;t totally fair when talking about reflections. That&#39;s just my 2 cents."}, {"text": "i&#39;m using the samsung ue55js8500. maybe the curve will do more when i sit closer"}, {"text": "You&#39;re cute 😉 nice review thank you"}, {"text": "which country do you come from? weird accent ,haha"}, {"text": "This guy should reduce his awkward accent."}, {"text": "I buy today a samsung 4k uhdtv 55 inch, and i regret nothing :)"}, {"text": "The curve is for closer viewing without parallex because to take advantage of 4K you must sit closer than average - thus making flat TV more annoying like sitting in the front row at a movie theater.  <a href=\"http://www.cnet.com/news/why-ultra-hd-4k-tvs-are-still-stupid/\">http://www.cnet.com/news/why-ultra-hd-4k-tvs-are-still-stupid/</a>"}, {"text": "Really nice review.  Camera shots were really helpful.  Very quick but detailed.  I found that I would get lost a little because of the very technical terms, but overall still very good.  I&#39;ve got to say, unfortunately, the hard consonants were a bit distracting, but I got used to it after a while (I live near Brighton Beach, so maybe i&#39;m used to it?).  A Black Friday recommendation would be nice :-)"}, {"text": "I am running my PC in 3840 by 2160 in 60 HZ on my Samsung UHD TV. I dont know why you get 30 HZ. Did you plug in your computer on port HDMI 3? PC in 4K is breathtaking in Gaming and videos."}, {"text": "I failed epically trying to watch this video, went to click on it the first time and somehow exited out of the tab, went back to youtube to get to this video and clicked on the one below it, went back again and clicked on the channel, and back again and now I can finally watch it"}, {"text": "Why is the scaling only at 30 hz"}, {"text": "That voice is Canadian as fuck."}, {"text": "Would this be good with the Corsair Bulldog and Lapdog?"}, {"text": "IR blaster out would have been such a neat feature... 1989"}, {"text": "One thing I miss is that lots of tvs longer have audio out for components or HDMI."}, {"text": "samsung 60hz 4k are pricey. 120hz native samsung 4k is 2x more lolz"}, {"text": "56inch for 4k....ur a fool should had got a 60inch 2 c the real difference"}, {"text": "i have samsung ue-40j6302  :)"}, {"text": "I am pretty sure you need a HDMI 2.0 output from gpu to get 4K @60Hz and i don&quot;t believe the 970 you mentioned has HDMI 2.0 but rather it has HDMI 1.4"}, {"text": "how much price"}, {"text": "Lg 65ef9500 is a flate tv, oled, 4K and new hdmi 2.0a what else do you need great tv"}, {"text": "Just laid down £350 for the samsung UE40J6300, their recent 1080p non-3D smart TV revision. I&#39;m hoping that curve&#39;s going to give me at least +3 CHA and CON, otherwise no dice."}, {"text": "ok guys i wanna buy a new tv and video gaming is my top priority. i have a xbox one. what do u recommend."}, {"text": "I dont think the curve is worth it you hardly notice a curve even close up unless youre looking for it, gotta see it first .Its cool though.<br />As for 4k. In theory It depends on the size of the TV. Its good not to see pixels. <br />Big Ass Tv = more pixels<br />Ultra widescreen is the future too, especially for bigg ass TV. does your bum look big on this OH YES bitch it does. thats why its called a big ass TV."}, {"text": "4k monitor is a very bad investment those time for either TV or PC game.<br />For PC, the monitor is very expensive and if you want to be able to play at 60fps on last games, you will need a 2500$+pc<br />For TV, the amount of 4k content is still poor compared to 1080p. Most of the time it is upscaled 4k.<br /><br />A TV behind 50&quot; for the living room does not worth it, and the price for a 4k TV is over 2000.<br />For PC, you want IPS and 27&quot; and over freesync. Its is at least 700$ + a pc with two GTX980 that will cost you one leg but you will still not be able to play at 60fps on demanding games.<br /><br />So definitly, 4K is a very bad investment for now. In one or two years, the price will drop for 50% and you will be like a clown with your super expensive and old 4k tv<br />Better buy a 1440p monitor."}, {"text": "pff ....LG OLED is KING TV"}, {"text": "they should make tvs that can bend curved and straight."}, {"text": "Thanks for the great review. May I ask which keyboard that was?"}, {"text": "Go back to study the facts!!!"}, {"text": "IMAX screens are the only curved screens I&#39;ll be viewing."}, {"text": "Interesting Preview Thanx :) I looking for 4K TV now but I live in Europe (different market).<br />Regards from Europe"}, {"text": "Interesting Preview Thanx :) I looking for 4K TV now but I live in Europe (different market).<br />I invite You to watch my channel too.<br />Regards from Europe"}, {"text": "4K Netflix and Chill at 30hz? No thanks."}, {"text": "Stop moving your hands around makes you look fake"}, {"text": "great review, will you do a top 5 tvs for gamer`s any time soon ??"}, {"text": "Why did they not do a side by side using the same hardware and showing an actual 4K video instead of just regular HD movies?   That is where the real mind blowing comes in."}, {"text": "i sae them and the new samsung S-uhd 4k is way better than the first generation curved tv the first ones have a distorted washed out angle and the new ones do not i recommend not to buy the cheap curved tvs they look like crap rather just buy a non curved 4k tv for better picture"}, {"text": "That game looks nice. What game it is?"}, {"text": "Game ?"}, {"text": "i have the UHDTV 6700 curved model from samsung. Soap Opera effect sucks!"}, {"text": "does anyone know/own the Samsung UE40JU6750? and tell me if it&#39;s worth it? can&#39;t find reviews or anything"}, {"text": "OMFG! The TV only does 30Hz for 4K?!?! LMAO wow you got scammed. did you end up returning the non-4k non-TV?"}, {"text": "only 1080p 3D?!?!?! I mean 3D sucks quality wise, but GOD DAMN. what a scam tv for real"}, {"text": ":( that tv is not 4k, but you say 4K in the title.<br /><br />stating that it&#39;s not technically 4K at <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=0m45s\">0:45</a> is not good enough. you did not buy a 4K tv. i&#39;m embarrassed to know you now."}, {"text": "If you use a display-port cable rather than HDMI, you can get 4K 60hz..."}, {"text": "I Love the curve"}, {"text": "I mean not even Blu Ray is the standard, people still buy DVD&#39;s.  If you have the money to burn i.e. the lotto, then yeah fine.  But as is there is no real reason to upgrade to something like this. I&#39;ll pass for now. Good vid though!"}, {"text": "can anybody tell me the title of the game? which means side-scrolling game what is played in this video."}, {"text": "ty for the review im in the market for a tv and i dont know if i want the curve or not i appreciate your opinion"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=5m25s\">5:25</a> can someone comment the review video of that tower"}, {"text": "@devilmikey00 Yes, that works but only if you have HDMI 2.0 port. On the source and the TV of course :)"}, {"text": "good for gaming?"}, {"text": "Connect a steam machine or desktop to it and play your games at max settings"}, {"text": "which tv/curved sets displays 4k @60fps nativley?"}, {"text": "HIS KEYBOARD IS SO SWAG. WHAT BRAND IS THAT? I THINK I KNOW, BUT I FORGOT THE NAME! ): :("}, {"text": "Great VIDEO!!!!!!!!!<br /><br />This remind me of my last video! You should check it out. I hope we can become friends and continue to support each others videos."}, {"text": "What are you watching on it? Blurry 720p Tv broadcast or blurry 1080p films?"}, {"text": "wow, i had to use high preformance mode on my laptop to watch this in 1440p and it only ran at 2 frames per second at 4k o_0 impressive...  my laptop is a 2011 HP pavilion dv6 Notebook PC laptop with an amd A8 processor with radeon hd graphics and 8GB of Ram"}, {"text": "4k is the best. Here&#39;s my elite plasma-best 1080p TV ever. Here&#39;s my set up.<br /><br /><a href=\"http://youtu.be/TR80tYG6ig0\">http://youtu.be/TR80tYG6ig0</a>"}, {"text": "WTF? UHD IS 4K, is the REAL 4k pixel by pixel... while 4096 x 2160 is a <br />Cinema 4K mode which has 256 more vertical lines. Make your numbers:  1920x1080=2.073.600, multiply that by 4x the resolution of Full HD: <br />2073600x4 = 8294400, so then 3840x2160=8294400, same pixel by pixel <br />resolution."}, {"text": "4k 120hz tv limited to 30hz on 4k<br />are you kidding me?"}, {"text": "I just ordered the Samsung Ju7100 65 inch for $1874 off of Amazon! I can&#39;t wait to get it by the end of this week! :-) The rtings review said it&#39;s one of the best for gaming due to its 26.1 mbps in game mode! I&#39;m so stoked!"}, {"text": "PFFF! My 60 inch tv is curved too! Mine&#39;s even BETTER bc it&#39;s CONVEX! Haha! Way ahead om everyone!! Yes!"}, {"text": "Id this 3 D ?"}, {"text": "are you in Canada???????????"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=1m23s\">1:23</a> for cerial. :D"}, {"text": "curved tv&#39;s suck, and a good example of that is a footbal match, because the lines<br />on the field also bend in a curve, so everything that is straight, wil bend on the screen, so that&#39;s why curved tv&#39;s wil dissapear as quikly as they came."}, {"text": "Even 1080 p or 720p looks amazing with the 4k upconverting. Trust me it is MUCH better.....compare and you will see."}, {"text": "So much bad info here. First I have this tv and it does 4k @ 60hz check you video card make sure it has hdmi 2.0 also make sure you have golf chip as the nova chip reduces bandwidth. Tv came with 2 different chipsets. <br /><br />The panel is native 120hz but with motion rating 240Hz all 4k tv&#39;s no matter the maker are either 60hz or 120 hz  with motion rating making them either 120hz or 240hz.<br /><br />all 4k tvs play native 4k @ 60hz  ALL!!! you&#39;re only limited by chroma 422 444 so less colours...False info saying @ 4k ur limited to 30hz on this tv maybe ur card is limited to 30hz but not the tv . To turn 4k 60hz on you must choose UHD colour. I am a member of AVS forums so I know what I am talking about fix this review.."}, {"text": "I am the current owner of this TV and this TV does have HDMI 2.0. As long as  you have above GTX 970, you can run this tv as PC monitor with 60hz."}, {"text": "Which Keyboard is that?!?! I NEED IT."}, {"text": "Is there any Tv with 4k on 60fps?"}, {"text": "No hdmi 2.0 no sale."}, {"text": "I have a samsung 60&quot; uhd tv that works very well with my up-scaling 4k blu-ray player. I am also running my computer through it. With a gtx 970 sli set up, I am easily able to run many games in this UHD resolution. But i have to agree, the lack of 60HZ in this resolution really kills it for me. It would seem that i have bought into the 4k fad just a bit to soon. All around i love this tv in my small living room for blu-rays and (to a much lesser extent NetFlix, Hulu, ext.)"}, {"text": "Hli went for the 55inch 4k but flat panel"}, {"text": "what is the name of that game he is playing on nvidia ?"}, {"text": "I was not a believer in curved tvs until I saw 65 inch version. Anything smaller then that is to small. Smaller curved displays might work if used as a desktop computer monitor."}, {"text": "Ok...we have reached 4k, let&#39;s move on to OLED technology that is affordable to the masses."}, {"text": "Useless arguments, instead ponder why are were here in this world, who created us, how many cells, tissues we have? who made them? Allah is creator. What happens when you die, we&#39;ll be asked how we dealt with people, how we made money, most impotently did we follow his directions? He is Master and we are slaves. Watch Nouman Ali Khan on youtube. I am not truing to convert people just delivering the message. Life after life is never ending but this life max is 100 years"}, {"text": "Should have bought a LG OLED, or a Sony 930/940C.  You bought into the samsung marketing hype, gratz."}, {"text": "This TV is last years tv!! the 2014 flagship from Samsung. could you please review this years flagship? JS9500 and the JS9000"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=8m00s\">8:00</a> What`s the name of this game? thanks :D"}, {"text": "Samsung TV&#39;s have the most shittest operating system i&#39;v ever seen.. I got screwed in the past but never again will I buy theirs"}, {"text": "What&#39;s the name of the game he is playing on the shield tablet???"}, {"text": "So if you game on this, it won&#39;t run 60 fps ?"}, {"text": "I want a 30&quot; 4K AH-IPS curved Gsync 240Hz monitor please!"}, {"text": "Think about a non curved 60hz 4k version"}, {"text": "What is the name of the game with the roman and barbarians?"}, {"text": "You get 2160P 30HZ<br />you do not have a card that supports HDMI 2.0 and 60HZ on 2160P"}, {"text": "buys 4k Tv, hooks up pc to wrong hdmi input, blames tv for not running 60hz! talks about sound quality after spending $$$ on the tv over not already having great sound! THUMBS UP!"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=0m42s\">0:42</a> what do you mean technically not 4k? 3840x2160 is 4k...UHD and 4k are different names for the same thing"}, {"text": "Is this good for ps4 gaming for instince facry 4 cod ghosts cod advanced warfare and other first person shooters"}, {"text": "The Walmart Visio is better than that tv, 240hz"}, {"text": "I never understood the appeal of a curved display for a TV. You&#39;re buying a big screen to show content to a lot of people, why limit their view? On an individual PC monitor I might consider it, but then I&#39;d run into trouble if I wanted to use it as a TV later, as i have done before."}, {"text": "Whats it like for ps4 "}, {"text": "I have the hu8550 and all the hdmi ports are 2.0 ....are you sure this model (which is a higher model)is limited to only 30hz ?"}, {"text": "Don&#39;t do the &quot;4 cereal&quot; jokes, kinda cheapens the channel. =&#39;( <br /><br />I really want a 4K Curved TV but I think 55&quot; is small. Seriously going to save up for 60&quot; or up to 70&quot;. I really want a home theater experience rather than just another screen. I basically have my PC setup for all other consumption."}, {"text": "Lol I got an add that said get ahead of the curve "}, {"text": "I got a Samsung 55&quot; 4K TV, it&#39;s actually the exact same model as yours, but without the curve.. I&#39;m extremely happy with my TV, 4K Content from eg. Netflix looks stunning.<br /><br />I honestly can&#39;t see a significant difference from my non-curved TV at home to the curved versions in electronic stores.. Maybe it&#39;s because I don&#39;t sit down in my couch and watch TV like normal, but as of yet I&#39;m not convinced that the curve is any more than a marketing strategy &#39;&#39;Hey look, this TV is awesome, it&#39;s Curved!&#39;&#39;<br /><br />Btw. I freakin&#39; love that remote! Best TV remote I have ever used :D"}, {"text": "Hey, I bought a Samsung 4k 65&quot; TV. The picture quality is not to what I expected. I tried watching Netflix content and YouTube content. The picture quality is blurry. I sit 8ft away from the TV and still looks bad. What should I do to upscale the hd content to a 4k content? Model no un65hu7350 from Canada. Need your advise."}, {"text": "I dont know why, but I feel like if Applemade a 4k Tv, then itll be the only tv anyone ever buys"}, {"text": "So close to being able to speak English. However still not there yet."}, {"text": "I have never looked at my TV/monitor and thought &quot;this is too damn flat!&quot;"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=2m00s\">2:00</a> what keyboard is that?"}, {"text": "I like my TV flat... and my lady curved. K tnx :P"}, {"text": "Ugh, this is so frustrating. Can someone please explain to me why this is advertised as being an 120Hz model but yet only achieves 30Hz at 3840x2160? As far as I&#39;m aware, the HDMI 2.0 spec can handle 4K content at 60Hz and above so why is it limited to 30Hz? All I want is a true 120Hz 4K TV so I can PC game at 3840x2160 at 120Hz. Why is that so hard to ask for?"}, {"text": "Şeker  Mahallesi Lg Servisi  (0312) 367 64 64<br /><a href=\"http://www.lgservis.com.tr\">www.lgservis.com.tr</a>"}, {"text": "Nice tv, was about to get a 4K Sony but then opted out and ordered LG&#39;s 55&quot; OLED."}, {"text": "Should I get Samsung or lg curve tv?"}, {"text": "i see that it&#39;s onsale on amazon right now... not sure why it&#39;s 50% off, but i guess i&#39;ll finally buy it now<br /><br /><a href=\"http://www.amazon.com/LG-Electronics-40UB8000-40-Inch-Ultra/dp/B00N45QF8Y/?tag=leacel0f-20\">http://www.amazon.com/LG-Electronics-40UB8000-40-Inch-Ultra/dp/B00N45QF8Y/?tag=leacel0f-20</a>"}, {"text": "amazing TV"}, {"text": "holy shit, 4K !"}, {"text": "4k definitely not worth it I have a 65 panasonic zt 60 plasma and with a hd source or channels it destroys 4k as there is no picture diffrence that I can notice 4k is just a gimmick like 3d "}, {"text": "How much does it cost"}, {"text": "nope"}, {"text": "Too bad the public will have to bend over and take it deep, while their wallets are being emptied, in order for the generous ISPs to provide adequate speeds necessary for 4K streaming."}, {"text": "do you have some sort of speech disorder?<br />good review though."}, {"text": "What&#39;s the input lag for this TV?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=7m13s\">7:13</a> graphics ARE AMAZING IN 4K "}, {"text": "@HardwareCanucks 30hz makes this monitor a no-go for me. Can&#39;t wait for 120hz or higher."}, {"text": "They say you can&#39;t watch the 4k on through 1080p devices I think they are wrong, I can see the image pretty good maybe not fully but this tv looks nice and superior to any 1080p tv I&#39;ve seen...looking forward for a UHD in the future..."}, {"text": "Hi, would you like to review Android tv vs Samsung and LG OS @HardwareCanucks ? Thanks"}, {"text": "What was the game with the spartan/roman/greek soldier?"}, {"text": "I love the honesty of your reviews. Not in anyones pocket. Good on ya."}, {"text": "This TV runs at 60hz via hdmi 2.0 I had the HU7250 55&#39; curve and I used my gtx 980 to play games at 60hz 4k so your completely wrong "}, {"text": "Fuck no.. Fuck no, not curved.. its a gimmick - it adds nothing to your experience but problems .. a simple flat tv is better.."}, {"text": "not bad for $1200-$1500"}, {"text": "What keyboard is that?"}, {"text": "is there an actual 60hz 4k tv?"}, {"text": "pewdiepie is u?"}, {"text": "I see no reason to get a curved TV on anything smaller than like 85&quot;"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=1m24s\">1:24</a> - for cereal"}, {"text": "$$$$$$$$ !"}, {"text": "What is that keyboard?"}, {"text": "No Displayport..... worthless!"}, {"text": "Still rocking my 360p crt since 2005. I don&#39;t think 4k curved is a worthy upgrade."}, {"text": "Among the 4K TV reviews out there, I gotta say this is my favorite! :)"}, {"text": "what&#39;s that keyboard at <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=2m01s\">2:01</a> ? it&#39;s beautiful!!"}, {"text": "Please do Lenovo Y50 FHD!"}, {"text": "You sure that 30 fps cap was due to the tv? It might be the graphics card which is why i sold my 780s for 980s to hook up to my 4k tv/"}, {"text": "Make a video to show your apartment.You will get alot of views :D"}, {"text": "@HardwareCanucks was just wondering... does this TV have hdmi 2.0 support? it&#39;s confusing to me that there would be a uhd display without one as it limits it to 30hz. Is this the case with all 4k tv&#39;s? or only this particular model... I searched the tv on google and it doesn&#39;t specify on the spec sheet. I understand that there is some electronic wizardry that the tv uses to add frames to movies to generate the 120hz or high frame rate experience I was just under the impression that the tech was available as an auxilary display for a 970 or 980 through hdmi 2.0. I apologize I don&#39;t tune into your channel that often so I don&#39;t know what kind of audience your channel caters to but... why is it that it only does 30hz? is it because it doesn&#39;t have hdmi 2.0? is it because this tv came out before hdmi 2.0 was finalized? is this just a stupid display and it does have hdmi 2.0 but still shows you 30hz?"}, {"text": "You should get the LG 34UC97. It&#39;s curved, 1440p and 21:9"}, {"text": "I would use a curved with a racing simulator so then you don&#39;t need tipple monitors with bezels."}, {"text": "I have a 65 inch one"}, {"text": "I think it&#39;s worth mentioning that Sony doesn&#39;t think that curved tv&#39;s are worth it. They discontinued all of theirs a while back. I would have to agree."}, {"text": "What game are you playing?"}, {"text": "what is the name of the game?"}, {"text": "You do not need a curved dispay if you watch it alone, so, monitors especially!"}, {"text": "When I was looking for a new tv about 6 months ago, i found that most of the 4k tvs had very high input lag. I ended up paying more for a 1080p tv with low input lag, where I could have gotten a similar sized 4k tv for less.<br />I&#39;m curious if this new set of 4k tvs are better in this regard. "}, {"text": "I hate too much this Curved TVs, just keep in mind, if you invite friends, family, etc.. to play videogames, or watch a movie, whatever, anybody will have the same point of view, yeah maybe looks pretty awesome, but theres out there some others tvs with the same definition, but doesn&#39;t be curved, remember its a TV not a Monitor, it&#39;s ok if you buy a Monitor curved but only if the Aspect Ratio is 21:9"}, {"text": "<a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=1m25s\">1:25</a> i see what you did there"}, {"text": "if this puppy can run the 4k @ 60hz at least, i would make it my next &#39;&#39;wtf are you thinking&#39;&#39; monitos"}, {"text": "wow this has av still. thought that was gone"}, {"text": "Don&#39;t need curve like big I have a Samsung 55 inch. And 30inch dell 2550x1600 non 4k or retina stuf I&#39;m a linux guy so looking at a prompt don&#39;t need 4k but like multiple big screens ;-)"}, {"text": "Don&#39;t trust the audio communication after seeing the youtube syndicate channel. About what companies do with voice input kind of scary no just give me a BIG. Normal chapped tv like 65inch"}, {"text": "I need help with this, I want a 50 inch or bigger 4k screen that can do 60hz and I mean true 60 so I can hook my beast pc up to it? Does one even exist? Hope u can help me, my 1080p 40 inch is starting to die"}, {"text": "try out LG 34UC97"}, {"text": "OMG that remote.. I want."}, {"text": "After the 840 Evo SSD fiasco, dead fab workers i Korea and snooping TVs, there is no way I would buy a Samsung TV."}, {"text": "My Visio does 60hz at 4k. you just have to plug it in the right hdmi port. I&#39;d assume it&#39;s the same with the samsung."}, {"text": "30hz, no deal. I&#39;m looking forward to 120hz+ 4k screens with some form of anti tearing built in. Give it a couple of years..."}, {"text": "Lame."}, {"text": "what was that little keyboard?"}, {"text": "30 hz is maximum even on display port?"}, {"text": "For some reason, I&#39;m reading the title as, &quot;My first $K Ca-ching $mart $$&quot;. Is that normal?"}, {"text": "Please give me name this case from <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=3m25s\">3:25</a> :DDD"}, {"text": "TV: Eh... Sure. Cool.<br />That case though. FUCK. That&#39;s beautiful."}, {"text": "i gotta get me one of these"}, {"text": "Nice hoody! What brand is that?"}, {"text": "I think that a curve in tvs is useless unless its the size of a movie theatre projector screen. I do however think it would be useful in monitors because your sitting so close to it that the curve would actually do something for you"}, {"text": "What&#39;s the name of the game? "}, {"text": "Have to sell my house first."}, {"text": "What are the gametitles you used please? They seems funny!"}, {"text": "You know what I fucking hate with those tvs? If you wall mount the close to a wall the ports are impossible to get at"}, {"text": "I like the idea of UHD televisions but I won&#39;t ever buy a Smart TV of any kind as I don&#39;t like the options that they can just shovel ads at some point down the line. Plus I have devices hooked up that access all the content anyway. Guess I&#39;m never getting a TV beyond 720p or shitty 1080p"}, {"text": "Nice review,thank you Dmitri."}, {"text": "Hey can u do a unboxing video and review of the astro a50 ps4 modell?"}, {"text": "Is this a good build?<br />What can i improve?<br /><a href=\"http://pcpartpicker.com/user/Airsnark1/saved/q3sWGX\">http://pcpartpicker.com/user/Airsnark1/saved/q3sWGX</a>"}, {"text": "I want to buy the Asus PB248Q i dont do much photoshop and such stuff. but do you think its still worth it for gaming? I dont think a single gtx 970 can push the newest games to 120-144fps"}, {"text": "i`m just waiting for a cheaper 1080p oled tv to upgrade"}, {"text": "How can people. Complain about bad sound on a flat screen TV? It&#39;s flat so you can&#39;t really put any impressive drivers in there! An external system is very much needed when dealing with a TV without a soundbar. "}, {"text": "The downside is that you have to sit perfectly in front of it to enjoy the curved experience. <br /><br />I&#39;m waiting for the TVs that are &quot;bendable&quot; I guess. So you can adjust the curve to your liking. Some were showcased at CES I believe. "}, {"text": "Hello.  May i know whats that LED keyboard? Thanks "}, {"text": "Have you got any rendering tips for Sony Vegas? I see a lot of degradation of my content in quality after rendering and uploading to Youtube."}, {"text": "What side scrolling game was that?//"}, {"text": "You pretty much confirmed everything I thought about curved TVs that isnt just &quot;omg amazing&quot;"}, {"text": "what game is that?"}, {"text": "I like my curves"}, {"text": "Nigel good is awesome"}, {"text": "I have a 32&quot; tv that I rarely watch, mainly because most channels air painfully dumb programs. Even news are not worth watching due to the biased nature. I stick to my 18&quot; lcd acer vga monitor for now :) I might replace it in some time in the future, when I finally see good enough reason to build myself a new gaming rig, but for now I do not feel like experimenting. This monitor is doing fine for years now, and it doesnt seem like its going anywhere any time soon :)"}, {"text": "I got rid of my TV in 2005 and haven&#39;t had one since. I just don&#39;t see much use for them anymore. "}, {"text": "30hz ... no thanks <br />i&#39;ll wait for 120hz 4k monitors and strong GPUs to run 4k with high frames <br />could be in two years ?"}, {"text": "Curved needs to die along with 3d. Waiting for hdmi to catchup to the year 2015 and oled tvs are the norm"}, {"text": "Great review. Enjoy the TV."}, {"text": "Lg 21:9 34  3440x1440 rew please would be nice."}, {"text": "whats the input lag? g2g response?"}, {"text": "There is a curved 21x9 samsung monitor I was looking to buy, also for editing and drawing etc, i&#39;d love it if you could review it cus there aren&#39;t many reviews out there :)<br />34&quot; Curved Monitor Ultra WQHD S34E790CN"}, {"text": "maybe if you use a matte screen protecties it will get rid of the sparklies"}, {"text": "it blows my mind how this channel only has 160K subs. great content that&#39;s well presented and not littered with ads. keep up the great work guys!"}, {"text": "What&#39;s the game running at around <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=7m15s\">7:15</a>? Thanks in advance."}, {"text": "All Dmitri does on the weekends is sit around and watch HardwareCanucks videos on his TV. :p"}, {"text": "Fantastic!!! I absolutely love your videos!!!"}, {"text": "The curve is always worth it"}, {"text": "Anyone using composite with this is an idiot."}, {"text": "My friend has the 65&quot; version of this TV and its GORGEOUS!!! Unfortunately these TVs are not capable of 4k @60Hz... only 30Hz..."}, {"text": "Ahh yeah I have 4 of these babies for my gaming setup"}, {"text": "My opinion of purchasing a variety of Samsung products is that they lack finesse. So I would be very reluctant to go down that path again. Curved tv? Maybe. 4k? Sure, but I would wait for another brand."}, {"text": "I have a feeling to get 300hz in 3D mode 4k resolution we are going to see bulky fans attached behind the tv soon. Just like video cards getting bigger and bigger over a 2% improvement from reference specs."}, {"text": "4k gaming at 30 HZ<br /><br />NOPE"}, {"text": "Trying to watch this but my crappy internet is pushing the quality to 144p :( I&#39;ll come back later"}, {"text": "chicks don&#39;t dig the curve :("}, {"text": "I thought we got past the 30hz 4k tv&#39;s? Wasn&#39;t that just a thing in first wave 4k&#39;s from a year or two ago?"}, {"text": "man trine two really is a beautiful game"}, {"text": "If you have the money you can try out 4k cheaply with this<br /><a href=\"http://www.amazon.com/Seiki-SE39UY04-39-Inch-Ultra-120Hz/dp/B00DOPGO2G\">http://www.amazon.com/Seiki-SE39UY04-39-Inch-Ultra-120Hz/dp/B00DOPGO2G</a>"}, {"text": "please tell me were u got that keyboard"}, {"text": "waste of money until 2020"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23RealTVsHaveCurves\">#RealTVsHaveCurves</a>"}, {"text": "only thing in 4k is pc games "}, {"text": "Bro I just got the Hu7200. Let me ask you.. a few issues here. Are you able to get 2k resolutions? 4:4:4 60hz 4k?"}, {"text": "Mmmmm... Definitely upgrading to 4K soon!"}, {"text": "Why do you have &quot;LinusTechTips&quot; and &quot;MarquesBrownlee&quot; in your tags?"}, {"text": "Great video, although on my end there was some crackling, it scaled with my volume so I believe it might be from source, other than that thumbs up"}, {"text": "What keyboard is that at <a href=\"http://www.youtube.com/watch?v=yOwZLfjmysY&amp;t=1m58s\">1:58</a>!?"}, {"text": "I have the LG 34UC97-S.  Once you go Ultra Wide, you never want to live without it.  After the beauty of seamless 21x9, bezels on a multi-monitor set up make me nauseous.  With display port, it is 60Hz at 3440X1440, absolutely amazing. "}, {"text": "Actually you could play at 4K 60fps with this monitor its not 30fps!!"}, {"text": "i bought one of the 90 inch samsung like a couple yrs ago lol it was worth the money an i luv it so much i had trouble drivin it home in my audi r8 lol everyone ask me if i need them to take it home for me lol i say no!!! i got it anyways i luv 4k so much"}, {"text": "You have such great content I just wanna watch your videos all day. Except its 11 and I&#39;m busy tomorrow :/"}, {"text": "If you are buying a 1000+ dollar 4K TV then you should probably be able to afford a separate sound system."}, {"text": "My internet can&#39;t handle 4K video. "}, {"text": "Trololololololololololololololololololo "}, {"text": "Could you do a video on the best 4k tv available under 4000$"}, {"text": "Cool Video"}, {"text": "Dmitry you&#39;re gonna be hearing about the typo in your title forever unless you delete and reupload"}, {"text": "Just wanna mention the typo in the title (curved)"}, {"text": "FIRST!! Just bought a 60 inch 4k curved TV myself, i really enjoy it"}, {"text": "Ops.. Typo! &quot;Surved&quot; ;)"}]