[{"text": "FIRST!  Since you all love them so much....timestamps below!<br /><br />Fave Case:  <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=1m55s\">1:55</a><br />Best Budget Case:  <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=3m06s\">3:06</a><br />Most Innovative Case:  <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=4m16s\">4:16</a><br />Best Case for Water Cooling:  <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=5m50s\">5:50</a><br />Coolest Features:  <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m02s\">7:02</a><br />Fail Compilation:  <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m39s\">8:39</a><br />Case of the Year:  <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=10m43s\">10:43</a>"}, {"text": "Every single item I have ever bought from NZXT, has had multiple problems with it. From case fans, to the Kraken X62, the USB hub and also my Hue devices. I will NEVER invest in NZXT again. As for cases, I will challenge you to show me an updated or older case, which can compete with the Cooler Master Maker 5T. It is almost completely modular, almost entirely with thumb screws, has a psu shroud where the gpu is at least 5&quot; above it, can handle a 280 or 360 AIO and all covers are magnetic instead of screwed down. Space is excellent, as it can handle an atx or eatx mobo, and air flow is superb. All of the pcie rear cover plates are slotted for ventilation, and the top has two areas for ventilation where you can add or remove covers. There is plenty of room and tie-downs for cable management on the rear, and access ports from rear to front. My only complaints about this case are the red color of the inside, and the ridiculous apathy Cooler Master has to providing an updated Face-Plate with USB 3.1 type A &amp; C ports. It would be so easy to do. Outside of that, this is the best case I have EVER used. I look every year to see if there is something better, but every case, INCLUDING the &quot;updated&quot; cases from Cooler Master, fall well short, and are found wanting..."}, {"text": "Didn&#39;t know Star Lord was PC Enthusiast. Cool!"}, {"text": "WTF happened in that intro?"}, {"text": "Lian li coming back"}, {"text": "No front mesh= no buy. That&#39;s my rule."}, {"text": "2019 plzzzzzzzzzzzzz"}, {"text": "I know this video is old but I just stumbled upon it. Your reviews is beyond on point. Thank you."}, {"text": "coolermaster masterbox td500 is the case i used for my first gaming pc"}, {"text": "What do you think about the cougar evo rgb?"}, {"text": "Do you know where I can get a cheese greater case built like the new mac pro 2019??"}, {"text": "Good video tho"}, {"text": "Bro you look kinda like star lord from the avengers 🤣😂"}, {"text": "Just got Define S2. Looks amazing already, especially coming from Inwin 303. Inwin is beautiful but such a pain to work with and doesnt end up looking that good."}, {"text": "Please do the best itx"}, {"text": "The goto channel for all your case review needs"}, {"text": "Nothing said about be quite 900 rev 2 !??? U lost my support 🙂"}, {"text": "a 2019 version is a must. please"}, {"text": "God I hate myself for building my first pc in the h500m, I couldn&#39;t even get the rgb hub working."}, {"text": "i have the case at <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m30s\">7:30</a> dose anyone know the price of it ?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m42s\">8:42</a> the burn 😂"}, {"text": "well have ordered the lian li 011 but blackdynamic"}, {"text": "why does new cases just dont care about disk drives xD<br />its such a pain in the ass to find a good case that has room for my blueray drive"}, {"text": "what&#39;s the case in the background? Corsair 500D?"}, {"text": "I came here for cases, left with a new array of colourful insults"}, {"text": "Where did you get your desk lamp?"}, {"text": "I agree the 011 dynamic is the best case of all time. Until someone designs one better."}, {"text": "I know no one hardly ever use blu-ray disc player or even dvd player, but I&#39;m still looking for a case for that."}, {"text": "Bro I came here to find out the best case and now I’m confused because you threw in bad casess"}, {"text": "NZXT H400!!!!!!!!!!!!!!!!!"}, {"text": "Hey ! Nice vid. Where do you got your pc stand that is right next to your desk. It&#39;s exactly what i need. Thanks."}, {"text": "All of those cases are garbage compared to the Cooler Master Haf Evo XB\r<br />Motherboards are made horizontally at the factory for a reason.\r<br />Plus you won&#39;t need to mod anything to have your video card to be vertical."}, {"text": "Where is the Cooler Master h500m?"}, {"text": "Can you review the new Thermaltake H200 case?"}, {"text": "You should add a new category: the best mini itx case"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=10m18s\">10:18</a> makes sense now, why the verge said an Allen key is required."}, {"text": "Thank Goodness for Lian Li Dynamic<br /><br />Dual Chamber concept is totally Genius"}, {"text": "I have the Lian Li O11 Dynamic and don&#39;t recommend it for AC, it&#39;s only good for LC/AIO BUT! <br />- If you have an AIO on your GPU and it has wide PCB like 2080Ti Kingpin - it won&#39;t fit, the tubing sticks out too much, or you&#39;ll have to squeeze it very hard with the side panel (not recommended). It does work when you mount the card vertically tho.<br />- Big AC like D15 or BQ DRP4 won&#39;t fit, too tall<br />- The latches on the glass panels feel very wonky, you only slide them in from above and the top panel prevent them from falling out.<br /><br /><br />Otherwise perfect case if you have 2 AIO&#39;s."}, {"text": "I like the nzxt h200. Super nice"}, {"text": "the H500 is $160 !!! not $70..."}, {"text": "Dimitri reminds me of Chris Pratt a bit"}, {"text": "I didnt know Chris Prat was such a computer enthusiast"}, {"text": "Can you add a new mini-itx / micro-atx case section here, ok thx"}, {"text": "Why did the q300l you showed have the window on the right?"}, {"text": "Building next week! Should I go with h500 or p350x?"}, {"text": "45 degree wallet cleanser lol"}, {"text": "Every single of of those are horrible. I have 4 3.5 hard drives, 2 2.5 drives a 165mm Air Cooler, a Blu Ray recorder and a 5.25 hot swap cage. NONE OF THOSE cases could fit my hardware. NONE! I hate these new retarded trend of AIO-ready and 5.25-less cases.  They are stupid. AIO is worse than AC and 5.25 bays still has many uses available. I guess I&#39;ll have to stick with my Cougar MX500 ad infinitum."}, {"text": "you said it right at the beginning . NZXT. mee to. technically perfect. with rgb lightning inside looks great."}, {"text": "I just stuffed all of the components and cables in the fridge. Works great."}, {"text": "Dmitri! What is that build in the background? If you already made a video on it, please send me the link; otherwise, please make a review video on it"}, {"text": "Why is it so fashionable for case reviewers to put plants on top of cases ??.  If you water those plants you will only burn that PC, unless they are plastic plants, in which case it would be worthless to put it on top of the case anyway. Who would use something arrficial to give the sense of nature and truthness?"}, {"text": "Is There A big difference between meshify c and p400s tg temperatures ?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=2m41s\">2:41</a>..that is just f. horrible temperatures and no wonder why knowing how terrible airflow that case has. You have great videos but I wish you actually recommend actual good cases to people. When it comes to computer case, the thing which matters the most is airflow and thermal performance. Everything else is almost not important because it is very subjective."}, {"text": "Hahahahahaha case industry is prettt much like pakistan economy atm.. fucked"}, {"text": "I love the Lian-Li, but it&#39;s too expensive, for me Fractal Define S2 is the best for its price."}, {"text": "no cougar  conqueror?"}, {"text": "do u have a picture of the lian li dynamic with all the coolers, I would like to see ur intakes/outakes."}, {"text": "&quot;You know it&#39;s very nice to have handles on the CoolerMaster Q300P, So you can easily carry into the garbage.&quot;<br />Bruh_<i>_____________</i>"}, {"text": "Where is the Thermaltake V200 😑😤 that case is BEAST with 3RGP fan 12v controller  for just $69"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m40s\">8:40</a> hahahahha"}, {"text": "500d fits my radiators a little too perfectly<br />My first watercooler build (probably last?) And the tibe between the 2 rads is just a bit big bit is soooooo close it doesn&#39;t really matter, had to put both in at once and the right fit made it a freaking nightmare...looks great now but not easy especially for a first timer.<br />Edit of note I used the black ice 360 and 280 flowers otherwise I would have had at least one tube going across the radiator on top...ugller but easier to fit"}, {"text": "I WANT THAT WOODEN SCALE MODEL CASE SO BAD! :(<br />I tweeted  Coolermaster and they are not planning on bringing them back D:"}, {"text": "lol starlord(the guy that punched thanos in the face when they almost got him) has a youtube channel?"}, {"text": "I wanted the phanteks but seeing 82 C on the temps puts me off.. thats the temps im getting now with my case with the glass on. Would like to hit lower 70s under full load."}, {"text": "No Evolv X? O.o"}, {"text": "Is the Fractal Design Meshify C still a relevant option?"}, {"text": "The Define R6 USB-C still best case."}, {"text": "I need a case for 2 slot server 2011 motherboard. A nice one."}, {"text": "To be fair to be quiet they don&#39;t market the 801 or 601 as having good airflow or cooling, they market it as being quiet....which it is."}, {"text": "Don&#39;t know if it&#39;s 2018 but I&#39;m happy with my recent purchase of the white Fractal Design Define R6."}, {"text": "Bro this helps a lot thanks"}, {"text": "Man call me old school, but I wish more modern cases included at least one external drive bay... I&#39;d like to have a 4k Blu Ray optical drive at some point."}, {"text": "why ur intro is so long"}, {"text": "Planning my first ever build soon, the Lian li 011 dynamic is the case i choose looong ago, great to see it here getting some love. I cannot wait to build in it, think it will spoil all other cases for a while."}, {"text": "Starlord, is this relevant for 2019?"}, {"text": "if you squint your eyes he looks like chris pratt"}, {"text": "why u look so much like quill from guardians of the galaxy XD"}, {"text": "What is name of the cpu cooler behind Dimitri at <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=10m35s\">10:35</a>? It looks really good!"}, {"text": "Cosmos 2 is trying to recreate something that Raven series have  - but its bad copy. Plus weight of Cosms 2 is making that case totallly unusable."}, {"text": "but have any of you tempered panels broken yet?"}, {"text": "Hi can you guys tell me what case can I buy? H500,h500i,h700 or h700i, which can I buy?"}, {"text": "LMAO the pun at <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m40s\">8:40</a>"}, {"text": "does anyone know if you can use any case for any pc build <br />trynna build my first pc"}, {"text": "Dmitry, you must be a very good person."}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=6m02s\">6:02</a> 8 FICKING FAAAAAAANS!!!!!"}, {"text": "What&#39;s the case at <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m51s\">7:51</a>, Streetcom.2?"}, {"text": "You look like chris pratt"}, {"text": "In one word people... Buy only the one and only best case Lian-li PC-011 dynamic. Don&#39;t spend your money on different products!"}, {"text": "👏👏 Case Review 👏👏"}, {"text": "I love the lian-li pc 011 air ghey onoy have to fix the size so we can put big air cool CPU"}, {"text": "The PC 011 Dynamic seems neat, but I keep hearing about the adhesive failing on the tempered glass panels. Maybe next time they&#39;ll use screws to keep the panels captive to the bits that slot into the case for assembly so no one has to worry about coming home to a shattered panel all over the floor by their desk."}, {"text": "public comment"}, {"text": "I&#39;m getting an MC500P because I still need an optical drive."}, {"text": "I just built a PC with the RaidMax Alpha Prime. Its a solid mid tower and budget friendly. I have a video on my build. I&#39;m moving away from the larger cases. Good video. Thumbs up."}, {"text": "Am I the ony one who doesnt need tons of RGB and a side window?"}, {"text": "Спасибо, Дмитрий"}, {"text": "I have coolermaster n500m. Orsan good case"}, {"text": "There is one unpopular case whitch is called <b>chieftec scorpion II</b>"}, {"text": "I need to know what case you&#39;re using in the background"}, {"text": "i love my corsair 500D. since i don&#39;t mess with my case very often (just cleaning). it has never been an issue for me. got to love the hinged doors!  :)"}, {"text": "Hi!<br />I actually have a corsair carbide spec alpha case and I want to change it, but I don&#39;t know what new case I have to purchase. I want one who the cable management isn&#39;t so terrible, a epurate case and I want to be able to put my cooler master ml120 at the back of the case. I was interested in nzxt h500i, fractal meshify c and phanteks p400s. Can you give your opinion and tell me what is the best case?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=10m43s\">10:43</a> Lian Li O11 Dynamic"}, {"text": "Thanks! Here i am spending my tax money, an stuck on the most important part of a pc. The CASE! Thanks again for helping !"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=5m38s\">5:38</a> tf was that?"}, {"text": "I like NZXT 500 and 500i"}, {"text": "&quot;so you can easily carry it into the garbage&quot; that took me out..lmao."}, {"text": "What case is that on the desk behind you during the intro and outro?"}, {"text": "The O11 Dynamic is undeniably innovative and easy on the eyes. However, the 155 mm CPU cooler height limit is a deal-killer  for those who want a beefy air cooler."}, {"text": "Where can I buy that wooden Cooler Master case??"}, {"text": "I cannot find the 011 Dynamic available anywhere that isn&#39;t $40 above the regular price. seems to be sold out!"}, {"text": "I have looked at every ITX case google could ever find.   The vast majority of them are hideous.  I&#39;d really love the H200 with the front 100mm chopped off.  I want to run a D15 cooler with a full size ATX PSU for silent operation and don&#39;t want the case to be so excessively large like the H200 would be if I don&#39;t use a CLC.  I&#39;ve looked at so many other cases that are somewhat close and not that ugly but usually have awful air flow issues.  It seems actual builders don&#39;t design these cases :-("}, {"text": "P400s is my fav"}, {"text": "My favourite case is the nzxt H700i"}, {"text": "Your video on the PC-O11 dynamic was THE REASON I pre-ordered one for my build this year! Yes, I even put 9 fans in mine as well (6x LL-120s w/ commander pro, and 3x ML-120s for the 360mm rad).<br /><br />THANK YOU for your reviews, they are amazing and helpful, and I&#39;m so glad I took your advice!! &lt;3"}, {"text": "watching and still rocking my not so new phanteks pro- m tg... not worth to buy a new case imo at this time."}, {"text": "God. Damn. That last case is sexy as hell!"}, {"text": "HardwareCanucks Would you still recommend the R6 from fractal?<br />Right now i am about to build a pc with z390 f-gaming monther board, 32gb ddr4ram 3200mhz, i9 9900k, rtx 2080 ti, 2x 1 tb 870 evo ssd, corsair H150i Pro licquid cooler.<br /><br />But i am not totally sure about what case i want to put this inside. I love my old tower &quot;Cooler Master Storm Trooper&quot; But i want to try something new, and the storm trooper gets alot of dust inside of it over a shorter time and i want to avoid that. <br /><br />Any helpfull tips is welcome &quot;On towers/cases only please&quot; :)"}, {"text": "wait, your name is actually dimitri?  are you serious?"}, {"text": "Dear Dmitry why Lian LI costs  237,57 € in EU computeruniverse @HardwareCanucks"}, {"text": "How do I get my hands on that collectible cardboard case???"}, {"text": "What is the best matx case. Price. Doesn&#39;t matter"}, {"text": "I have a question. If you know about the Thermaltake Core X2, do you guys think it has good air flow? Im new to pcs and stuff and I cant find many good reviews about it."}, {"text": "only moron could think that putting usb ports on top would be a good idea..."}, {"text": "That store is dog shit"}, {"text": "Not a single one, has room for an optical drive!!!"}, {"text": "Well waddya know, my new 275R made in into the Fail compilation. At least it&#39;s just for bad side panel design, not crippling thermal problems."}, {"text": "Why do you look like star lord"}, {"text": "Thanks to this video I got myself the Lian Li Pc-011 Dynamic and it is amazing and definitely deserves to be case of the year"}, {"text": "The Level 20VT is shit. But it&#39;s a really beautiful looking piece of shit!"}, {"text": "Best case I should buy?"}, {"text": "Definitely agree with your choice of your favorite case because the H500i is really amazing with preinstalled RGB Lights and Fans"}, {"text": "What&#39;s the best  case for a full tower, best airflow, modularity, mesh over Glass, and good materials, and cable management? I don&#39;t care about glass and hate the front covered. Sucks that 011 air is too small for most tower coolers. They need to bring back and upgrade the cooler master haf x (no glass) and the Silverstone raven 2 (upgraded) with more mesh and no dumb glass."}, {"text": "&quot;very nice to have handles so you can easily carry it into the garbage&quot; LMFAO I spit my water out when you said that"}, {"text": "Is the H500i worth the extra price over the non i version?"}, {"text": "I skimmed through this video, found no Thermaltake cases shown.   I know the optical drive is considered dead, but you should have at least included 1 case supporting for us Experienced PC users."}, {"text": "youd have to be a cock eater to buy that quad stellar"}, {"text": "NZXT s340 Elite no question, the h500 is ugly as fuck"}, {"text": "And no silentiumpc cheap cases?"}, {"text": "he looks like chris pratt"}, {"text": "Well, gna go ahead and assume I&#39;m not the only ones whose plastic cable management clips in the s340 just snapped right off. Glad to see they changed them up in the h500"}, {"text": "Why has no one looked at the raidmax enigma? It&#39;s like a small cheap O11!"}, {"text": "It&#39;s frustrating that so many front panels are solid and provide no airflow. Especially from a brand named CoolerMaster, I have a Masterbox and also dropped 10* after removing the front panel."}, {"text": "Yeah I like the choices. I like the stying for the case.of the year."}, {"text": "I like the H500 from Cooler master"}, {"text": "you are the best"}, {"text": "what is the name of the background song?"}, {"text": "NZXT H500i vs Fractal Design Define C TG vs Fractal Design Meshify C TG for quiet and good cooling rig?"}, {"text": "lovely video....you rock bro...."}, {"text": "Thanks for this video 😊"}, {"text": "Oh Yeah Yeah"}, {"text": "It got to that fail comp and it felt like a roller coaster then you&#39;re just out of breath looking at that case of the year like it already took the money out of your wallet"}, {"text": "Why open cases are more expensive? They make them whit less material and protection...🤔🤔🤔sorry my english is really bad"}, {"text": "Can we just take the time to admire these videos. The shot, editing, music all come together so beautifully. It creates a this sort of timeless feeling that allows you to truly appreciate the artistic side of PC&#39;s. The pure style and aesthetic is on point. Keep up the good work!"}, {"text": "I own the cm Q300P lmaooo and yeah it’s aesthetic but garbage airflow 40 on idle for cpu and around 65 when gaming with highest settings no fan tweaks and gpu blower type is 74 on gaming highest setting."}, {"text": "Obviously here in Italy the Lian Li is around 300 euros a.k.a. 340 dollars :D"}, {"text": "whats with flower pots and pc cases?"}, {"text": "Can’t go wrong with a Corsair case! 😛 am I rite?"}, {"text": "I went with the Corsair Spec-Omega RGB. great look, decent airflow, cable management is very limited but manageable. Also I have lots of Corsair RGB parts such as aio, ram, fans and etc, so it is nice to keep all RGB in the same ecosystem."}, {"text": "I don&#39;t get why &quot;Canuck&quot; channels give us only USD pricing. I got all excited over a h500 for 70. But couldn&#39;t find one. Boo."}, {"text": "uploads videos about top cases but none of them are linked..."}, {"text": "I want that wood pc sooooo badly. I love it."}, {"text": "I wish CM made a Tg version of the Q300L."}, {"text": "Is this good build?<br />I5 3470, palit gtx 1060 3gb, 8gb ram, H61m motherboard... I don&#39;t know whether 450w psu is good or no. Pls help me"}, {"text": "I wanna buy that mini cooler master case!"}, {"text": "O11 Dynamic best"}, {"text": "&quot;..whoever designed the level 20 VT has an even lower IQ..&quot; bruhh I dieded"}, {"text": "If this is a good year, I am glad I missed last year.  The only possible good case was the Lian Li case. I have a couple of his and they have held up quiet well.  The rest of them may be to other peoples taste but not mind.  Thanks anyway for letting me look at all of them, but I hope they are a lot better for next year."}, {"text": "I did see your review of the Dynamic by Beyer so I ordered it today and then I found your top pc case video just now and man im glad this case is in the mail at the moment, I got a mountain of brand new parts so this build will be fun. thx for all the good work !"}, {"text": "Does the NZXT H500i case actually have good air flow? It looks super restrictive o_O"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=10m47s\">10:47</a> - this case is shit... you are unable to mount the most popular cards with waterblock becaue od the thickness... it should be like 10mm more. The same issue is with the cpu air cooler. It would be good but this thing just ruined this case. Its useless."}, {"text": "Qui peut me faire un résumer en Français ?<br /><br />Au passage je chercher un mini boîtier pour un mini pc.<br /><br />Merci"}, {"text": "Why the modern case have no 5.25 slot..?"}, {"text": "What about the corsair SPEC-OMEGA rgb?"}, {"text": "Great job. Love the shade thrown at the lazy case makers/designers."}, {"text": "I think there are two sides here, you say the &quot;user experience&quot; is so frustrating.  You are obviously coming from a computer builder experience.  To me as an &quot;ACTUAL END USER&quot;  that will have to live with the product for a couple of years is paramount when  compared to a BUILDER of maybe 1-2 days contact with the product, sell it and move on.  I find it quite distressing that you and others merely focus on the ease of build as number one benchmark of if a computer case is good or not.  I like your channel but this one side view over years of watching is becoming painful."}, {"text": "Can&#39;t wait for 011 Dynamic Razer edition."}, {"text": "Use this as a best channel on YouTube button"}, {"text": "This guy looks like starlord"}, {"text": "What about silentiumPC ? Polish brand but they have nice budget cases"}, {"text": "Thermaltake view 71 is an awesome case with great airflow. Best case I ever owned"}, {"text": "Aww.. Sad to know that my country doesn&#39;t sell lian li O11!!"}, {"text": "fucking wooden case"}, {"text": "Really helpful... appreciated!!"}, {"text": "How did they fix the side panel installation on the Corsair Carbide 275R? Was it a completely different case or just an improved glass panel?"}, {"text": "Just wondering if there is a case that competes the the Define R6.  I need one external 5.25 bay for a hot swap HDD, 2 @ internal 3.5&quot; HDD, 2 @ SSD, silent, good air filters, tempered side panel, Type C front panel connector, etc."}, {"text": "Lian Li get your sh*t together. Dynamic and Air O11 are almost perfect. All they need is better CPU clearance. I fell in love with this case but I didnt buy it. I couldnt fit my Dark Rock 3."}, {"text": "011 Dynamic may be case of the year but that&#39;s based on the popular demographic of AIO and custom loop. That case is not good for air cooling at all and most likely be to cramped for a 360. Design wise it may be slick but not sure it deserves case of the year. I mean these reviews are only about build and features no performance"}, {"text": "Excellent review ! Really enjoyed it"}, {"text": "Wow every case here is crap.....complete crap.  Choked for airflow and useless features added while removing needed features.   2018 was a shit year for cases and 2019 looks to be non innovative as well."}, {"text": "I don’t like the winner aesthetically, any runner ups to Lian Li?"}, {"text": "I dream of a lightweight case. One with a handle to easy carry. All them glass cases weight to mutch"}, {"text": "you the best"}, {"text": "why isn&#39;t the matrexx 55 on this list? great case and extremely affordable."}, {"text": "where is a new corsair 540 Air? I need the box setup and its direct airflow (not like the Lian Li dynamic)"}, {"text": "why is this man like the hottest human being i have ever laid eyes on wtf"}, {"text": "What about the Sharkoon TG5 RGB?"}, {"text": "Looking for a case for my first build, harder than i thought it would be."}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m50s\">7:50</a> what&#39;s the name?"}, {"text": "half of your amazon links are dead"}, {"text": "Some people still like to have a DVD drive in their tower. For that reason I had to stay with the Fractal R6. Please give us an option of use at least a slim one in these huge towers."}, {"text": "do a review on Thermaltake Suppressor F1"}, {"text": "I think to buy Asus thor which case should I buy"}, {"text": "very nice, good work man"}, {"text": "Жаль что про H500M так мало информации сказал 😑"}, {"text": "I wonder why a case with 4 USB ports on the front are more rare than Unicorn. Wishing to buy a maxi tower and can&#39;t find one satisfying me"}, {"text": "😭 where&#39;s the itx category?!"}, {"text": "A little suggestion: write on screen the category you are talking about. It really helps comprehension for non-english people (like me) who doesn&#39;t understand every single word and risk to lose some part."}, {"text": "When you see that the case you built in is case of the year...I spent hours and hours trying to even find a case I liked overall, and then stumbled upon this beauty. I&#39;m so glad I got one."}, {"text": "Aside from dust issues, any problems with using a Q300P with the acrylic panels removed?"}, {"text": "HardwareMynuts"}, {"text": "Looking for a case with a great sd card reader  any suggestions"}, {"text": "I haven&#39;t seen any case I like in 2018. Very much disappointed in the selection available and I expect nothing from 2019."}, {"text": "Not surprised to see an NZXT case on here. NZXT always seems to make a popular widely used case for builders."}, {"text": "i wish the psu should wasnt vented on the h500. i can see all the warranty stickers and screen printed logos on my EVGA peaking through. with the right light, i can see all the wires stuffed down there as well."}, {"text": "No idea what you&#39;re talking about on the quadstellar having bad cooling. I got it specifically because I want it better cooling and just a unique case for once. And I never see my case temps go over 34C and my card now never goes over 67 and I have a 1070 TI."}, {"text": "Wye are all the cases with no DVD cd rom drivers these days. I want my new pc with it."}, {"text": "O11d is amazing case, but i think too big for most users, toomuch empty space even after 9 fans installed, but still the best case of the year"}, {"text": "Very nice the case of the year! Great reviews as always! Have a great 2019"}, {"text": "I got that Thermaltake Level 20VT - love such mobo layout. Cable organizing is not a big deal (just get lots of Self-Adhesive Zip Tie Cable Wire Mounts Clamps). But omg front fan panel mounting plate is horrible. It could easy fit 4x120 mm fans (I think even 4x 140nmm would fit) , but no option for that, well... time to mod :)<br />For miniITX Love InWin case except for the airflow (might build system using it one day)"}, {"text": "New Antec reviews please! &lt;3 &lt;3 &lt;3   Guess I&#39;m a little sentimental from back in the day but I think the new P110 Luce and the matx look fresh.  Everyone loves a underdog/comeback kid story right?"}, {"text": "I still love the modern classics Phanteks Enthoo Pro and R5"}, {"text": "damn.. wish i saw this before i build the Cooler Master Pro 6..."}, {"text": "Please make some wallpapers from your videos"}, {"text": "No full towers?"}, {"text": "Damn you were ruthless at the end holy shit"}, {"text": "I have kolink levante"}, {"text": "What is the name of his case behind him in the beggining of the video?"}, {"text": "I prefer the corsair 570x. Its very pretty with lots of space and tempered glass sides"}, {"text": "How those the  Lian li - O11 Dynamic compare against their D600 case? , are they using the same frame?"}, {"text": "Review the Louqe Ghost S1 please!"}, {"text": "It would be great to get a follow-up and build experience with the new Metalic Gear Neo Mini."}, {"text": "Star...lord...?"}, {"text": "I bought the Lian-Li PCO11 Dynamic (white) about 3 weeks ago without looking at any reviews or anything.<br />I saw it on Amazon and just knew it was the one.<br /><br />I&#39;m glad I watched this video, you&#39;ve kinda made my day.<br />It&#39;s a beautiful case with amazing cable management options, my build isn&#39;t finished but I can already tell I&#39;m going to love it."}, {"text": "Corsair 2018: No FOMO!"}, {"text": "Want to see more companies heading towards smaller form-factor cases in 2019. Really hoping for Phanteks to release a mesh front panel for their cases as well as a revised mini-ITX enclosure that has integrated addressable RGB."}, {"text": "OOF, Dmitry being SAVAGE with those case fails"}, {"text": "Still not finding any good case since 2017"}, {"text": "Was lucky enough to do a build in the Phanteks Evolv X, of the 5 computers I’ve built this year, this one was leaps and bounds above any case I’ve worked with"}, {"text": "I wanted to buy the Lian Li 011 Dynamic but i couldnt find it anywhere online or irl so i had to buy a corsair 570x instead feelsbadman"}, {"text": "I&#39;ll ask this here instead of asking google.<br /><br />I&#39;m.buimding a new PC with the z390 aorus master MB. It has RGB headers it says. How do I hook that shit up? Is there a vid on this channel on this subject:)?  <br /><br />Can I use any RGB brand fan or so with this Mobo or do I need to stick to the MB brand? I&#39;m new to RGB since I only cared bout performance. But now I care xD sooooo help:p"}, {"text": "Whats airflow? - PC cases 2018"}, {"text": "Awesome video :)"}, {"text": "Does any case support 3 200mm fans in the front of the case?"}, {"text": "You have such an incredible talent for making stunningly beautiful videos. Thanks for all the hard work over the years :) !"}, {"text": "Chris Pratt?"}, {"text": "Bought an O11 Dynamic just before Christmas. Can&#39;t wait to do my build in it!"}, {"text": "You didn&#39;t review the Saberay case from Enermax and it came out last year. It&#39;s an awesome looking case you should check out"}, {"text": "Case of the yr for the win"}, {"text": "I guess you didn&#39;t get to test the corsair obsidian 500 or 1000?"}, {"text": "011 Dynamic wins case of the year but the 011 air is in your fails compilation for not having enough room for the most popular air coolers.  Are they not the exact same dimensions? In addition, no reset button on 011 Dynamic is enough to put it out of contention for my purposes; the case is perfect for OCing but no reset???"}, {"text": "Wohoo i&#39;ve got the Q300L as i wanted a small stylish case with good cooling and i am very happy with the case it really does deliver what is said :) amazing case at super value"}, {"text": "Which case do u have in use  on your desk in the background? And which RGB cpu cooler? Thank you."}, {"text": "Just built in a Meshify C. Amazing case especially for the price"}, {"text": "Nice job. I like many of these cases, but it&#39;s hard to really judge a case until you&#39;ve built a system in it. For example, I really love the Fractal Design Define R6 (and really, the S2 you highlighted is basically that case but in the open configuration). I still love it after building two systems in them, but you notice little things when you actually build. Like how much of a PITA a nonremovable power supply shroud is if you have to add or change a cable once some of your cables are connected and cable-routed and can no longer easily just slide the whole power supply out the back. Or, how some power supplies (I&#39;m looking at you, perfectly adequate Seasonic X600X I can&#39;t now re-use) can&#39;t slide in through the back because of a slightly raised fan grate, and thanks to a non-removable shroud, now physically can&#39;t be put into the case from either direction without modding. <br /><br />Non-removable shrouds need to die. I want to see more power supplies on display with side-panel power readouts like that Asus Thor, though. Maybe then I&#39;d see a compelling reason for a TG side-panel."}, {"text": "THATS WHAT MY PC WAS MISSING....... im about to go buy a potted plant right now."}, {"text": "dude where is the cooler master h500p"}, {"text": "Why not show temps on all of the cases in order to have some comparable atribute?"}, {"text": "Anyone knows if the rgb/fan controller in the 500i, is available for purchase alone? I checked the website and found rgb and fan controllers as separate devices. Thanks!"}, {"text": "I totally agree, I have the 011 ROG, I can honestly say is the best all in one cooling and design system ever... with good amount of space. 👍"}, {"text": "Димас, давай уже по русски"}, {"text": "My personal case of the year goes to the Corsair Obsidian 1000D, as I owned one :)"}, {"text": "You are a professional youtuber. Love your videos.<br />H500 or H500i worth it?"}, {"text": "I still prefer the old 2 drive cages in front of the fans where you can remove 1 or 2 of them. SATA cables are ribboned, wiring ssd&#39;s behind the motherboard tray is a pain in the butt."}, {"text": "Are you Brazilian?"}, {"text": "Dude check out the mb511"}, {"text": "No mention of H700. Best case imo."}, {"text": "Honestly, I think the Fractal Design Define R6 TG is still better than these cases.<br />Greetings from Argentina!"}, {"text": "oh thank God the 570X did not make the fail list.. i just ordered one!! D&#39;oh!"}, {"text": "Imagine a mini version of the 011 Dynamic for SFX PSUs, ITX boards, and single GPU setups but maintaining lots of fan mounts and the dual chamber design to hide the PSU."}, {"text": "I see 27uk850 still standing on the desk. Do You recommend it for console and pc single player gaming? I know 4k is demanding but it would be future proof for some time. Any glaring issues? 1440p 144hz is about the same price but ps4 does not support either 1440p or 60hz and getting 144hz at 1440p on pc is not easy too.. and dark souls 3 is locked to 60fps (done!)"}, {"text": "Best mATX case?"}, {"text": "For me, the best case of 2018 was the Louqe Ghost S1. It might&#39;ve taken a long time to arrive with a few missed deadlines, but now that it&#39;s in front of me, I have never seen something so sleek and minimalist. SFF ITX case that can accommodate full sized GPUs, modular rails design that can be expanded with top-hats to fit your needs, pretty decent airflow considering its size. Depth is big enough for some powerful air-coolers or top-hats can be used to accommodate AIOs."}, {"text": "I&#39;m hurt. I own a Q300P hahaha"}, {"text": "Hello Good People!"}, {"text": "oof evolv x didnt come in 2nd runner up :c"}, {"text": "Just what i needed now to choose from this list is going to be hard."}, {"text": "Hello good dmitry"}, {"text": "All I want is a tiny  m-ATX case with space for a 240mm rad and a fairly big graphics card. Closest I can find is The Bitfenix Prodigy M and that is horrible..."}, {"text": "waiting the entire video thinking, &quot;no love for the lian li o11 Dynamic? i mean he diskliked the air version for good reason but o11 would be great feature for watercooling possibilities&quot; and then it shows up at the end, great vid man, keep it up."}, {"text": "Recent year or two for computer cases were really disappointing. TG, RGB and similar crap invaded the market, which is why I can&#39;t find at least decent case anymore. Even LIAN-LI doesn&#39;t make good cases anymore."}, {"text": "Well Done Team Alpha Gaming Loves it :)"}, {"text": "please include indonesian language 🙏"}, {"text": "When it came the the watercool option I was rather confused. However the Dynamic getting case of the year makes up for it. I bought one to build a system to sell. Now I want one to replace my case."}, {"text": "Im agree with your picks specially with your favorite case and case of the year positions, the lian li case deserve that award for innovating and functional design, and i also have the NZXT H500i, this case is so funtional and easy to build, maybe has the needs of any normal - advance user could need. Very well done, my estimated."}, {"text": "another year without wooden pc cases... Why won&#39;t the PC Gods answer my prayers?"}, {"text": "Haven&#39;t seen the video yet, but Lian-li pcO11 dynamic derbauer edition is coty"}, {"text": "Leather wrapped pc case please! 😍"}, {"text": "NZXT H700i Didnt make the list?"}, {"text": "kinda funny how you praise the 011 dynamic for its dust filters but criticize the 011 air for the same thing, especially when the 011 air has over all better fan/rad support and better ventilation"}, {"text": "First case he picks, my case! Haha. NZXT H500i in white. =D"}, {"text": "The o11d is the best case I have ever had in 38 years of computing. Good call!"}, {"text": "Best case review channel."}, {"text": "As a casual user, I once dreamed having one of those cases. Now I realize, I only need minimum cable for my case to look sleek and badass."}, {"text": "Tell me more about the Carbide 275 side panel fix. If we already have the case can we get the &quot;fix&quot; as an additional purchase? Also, glad the Dynamic is your top case. I waited 2 months to get on due to stock issues lol."}, {"text": "The Q300P was a stupid design. Who would want to carry their PC around like a briefcase? And the airflow is shit."}, {"text": "I remember Dying Light, same Intro. Like it 👍"}, {"text": "Please review the Louqe Ghost S1!"}, {"text": "Does anyone recommend budget micro atx cases for rx 580 builds?"}, {"text": "I dont like any of the cases released in 2018. They are all dog shit."}, {"text": "The CM SL600M looks very good"}, {"text": "iron fist?"}, {"text": "I just picked up a used phanteks enthoo pro, I like it better than all the newer cases out there. ...it helps that it was free. Ha! Still a solid case."}, {"text": "Again, very nice and detailed video. Congrats!  Your review for the Coolermaster H500M has confirmed me,  that I did well that I choose it, despite its negatives. I will combine it later in 2019, with the Coolermaster ML240R. Btw I would like to know what case is that on your desk. From a first look, it seems like the Corsair 500D with three ML 120."}, {"text": "Having watched every review this year separately, the end result for CotY doesn&#39;t make any sense to me."}, {"text": "The video I have been waiting for a while!! Thx for this Xmas present Dimitri!!"}, {"text": "I want that tiny case by CM lol"}, {"text": "Dude looks like an off-brand Chris Pratt"}, {"text": "I actually bought a p350x a few days ago"}, {"text": "In building my new system after 6 years of using the old one I used your reviews specifically in picking my components and even though i had to wait 6 months to get a chance to order the Lian Li Dynamic in canada I can say I fully agree it to be case of the year. It is just a magnificent design and I love every aspect it brings to what i wanted in a new pc"}, {"text": "Define R6 or O11 Dynamic (not taking into account cost)?"}, {"text": "Yes!!! 2018 is not complete until we have a cases of the year video from HardwareCanucks. Thanks guys and Happy New Year to you and yours."}, {"text": "Wow, the absolute complete and utter hatred for all cases that can carry an Optical Drive is strong with this video... all the cases of 2018, and not a single one can sport an optical drive... I know a lot of Youtubers think it&#39;s antiquated and nobody could EVER possibly have a use for one in 2018, but I know a TON of people in the real world (ie: not Youtube channels) that use and want optical drives for a variety of reasons... and speaking of trends, the trend to never review cases that can use an optical drive... not even one, is a pretty fail trend for 2018... I hope that gets reversed in 2019... surely a single case that can sport an optical drive should have a little potted plant put on it."}, {"text": "i love my HAF932 been a great case even after all these years.. even the original 200mm fans still running after nearly 8 years (been cleaned and taken apart and oiled often) but after seeing that pc case of the year i like looks of that one as well it sorta reminds me of a retro loft converted into a modern age tower just way glass is. maybe that is something ill get in time when i get a new system in the future (unless they are no longer sold by then hopefully their successor version ahead that looks just as good)."}, {"text": "Hey Hardware Canucks, love you’re videos as always and wait for these awesome vids at the end of the year. On the topic of cases, what did u think about the NZXT H200(i) as a mini itx case from this year?"}, {"text": "Someone tell me why the CoolerMaster TD500 gets no love its so nice"}, {"text": "I love the Define R6 from the start of the year, but I am having an issue with my NZXT Kraken x52 AIO cooler. The dust filter on the top of the case cannot slot in properly because the cooler&#39;s fan screws are just too tall."}, {"text": "can you make the best airflow case for the past 2 years?"}, {"text": "Surprised the Cohgar Panzer EVO RGB wasnt here"}, {"text": "Phanteks P400S TG or NZXT H500?"}, {"text": "Nice review, but you forgot the silent case category"}, {"text": "2018 year of crap cases."}, {"text": "Got the Lian Li Air and filled it with an AIO and 14 fans. The Dynamic was nice too but could only hold 9 fans so........"}, {"text": "[even lower IQ]"}, {"text": "O11 Dynamic is the biggest disappointment of the year for me. I love the looks and unique side mounted radiator mount. But E-ATX motherboard with side mounted radiator = nope. and tall air coolers for testing are also big nope. Few centimetres short in every direction to become my new case  :("}, {"text": "So tired of all these boring square cases. Corsair carbide omega is a perfect example of how you can still have a clean stylish case that isnt a brick or a spaceship"}, {"text": "&quot;You know it&#39;s very cool to have handles on the cooler master Q300P so you can easily carry it in the garbage&quot; XD LOL!<br />&quot;Whoever designed the Level 20VT has an even lower IQ&quot; LMFAO! Dude after all these years of watching Hardware Canucks! Oh man never laughed so hard!"}, {"text": "can you please check out jonsbo case like u4, umx4..."}, {"text": "Great video"}, {"text": "The O11 Dynamic is fantastic for the price. Gorgeous, good cooling support/ performance if you use an AIO or a custom loop. It won&#39;t fit a lot of high end air coolers above 155mm in height. GPU clearance is also tight. My MSI 2080 Gaming X Trio is 142mm in height and it just barely fits. The PCI-E connectors are touching the glass. <br /><br />The only other issue I had was mounting a 2,5&quot; SSD and a 3,5&quot; hdd at the back, it&#39;s incredibly tight to fit the connectors. On my unit I also occasionaly get loud vibrations in the case, from using 3x 3,5&quot; harddrives."}, {"text": "I really want to love the 011 Dynamic, but the aluminium front is very aesthetically displeasing. It doesn&#39;t fit anything else on the entire case and doesn&#39;t go well with the white-black color scheme. The enormous bezels around the glass panels aren&#39;t exactly helping with the minimalist approach. Guess I&#39;ll wait for the next generation, which will hopefully do away with the miscolored front."}, {"text": "Choices are shit. I&#39;m going back to 3dgameman reviews, your fucking dead to me Canada boy"}, {"text": "Unbelievable!... Just 1M subs, for a channel with great content :("}, {"text": "Would really love to see a return of inverted cases that allow the &quot;view window&quot; to be on the right of the case."}, {"text": "you know what&#39;s fail? most cases are stupidly huge."}, {"text": "I like how most other reviewers where not impressed by O11, its maybe useful if you are new to custom water cooling and need room.... lot of wasted space, probably good for a child&#39;s first build."}, {"text": "It is ridiculous when the price of a case is over $50."}, {"text": "H500 vs phanteks pro m? Like them both"}, {"text": "That Lian-li case is gorgeous, might replace my rosewill rise."}, {"text": "Wow! : ) LIKE"}, {"text": "I think case manufacturers are falling into the same category as game developers for 2018.  Half finished, nothing new, nothing special, and overpriced."}, {"text": "Most of these cases are bad if you have cats. They&#39;ll jump on top and press the power button. Would be cool if you included a section next year for the best case that has the power button on the front as well as either no top intake or optional panels to block the top intake.<br /><br />If anyone else has the same needs, consider the InWin 303. No top intake (its moved to the side) and the power button is on front."}, {"text": "Best case for water cooling that isnt 500 dollars anyone?"}, {"text": "Cool. I purchased the case of the year a few days ago.<br />Feels good man."}, {"text": "Every new case in 2018 that lacks a front panel USB-C should have been disqualified from any potential award automatically."}, {"text": "Ah, my favorite HC video every year!"}, {"text": "Definitely have to agree with best case! Bought it myself and it was wonderful to build in and looks sooooooo good!"}, {"text": "<b>A French person says thank you! Merci beaucoup j’ai pris un Lian Li PC-o11 Dynamic 😎</b>"}, {"text": "pc cases are so confusing, i just need a small, simple and silent micro itx case with ok temperatures"}, {"text": "My favorite case in 2018 is the Thermaltake  View 37, but I cannot understand why it doesn&#39;t have a meshified front!"}, {"text": "P400S is the best CASE"}, {"text": "I bought the p350x due to your review about 2 months ago, I can agree, this is the best budget case I&#39;ve had in a long while"}, {"text": "I know it’s of topic but is the gsp300 headset just as good on Xbox as pc"}, {"text": "Suprised that h500m is not a top case. I mean it looks amazing and has the best airflow, it has nice features. The only downside is price and sidepanel and psu shroud could have been done better, but still perfectly fine. O11 looks like dogshit, so, it doesn&#39;t really matter what else it does at that point."}, {"text": "Never seen the dynamic for less than 150"}, {"text": "Why u farted at the end of video? 11.55"}, {"text": "lol I paid like 120 usd for the h400i, but I’m not from the US so this price is expected. No regrets anyhow."}, {"text": "i love the lian li case really considering getting it<br />but i&#39;m scared of the power supply slot since it&#39;s not layed flat and sort of floating? i guess"}, {"text": "I literally searched for this video two days ago as I was looking to get a new PC case. . . perfect timing."}, {"text": "do a best 10 cases of the past 5 years"}, {"text": "Nice to see I picked case of the year for my build. Very happy with the O11 dynamic. Such a nice clean case to build in and looks great."}, {"text": "The dynamic cant support ekwb&#39;s Phoenix rads as them bois are just tooooo thick. Just a heads up for people wanting to get this case with the ease of easy disconnects from ekwb. Otherwise it&#39;s a wonderful case"}, {"text": "Subbed - loved you in pineapple express"}, {"text": "To be honest I&#39;m underwhelmed by the case selection in 2018\r<br />I was looking for a mini ITX case for an htpc build\r<br />I wanted a window and I wanted a 5 and 1/4 Drive Bay for my Blu-ray\r<br />\r<br />And there was nothing available\r<br />I ended up buying a used  Cooler Master Elite 130\r<br />It worked but there&#39;s no cable management at all\r<br />It&#39;s just not a pretty build\r but it works <br />till I find a my dream Case.<br /><br />\r<br />I&#39;m looking for something around the same size as The Cooler Master Elite\r<br />But I wanted to have cable management <br />USB C header on the Front a window on the case <br />RGB on Front \r Plus room for 5  and Quarter inch Drive<br />\r<br />In my opinion you still need a Blu-ray  drive if you want to rip movies\r<br />Where is my perfect case right now there isn&#39;t one Dimitri"}, {"text": "CORSAIR Obsidian 500D RGB &gt;"}, {"text": "Imagine a custom loop dual system in the evolvX !!!!"}, {"text": "still have to wait for my i9 until i can build in the O1 dynamic"}, {"text": "I was so sad that you can&#39;t get that little mini wooden case anymore :("}, {"text": "Lian Li PC-O11 Dynamic is my case! :)"}, {"text": "I love your channel hardware canucks. audio and everything is great but still the channel only have 1 million subs wish you got some great amount of subs in 2019 i hope you will pin this comment. Hard Works Pay Off"}, {"text": "I really am looking forward to more dual chamber cases, the O11D is just amazing"}, {"text": "Like the video EXCEPT on the H500M. I just bought that case and it&#39;s A M A Z I N G! The only issue I have with it is the included GPU support because I can&#39;t use it since I have a Strix 3 fan GPU which isn&#39;t really their fault."}, {"text": "Ur video on the lian li made me buy one"}, {"text": "Should change the fail category to the roast compilation. Alot of heat with those roasts 😂"}, {"text": "The Corsair 500D gets a lot of flack. I swapped the fan brackets, moving the 360 to the top and 240 to the side. An additional 360 bracket can be purchased from Corsair for dirt cheap btw. Removing the top dust filter increased airflow. Why have a dust filter on the exhaust? Yay I can filter hot air! Lol it&#39;s a beautiful case, but it&#39;s short comings are easily over looked IMO."}, {"text": "I have a Fractal Design Define R6 and its my favorite case I have ever owned or built in. I run the fully open configuration with a 240 AIO push/pull with very impressive cooling."}, {"text": "I recently saw your video building on the lian li case!<br />I&#39;m building my 1st pc on that one!!<br />Wait for me 2019"}, {"text": "where is the corsair crystal 570x???????????????????????????????"}, {"text": "Wow saying h500 by nzxt has good rad support and airflow is actually just blatantly lying to your audience. I am ashamed."}, {"text": "I love my Phanteks P350X"}, {"text": "Needs to be a best ITX case . As always I look forward to this video. Damn good"}, {"text": "best quality content on youtube."}, {"text": "For me Fractal Design Define R6 is still the best"}, {"text": "Man, that bit about the low IQ designer guy.... Ouch! lol"}, {"text": "Would a Ryzen 7 1700 Go into the Phanteks P350X with enough ventiliation"}, {"text": "spec omega rgb ?"}, {"text": "来自中国的垃圾佬表示，我们的机箱还是鞋盒！"}, {"text": "Why cases cost that much?"}, {"text": "Nice cases shown! I really do like your favorite case!<br /><br />But my case stands on the right side of my desk and you can walk by ... so im looking for a case where you can take a look inside from the right side and see the hardware in nearly &quot;normal&quot; position. This would be my option to renew my 15 year old chieftec goldie!"}, {"text": "i dont get how the h500’s ventilation is any good with no space up top, can someone inform me why?"}, {"text": "the only thing why is subscribe to this channel! great man!<br /><br />atleast Phanteks Evolve X is in the wow section not the fail section"}, {"text": "When you watch the fail compilation preying your case wont show up"}, {"text": "Best dual system case?"}, {"text": "&quot;Has an even lower IQ...&quot; damn lmao"}, {"text": "oh an also their is a new version of the lian lee pc-O11 its called the pc-O11 WGX its pritty much the same case but it was been made rog certified"}, {"text": "The Q300L is SUCH a killer sub-ATX case, especially for that awesome price.<br /><br />Frankly, Cooler Master deserves MUCH more respect than they get from the media, they&#39;re the only &#39;big name&#39; in the industry that&#39;s truly pushing innovation. I mean, what the hell has Corsair done, the disappointing 1000D that got picked apart for the lack of thought put into the design? <br />And, mind you, this is coming from someone that &#39;daily drives&#39; an InWin 303.<br /><br />Also, LOVE the more unique graphics card mounting concepts of this year, looking forward to more of this.<br />And, hopefully more unique layouts like my 303 as well, I REALLY don&#39;t have much interest in the standard ATX layout, front intake, rear + top exhaust, power supply in the bottom with a giant full length shroud, such a tired design. No one uses desks that require &quot;standard&quot; mid-tower dimensions anyone, those days are all but gone - we can go wider!"}, {"text": "i love that phanteks p350x ive been looking for a case in the £50 to £80 price range and thanks to you i think ive decided so thanks for doing this vid"}, {"text": "Took me 4 hours. FOUR HOURS. To install an AIO loop in my 500D. You&#39;re so right about the top panel. It&#39;s ridiculous."}, {"text": "who knew starlord was so into computers."}, {"text": "star lord is that you?"}, {"text": "I made a good choice buying the O11 Dynamic it seems :) Honestly I love the case because not only is it really nice looking buts its also really versatile and well built."}, {"text": "At first glance I really liked the 011 Dynamic, but the more I learned about it, the more needlessly oversized it felt. And so I am leaning more towards 280X from Corsair."}, {"text": "what about phanteks evolve x?"}, {"text": "that wonderful feeling you get when your pc case gets case of the year from dimitri"}, {"text": "Liked for just 1line😋 @<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=0m27s\">0:27</a>"}, {"text": "inwin 301 &lt;3"}, {"text": "I thought you were Chris Pratt the Star Lord"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=11m56s\">11:56</a> tf did you do."}, {"text": "Hey Dimitri..i hope u will do a review for the COUGAR GEMINI X case video 👍"}, {"text": "I really REALLY want to go ahead and purchase the Lian Li PC-011 Dynamic - its nearly everything I want in a case and its absolutely gorgeous, but I&#39;m so sketched out that I wont have enough room for the video card + waterblock that I had planned on. :/"}, {"text": "could we see fail compilation more frequently?"}, {"text": "WOW MAN WHY DIDN&#39;T YOU REVIEW THE COOLER MASTER H500 non p or m for 99 BUCKS"}, {"text": "The enthoo evolv x is not even on the list! That was surprising."}, {"text": "curiosity why did you criticise the 011 air for almost the same things you gave the 011 dynamic credit for ,excluding front glass of course. same clearance issue is present in the dynamic its the same frame ."}, {"text": "Cooler master TD500 RGB?"}, {"text": "Is the NZXT H700 (not the i version) a good buy?  Single GPU, 280mm rad setup w 2 SSDs and 1 HDD."}, {"text": "I have the h500m case. And it&#39;s awesome. but the price is a little bit high."}, {"text": "No doubt the best are: Phanteks Evolv X and Fractal R6/S2"}, {"text": "Your intro nor advertisement never disappoint us!"}, {"text": "My favourite case is still the Bitfenix Prodigy, perfect size and it looks so nice"}, {"text": "Man that case of the year looks good.<br /><br />I love how you went all savage on the case fails."}, {"text": "So you can easily carry into the garbage... Dmitry has no chill :D"}, {"text": "Could&#39;ve done with a mention of that sweet WATERWAY for the O11 from Bykski, Barrow etc ;)"}, {"text": "Great video and a step up from last year. I agree with your pick for case of the year the price, performance is too good to pass up for many people and the water-cooling support actually is so so close to being perfect."}, {"text": "Glad to see the Lian Li is at the end. Been thinking of downgrading/upgrading? from my Corsair 570x (it&#39;s a nice case, but damn is cable management annoying and I kinda&#39; don&#39;t like the PSU shroud the more I look at it). Only issue I have with the Lian Li is that my custom PC shelf doesn&#39;t support the extra width because it&#39;s made for my Corsair (and honestly, I don&#39;t know if I can trust a wider case on a wall mounted shelf unless all the weight was closer to the wall)"}, {"text": "Depressingly, i bought a TT level 20 vt before watching reviews. My feelings are hurt, but it&#39;s true that cable management sucks on so many levels. It&#39;s a very weird case. It&#39;s stupid. But now i have no choice but to love it for a while. Still waiting for a similar looking but better micro atx chassis."}, {"text": "Yepp, O11 Dynamic sure was a dope move from Lian Li. 😍"}, {"text": "A million subs!!!"}, {"text": "The canuts are my reference point when reviewing cases.<br /><br />Bad that this year the didn&#39;t choose a Phanteks for the prize :D"}, {"text": "A Strong Philisopher Once Said<br /><br /><br /><br /><br /><br /><br /><br />Hello Good People<br />Edit: Thank you For the Heart Dimitry! <br />Correction it was Philosopher LOL"}, {"text": "Wher is the view 71"}, {"text": "lain li deserves case of the year. its a case ive been wanted since ces 2018"}, {"text": "I am rather surprised that you went with the Lian Li over the Evolv X considering how much you raved about it during the year after it debuted."}, {"text": "Thank. I am pleased to watch your channel. Interesting and informative. Greetings from Russia. Congratulations on the upcoming New Year."}, {"text": "Just love hardwareCanucs videos<br />Best reviewers"}, {"text": "Dat O11 Dynamic... can&#39;t wait to get my hands on one of those.<br />Just need the money :/"}, {"text": "“Great handles so you can easily carry it to the garbage” that was savage"}, {"text": "I got a budget of 50gbp for a case, my first build so I don’t want it to be really hard to build in, any recommendations"}, {"text": "I hate mid tower cases there are no good one I found and they&#39;re small I want more atx cases"}, {"text": "I think next year you should add a best compact case category"}, {"text": "No cougar Evo RGB?"}, {"text": "Like many of you I was expecting evolv x to be demitrix&#39; case of the year!"}, {"text": "what about eber&#39;s favorite case?"}, {"text": "You hew to try Raidmax Sigma Prime i love that chase they think about everything on it :)"}, {"text": "Was looking for the best custom airflow only case  2018 but all i see here is low end crap cases who is pulling more heat than a box of  Molten Rocks ."}, {"text": "Q 300 L user here"}, {"text": "I went with the Lian Li a few months ago! Beautiful case!"}, {"text": "Glanced through and didn&#39;t see the Raven RV02, can only assume none of these cool as well and are therefore uninteresting."}, {"text": "coolermaster h500?"}, {"text": "Voice crack at <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=0m29s\">0:29</a> ????? Lol"}, {"text": "The Dynamic is so worthy of the 2018 title! I&#39;ve had the pleasure of building in it, and there&#39;s so much potential for customisation within. It&#39;s a joy to look at every day."}, {"text": "Few new cases offering a 5&quot; half inch drive which I use, if its removable then its more versatile, also usb type c ports are still not common place. Looking forward to a new revision of fractal Design arc, I just wish they ditched the plastic front fascia for sand blasted aluminium. I&#39;m not a big fan of rgb lighting &amp; glass panels as they can break."}, {"text": "If I didn&#39;t need to fit in 8 3.5&quot; HDDs in my system, I would have chosen the O11 Dynamic in a heartbeat. Though, my Fractal Define R6 is still an absolute treat as well :)"}, {"text": "Ayyy I own the 011 dynamic, looks like I chose right"}, {"text": "Glad the evolve X didn&#39;t get case of the year and happy it was the lian li, I was going to get this case but the brushed aluminium turned me away and the need for 9 fans. But still love it"}, {"text": "IM NOT KIDDING .... I HAD A DREAM OF MINIATURE COMPUTERS HOLY SHIT ."}, {"text": "I love that the 1000D gets a shoutout. I LOVE mine, its the centerpiece of my whole room. And despite it being both very good and HUGE/expensive, I&#39;m sad a lot of &quot;best of&quot; case lists havent included it in their high end/best watercooling category. Cant wait to get a 2nd system and some sick custom loops in there"}, {"text": "i have the 275r :(, I&#39;ll throw it away next year"}, {"text": "One of my favorite cases this year is Cerberus X. It’s just amazing to be able to put an eATX motherboard in less than 20 L."}, {"text": "Just bought NZXT H500 case, thanks to you. Keep it up! Love your channel."}, {"text": "Shucks. The Level 20 VT looked like such a cool case. Guess I got caught up in all that glass."}, {"text": "Just rebuilt the wifes PC in the Fractal Meshify C, such a nice case im considering swapping from the Phanteks Evolv(original)."}, {"text": "Im still waiting for Corsair to release a Carbide Air case that actually has filters...... lmfao"}, {"text": "My go to case is the Meshify C.  Just did my first ever AMD build with it 2 weeks ago.  Liked it so much I bought another one this week and rebuilt my 10 year old i920 computer in it."}, {"text": "Wow. A phanteks fanboy not talking about the phanteks evolv X."}, {"text": "i was wondering where the pc-011 was a well deserved ase of the year"}, {"text": "Been waiting for this"}, {"text": "just built my first pc in the o11 dynamic"}, {"text": "Agree like last year and 2 year ago"}, {"text": "Where is the meshify-C love? :p"}, {"text": "Love my 011 dynamic, litterally everything i wanted in a case and so sexy to look at"}, {"text": "No mini itx ?"}, {"text": "NO Cooler Master H500"}, {"text": "So glad my case 011 is the best of 2018"}, {"text": "YAY I have the case of the year"}, {"text": "Oh well now i feel dumb... i just picked up the phantek p300..."}, {"text": "wuhooo ~~~ no regret after swap to PC-o11 dynamic ~ with custom watercooling ~ it became show piece"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=10m19s\">10:19</a> I see why The Verge list of tools included and Allen key and everyone was like wtf you would need one?"}, {"text": "I bought lian li O11 after watching your review, and glad that you have chosen it as the case of the year. Mine has so much RGB stuff in there now, it shines more than a christmas tree. Love your videos :)"}, {"text": "after seeing the O11 Dynamic for the first time anything with a non-glass front panel is suddenly ugly"}, {"text": "This guy looks like &#39; star Lord &#39; from gardians of GAlaxy😁😁"}, {"text": "How much were you paid to choose that garbage can Lian Li case as the winner?"}, {"text": "Nice, and I wanted to get Lian Li O11 before this video. BUT we are so close to CES 2019 so I will wait a bit longer."}, {"text": "Corsair 570x in mirror black should be one of the best cases. It&#39;s beautiful so disappointed."}, {"text": "Very happy with the O11D winning CotY. I 100% concur with the placement of this (and basically all the cases)"}, {"text": "I almost threw a fit when I didn&#39;t see the O11-D on the list, being that I bought the case since it y&#39;all gave it a great review. Now at the end of the video, however, all is forgiven lol"}, {"text": "What about the View 91?!"}, {"text": "segotep does pretty good cases"}, {"text": "Ssds’ have dropped prices and so have ram. Building is fun again <br />Pc cases are another thing and also very important 👌"}, {"text": "I love the 011 think it will spawn similar compartmental cases"}, {"text": "Best case I could find for my EVGA X299 Dark EATX given its 10.897&quot; wide..."}, {"text": "gday folks..cant wait till the neanderthal case makers for ITX MOBOS..DISCOVER THE HANDLE...TO CARRY SUCH SMALL CASES..yes you DAN  AND LOGUE CASES..probably wont happen..still stone age compared to my handmade aluminium case(12 litres)..that has 2 handles and a strap..to sling over the shoulder. when visiting my mates in australia.."}, {"text": "So, where do I buy the straecom da2?<br />I have been searching this case for a few months now, but I don’t see any places selling it in europe. I don’t know if it is even sold anywhere else..?<br />Pretty strange for a new case"}, {"text": "I love dual chamber cases but they are too expensive for budget builds you need to sacrifice a lot for the case"}, {"text": "I got the corsair 275r yesterday after watching your review, even despite I didn&#39;t know they added thumbscrews, but I was pleasantly suprised. Very nice case for the price"}, {"text": "GDAY HC..HAPPY NEW YEAR..and thanks mate for all this last years REVIEWS.."}, {"text": "Wheres the corsair crystal 570X??"}, {"text": "I did a massive overhaul, back in early September. After dropping £1,600 and wanting to show what is/was essentially a new PC off--it was your video on the P350X that convinced me to retire my old CM 690 II Advanced (USB 3 version). It&#39;s also the video that made me sub. I&#39;ve not regretted it one bit. With Corsair LL fans (2x 140, 3x 120) and strips, and a Cooler Master vertical mount, it&#39;s nesting; <br /><br />A Ryzen R7 2700X w/ MasterLiquid Lite 120, ASUS Prime X470 Pro, 32GB (2x16) Corsair Vengeance LPX 3000MHz DDR4, Gigabyte GTX 1080 8GB Windforce OC, Cooler Master G750M PSU (carried over), As far as storage goes--a 970 Evo 500GB and Kingston A1000 480GB M.2 drives, with a 850 Evo 500GB (former boot drive) and 2x 2TB Barracuda drives being carried over. The 850 Evo and a 2TB drive is part of a StoreMI tier, for games. <br /><br />Planning on using retired/old components for a backup rig; FX-8320 @ 4.4GHz w/ Hyper 212 Evo, 32GB DDR3, 990FXA UD3, R9 290 4GB (OC&#39;d), Corsair AF/SP fans...need to dig out an old HyperX 3K 240GB SSD that I use as a portable drive, and grab a PSU."}, {"text": "Yeeees, now I can buy one here in Brazil. Thanks for the recap dude"}, {"text": "Never got this obsession with cases, it&#39;s just a metal box with some fans to hold all the actually important stuff."}, {"text": "Their case of the year reviews are the highlight of my year!"}, {"text": "Corsair 280x is the case of the yeah"}, {"text": "These guys have &quot;quality content&quot; as their middle names."}, {"text": "I was mad when the O11-Dynamic didn&#39;t get the watercooling pick but then you saved it. If they made the PC-O11 in an mATX or ITX version with only 2 fans instead of 3 I wouldn&#39;t hesitate to buy it."}, {"text": "You always seem so excited when you release these videos. 👍"}, {"text": "im hoping for more cases that are for air coolers, in particular the nh-d15. Too many cases that only look good if you install AIOs these days"}, {"text": "I&#39;m not into desktop anymore, I was needing the mobility of a laptop and I really miss my rig. Well, I&#39;ll definitely come back with a H500!"}, {"text": "Please test some PC cases without the glass panels; not all PC builders what to hjave a big case on the desk with a lot of RGB lights......"}, {"text": "tbh i thought the riotoro cr500 would&#39;ve fit in for the best value but then again it released really late last year"}, {"text": "Phanteks evolv x should of been on that list"}, {"text": "I do so love my Lian Li PC-011 Dynamic. The cable management, and unique front 360 mount is fantastic."}, {"text": "I&#39;m not what you would call a case enthusiast but watching your channel blows my mind with what&#39;s possible in terms of PC builds.<br /><br /> Great vid, keep up the great work!"}, {"text": "I&#39;ve got the 011 air I just replaced the filter boom problem solved"}, {"text": "So where can I get that wooden pc?"}, {"text": "Just saying you look so much like Chris Pratt :)"}, {"text": "570x is my favorite case"}, {"text": "Phanteks Evolv X needs to be the case of the year. Never seen such a good and pretty case!"}, {"text": "Yes....the Lian Li dynamic is the best. And not expensive. Very nice vid."}, {"text": "Love you channel :)"}, {"text": "I have the PC-O11 Dynamic and love it, however double check GPU widths before purchasing. My EVGA 1080 FTW2 would not fit without moving the power inputs to the end of the card via the EVGA powerlink thing"}, {"text": "Can they do real SFF research? Those SFF cases suck."}, {"text": "been waiting for this"}, {"text": "Awesome case that won."}, {"text": "I`m skeptic on the Evolve X because of the airflow but I`m a true believer on the H500M from Cooler Master and the Lian Li O11 Dynamic, for water cooling."}, {"text": "I would have given an award to the H500"}, {"text": "two year refresh and both of the cases (A1 and 011 d) made the list! thanks for the content that helped with the decision making!"}, {"text": "i picked the 011 dynamic up about a week ago thanks to your video on it and am glad to see you think its a top case too"}, {"text": "Was expecting the evolv x to be one of the best tbh"}, {"text": "No in win 909 review?"}, {"text": "Pfft H500M best case"}, {"text": "in win 915 ? Check my page"}, {"text": "I just went and intentionally bought a case that&#39;s a few years old. While these new ones are great, they are leaving behind people that actually need storage.<br />&quot;dual power supplies! radiators everywhere!!! FANS!! RGB!!!!!! WATER COOLING!!!..........one ssd slot&quot; ----yippee."}, {"text": "Mini ITX didn&#39;t have a good showing this year"}, {"text": "How about that bitfenix enso MESH?"}, {"text": "I was considering getting a Level 20 VT, but I never even considered the cable management. I just liked how it looked. Unless I can think of a good solution maaaaybe I should find a different case for M-ATX"}, {"text": "Cheers to 1 million subscribers to a person who talks about cases ! :)"}, {"text": "Always love the end of year video. But where is the phanteks evolve shift X. That was a very unique case in 2018"}, {"text": "I just got the 011 dynamic Sweet"}, {"text": "Yes! Lian Li!"}, {"text": "The Pc-O11 dynamic is a very well deserved Case of the Year/2018. I have seen so many beautiful Custom loop or just Air, builds this year using the Pc-O11. I my self have a brand new Pc-O11 in the box waiting to convert my 8086K system into my first custom loop into it, looking forward to it. Since it was designed by D8auer a very experienced Custom-Loop Builder &amp; Overclocker, it has been very pleasant to build in according to other Tech Tubers."}, {"text": "I can&#39;t understand why there are so many comments about the evolve X. It should have been in the disappointment section with its lower than average performance. A much better case that could have been included is the nzxt h700. Probably my personal favourite this year."}, {"text": "a question do you think that the meshify c mini is a good case or its not something you should get?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=4m40s\">4:40</a> why did 2 fans stop?"}, {"text": "probably going to get a new case and maybe even a new system. Currently deciding between the NZXT 500i, the Lian Li PC 011 and the Corsair 280X. Does anyone here have experience with any of them? What would you recommend?"}, {"text": "Was waiting for this all month! Thanks!"}, {"text": "We need a meshify R6, but not all angular and stuff. Just a flat mesh version of R6 with no logo on the front. Also, despite the O11 being case of the year, I&#39;m still going for Fractal R6 in my march/april/may build due to the more conventional design (which I prefer), the easier to remove side panel, more hard drive space, etc."}, {"text": "I had 0 issues with my carbide 275R&#39;s tempered glass mounting process. It came with different screws from what you described"}, {"text": "Finally it has arrived!!!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m44s\">8:44</a> i loled so hard at that"}, {"text": "I love my o11 dynamic. I gave up my caselabs m8 for this thing and never regretted it lol."}, {"text": "Where is the Evolve X or the Be quit 700 ?"}, {"text": "&quot;top pc cases&quot; and all i heard was him talking shit and what was wrong with every one. mustve been a piss poor year for cases"}, {"text": "is lian li o11 dynamic worth for 144 euro ? Because this is the only kind of price in my country. BTW Phanteks EVOLV X is not the case of the year because it looks that it can mount two systems and do all those bells &#39;n&#39; whistles in theory but in the practice it is barely two systems case and if you make two system they look quite cramped. Lian li for instance is somehow design that it almost don&#39;t need fans. I watched gamers nexus video and he said 3 fans is more than enought for this case."}, {"text": "Hi D.<br />Great video :) But can you come with 3 examples on best Storage cases ? or maybe a new category :)<br />I have to buy a new case because I uses my build for PLEX, so a single i115 water coling and alot of storage, but right now all my storage is extern, and it could be nice to have them intern.<br />Thanks for all your great work into making these video&#39;s for us :)<br /><br />Happy New Year :)"}, {"text": "I bought the O11. I got a bit sad when it couldn&#39;t fit a Fractal Design S36 vertically (it&#39;s got a tip that makes it slightly longer than a conventional 360 rad), but then I mounted it in the top instead, and the temps were fiiiine. So now I am happy again. :)"}, {"text": "Good choices, i love dark base pro v2 from Bequiet! &lt;3"}, {"text": "Small form factor cases will be 2019 i think. If i would build now. I would go &quot;small, but deadly&quot;"}, {"text": "2 ads 1 video"}, {"text": "Too many ATX and ATX+ sized cases, If you are nuts and really want to drop the money on two 2080Tis you can get SLI motherboards for both 1151 and TR4 sockets. I do not know why you can not find one for 20``  but those used to be available. If you can make SLI motherboards for the 2011 and TR4 then one for the AM4 should be possible.<br />If you are not going to build an SLI gaming rig or massive workstation with lots of GPU compute cards why go for an ATX or ATX+ sized system? <br />Also, I am tired of white or black and RGB.<br />I would also like to seem options for no window cases. I know that some people love to show off their systems but there are people that might want a more professional look and maybe more sound deading"}, {"text": "Why do you like the NZXT 500I more then I 700I"}, {"text": "Great vid! I was wondering what case is that you are using in the background .. . Always looking forward to your best of.. every year!!"}, {"text": "Where is best case for beginners award?"}, {"text": "I bought the lian li pc-o11 dynamic after your review of it earlier this year. I love the way it looks with all the cables hidden in the second chamber. Hopefully the two chamber design picks up this year. The PSU shroud in modern cases always seemed like wasted space. Really glad to see it on top as your case of the year."}, {"text": "MORE TINY CASES PLEASE!!!"}, {"text": "I have the H500i for my VERY FIRST PC build, I love it!!"}, {"text": "Matrexx 55 or Q300L"}, {"text": "Είπες Δημήτρη???????? Ντουμ Ντουμ ντουμμμμμ!!!"}, {"text": "Can you review the rosewill prism s500? I&#39;ve never seen a review on it, but i bought it and I love it, and I&#39;ve never seen a review on it"}, {"text": "Been waiting all year for this! Thanks for helping me decide for all these pst years!"}, {"text": "Great Canucks Followers, Please hear and answer this question<br />I already own a corsair 800d (used for about 5 years), bought a new motherboard,Cpu, Ram that&#39;s arriving next week.<br />Should i start looking into a new case or continue using my 800d (think for better airflow, casefans, etc)<br />Thanks in advance for anyone who answer or help me in any way<br /><b>*!!Happy New Year !!*</b>"}, {"text": "Lol just about to complain the dynamic wasn’t the best and than boom it’s there"}, {"text": "h500 gang"}, {"text": "new cases are so much better now, hopefully more innovation will come"}, {"text": "On the Corsair 500 D - you can just switch which bracket you want on the front or top - 360 or 240 - you can&#39;t fit two 360 rads in that case.  I have a custom loop in mine - 360 in the front in push/pull, 240 on top.  Temps are great and system is silent - even with all the fans.  Just not going to fit 2 360&#39;s (at least without some tight tolerances making installation a crap shoot)."}, {"text": "My personal case of the year for 2018... phanteks enthoo pro TG :) Because its like the only not-budget case released this year to have several 5.25&quot; slots, proper HDD cages cooled by intake fans that are not choked, and overall good versatile design"}, {"text": "90% of these cases are horrible, they fail with the most important thing...air flow."}, {"text": "Best matx case corsair crystal 280x<br />Best atx case lian li dynamic 011<br /><br />I upgraded  my wc loop from full tower to wc corsair crystal280x so much better as nobody needs all that room in a case. I feel like matx is where the best pc case builders end up because in the end for half or a quarter of the size! You can run a system as powerful as any full tower case so there is no point."}, {"text": "Wheres the &quot;Outside the Box&quot; designers gone? Want something different to look at."}, {"text": "Yaaaas, finally! I&#39;ve been waiting since october"}, {"text": "Best Silent case?"}, {"text": "Why show CPU temp values if you use different CPU&#39;s for different cases?"}, {"text": "So glad I got the Case of the Year 2018!! O11D, woo hoo!"}, {"text": "I have phantek Evolv X and Its The best case ever."}, {"text": "I had a very bad experience with the NZXT H500. There is ONE LAYER of steel (nothing else), it is boxy, airflow is not good, you can&#39;t remove the front or the top panel without drilling into rivets, and the sharp edges might cut you. I barely pushed down on top of the case and it left a temporary impression. Got the Phanteks Enthoo Evolv MATX and haven&#39;t had a single problem yet."}, {"text": "My favorite video of the year! This is the place I come for case reviews. Good choices in each category as well. I completely agree with your choice for case of the year. I&#39;d definitely choose that for my next build, if only it came completely white and not black and white together."}, {"text": "Bought my self the Lian Li 0-11 Dynamic a couple of days ago and it set to arrive really soon, cannot wait!"}, {"text": "Im missing the corsair 280x"}, {"text": "At <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m50s\">7:50</a> he shows an ITX case that I haven&#39;t seen and can&#39;t figure out the name. Can anyone tell me what it is?"}, {"text": "But what case when i don&#39;t want RGB or window of any kind and good airflow?"}, {"text": "the case of hte year is phanteks evolv x"}, {"text": "wait , so i can re-position the side I/O on my Q300L? TIL."}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m44s\">8:44</a> SAVAGE"}, {"text": "I have order silent base 801 window a few days ago, and im proud of it. Along with all components, ryzen 2700x, asrock x470 taichi, XFX RX 580 8GB... Front panel on/more silence with idle work and off/less silence and underload."}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m42s\">8:42</a> SAVAGE."}, {"text": "Where can I get that white desk lamp that shows up so often in this video?"}, {"text": "Streacom DA2 is best :D (for me)"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=0m08s\">0:08</a> MicroATXD case"}, {"text": "Great vid as usual.   I&#39;d love to see a yearly top 10 with a case of all time combination video.<br />How do yearly top 10&#39;s compare with all time favorites... this years contenders for king of the mountain."}, {"text": "Design is one thing. But some complaints are regarding build quality, that may or may not be due to cost constricts. I&#39;m not familiar with cost&amp;price of cases but it&#39;s a possibility."}, {"text": "Your recording camera is badass!!"}, {"text": "if its not a mITX case then I don&#39;t care."}, {"text": "is it just me or the majority of pc towers don&#39;t have optical disk drive? is that the future of PC - full digital?"}, {"text": "The Corsair 275r now comes with nice wide thumbscrews with better rubber stoppers that dont fall out when you remove the side panel"}, {"text": "You hit Corsair where it hurts, their tramp stamp logo"}, {"text": "I knew the 011 dynamic was gonna win :)"}, {"text": "Define S2 for the win! &lt;3<br /><br />I am happy that it got on your top list.<br /><br />Thank u guys for the review, I did a good choice because of that and i am very happy with that case :)"}, {"text": "Savage fail compilation. I love it.  👍"}, {"text": "Thermaltake takes it for me, they have the best water cooling support and it also passed the air flow test with Gamers Nexus👍"}, {"text": "Itx case, best??"}, {"text": "The H500M is so beautiful with, easy vertical gpu and 3 fans at the top and the airflow is amazing. I removed the controller and just plugged my fans on my motherboard with rbg splitters\r.<br />It&#39;s just perfect (and yes I turned the fans so I have a 360 watercooling at the top)"}, {"text": "How come no one removes the drive cage space? Some remove the drive cages but still keep the space for some reason. Id love a case thats less long. Also away with the stupid windows and instead side fan support with filters would be great."}, {"text": "I have to ask. When did &quot;Sex appeal&quot; become a standard for judging a PC case? also, all these cases are shit in my opinion. too much tempered glass and RGB."}, {"text": "The mini case is a Master Case Pro 5... one of the best cases of the past few years, too bad it&#39;s basically discontinued"}, {"text": "Thank you for another great compilation / video for 2018.  I purchased the Dynamic, but am having trouble fitting my GPU inside with the water reservoir in the front.  It&#39;s a beautiful case and I&#39;ve ordered some different brackets to see if I can move the res forward a little bit.  I&#39;m using the EKWB XRes 140 combo and their vertical bracket which centers the Reservoir / Pump in front of the 120mm fans on the side.  Be aware that the base of the res is very wide and with a long GPU like the MSI 1080ti, you may not be able to fit.  Just a little more length to the case and also the depth is needed.  Another challenge will be to mount a water cooled GPU since the depth can be no more than 158mm.  Still an awesome case and I haven&#39;t thrown in the towel, I will try to make it work.  If it won&#39;t then I&#39;ll send back to Newegg and buy the S2.  I have 9 fans populated and a 60mm thick 360 radiator in the top for exhaust.  The three front - side and bottom are for intake per  your previous tests.  Thanks!!!"}, {"text": "Além dos ótimos artigos editoriais a exemplo dessa compilação de gabinetes o que mais me atrai nesse grupo de conteudistas é a tradução perfeita e automática que proporciona para a meu idioma. Parabéns e continuem firmes para 2019. Boas Festas!!!"}, {"text": "I saw my view37rgb and I clicked in just so that i can comment to spit on its poor cable management which basically isnt there´_&gt;`"}, {"text": "First time watching video for over 12 minutes with someone keep talking nonstop about cases and all his talk mean something not trash best video in the year so far"}, {"text": "Very well done. Really appreciate the time and effort you put in to giving us proper reviews. Also love the artistic and creative aspects of your videos. Really unique."}, {"text": "Would it be possible to do these type of videos during the Black Friday season? I understand that it might leave out last minute contenders, but it would be helpful since that&#39;s when most things go on sale."}, {"text": "that Q300L might house my shitty lil build.  thanks for the info!"}, {"text": "Thank you for doing the Fails too; highlighting the bad cases/features that could frustrate system builders. Looking forward for 2019!"}, {"text": "thank u for beeing honest in ur reviews and with ur opinions about good and bad cases."}, {"text": "If I was building a new pc I would go with the H500 Mesh"}, {"text": "Its like Chris Pratt, but with a sexier accent."}, {"text": "Where can I get that toy case!"}, {"text": "My daughter built her first system in the Q300L for Christmas. It&#39;s a great case, especially for the $32 I paid for it."}, {"text": "You should add an itx category next year"}, {"text": "I don’t regret buying my h500m lol"}, {"text": "Where is Cougar mx330???"}, {"text": "I came inside her pussy"}, {"text": "Дмитрий? С таким произношением не догадаться. Уже родился в англоязычной стране?"}, {"text": "Handles are nice so that you can easily carry it to the garbage. Savage level = Gamers Nexus"}, {"text": "I personally favor the Corsair crystal 280x. It fallows the same design as the 011 dynamic but it’s smaller and wider which I personally find very appealing"}, {"text": "R.I.P. No ThermalTake P5"}, {"text": "Very well said..indeed lian li 011 dynamic best case for 2018.."}, {"text": "Inwin 301 ???"}, {"text": "I was about to say why no Lian li 011 dynamic. Glad it’s case of the year. I got one not too long ago and love it"}, {"text": "I love this idea of doing Top PC Cases of 2018!"}, {"text": "Hey Dimitry! I totally agree with the Lian-Li O11 Dynamic getting Case of the Year 2018! The amount of airflow options is truly endless. However, I was hoping for you to chose the Phanteks Evolv X as the Case of the Year 2018. Dual system support, fill &amp; drain ports for watercooling and as the most versatile case for customization, I was hoping the Evolv X would be the Case of 2018. Also, I would have liked it to be the Case of the Year because the original Phanteks Enthoo Evolv was awarded case of the Year for 2015. It brings in that whole family love! :)"}, {"text": "Awesome round up Dimitry! Got my 011 Dynamic in White a few months ago right b4 my wedding.  That case deserves that award and it is sitting in its box in my living room waiting for me to put my 2920X or Zen 2 build in it =)"}, {"text": "my case is full alu 3T."}, {"text": "Man I feel like metallic gear neo series need to get some mentions 🤫"}, {"text": "It is about time"}, {"text": "I really want o11 dynamic but its not even available in here"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m43s\">8:43</a> XD"}, {"text": "Best SFF case?"}, {"text": "BEST IN BUSINESS"}, {"text": "coolermaster 300ql must be very loud considering its fully perforated right?"}, {"text": "Fuck that. TT View 71 FTW. Idiots."}, {"text": "You should check out the Thermaltake Versa H17. It&#39;s a mere $33.04 on Newegg right now."}, {"text": "For all the flack that the H500P caught, glad that the H500M was just the panel concerns. It was a pretty big pain to get all the equipment in the case, but I love the way mine looks now that everything is together and it&#39;s easy to maintain now that it&#39;s set."}, {"text": "I was 90% sure the lian-li was my next case. U guys have just made it 100%. Great 2018, have a great 2019. <br />Your word is gospel."}, {"text": "Woo Star Lord!!!!!"}, {"text": "I love my case better.<br /><br /><br />Evga dg 87"}, {"text": "NZXT H500 ot Phanteks P350X ? help me"}, {"text": "So glad I went with the 011 Dynamic for my case. It was worth every penny."}, {"text": "While I disagree with some of your recommendations, I agree with your Lian Li 011 for the case of the year. 😁"}, {"text": "When will you make your own case?????"}, {"text": "Agreed for case of the year, loved building it."}, {"text": "Just got my O11 dynamic delivered today I&#39;m glad everyone agrees it&#39;s one of the best cases out there"}, {"text": "ବାହୁତ ବଢିଆ ଭିଡିଓ | 👌"}, {"text": "Been on the edge of getting the lian li dynamic that I saw on your channel a while back, but this helped me go ahead with that decision. Spoiler: I was hoping that was gonna be the case of the year. Great work, love your videos."}, {"text": "gotdamnit, I&#39;VE BEEN WAITING FOR THIS FOR A FREAKING MONTH ♥"}, {"text": "I don&#39;t like modern case designs. Why have a giant tower design when it doesn&#39;t even house a single 5 1/4 inch drive anymore? That form factor was designed decades ago for utilitarian purpose, and now it&#39;s just taking up needless space."}, {"text": "Will you consider doing a review of Cooler Master&#39;s Trooper SE?"}, {"text": "ive been lookinf into MetalicGear, but it seems like no one is reviewing em. no one that im sub to at least. just the showcase on CES 2018, i really wanna see a comparison of it and h200. or &quot;big&quot; itx cases compilation."}, {"text": "Nice video chris pratt"}, {"text": "But does the Corsair 1000D come with the plant though? Thats the real question here."}, {"text": "wow, couldn&#39;t agree more with these picks!"}, {"text": "The Q300L is my go to for all my builds i order them by the dozen and customers love the looks without the added cost. great air flow and one thing you should have mentioned Dmitry is it can be placed on it&#39;s side and used as a HTPC."}, {"text": "Personally I would love to see more manufacturers making cases that do away with most of this glass window and RGB nonsense and instead focus on perfecting stuff like cable management, better directed airflow, and sensible compact designs that have minimal thermal impact. I approach building systems with a more utilitarian mindset and believe there can be a kind of beauty in efficient design."}, {"text": "You guys are the B-roll Kings! Makes me want everything on your channel."}, {"text": "The video we have all been waiting for"}, {"text": "Still rocking my s340 elite :)"}, {"text": "CollarDidn&#39;t someone on the channel review the Non M or P Cooler Master H500? That&#39;s actually been my favorite case to build in this year and I feel should have at least been a special mention. And yeah, that Lian Li Case is awesome. Great Video!"}, {"text": "This is the video I look forward to every year, especially helpful in years where I am upgrading my case."}, {"text": "Love my Phanteks Evolv X, but needed an easier/better way to mount a custom water cooling pump/reservoir..."}, {"text": "my fav. case is the QBX Kaze and thats where my current build is inx"}, {"text": "Awesome compilation to end the year"}, {"text": "Pro case withe  only 2x 3.5” while any good motherboard got 6x sata"}, {"text": "Need more, better, cheaper it cases"}, {"text": "80% of cases dont have front ventilation at all, BUT &quot;it got RGB&quot;.<br />As long as it sell I guess..."}, {"text": "I think the Phanteks Evolv X should have won the Case Of The Year Award......"}, {"text": "Evolv X 4 Lyfe"}, {"text": "Funny this video came out today and the o11 dynamic won case of the year because an o11 dynamic just showed up at my door today haha"}, {"text": "I just got the Coolermaster sl600m. Great case if you plan before you buy, I have the Corsair h150i, cooling my Ryzen 2600x at the top, GPU is vertical and temps are great. Noise is decent, phone app says it averages 35db and I am good with that. Thx for your review in helping me decide on which case to get."}, {"text": "ive been wanting to buy the pc o11 dynamic for like 2 months now and now i want it even more lol"}, {"text": "Hey Dmitry, great video! Would you mind telling me what fans are you showcasing in the Lian-Li build?"}, {"text": "2019 Better front case airflow ;)"}, {"text": "Just Bought the H500, and the ML240R! Excited to pick them up soon."}, {"text": "Never stop making this series..."}, {"text": "For me the case of the year is the Phanteks Evolv X, never had a case before that made building my PC such a nice expierence. The options are endless. This case not only looks fantastic the build quality is exceptional."}, {"text": "No Love for Corsair 280x ?"}, {"text": "Where can I get that pc wood model?"}, {"text": "I was waiting for this to buy a case!"}, {"text": "what about cooler master h500 $100"}, {"text": "I agree with every pick that you made except for the h500i 😂 built a system in it recently and hated it. It looks incredible tho"}, {"text": "Perfect timing, just few hours ago I was like &quot;Hmm, what&#39;s the best case of 2018, Oh wait Dmitri will upload something soon!&quot;"}, {"text": "I came here for the roast. I was not left wanting.  I also built my system into the Dynamic.  Glad to see it took the top slot."}, {"text": "meshify c master race :D"}, {"text": "Imagine my smile when I watched the video, after I got delivered the O11 Dynamic today :)))))"}, {"text": "Got an O11 Dynamic for christmas, its such an awesome case"}, {"text": "So you can EASILY carry it INTO THE GARBAGE.  Lmaoooo"}, {"text": "God, the content is already great, the lighting, the camera works, and the editing is absolute ORGASMIC!!"}, {"text": "I just came here for Dmitry&#39;s gorgeous camera work, I wasn&#39;t disappointed."}, {"text": "Comming into the video, im expecting the cases will be trash, too much glass, low airflow, made for RBG &#39;gamers&#39; with pricetags well above $100<br />After watching this video, i wasnt disappointed.<br /><br />Im still using a CM Storm Scout II after 5?ish years because its difficult to find cases that arent crap.<br />People want simple, airflow orientated cases with dust filters, have space for more than 2 HDD&#39;s"}, {"text": "I was debating between the o11d and EvolvX, so glad I got the o11D. Case of the year boiii."}, {"text": "Ok ok i get it so i will get an O11 Dynamic .... Last time Dmitrys opinion on an enclosure made me buy the Phanteks Enthoo Pro and wasnt disappointed. Good Video liked the Fail Compilation as everytime. Keep up the Good work with the Channel!"}, {"text": "one step forward with cases, but two steps backwards with your video, what happened to using a title screen for the next category ?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m05s\">7:05</a> what is the name of this case?<br />(i&#39;m not sure what he is saying in the vid)"}, {"text": "Corsair updated the 275R the one i got shipped with 2 sets of screws for the glass panel slotted and the fancy allen (hex) ones and pegs to hold the glass (purchased nov 2018)"}, {"text": "I was hoping on seeing more ITX enclosures, but other then that I&#39;m a fan of the cases you picked this year!"}, {"text": "The 011 dynamic was going to be my case choice but I need the extra 3.5 bays so the evolv x takes it for me plus the doors on the evolv X are really something that appeals to me rather than having to line up a TG panel to the frame and accidentally chip or crack it.<br /><br />all are still really nice picks though so"}, {"text": "I really looked forward to Lian Li PC 011 Air , but then I saw its CPU clearance and I became very very sad and also angry. This case was 1,5 - 2 cm from being the best 2018 case but nope. They forgot about decent height aircoolers. Major major fuckup."}, {"text": "Since O11 Dynamic has interchangeable side panels, does anyone know if LIAN LI sells it without tempered glass? I would actually love to have it all in &quot;cable side&quot; style."}, {"text": "did anyone tell you that your face is like chris pratt"}, {"text": "Wow. Lian li 011 is beautiful. ✔️"}, {"text": "Guys what do you think of Corsair Spec Omega?<br /><br />I am planning on building a Ryzen 2700x, GTX 1070ti pc"}, {"text": "HELP PLS! Monitor For gaming and movies? use general. Under 250 USD"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m40s\">8:40</a>  The savageness begins"}, {"text": "Now do best budget stuff"}, {"text": "I agree with the winner case because it is ingenious and looks great, but I would like to see the inwin A1 without PSU and the charger with slightly more affordable price."}, {"text": "I have a CM H500M case with addressable RGB fans and i complained about the almost non-existing customization of the individual LEDs at their forums and reddit page. One of their representatives noted that more ARGB support and other features will be added to their MasterPlus software after CES 2019 for more support of H500M and other cases. This means that almost certainly they will be unavailing at least 1 more case with ARGB fans at the expo."}, {"text": "What&#39;s the case at <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m50s\">7:50</a>? I can&#39;t catch the name due to Dmitry&#39;s accent."}, {"text": "as expected for the case of the year. that case really deserves it"}, {"text": "Anyone else got the view 37? Hope they make a tempered glass version"}, {"text": "Dmitri!!<br />May we have a discord channel ?"}, {"text": "Cooler Master has made some amazing cases this year.<br /><br />One of them being the H500. Not the P, not the M, but the regular one without the extra nonsense.<br />And honestly, building with the Q300L is just an amazing experience. I own both those cases and I just love the HAF design trend."}, {"text": "LMAO I have a full Linus tech tip video ad before you vid"}, {"text": "No mitx/sff"}, {"text": "pls more mini itx cases!"}, {"text": "I bought Cooler Master Q300L only because of you and I am very happy with it. Using I5 8400, GTX 1080 mini with cooler master H410r air cooler and my CPU temps never gone above 75 deg even at heavy load.<br />Thank you Dimitri. Its good to see Q300L in your list. :-)"}, {"text": "I don&#39;t know about you guys, but Dmitry roasting those bad cases made my year"}, {"text": "I personally love the H500 i version"}, {"text": "Where&#39;s the link for the tiny wooden case :("}, {"text": "Sl600m is sexy as f"}, {"text": "Now everything is about radiatos"}, {"text": "I knew the case of the year would be between the 011 or R6/S2."}, {"text": "I just got the case of the year i am so hyped to start my build in it, just need to get my Aio and rgb fans"}, {"text": "Ah what a timing I&#39;m just about to build a new PC soon after my exams finish and dmitri uploads this vid? Wait I&#39;m in heaven or what?"}, {"text": "I still recommend Phanteks Enthoo series to those who ask me about cases. I don&#39;t need to say why ;)"}, {"text": "lol my pc case is the one that chosen last year <br />Fractal Design R6 :)"}, {"text": "Hey can you help me to choose small case for my noctua NH-D15. Thanks"}, {"text": "How come O11 Dynamic is praised for great airflow with same dust filters as O11 Air?"}, {"text": "Best mATX case of the year?"}, {"text": "Welp, thanks to your recommendation 8 months ago, I currently have the case of the year standing right beside me :P"}, {"text": "Wish there were some cases with 5.25&quot; bays, for optical drives and such."}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=5m05s\">5:05</a> Have you heard of Louqe&#39;s Ghost S1? It has pretty much the exact same concept of the Riotoro Morpheus (expandable height) but the Ghost S1 is a mini-ITX case. It is also pretty well-recieved, and JayzTwoCents used the case in his video about building the smallest watercooled PC he has ever attempted."}, {"text": "Nzxt for 96, os nzxt crazy?!"}, {"text": "Awesome video, Dmitry! Happy new year to you!"}, {"text": "Curved Temper Glass ♥👍"}, {"text": "Great pick for the best of 2018..looks awesome!"}, {"text": "I was waiting for this"}, {"text": "Ok. About the H500M. I don&#39;t think it&#39;s that bad. I was able to build a system in it, just fine. The only problem I had was that I had to cram my psu cables behind a panel. But I think it&#39;s a great case. Don&#39;t let him discourage you from it."}, {"text": "Can you do a review of the cougar MX350, there are literally none"}, {"text": "I got the phanteks p350x thx for Christmas thx for the review a while back."}, {"text": "where is worst case trends ???"}, {"text": "this is the video i was waiting for"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=7m03s\">7:03</a> Deepkut"}, {"text": "P300 or h500? The p300 is $50 while the h500 is $90 in my country.."}, {"text": "Happy Q300L user here!"}, {"text": "Corsair spec alpha remains my favourite case"}, {"text": "I don&#39;t know, the H500M and H500P Mesh are great cases (H500P is lame tho), not sure how you can call them disappointing just because they have different RGB controllers"}, {"text": "One &amp; only PC Case expert on YouTube 🙏👏"}, {"text": "Yeet I have the case of the year!"}, {"text": "No nzxt h200?"}, {"text": "Liam li glass panels use adhesive and not some mechanical means to hold glass to panel frame?"}, {"text": "I feel like the view 71 should be there"}, {"text": "For 2019 i hope we have more &quot;inverted&quot; cases, been looking for one but the ones available atm dont really seem that great, im using a meshify C right now but i wanna switch my pc to the left side so i can mount a monitor on the right and i cant do it :("}, {"text": "Phantex could easily be the best pick / recommendation for a PC case with their tasteful RGB and Superior build quality but their airflow is really a deal breaker.<br /><br />Cooler Master hit the airflow point with H500M but WTF with all the minor flaws that make the case not worth buying ? like why does cooler master in particular keep fucking up their releases ??<br /><br />Dear Fractal Design, PLEASE give us an R6 with Meshify C front panel or at least make Meshify C literally just 3 or 4 cm more in length so we could actually use a high end GPU with Front mounted Radiator<br /><br />Corsair is just MIA from Case market imo, like come on ive been waiting for a Refresh of 780T with tempered glass and PSU Shroud for AGES !!  also ditch the plastic while you&#39;re at it !"}, {"text": "I rather liked the Phanteks Evolv X for it&#39;s style and sheer monstrous amount of SSD carrying space that&#39;s totally tucked out of the way. :)"}, {"text": "Where can I get mini wooden computer?"}, {"text": "Yesssss"}, {"text": "agree on the o11dynamic i have that one. but the black bars were a bit anoying at the glas so i wraped that in carbon white vinyl wraps so i have a complete white case!"}, {"text": "I am looking for a small atx case not much larger than a mATX. <a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=3m35s\">3:35</a> why are those cpu and gpu temps so high?"}, {"text": "+HardwareCanucks Excuse me, i have a question. What is your opinion from Lian-li pc-011 wgx (ROG editión)? Please, a need your answer. Thanks."}, {"text": "Well done Lian Li you do a great epic comeback I hope you made a budget friendly case"}, {"text": "Shame no full tower case&#39;s why??"}, {"text": "Your video helped me out so much"}, {"text": "So many shit cases this year with the closed off front panels. Damn right with the pc011 as best case. The air is great, just use it with an AIO. Air cooling is dead anyway."}, {"text": "What?! This ugly piece of shit Lian Li case gets Case of the Year? Are you serious? This thing is not only ugly, made by subhuman slit-eye scum but is also horrible for airflow and shit to work with."}, {"text": "My thermaltake v200 temperedglass rgb is very similar to your case of the year at around 10 dollars cheaper but that ones still nice"}, {"text": "Still finding my corsair 460x the most attractive"}, {"text": "Man, the whole time I just thought: WHERE IS THE O-11 DYNAMIC?!<br />And in the end it&#39;s the case of the Year😅"}, {"text": "woah im excited about this topic"}, {"text": "Finally"}, {"text": "Happy that the list didn&#39;t feature the FD R6 at all. Build in one a couple of months ago and I was very displeased with its quality."}, {"text": "I love the perforated design of the Riotoro Morpheus, any other cases like this on the market?"}, {"text": "The crap list is enourmous....Lian li really deserves the case of the year!"}, {"text": "Much awaited.....highly appreciated"}, {"text": "Hating on the H500M? 😐"}, {"text": "Oof, nice voice crack😂"}, {"text": "Where was the best case with an external 5.25&quot; bay category? I need to put my Blu-ray burner somewhere."}, {"text": "I still like the meshify c, but I wish they&#39;d release a usb-c version."}, {"text": "Such good timing, I was just looking for a new case."}, {"text": "The video I was waiting for."}, {"text": "I thought u had an itx build"}, {"text": "I&#39;m hoping for more Mini ITX, HTPC and SFF cases for 2019. Sometimes less is more."}, {"text": "👁👨‍🍳⛎🅰🥧"}, {"text": "For the love of God, stop recommending the P350X. It&#39;s a worse, plasticky P300"}, {"text": "Lian Li 011 Dynamic is just the best of the best. Looks and performance on top paired with a decent price...unbeatable. This case will stand for the next few years on top of the charts."}, {"text": "The video for which I wait for the whole year.<br />A big fan from India."}, {"text": "Great video as always HardwareCanucks!!! Happy New Year!!!"}, {"text": "I was just looking for a case and saw you uploaded a video. Nice"}, {"text": "Very happy with me Lian li O11 Dynamic on my desk ;)"}, {"text": "Love ure vids man... but i miss best mini itx .. nomination (idk how to call it)"}, {"text": "can you use intake fans instead of a rad in the front of the phanteks P350X?"}, {"text": "mATX case to buy?"}, {"text": "I love this channel I liked and subscribed keep on making good content"}, {"text": "Finally!!!!! Finally got the Starlord case awards video ❤️❤️❤️❤️❤️<br /><br />Edit: Oh my god oh my god<br />I got a heart from Mr. Dimitri 😄<br />And my comment is highlighted 😆<br />Love you Dimitri and Eber 💛💛💛"}, {"text": "Like First, Watch Later"}, {"text": "I was waiting for this for 2 months lol"}, {"text": "Can I use a PC case from 2001 :D"}, {"text": "Why do you call me good?"}, {"text": "No air flow focused case this year.. Disappointed.."}, {"text": "Still nothing beats the Corsair carbide air 540."}, {"text": "what do you think of the cooler master MB 520 (rgb)?"}, {"text": "finally! ive been waiting a week."}, {"text": "I have been deciding the 570X from Corsair and the LianLi PC O11 with same price in black friday (in my country at $120) but i decided to get 570X because the airflow is better although the Lianli look more sexy"}, {"text": "Yessss! I’ve been waiting for this!"}, {"text": "Why was there no category for the cases that didn’t make it into the video but are still good?"}, {"text": "My favourite tech youtuber and editor! ❤️"}, {"text": "and i was worried how come the 011 dynamic was missing from the whole video until at the end where it deserves to be  &quot;The case of the year&quot;"}, {"text": "Just started video. The Lian Li O11 Dynamic better win. Otherwise Im unsubscribing...<br />OK every1, we can stay subscribed and watch until 2019 awards."}, {"text": "I love those Case Handles for dumpster tossing!"}, {"text": "Hey Star Lord,  see you in April.<br /><br /><br />Thanks for the case review year end wrap up. :D"}, {"text": "I hope for 2019 would be something crazy like return of full towers, vented tempered glass, modular big cases like the haf itxs from a while back"}, {"text": "Awesome content as usual. po11 dynamic is indeed the best of the best and it&#39;s going to remain so for a very long time."}, {"text": "Ghost s1, core p1 and h700i ninja edition."}, {"text": "pls like"}, {"text": "This year doesn&#39;t have lots of case like last year"}, {"text": "I like the 275R"}, {"text": "I actually really want the mini April Fool&#39;s joke Cooler Master case to put on my desk or something. Wish they would actually sell them :("}, {"text": "Next you should do best cooling/silent fans of 2018......Id love to see where the Corsair ML 140mm RGB PRO jet engine would rate."}, {"text": "Hey Dimitri, could you show the View 71 some love? An Aio review not custom loop."}, {"text": "So many Dmirtys. Can not keep track of the real one."}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=8m49s\">8:49</a> wtf who designed that piece of garbage? I hope literally no one has ever bought that case"}, {"text": "SilentiumPC have great budget cases."}, {"text": "No best ITX case??"}, {"text": "Thanks, because of you I picked up Phanteks P350X. Budget case with decent airflow, decent cable management, but not all 280 rad will fit there."}, {"text": "My p350x is supposed to arrive later today. Glad to see I made a good choice with my new case."}, {"text": "I am thinking of building a matx pc and i really like the look of the in win 301C. However i am concerned about the thermals. I would install a 240 rad AIO on a 9600k. Do you think it could manage some decent overclocking?<br /><br />Thanks"}, {"text": "My favourite part of the video is when you roasted the cases lol"}, {"text": "The O11 Dynamic is ridiculously good looking. Easily the best case of the year! Great video as usual HC team! Happy holidays and here&#39;s to an awesome new year!"}, {"text": "NIce, my case won Case of the year!"}, {"text": "I want to upgrade from my NZXT S340 to the H700i so bad I love the layout of that case so so much. When I build a new gaming PC that Lien Li case I’m going to get. It’s sexy."}, {"text": "Finally"}, {"text": "Gaming headsets next plz"}, {"text": "Evolv X wins hands down, cant believe its not on the list"}, {"text": "what about the corsair 400c?"}, {"text": "I have to agree on that last one. Always love these videos"}, {"text": "Thank u for ur expertise in cases"}, {"text": "Last<br /><br /><br /><br /><br />I tried,ok?"}, {"text": "Thanks to you, I got the P350X for my new pc that I built on Christmas!"}, {"text": "@HardwareCunucks I was looking for a new case last year (for about 6months) and saw your review of the Define R6 I was impressed, and then when it won case of the year it was sold. Best case ever."}, {"text": "well... you dont know cube gaming, they sell tempered glass case and a decent looking for less then $40"}, {"text": "Finally..Been waiting for this video since gamers nexus released their list.."}, {"text": "Great vid! What would you consider to be the best airflow case of 2018?"}, {"text": "My favorite case is thermaltake view 71"}, {"text": "Shouldve waited for this video before I did my 1st pc build the case was a nightmare"}, {"text": "yay 68th comment"}, {"text": "I wonder what year they&#39;ll finally introduce a feature that would be worth dropping the internal hot swap bay for a fourteenth USB device. RGB is not it."}, {"text": "That Lian Lí PC 011 dynamic is amazing, but that plate with Derb8our&#39;s name on it is just hideous."}, {"text": "2018 cases all in one one video finel review nice video"}, {"text": "Wait for this every year, absolutely fantastic 😊 but highlighting the categories during the video would of been handy."}, {"text": "I really want one of those wooden pc models"}, {"text": "100% agree with your case of the year. The O11 Dynamic is extremely versatile, sexy, and affordable given its feature set."}, {"text": "i am sad no one talks about the fractal design meschify c :&#39;( its such an epic case"}, {"text": "Should add a category for the best/worst mini itx cases."}, {"text": "Just ordered an NZXT H500 2 days ago, it arrives in 3 days, switching my 2015 Aero-800 with it since the acrylic window on it cracked when I was moving to my new apartment. Seems like I made a good choice."}, {"text": "2018 and no DVD or blue ray player support. Retro is nice thing. I have be quied 900."}, {"text": "I have a 275r and I have had no trouble with the alen key and the rubber getting lost and I can hide the key so my sister can&#39;t use the thumbscrews to get in to my system (she&#39;s taken off my back panel before) cooling is very good and not chocked and was a joy to build in compared to other cases the case is also pretty big and support for aio is great really recommend this case"}, {"text": "First class."}, {"text": "Lian Li 011 Dynamic totally deserved case of the year in my book :)"}, {"text": "Have been waiting for this one. Finally ty :)"}, {"text": "Evolv X is the sexiest case"}, {"text": "it seems Boxes have just taken out the DVD player in the front and made a place for coolers tower(rad) and only enclosed the power supply and left a 1&quot; space for wire behind the board for wire management so really there no different than the Antex 900 from, Scam man!! the price is to hi for no reason for some. should be 4 usb 3.1 ports in front or side case for front use."}, {"text": "I want to see more cases with bottom air intake like the O11 from Lian Li and SL600M from Cooler Master."}, {"text": "Been waiting for a week 🔥"}, {"text": "Corsair Spec Omega RGB"}, {"text": "case video!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"text": "Been waiting for this video for long times, finally......"}, {"text": "My case doesnt even have front usb 3 connections"}, {"text": "I&#39;ve been waiting for this."}, {"text": "Its been so long since ive seen that beautiful face"}, {"text": "The best cases are the Evolv X and the Lian Li! i cant choose betwwen the two."}, {"text": "Hey Dimitri!"}, {"text": "Hello there"}, {"text": "The rewind we needed, thank you"}, {"text": "So, the Phanteks Dual System didn&#39;t make the list! What happened?"}, {"text": "I think a collab video should be in our future where Hardware Canucks builds me a new PC Setup"}, {"text": "nice"}, {"text": "NZXT &lt;3"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=3m06s\">3:06</a> is best value not budget"}, {"text": "Great video.  I wait for this one every year."}, {"text": "Thank you very much! Your inputs are best."}, {"text": "Just popping in early to thank the HC team for providing us enthusiasts with amazing content all year. The production value of your videos is up there with the best, I look forward to watching all of your upcoming vids in &#39;19. Cheers!"}, {"text": "What do you think about Kolink Stronghold?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WTnFIJs53Pc&amp;t=2m00s\">2:00</a> But how&#39;s the temp on that?"}, {"text": "just switched my computer case to the case of the year :P did it about 3 days ago. i absoulutely love it with rgb etc. its so nice &lt;3"}, {"text": "Was not expecting that intro. A little bit trippy because I just woke up"}, {"text": "Sorry but none of these have ray-tracing..."}, {"text": "Check the cougar panzer evo and tell what you think .for me it is the best case ever"}, {"text": "Oh finally! I want a heart from hardware Canucks on this one!"}, {"text": "Definitely better than last year!"}, {"text": "<i>The Pewdiepie&#39;s Rewind Is Stuck in my Head, And I Don&#39;t know What To Do</i> 😓"}, {"text": "Thanks for this! Been thinking of upgrading my H440 due to its poor cooling efficiency."}, {"text": "2019 is will be the year when cases are more mature with minimal design languages and premium materials."}, {"text": "Waiting for this for an entire year"}, {"text": "Swear to god i was looking if you had done one of these 15mins ago"}, {"text": "NCase M1 and any Caselabs case."}, {"text": "first i hit like than watch"}, {"text": "Most anticipated computer related video of the year."}, {"text": "I was the 8th one too like"}, {"text": "<b><i>Just use a cardboard box!</i></b>"}, {"text": "42 seconds ago, awww yeaah"}, {"text": "Hey"}, {"text": "damn"}]