[{"text": "I&#39;m confused. at <a href=\"https://www.youtube.com/watch?v=0UM5xzerIC0&amp;t=6m15s\">6:15</a>, you say cos45=1/sqrt2. In the table at <a href=\"https://www.youtube.com/watch?v=0UM5xzerIC0&amp;t=11m15s\">11:15</a>, cos45=sqrt2/2. ?????"}, {"text": "Maths is the way of thinking"}, {"text": "Jane is there a site on you tube where I can learn Trig from the beginning?  I had Pre Algebra, Algebra 1 and 2, and College Algebra, a long time ago. Around the year 2000 in a community college. And I would like to learn trig from the beginning. Thank You."}, {"text": "actually is this maths or piano?oh god"}, {"text": "I had not seen or heard this for 35 years. Thank you. And thank you for the sight reading lessons that I am now going to check out."}, {"text": "Heard the flush but not the wash !! Dirty teacher"}, {"text": "M"}, {"text": "Tqsm"}, {"text": "I&#39;m In 7th Grade And I Know What Sine And Cosine Is, Thanks A Lot"}, {"text": "but sin 45 is 1 by root2"}, {"text": "Damn, UMass? What else can you do, Jane?"}, {"text": "Bach and math?<br />LOVE"}, {"text": "homework answer 25"}, {"text": "Can someone make a mnemonic for the words"}, {"text": "Confused at the 0 degree part, how did cos 0 = 1??"}, {"text": "thank you mam"}, {"text": "If your background is strong, i.e., if you really know your algebra, geometry, and pre-calculus, you’re going to do well in college calculus. You don’t need a high school calculus course. <br /><br />The above was the conclusion of a long-term Harvard research study, published July 2018.  It&#39;s upsetting and incredible that something so obvious was ignored for the last 50+ years."}, {"text": "good."}, {"text": "where are you from?"}, {"text": "the basic formula means All the sin cos theta etc but what IS THE sin 45 = 1 by root 2<br />and by the way which Language you spoke"}, {"text": "I learnt the trig functions<br />MERCI!!"}, {"text": "awesome video"}, {"text": "yay I did well in exam .YAHOOOOOOOOOOOOOOO"}, {"text": "Awesome video. Astonishing pa!!!!!!!!!!!!!!!!!"}, {"text": "pls explain the basic formula😤😤😤😤😤"}, {"text": "Thank  you,  your videos are very understandable. Nice and slow. This is  a refresher course for me as i am 86 old."}, {"text": "I love Trigonometry :) I studied it alone years ago... And found it simply amazing !!! Good job as usual !!! I think that I&#39;ll follow your courses just because you speak slowly, and that will help me to master the mathematics vocabulary and syntax in English :)"}, {"text": "Dear Jane, I am enjoin you classes in you tube, I have disability called dyscalculia  which is a learning disability of math, I which to have all the videos to practice and pass my exam in trigonometry, please help me get the complete course, contact me at mangu026@<a href=\"http://fiu.edu/\">fiu.edu</a>.<br />Thanks <br />Mangurelo."}, {"text": "Don&#39;t know why, I prefer your piano videos  ;)"}, {"text": "thank u helped lot for me"}, {"text": "Thank you very much your video realy help me a lot .."}, {"text": "why does the sqr of 3 always go on top when dividing but the 1 goes over the 2 when dividing"}, {"text": "I am not understand"}, {"text": "Nice job explaining everything. You spoke nice and slow so the information had time to process in my rather small brain. I learned more in lesson one and two than I did in four years of high school. Some people speak geek and like to speed thru everything to show how smart they are but they are poor teachers. Again nice job people loke me appreciate it. Thank You"}, {"text": "I understand this a lot better than with my teacher discussing it"}, {"text": "so whats the answer  for the homework u gave . idont know if I&#39;m correct . I&#39;m just only 13 yrs old"}, {"text": "Helpful video"}, {"text": "good explanation"}, {"text": "I am understanding"}, {"text": "Excellent you are. Math &amp; Piano, you&#39;ve done well both. Thanks much Jane!!! 😍"}, {"text": "it  is not nice you correct it please"}, {"text": "Thank you for your time and effort in making this video..definitely helps !"}, {"text": "the best efforts"}, {"text": "thank you soo much this video i understand 100% and got perfect test.. hihihi im going to lesson 2"}, {"text": "...I&#39;m starting to understand, son of a shiv, you don&#39;t know how confusing it&#39;s been trying to learn to learn this from a computer that assumes you already know how to do this"}, {"text": "I was always confused with flat triangle and the values of Sine0 and Cos0 as  to their values. Now at the age of 54 I have cleared it. thank you very much."}, {"text": "thanks"}, {"text": "thankyou, but sin 45 and cos 45 are both √2 over √2? anyways it helped x"}, {"text": "Thankyou!! helped in alot of ways!"}, {"text": "And, How is theta defined? You said it was THE angle, which is pretty hard to figure out for something called a TRIangle. Is it the angle the hypotenuse and base make?"}, {"text": "This helps more than school"}, {"text": "What a wonderful video.... no body taught me like this when i was a student... I am now a doctor and reside in Dhaka, Bangladesh....  but i watch maths video to recommend to my son (who is now in year 8) and also to learn myself. <br /><br />I showed this video to my son..... he liked it so much!<br /><br />Thank you Jane, You are great. &lt;3"}, {"text": "awwwsemmmm .. i saw videos of 1 and 2 hours n it was so shitty. But this was the smallest , easiest and fastest to learn<br />thank u so much"}, {"text": "Well thanks for this, today&#39;s lesson on our school ;) Trigonometric Functions. Really helps"}, {"text": "before some time I was too confused about sine and cosine thnq"}, {"text": "Jane your video help me very much in trigonometry"}, {"text": "fue lo traduscan a español"}, {"text": "Jane just wanted to know, at <a href=\"http://www.youtube.com/watch?v=0UM5xzerIC0&amp;t=2m48s\">2:48</a> how is it an equilateral triangle. Isn&#39;t it an isosceles? Feedback will be much appreciated."}, {"text": "thanx😘😘"}, {"text": "How do i figure out whether to use sine, cosine, or tangent?"}, {"text": "Many thanks from Ukraine, Jane!<br />I&#39;m reacquainting myself to the maths in English and your videos are very helpful. Nice job!"}, {"text": "really really interesting.............I loved it ...it made me easy to learn and understand trignometry"}, {"text": "hi :it&#39;s great thnx"}, {"text": "Good job Jane, thanks for these vids :)"}, {"text": "please correct it.It will be a wrong guidence"}, {"text": "even cos45,"}, {"text": "it&#39;s not root2/2<br />check in other books and websites"}, {"text": "there is a mistake in it sin45 degrees is 1/root2"}, {"text": "<a href=\"http://www.youtube.com/watch?v=0UM5xzerIC0&amp;t=9m15s\">9:15</a> was probably my favorite part lmao &lt;3"}, {"text": "lol. What side for the what side? :) Thumbs up"}, {"text": "Actually I&#39;ve come to enjoy your accent.... its quite soothing."}, {"text": "cheers jane"}, {"text": "nice"}, {"text": "This is an awesome tutorial because it teaches the basics in a simple, yet gentle, format within a few minutes that anyone can understand!<br />Everybody can&#39;t teach, this video proves that Jane can!!!!!<br />Kudos :)"}, {"text": "Great explanation Jane"}, {"text": "Well you know what... I&#39;m sorry for that comment. Obviously you were trying to be fun and just thought it would I guess possibly seem more easy for the person learning. I was just thinking in a different per say &quot;field&quot;. Your video I give an A+ and hope you make more helpful videos for the world like this. This person is one of your fans starting now. Again I hope you can forgive me.<br />BTW I was wondering if when you get a chance to see my video &quot;Super Syd!&quot;, I would like to have another point of view for what I should do.<br />Thanks!"}, {"text": "Hey, I like how this is well explained and made. It had really helped me, but in my opinion I wouldn&#39;t just say &quot;duh&quot; in the middle of a lesson/ learning experience. No matter how fundamental you think the topic you speak about is, somebody in the world that is possibly watching your video right now could be offended. I&#39;m not saying that this you tube video wasn&#39;t good, but just think about it. BTW I clicked thumbs up."}, {"text": "TENK QIU????? GRACIASSSS GENIA"}, {"text": "JANE SOS GENIAL EN TODO!!!! LASTIMA QUE NO INGLES!!!!! TARDO EN TRADUCIR PERO HOY ESCUCHE TU VOZ TAN DULCE COMO  TUS MANOS EN EL TECLADO FELICITACION NO LO TOMES MAL OK YA SOY ABUELA DE 4 NIETOS Y SOLO SABE INGLES PEROLE GUSTA EL ROK, UN CARIÑO MUY GRANDE DESDE  ROSARIO ARGENTINA BYE"}, {"text": "Wow. You really have so much talent. Thank you for sharing.<br />I loved your video on the formula for Major scales but is there a similar formula for minor scales?"}, {"text": "I&#39;m confused. You teach Maths AND Piano??"}, {"text": "really awesome"}, {"text": "P.S. Thanks for the reminder on trigs"}, {"text": "<a href=\"http://www.youtube.com/watch?v=0UM5xzerIC0&amp;t=9m15s\">9:15</a> nice break when call of nature cannot be put off"}, {"text": "Jane, <br /><br />Thank you so much for refreshing my memories from the school after almost 20 years. I really enjoyed listening to your lecture. I just felt as If I were a young student and was sitting in the class. Please keep up the good work. I would love to check out your website, too. Once again, Awesome Job. I loved it."}, {"text": "Horrible"}, {"text": "I haven&#39;t take trigonometry yet so... What do you find out by figuring out the sin???"}, {"text": "lol who are you. Math teacher or Piano teacher?"}, {"text": "Added subtitles in English. The tool setting allows translations. Hope that helps!"}, {"text": "To all, I started to edit the automatically generated YT closed caption today. What a mess they made of it. It&#39;ll take me a few days to finish. Those who requested subtitles in Portuguese will be able to use the translation feature."}, {"text": "how to find they r asking.... y we use cos sin tan diffently"}, {"text": "<a href=\"http://www.youtube.com/watch?v=0UM5xzerIC0&amp;t=09m09s\">09:09</a> is the best part of this video!"}, {"text": "Thank you very much i promise to get an 8/5 for my math"}, {"text": "Is this grade 10 math"}, {"text": "Thanks! :P"}, {"text": "kl"}, {"text": "this is fantastic more effective than sleeping pills :-)"}, {"text": "Hey  <a href=\"http://www.youtube.com/results?search_query=%23jane\">#jane</a>  It WAs Very Helpful........THankss a Lot"}, {"text": "Hi Jane.  I found this Trig lesson fun as I&#39;m 63 years old and brings back memories.  I remember writing all the formulas down and using a slide rule to build the answer.  Calculators make it too easy in my opinion.<br />I actually found you on YouTube because I bought a Yamaha Digital piano and starting learning.  Thanks for all the vids.  Math is fun."}, {"text": "It was amazing..! Than a lot for the video... its the best video for the beginners in trigonometry..!  May God bless you..!"}, {"text": "That was an awesome lesson. I love math"}, {"text": "That was a Very Good Video. That is the best Trigonometry Video I have seen. I just turn 12 and I can completely understand this. Watch this Video this is Probaly the best one.<br /><br />Like this comment if you liked the Video."}, {"text": "I got 61 as the hypotenuse"}, {"text": "Is this the right answer for the math home work from your first lesson the hypotenuse is equal to 61??"}, {"text": "I would like to know if sin0 =0 why cos0 equal to  1?"}, {"text": "thanks for teaching us"}, {"text": "i felt very easy by hearing ur lesson"}, {"text": "What was the music at the start of the video? It seems very familiar."}, {"text": "Good examples"}, {"text": "I learned this when I was 13. Hard to imagine any kid at the age of 10 has to obtain these. I was busy with the ratios when I was 10 then "}, {"text": "♥"}, {"text": "Thank you so much for your brilliant video."}, {"text": "Loved ur video, helped me a lot......."}, {"text": "+Jane I adore Piano... I&#39;m not pro unfortunately... my Branch is maths and I adore Maths but I&#39;m not very good at it unfortunately...But you, you can help people by tutorials and lessons. I just find my perfect personality on you May god bless you&#39;re the most amazing human I&#39;ve seen in my life hahaha"}, {"text": "This voice in the video is yours??<br /><br />No offense,but your voice looks like the voice of a robot LMAO<br /><br />But about the video: Well,trigonometry is kinda hard to learn &#39;-&#39; and please,put subtitles in portuguese,i&#39;m a stranger,and whith subtitles in Portuguese,maybe i can learn better this damn thing!!<br /><br />Thanks :)"}, {"text": "It is a good video, it covers the main parts of Trigonometry."}, {"text": "love the accent! is that long island?"}, {"text": "Great lesson, thanks!"}, {"text": "1 minute break. i laughed and though, wel she is old and has to take a piss. then i hear the toilet flush. .damn i called it. thumbs up"}, {"text": "Jane, you are a very interesting YouTube person, but I personally feel your statement here is kind of ... fake.  &#39;this is far more important than my piano tutorials&#39;.  That&#39;s bulls***t.  You&#39;re not really being truthful; or are you?  You have an amazing piano talent, however you think Geometry is more important?  Or am i making / asking wrong comparisons?"}, {"text": "Thank you, Jane.<br />Many people learn best from hearing and seeing.<br />Writing “flip it from end to end…” seems awkward; my bet is that virtually everybody would know what to do in this case. :I:<br />Finkänslig"}, {"text": "@ <a href=\"http://www.youtube.com/watch?v=0UM5xzerIC0&amp;t=11m08s\">11:08</a>: Learn the sin θ line; flip it for the cos θ line. Do tan θ = sin θ / cos θ  for the last line. :I:"}, {"text": "thank you very much...helped me alot for brushing up"}, {"text": "Jane , i am also good in theory :P figure this one out willya, two hippopotamus = 5 medium rare elephants 2H = 5E (not squared , rounded) "}, {"text": "<br />please make videos with subtitles in Portuguese"}, {"text": "volume would be good, but thanks anyway"}, {"text": "i have a problem my prof last semester always ask tan180,  sine180 cos180      is their any triangle that i can use ? "}, {"text": "gooooooooooooooooooooooood"}, {"text": "Ahhhh! The famous--square root of three over two--or is it the square root of three divided by two--or is it three divided by 1.2247 or??? This was and still is confusing."}, {"text": "The &quot;New Math&quot; started my freshman year. I believe the teacher knew as little as we did since he was constantly referring to the text book for minutes at a time!! I use the right triangle solutions frequently in welding and fabrication--and in pipe fitting. Most of the workers have never heard of the Pythagorean Theorem. They just lay the pipe on the floor and &quot;rough fit&quot; it and then go install it--works most of the time. When I compute the length of a section using these formulas and it fits--they think it is some kind of magic!!! Reading the section in my daughter&#39;s text book which deals with right triangles--there is nothing there which is recognizable as what I know. It seems as though the explanations are in some kind of code!!!"}, {"text": "Whatever you are calling that funny little O with a line through it--this is the first time I&#39;ve ever heard that term--either in high school or real life. Is this something new or fabricated fro this demo?"}, {"text": "i was a bit confused on the reciprocals, but when i solved the homework i realized that the reciprocals is nothing more than just switching the numbers. awesome instructional! learned alot!"}, {"text": "excellent! Thanks so much for this!"}, {"text": "@Ishant Bibaan your comments do not have a reply option. extra work to reply :(  can I ignore you from now on? :)  my first language was not french"}, {"text": "IS YOUR 1ST LANGUAGE FRENCH??"}, {"text": "hello @Ishant Bibaan,  you&#39;re welcome :)"}, {"text": " PLS REPLY ME"}, {"text": "THANKS VERY MUCH !!!!!!!!"}, {"text": "thanx bro...."}, {"text": "reply me -  its very nice"}, {"text": "@Rachel Rose Estrebilla  Google+ will not allow me to REPLY to your comment. The sohcahtoh scheme is terrible. Forget about that completely. Then watch this lesson from the beginning. Pause and rewind when you do not understand anything. The definition of tangent as sine/cosine is most important. When the triangle sides are used, it comes out as adjacent/opposite."}, {"text": "yes"}, {"text": "sin 45 = 1/root 2"}, {"text": "You&#39;re welcome :))"}, {"text": "Thank you very much. :))"}, {"text": "Good to hear from you. Best of luck on your entrance exam. If you are interested in how basic trig can be applied, see word problems. I recommend PatrickJMT."}, {"text": "Thanks Jane, have an entrance exam next month for MBA. Knew nothing about trig, you helped me a lot. Cheers and keep up the good work. :)"}, {"text": "Good job, Renee!"}, {"text": "I understand now thanks :)"}, {"text": "no need to be sorry, just rewind and review until you understand all of it. this is a very important basic lesson. you need to understand every bit of it to do well in math later."}, {"text": "I&#39;m really sorry but I got a little confused... Most was very helpful though :)"}, {"text": "glad it helped Brandon. trig is FUN! :)"}, {"text": "i could never figure out when to use cos or sin and this is the only video that CLEEEEAAAAARLLLLYYYYYYYYY EXPLains it...thank you for being very detailed..."}, {"text": "thanks for writing, Yash :)"}, {"text": "You&#39;re welcome :)"}, {"text": "You&#39;re welcome Waldor. Glad it helped."}, {"text": "Thank you so much, Jane! ^_^"}, {"text": "Thank you Jane. You helped me a lot"}, {"text": "You&#39;re very welcome. Thanks for writing, and I hope you do well in your upcoming trig course."}, {"text": "Thank you for this video, I&#39;m trying to familiarize myself with Trigonometry before taking it during the short winter session since my work prevented me from taking it in Fall, I&#39;ve looked at other videos and the slow instruction really helped the information &quot;sink in&quot;, (pausing the video helped too) Much appreciated!"}, {"text": "thanks for writing :)"}, {"text": "This is very helpful"}, {"text": "you will do well in math :)"}, {"text": "Wow, this is very simple and I haven&#39;t started high school yet :)"}, {"text": "you&#39;re welcome. glad it helps."}, {"text": "please do not confuse my students. this is high school trig. they have not learned about &#39;functions&#39; yet."}, {"text": "you&#39;re welcome"}, {"text": "thanks prof this is helping me out "}, {"text": "if the 7 yr old has finished algebra"}, {"text": "keep up the hard work!"}, {"text": "glad to help. and thanks for the compliment  :)"}, {"text": "Youre really great, thanks a lot because i learn a lot :))"}, {"text": "please review your square roots. those fractions are equal."}, {"text": "you&#39;re welcome. you must be an attentive student :)"}, {"text": "Same here man!"}, {"text": "you&#39;re very welcome. happy to hear the good news :)"}, {"text": "THANKS!!!!!!!! Couldn&#39;t have passed my Trigo test without this vids"}, {"text": "thanks :)"}, {"text": "Nice Video!!!!! \n"}, {"text": "glad it help. have fun with trig :)"}, {"text": "my english is not to good but I  understand your video. thank you for showed this great video. help me very much. greetings from Mexico City"}, {"text": "thanks for writing :)"}, {"text": "very helpful!\n"}, {"text": "you get your F :) "}, {"text": "it is not a &quot;demo&quot;"}, {"text": "its not the square root of two, is the square of two, wich is four, and the square of one wich is one. four minus one is three\n"}, {"text": "most of us forget things we don&#39;t use :)"}, {"text": "Wow I learned this in High school but I dont remember any of it  "}, {"text": "Very bad video"}, {"text": "finding a good trig textbook appears difficult. I&#39;ve been searching the library without success. "}, {"text": "Thanks :) , now to find a used textbook somewhere, that way I can start my &quot;own curriculum&quot; lol , these videos are helpful too, my friend took it in the ninth grade. "}, {"text": "try.............an.............gle"}, {"text": "That&#39;s nice. I wish you smooth learning."}, {"text": "I missed out﻿ on learning about this stuff in High School . . But am wanting to, now that I&#39;m older and there is more time to focus in and concentrate."}, {"text": "sq rt (2^2 - 1^2)  =sq rt ( 4 - 1) = sq rt (3)"}, {"text": "how come the square root of two squared minus one squared becomes square root of 3? the answer should be one."}, {"text": "ha ha. I was bad! only two people got this far? "}, {"text": "that is simple algebra. should be automatic like 1 + 1 before one learns trig."}, {"text": "Also you should explain why sin45 is 1/root2 = root2/2"}, {"text": "One minute break... FLUSH!!!"}, {"text": "to distinguish among various concepts, such as angles and sides, or different coordinate systems."}, {"text": "don&#39;t know what to choose. plenty of word problems already... want trig ids?"}, {"text": "This is fantastic! Can you post more videos please."}, {"text": "I&#39;m sorry, I was so distracted by the Megan Fox Ultrabook commercial that I couldn&#39;t focus on Trigonometry. "}, {"text": "oh lord where do i find the second one i need more. every video i&#39;ve seen so far stops here like this one and trigonometry is never spoken of again."}, {"text": "super video guide to trigonometry"}, {"text": "Got busy doing other math topics. Might do more high school trig next because of your comment."}, {"text": "lol, you are the first one who commented on my joke. I had thought my lesson went down the drain."}, {"text": "I heard the toilet flush, she must be doing the lesson inside her bathroom"}, {"text": "glad to know that :) keep at it and have fun. you&#39;re welcome to send me questions."}, {"text": "Thank you for this.  I was about to jump back into trig as a non traditional student and was feeling a bit anxious about starting math again.  This seemed to put me a bit at ease. "}, {"text": "yup,but don&#39;t worry I did post a comment apologising on said person&#39;s channel \r\n(to anybody out there who knows me yes the princess of pride can apologise and there will not be a need for anybody to put this post in a record book):) again I am sorry but I have friends who revel in writing in&quot;text/BBM language&quot; and in the english exam our teachers had no problem designing their essays with question marks as well as big fat zeros"}, {"text": "sorry for my late reply. algebra is a pre-req for trig"}, {"text": "was that necessary?"}, {"text": "well.......honey I guess that you can&#39;t say the same for your english teacher because the word is spelled prAise[(don&#39;t mean to be rude but I just thought that I would let you know) plus I do understand that you could have been typing at paranormal speed resulting in this &quot;error&quot;]"}, {"text": "you&#39;re welcome :)"}, {"text": "THANK YOU SO MUCH DEAR TEACHER. VERY USEFULLY.PRISE YOUR WORK.\n"}, {"text": "college alg is like alg 2 but with more information. it&#39;s also offered as a high school course just like trig. but i have to take them again in college since they werent worth college credit"}, {"text": "not sure what college algebra consists of, because algebra i and II used to be in high school. this belongs in high school trig. "}, {"text": "Is this class harder than college algebra? or vice versa? any reply would be greatly appreciated"}, {"text": "This video saves my life :D"}, {"text": "Wow thank you, this was very clear and made complete sense! The music wasnt too bad either (h)_(h)"}, {"text": "thanks alot... now i can do my homework...\n"}, {"text": "Bach minuet in g"}, {"text": "I would like to ask the music song from beginning.Thanks a lot."}, {"text": "Im 15...and math is a chore....which i can refuse to do...sometimes...."}, {"text": "there are thousands of math topics, hard to choose from... will keep your suggestions in mind."}, {"text": "love part one of your trig.video i learned what I couldn&#39;t learn back in high school in the 70&#39;s.\nThank You; Now is it possible that you could upload a part two of trig? and maybe if you could add ratio proportions,percents,fractions,basic shape measurements and how to an essay?\nThank You:\n Billy"}, {"text": "purportedly 32 yrs old from Australia? are you proud of yourself for announcing your adversity to math?"}, {"text": "I fall asleep in class...to watch This!!!!! Y GOD"}, {"text": "yeah, this teacher seriously wants you to learn!"}, {"text": "beware, for only the boring get bored :)"}, {"text": "boring stuff bro!!"}, {"text": "i was like not here, what has youtube come to, when she mentioned homework. lol."}, {"text": "meaning of the name of each trig ratio? please explain."}, {"text": "Great tutorial. Unfortunately, you should&#39;ve go more in depth and explain the meaning of the name of each trig ratio. It&#39;s important."}, {"text": "Thank you ma&#39;am, I appreciate it very much. Luckily I found your channel, the explanation seems very clear to me. :)"}, {"text": "easiest way is to use my website. there is a &quot;math tutorials&quot; page that lists the ones I&#39;ve done.  log and exp belong in precalc. I&#39;ll get to those someday, perhaps sooner because you asked."}, {"text": "thank u very much, is there other parts?  Have you videos about log and exponential function? I was searching for that on your page, but there is too much piano videos, it doesnt make it easy to find out what you are searching for. Pls distribute videos by subject on your page. I wish I found your videos earlier, really helpfull, thx again. (sorry for errors)"}, {"text": "yes maam"}, {"text": "pay attention everyone:  for all my math tutorials, take out pencil and paper and  work on the examples with me. takes notes as if you were in a classroom. have to involve as many brain cells as possible."}, {"text": "im in 7th grade and this just blew my mind but im starting to get it"}, {"text": "good :)"}, {"text": "I Have no idea to be honest with you...algebra had a little bit of trig problems in it.and thank you ill be sure to send you some questions"}, {"text": "couple years back,i found this pointless to learn but it seams i&#39;m going to need for the rest of my graphics design life. i wish my teacher would give real world example at beginning lesson so i don&#39;t get bored and only have to learn it for the exams, find out later like now that this is really important."}, {"text": "why was this in algebra? trig is fun and easy. get a good work book, study one section at a time and do the problems. if you have questions, send them to me and I&#39;ll help you."}, {"text": "they did this on the algebra regents my freshmen year thank god i go a 92 on it.but when i got into trig my jaw dropped i did not understand NOTHING !!!! im soo going to fail this regents -__-"}, {"text": "this video was great! i really liked the technology that was used in it."}, {"text": "Thank you so much! I really appreciate it"}, {"text": "uploaded part 1 on sine function examples.  part 2 will be on the cosine, and include changing periods."}, {"text": "yes please. that&#39;ll be great. thx! "}, {"text": "most learn that as part of calculus. will add to list. all six functions?"}, {"text": "can you make a video on graphing trig functions with shifts, amps, etc.? "}, {"text": "your classroom is down the hall"}, {"text": "i can take this balarena music anymore !"}, {"text": "in layman terms, a function assigns to each input value, a unique output.  as you saw, a trig function assigns a number to each angular measure. there are other functions that have to do with triangles, such as inverse functions. functions are useful. without functions there will be no advanced math. you can read more on wikipedia. math is FUN :)"}, {"text": "Lets see, I am not mathematical... would you talk a little bit about &quot;function&quot; as a concept.  I would like something like a philosophical-mathematical definition... something we can work &quot;imaginistically&quot; Does a triangle have only six functions?  What is the use of a function? What does a function not allow one to do?"}, {"text": "ok...  and good luck in your studies"}, {"text": "sorry.."}, {"text": "please do not use vulgar language to comment under my videos, even if it is meant to be complimentary. if math is _____  in your country, you can learn on your own. khan academy covers almost every topic."}, {"text": "how would you handle a roomful of unruly teens? is that what your teacher is dealing with? luckily I never had to deal with such problems."}, {"text": "Understood it&#39;s just that it infuriates me that my teacher doesn&#39;t have control over the majority of the classroom."}, {"text": "excellent, but please don&#39;t call your teachers stupid, okay?"}, {"text": "I got a 100% on it. i got 20/20"}, {"text": "how did you do? :)"}, {"text": "the hypotenuse is always the longest leg. look at the picture."}, {"text": "hey....at 3:22 my answer was 1 but when i added instead of subtracting i got 3"}, {"text": "Wow this video save my life. Tomoroow is the test and i learn exactly ehat do i need to know. I will trade my stupid teacher for this video anyday."}, {"text": "Are you by any change chinese? Not to be rude but it it sounds like it.:)"}, {"text": "Im using the fx-82B"}, {"text": "I totally love your video, brought back memories, unfortunately I didn&#39;t get as good an explanation as you did now back in the day, but I have the privilege of passing your video on to my kids. Thanks!!! "}, {"text": "@stevalianarbone see my reply to a greensleeves comment  :) "}, {"text": "@bbdhrggl I seem to remember slide-rule, but never knew how to use it. I couldn&#39;t read or write when I left school, the only sums I knew was from playing darts. Though picture of me was taken last year I&#39;m age 52 next so I&#39;m probably much older than you Jane. "}, {"text": "@missshawolelfsone good luck on your test :)"}, {"text": "@stevalianarbone amazing that the casio battery still works. i used to use a slide-rule! you probably never heard of those :)"}, {"text": "I been working on your Trigonometry demo today Jane, and though seemingly easy to follow, from looking at your tabe I got to brush up on my fraction devisions. I wrote it all down as well as you mentioned in another video to do. It does help. I also used my casio scientific calculator fx-82A  to find square root. (I bought it back in 1988 and still battery is not run out and is working perfectly. "}, {"text": "@Claybear17 the values come from the triangles in the examples"}, {"text": "Im in 7th doing pre-alg and within 2 hours i know trig (:"}, {"text": "@yaniyan2809 ace your algebra before doing trig  :)"}, {"text": "i&#39;m 11...I&#39;m trying to learn this..so when im in high school...I got no probs....j/k"}, {"text": "nice video...tnx\n"}, {"text": "@AreWeStillFree1 I am not familiar with trig textbooks. will ask a local HS teacher or you. for calculus,  I strongly recommend author Howard Anton. let&#39;s correspond via personal messages after this."}, {"text": "@mia031593 good luck! :)"}, {"text": "Thanks a lot for this vid! I have a monster test on trig, and I think I&#39;m gonna make it now. Thank you soooo much!"}, {"text": "@SuperOutcast55 very funny, at least now you see why I don&#39;t say anything on piano tutorials :)"}, {"text": "tho if i can&#39;t fliping understand your esths language, how can i understand Pythagoraths therom?"}, {"text": "I can barely follow, I understand the concepts like a person understands words to a new language because the word is defined right beside it, its just that reading the language is very difficult. I find this alien and enormously difficult, but still somewhat comprehensible."}, {"text": "@Banvoolivre your request for a piano tutorial does not belong here :)"}, {"text": "@bbdhrggl Ok. thank&#39;s a lot! :)"}, {"text": "@MrPianist101 one lesson will not be of much help because algebra encompasses many topics. I did one on factoring that you might find useful in Algebra II. The best thing you can do is get a Barron Algebra thick workbook (library) and do as many problems as you can. my husband and I are seriously considering starting a math series, but you will be way ahead of us by then. good luck. algebra is fun, and it is an important foundation for calculus. you can message me questions any time."}, {"text": "Is there anyway you could do an Algebra Lesson for me? I&#39;m going into algebra next year for my sophmore year.  Thanks!\r\n"}, {"text": "@bbdhrggl noo, not at all! :)"}, {"text": "@jinxler disappointed? :)"}, {"text": "@paper900 mutation?"}, {"text": "I thought you were a guy!"}, {"text": "I always wondered how you will sound like ! Thank you so much ! youre such a talented person  :) "}, {"text": "I belive You are proffesional teacher. You are also great speaker/announcer - helpful to learning english."}, {"text": "Thanks!!!! : )"}, {"text": "Yeahh! you&#39;ve made a new math tutorial :)\nvery good job Jane. \nyou explain it very good. :)\nmaybe you make some day a new channel with ONLY math tutorials ?! :) that&#39;s only a idea. your tutorials are very helpful. ;)"}]