[{"text": "Hi Bold Bakers! Get my written Microwave Butterscotch Blondies recipe ( <a href=\"http://bit.ly/ButterscotchBlondies\">http://bit.ly/ButterscotchBlondies</a> ). Plus, get started with 8 free meals – that’s $80 off your first month of HelloFresh. Go to <a href=\"https://bit.ly/30ic1Vy\">https://bit.ly/30ic1Vy</a> and enter gemmasboldbakers80"}, {"text": "Whatever you do comes out perfect 👌."}, {"text": "Hi i dont use egg so do i need to add baking soda too?"}, {"text": "I made these last week. They were fabulous ! The edges were very chewy like caramel and  rest of the brownies were lovely and chocolatey and fudgey ! I will definitely be making these again !"}, {"text": "You are amazing Gemma 🤗"}, {"text": "Gemma Ma&#39;am <br /><br />We have seen so much of your microwave baking and you are brilliant at that<br /><br />But plz start stove baking like fry pan cake, saucepan cake for all those people who doesn&#39;t have a microwave<br /><br />Here are some links and tutorials of the method <br /><br /><a href=\"https://youtu.be/b0fuX0SyJmY\">https://youtu.be/b0fuX0SyJmY</a><br /><a href=\"https://youtu.be/-hZ-7xWNanA\">https://youtu.be/-hZ-7xWNanA</a><br /><a href=\"https://youtu.be/6xj1yJopVjU\">https://youtu.be/6xj1yJopVjU</a><br /><br />You can use these methods of baking by using your recipe,it would be amazing.I believe so<br /><br />Just a suggestion and humble request<br />At the end it&#39;s your choice if you don&#39;t like the methods then don&#39;t make it<br /><br />Be happy <br />Keep smiling 😊<br /><br />Your fan"}, {"text": "Can you please share some fall recipes? Huge fan!!! 😁"}, {"text": "Do you have a low-carb, blonde recipe?"}, {"text": "Gemma is a blondie and a brownie same?<br />I am sorry if that sounds dumb but I just cannot find the difference"}, {"text": "Hi, pls make a video for white chocolate cake"}, {"text": "Thesee look fantastic!"}, {"text": "Is the texture gummy?"}, {"text": "Hi, can you make cake pops in an easy bake oven ."}, {"text": "Can you do sacher torte"}, {"text": "Ooh. I love butterscotch. Thank you for sharing."}, {"text": "Super yummy can&#39;t wait to try fyi type the promo code in hellofresh and it says it doesn&#39;t exist 🤪"}, {"text": "Is it okay to use molasses instead of brown sugar  ??"}, {"text": "Love this... Thanks for the recipe... More more more microwave meals please~ 👌"}, {"text": "Bad experiences with HelloFresh.  Would Not recommend."}, {"text": "Ad&#39;s not cool, took almost half the video."}, {"text": "Her channel and recipes are what we never knew we needed but need and love"}, {"text": "Can u please make easy recipes that are vegan and for weight loss that don’t take long and are easy to make bc I know so much people including me would appreciate it so much!!!❤️"}, {"text": "New here and subscribing bc your recipes are the best and idk what id do without them!"}, {"text": "Oh Gemmyyy miss your videos lodz😭😭😭💔 lovely recipe ❤❤👌🏻"}, {"text": "<a href=\"https://youtu.be/PLH9EV91cME\">https://youtu.be/PLH9EV91cME</a> check this 😂😂"}, {"text": "Wow"}, {"text": "Hi gemma! Great recipe as always! I have a few questions, I&#39;d be very thankful if you would answer them.<br />1. I can&#39;t find brown sugar nor molasses here where I live, can I substitute it with palm sugar or shredded jaggery?<br />2. What is butterscotch, really? Because I see many kinds of dessert or sweets with butterscotch flavor.<br />Thank you so much in advance, Gemma. Keep being awesome!"}, {"text": "Oh yeah baby.. white chocolate instead of brown chocopoop.. I&#39;m loving ur recipe !!"}, {"text": "This is super super awesome"}, {"text": "they look nice good job gemma<br />btw i reckon these will go well with a scoop of chocolate ice cream i mean chocolate=caramel is quite a good combo"}, {"text": "It looks deadly delicious..."}, {"text": "Amazing recipe. Fast and delicious, thank you 🥰😘"}, {"text": "Hi gemma..<br />Is ok also in oven..since i dont have microwave."}, {"text": "Yummy! Good summer dessert."}, {"text": "We need more mug cake recipes!!!"}, {"text": "You should do a video on pregnancy diet/ what desserts you eat while pregnant! That would be cool!"}, {"text": "Josh made a reference to your channel <a href=\"https://youtu.be/ZqAE19OIfMc\">https://youtu.be/ZqAE19OIfMc</a><br />at about 11 minutes and 37 seconds"}, {"text": "can i also bake it in oven since i dont have microwave? 😟 if yes what temp and cooking time? 😊"}, {"text": "Thanks Gemma 🙂"}, {"text": "I like your recommendation...eat them when they’re a little pit warm....it’s like eating a warm butternut blondie. 😂<br /><br />Aren’t you eating just that?"}, {"text": "Butterscotch blondes 😍😍 oh my gosh those look so wonderful"}, {"text": "Gemma, these blondies look delicious  :) Absuloute heaven♡ Great job :) Lots of love"}, {"text": "Yeheeeey another geeat recipe for microwave baking 😊"}, {"text": "The chorizo in the paella hurt me as a Spaniard. And why would paella be spicy? We don&#39;t eat spicy food in Spain. I am so confused XD <br /><br />Great video though. It looks super yummy and very easy. I will have to try making them."}, {"text": "Definitely going to try this sometime! 😚😚😚"}, {"text": "As a student, I greatly appreciate this. 🥺😘"}, {"text": "Love your channel. Awesome recipes."}, {"text": "I love your videos ❤️<br />Keep going"}, {"text": "Sorry Im late but I want to say something for this recipe very very but very delicious Im seriosly going to try tomorrow"}, {"text": "im sure Gemma invented baking. I always use her recipes."}, {"text": "Ahahah this looks amazing! Bye bye diet"}, {"text": "Instead of chocolate can I add nuts???"}, {"text": "Looks delicious!  My one question... since they are microwaved, how do they hold up 1 or 2 days later?  I mean baked goods do tend to dry a bit as they age, but is that problem more noticeable since they were microwaved?"}, {"text": "Hey Gemma awesome recipe <br />Do well ☺☺<br />Good night 🌌🌌🌌🌌🌌"}, {"text": "Now we want a video tutorial to make these on stovetop 🙂"}, {"text": "It sounds delicious. Thank you for the new recipe Gemma."}, {"text": "aw maan.. soo good😍😘😍"}, {"text": "What can I replace the eggs with to make them vegetarian"}, {"text": "Hi Gemma! Thanks soooo much for adapting the recipe for a microwave. My oven does not work and I miss baking. Your best ever carrot cake is my favourite cake and almost one of my signature bakes with my friends and family. Can&#39;t wait to try this recipe."}, {"text": "Do flax eggs work?"}, {"text": "Wow"}, {"text": "So yummyyyyy...😋😋😋😋<br />Love these Butterscotch Blondies.😉<br />Bravissima Gemma👏👏👏👏👏👏👍💋🙋‍♀️"}, {"text": "Hi Gemma!👩‍🍳 I love this recipe! It&#39;s so quick and easy, yet the result is so scrumptious! This is a terrific recipe to have on hand when guests pop up! The blondies looked so moist and yummy when you cut into it. I have always been the person who loves the middle portions of brownies, I have never tasted a blondie yet. So whilst my Ma and sisters we&#39;re fighting over the corners, I was enjoying everything that was left LOL. I have everything for this recipe except the ice cream🤩. Thanks Gemma, you always keep coming up with such wonderful recipes for us.❤💚❤"}, {"text": "Easy for a quick snack love it...if you guys more healthy recipes.check Out Daley lifestyle! They need support 😊"}, {"text": "Amazing quick and easy recipe Gemma, thanks! 🥰"}, {"text": "I&#39;ve got my eye on these. They look nice."}, {"text": "Gemma are there any egg replacements for this recipe?"}, {"text": "Hello Gemma ☺️ Always like your Recipes 👍 Whenever I am Tired n Tempting for Chocolate Perfect Blondies makes the Day ☺️ Have a Lovely Day ☺️"}, {"text": "&quot;It&#39;s like the center, but it&#39;s everywhere!&quot; - best phrase! = )"}, {"text": "Can you make a video of food for the gods. I miss the taste of it. It&#39;s hard to find it."}, {"text": "YUM! I know what I&#39;m having with coffee this afternoon  :)"}, {"text": "Awesome as always. Can we use salted butter. Just asking most recipes say unsalted butter and then salt is added. So can we not use salted butter. Just question. Hope u dont sound rude."}, {"text": "Also this looks fab!"}, {"text": "Can we use light brown sugar?"}, {"text": "These are very good!"}, {"text": "These look delicious can’t wait try love your recipes Gemma x"}, {"text": "Loved these in college. Hope to make these once I find molasses."}, {"text": "Can I use coconut sugar ? and flaxseed instead of eggs? Thank you 🙏"}, {"text": "Hmmmm I can make this over the weekend. Would it matter if I use a different kind of brown sugar? Like I use the darker variety or maybe palm sugar even?"}, {"text": "I love your microwave videos because they’re easy and tasty ps love your videos Gemma"}, {"text": "Amazing ...😋😋😋"}, {"text": "Any substitute for eggs?"}, {"text": "Looks yummy ! 😋"}, {"text": "Yesss! I wish I was your neighbor!"}, {"text": "OMG thx soo much. I was looking for an awsm receipe to bake this weekend"}, {"text": "Love the microwave recipes especially when the air conditioner broke."}, {"text": "Yum looks delicious tell waffles i love him soooooooooooooooo much and i say hi to him love dogs tell waffles he is my friend drooling over my samsung galaxy j4 love your recipes making me hungry Thanks Ramya"}, {"text": "What lovely blondies, Gemma, and you look so pretty in red. Do you have any Thanksgiving recipes in the works? Take care of yourself, sweetie. &lt;3"}]