[{"text": "Thanks for the helpful tutorial. Though I noticed there may have been a mistake @ <a href=\"https://www.youtube.com/watch?v=AX9WmW-6_8M&amp;t=6m07s\">6:07</a> on the left hand should be(according to my score) B E A, instead of B E B."}, {"text": "Excellent tutorial 💙💚❤️💛💜💙😀"}, {"text": "Love you Jane!! &lt;3"}, {"text": "Jane, Your rock!!! thank you so much for the video.I just got the music score and am going home to play!!"}, {"text": "Very nicely done. Very helpful also! Like Hafiz I&#39;m a guitarist and sometime  blues  piano player. But I&#39;ve always wanted to learn this beautiful prelude. Thank you."}, {"text": "Hello Jane, thanks for your tutorial, I finished it and put it in a recital I did. If you want to see a part, the video is below, thanks, see you later!<br /><br /><a href=\"https://youtu.be/jZ-KYmklDLg\">https://youtu.be/jZ-KYmklDLg</a>"}, {"text": "muchas gracias.. gracias"}, {"text": "Jane...I think this is your best one yet!"}, {"text": "Good morning Jane... Lovely playing. I am more of a jazz player, but &quot;classical&quot; music is my true love. So with that in mind I decided to work on my &quot;legit chops. I picked this Prelude to start working on, as well as Hanon exercises. My problem is the last 3 chords. I have very small hands (an octave span), and I can&#39;t play the chords as written. Any suggestions? I can leave the bottom octave out, but it loses something. The last chord I can play the lower octave (left hand) as is, and not play the root with my right and still play the rest of the chord.Note: I can play the 9th as long as I don&#39;t have to play anything with my middle fingers... I hope some of this makes sense."}, {"text": "Jane, can you please send me a link to your PRELUDE IN E MINOR BWV 941 by Bach. I would really appreciate it."}, {"text": "Please make a new tutorial with score. Thank you"}, {"text": "Hello, Jane - if you have sometime in your very busy schedule, please would you be kind enough to serially write out that turn in the stretto section for me. And, if possible with the correct fingering.   I do not manage to see how you do it even at the slowest pace available on your site.  My copy just puts the turn sign which is lazy. This means absolutely zilch to a beginner like me.  I am so glad Chopin is not here to listen to my version of this Prelude - hahaha!"}, {"text": "Jane pls make a website and let people who want to donate as an appreciation for what you do be able to do it (donate)...     Whenever I look for a tutorial for a piece ur videos come up for it!! and I feel great cuz I know I&#39;ll learn it. <br /><br /> thank you thank you thank you and May God Bless you &lt;3"}, {"text": "Wäre der Ton besser, wäre das Stück super!"}, {"text": "Bonjour Jane, Auriez vous conçu un tutoriel pour le prélude opus 48 n°18 de Chopin.<br /><br />Merci. Christine"}, {"text": "Скажите, пожауйста педаль нужна во время всего произведения?"}, {"text": "I&#39;ve got the notes of it and I&#39;ve tried it. I think I&#39;m gonna get it but it&#39;s a bit difficult like all the original preludes..."}, {"text": "Lovely music and view those hands... I&#39;ll start practice right now!!! Mexican&#39;s Hughs dear +Jane ;)"}, {"text": "Do you use the pedal when you&#39;re playing those repeated chords in the left hand? If not, how do you get them to sound so continuous and not choppy?"}, {"text": "Thank you, Jane."}, {"text": "loving your tutorials, love Chopin, just learned Fantasies Impromptu, and Nocturne no. 21 and your tutorials help so much.. definitely going to play this piece. its a nice change of pace from the overwhelming Fantasie impromptu, THX JANE :)"}, {"text": "Help!  Somebody tell me the notes!  Only the notes (do-re-mi... )"}, {"text": "Great video, super helpful!"}, {"text": "as a pianist, who is your favorite compositer ? i&#39;d like to know ! as for me it is beethowen .... thank you to take the time to answer me !! ;) great video !!!"}, {"text": "soon one million viewers on this.... such great work jane...."}, {"text": "Thank you so much Jane!!!  This is so helpful."}, {"text": "You have wonderful hands, Jane"}, {"text": "i dont understand, with tutorial you mean looking somebody that is playing?"}, {"text": "Jane... I could barely play the piano and read zero music. My main instrument is the guitar which I mostly learn from tablature and just by ear. I was introduced to Chopin by my girlfriend and since then have come to appreciate how beautiful his compositions are. Your video above is helping me play this piece, and I&#39;m happy to say I&#39;m 40% from completion. Thank you, thank you, thank you."}, {"text": "Thank you for this great tutorial!  Between watching you and the sheet music I have I can play this song now :) but I was wondering how you know to play a fast B, B flat, A, B flat where the x thing is in the E space?  This is so confusing to me. I am trying to learn to read music better but I have been unable to find this symbol in the music theory books I have bought..."}, {"text": "Elinden birşey görünmüyorki."}, {"text": "Noob question. When you vary the tempo, is that interpretation or is it indicated in the sheet music? I.e. Slows down at start of each bar. "}, {"text": "Lo~~~~~ng Fingers you have ! I am so envy you ...............<br />It is so hard to reaching key combination for me............"}, {"text": "this was played in fifty shades of grey"}, {"text": "I really love all your tutorial vids.  they help me so much while practicing!  However, sometimes I can&#39;t really see which key you&#39;re playing due to the videa angle coming from the top.  If it is possible to switch it up whenever you can, it would be greatly appreciated!"}, {"text": "This was so helpful! Xoxo"}, {"text": "Thank you for showing how!!!  Playing this and Moonlight Sonata in recital at end of year.  Beginning 3rd year lessons.  Listen to neoclassical mostly, didn&#39;t know much about Chopin, when I heard this, new I had to learn it.  This much beauty requires lots of pain, get the feeling something was hurting bad.  Hence the name &quot;Suffocation&quot;."}, {"text": "Thank you so much Jane for making these tutorials.  I&#39;m an old lady today, always wanted to learn how to read, am teaching myself and your tutorials are a Gift from GOD to me!  Bless you !"}, {"text": "This is my favorite classic, I&#39;m still learning it. I admire your  patience, smoothness &amp; sensibility that I&#39;ve been looking for a long time at youtube, finally I found you. There is one thing that I wonder, if most good piano player always have long fingers that help them to play easily, rare are the ones with short and thick finger which is my case, I find difficulty to reach some keys, in other words some people were born to be pianists, right ?  others no matter how hard they try nothing happens, except Erroll Garner who started at the age of 3 and died without knowing where the Key of C (center) was located.<br />I love the way your fingers move on the keyboard it inspires me to learn more it&#39;s just amazing. I have subscribed, I&#39;ll be watching you."}, {"text": "@Leo Thomas Bookmark this site: imslp dot org. It is the best source of free classical sheet music"}, {"text": "Incrivel jane!! Você é espetacular! ! Parabéns pelo talento. Continue postando videos <b>-</b> ;)"}, {"text": "imagine"}, {"text": "its so beautiful) like!"}, {"text": "Love the way you played (1st time)."}, {"text": "Hello Jane, lovely hands! If I have difficulties playing all 4 keys with either hand towards the end of the piece, is there any hope I ever will succeed? How long had you played the piano when you learned this Prélude?<br />Greetings from Finland!<br />Heinrich"}, {"text": "Thanks Jane, I like the way you teach the songs."}, {"text": "I cant read sheet music yet, so for now im listening yo the notes you plan and rite them down for myself so i can play them. Thanks so much for this video."}, {"text": "Viele Dank !! ich versuch es :-) Liebe Grüsse  und schönen Sonntag"}, {"text": "kannst du mir sagen wann ich richtig pedalen einsetzen sollte ?<br /> "}, {"text": "Excellent."}, {"text": "Regarding the turn...I just had to look it up because I was confused by the double sharp sign. The double sharp sign refers to the lowest note in the turn sequence and makes it (or confirms it as) a G double sharp (= A) (as discussed at <a href=\"http://www.pianostreet.com/smf/index.php?topic=39929.0\">http://www.pianostreet.com/smf/index.php?topic=39929.0</a>). "}, {"text": "schön das ich Sie gefunden habe ,sie sind grosse hilfe :-)"}, {"text": "Wahouu&#39;*.* It&#39;s Magic. ..juste perfect&#39;&lt;3"}, {"text": "Perfect ! Thanks for your tutorial ! "}, {"text": "Hi Jane,<br />Hope you are well.  I;m doing this piece for my G5 exams. Tks for sharing your passion and talent.<br />Oh and btw, I played Somewhere-Westside story at a private concern... I mentioned where I was able to get my tutorials from - Jane.. I was told that I played it well. Tks again, Jane.<br />Gary"}, {"text": "Thank you very much Jane. Very helpfull tutorial, especially in slow tempo I can see how to play all difficult parts. Thanks and regards from Pianogeek :D"}, {"text": "Thanks, without you I will never finished this prelude. ;)"}, {"text": "Widać że kobiece ręce <b>-</b>"}, {"text": "Gracias !!! From Cuenca-Ecu"}, {"text": "Muchas Gracias!!"}, {"text": "Excelent! Thank you so much for sharing! If I may ask, I am unsure about how to read the groupette and what notes to play. Can you help me with this? "}, {"text": "Jane , Great Great Great  !   How can I thank you? God Bless you ! (from Argentina)"}, {"text": "Perfect for me !<br />Thanks et Kiss from Paris - France"}, {"text": "Jane, what do you mean by Level 4 of 10? What is that relative to a committed adult beginner?"}, {"text": "thank you,@Zona do Pagode Musica Brasileira"}, {"text": "Exelent left hand¡¡\n"}, {"text": "Exelent technic, the temp so very very nice, thank youoo"}, {"text": "You are absolutely amazing. Im your loyal follower ."}, {"text": "this is really good. thanks"}, {"text": "My goodness, their standards are lower."}, {"text": "I gave it a Level 4. which organization rated it Grade 7?"}, {"text": "yes, you will be able to learn this soon. enjoy."}, {"text": "thank you, and you&#39;re welcome."}, {"text": "thanks :)"}, {"text": "Beautiful.  Thanks for sharing."}, {"text": "Love the tepmo.  Nice job."}, {"text": "gitme yalnızlığımın sebebi olma..gitme gülüm beni bi çaresiz koyma"}, {"text": "thanks. yes, i find this one of the simplest to play, yet intensely emotional, pieces."}, {"text": "This piece was written in heavens  by a super sensitive,romantic genius.\nYou have to be in love to get the depth of the composer&#39;s feeling.;This piece was used in a black and white French love movie, about forty years ago.Thank you for performing it so skilfully."}, {"text": "you&#39;re welcome. and thanks for the undeserved praise."}, {"text": "If you are giving tutorials,thank you so much,great talent."}, {"text": "then learn easier pieces first to build a foundation"}, {"text": "For my level is too fast :/"}, {"text": "the slow tutorial is too fast?"}, {"text": "Too fast"}, {"text": "Thank you, Ken. I enjoyed yours too. Jane"}, {"text": "  I must compliment you on your talent, as well, bbdhrggi.  Very well performed, and very enjoyable.\n  I have my interpretation of this Chopin work here on YouTube.\nThough, I must confess, after hearing Rod Argent&#39;s version on his solo album CLASSICALLY SPEAKING years ago, I gravitate toward his style.  He plays this even faster than you or I! \n  Keep up the good work!"}, {"text": "wow, you are talented!"}, {"text": "Thank you so much, I don&#39;t even play piano and I learned this in one night! Going to play this for my brother on his birthday tomorrow. :)"}, {"text": "you&#39;re welcome, glad the tutorials help you :)"}, {"text": "Thank you so much, for all your teaching!very helpful!"}, {"text": "that&#39;s wonderful to hear. thanks for writing.  :)"}, {"text": "Very nice and skilled. i know many complicated songs because of you!! thank you!"}, {"text": "thank you"}, {"text": "yes. experiment and listen carefully. use to enrich the sound, once it gets &quot;muddy&quot;, no good :)"}, {"text": "excuse me, you use pedal ?"}, {"text": "experiment with different combos. jot it down in pencil, then choose the most comfortable for your hands :)"}, {"text": "Min 5:22 its hard for me to use 5,4,2 and 1. left hand."}, {"text": "thank you. some day you will be better than me :) have fun!"}, {"text": "You are an amazing pianist! Better than me, but iv&#39;e only had 1 year of lessons... an i&#39;m 13, i played a dumbed down version of this song for my recital."}, {"text": "you&#39;re welcome."}, {"text": "Thanks for this lesson."}, {"text": "thx a lot ;)"}, {"text": "good job christophe, you played well."}, {"text": "I&#39;m 18 and I started playing the piano 2 years ago;) If you want you can listen to my interpretation of this work on my channel. Feel free to leave a comment and a Like;) My channel will be updated very soon with new pieces."}, {"text": "Wow! thanks a lot for your help and prompt reply! You must spend hours a day replying to these posts! Very much appriciated!"}, {"text": "1) Thiman: Flood Time (made tutorial)\n2)  Bach: Air from Partita No. 6 BWV 830\n\nHave seen this video. The high number of talented young children is astounding. Toughest field to be in. Luckily I&#39;m no pianist. Uh oh, just last week Jane was scolded by a world-class musician, for saying that :)"}, {"text": "Hello! I need some help identifying two classical pieces, I believe one might be Chopin. There is this 4 year old playing these two pieces on the piano, amazingly well I might add.\n\nPlease type into Youtube search - Amazing: 4-Year-Old Boy Plays The Piano Better Than Most Professionals!\n\nI think this may interest you as well, being a pianist yourself! BTW Thanks for posting your videos!"}, {"text": "you&#39;re welcome. glad it helped :)"}, {"text": "Thank you so much!!! You just help me to practice my piano lesson ;) \n"}, {"text": "you&#39;re welcome :)"}, {"text": "Muchas Gracias :)"}, {"text": "yes, beautiful piece."}, {"text": "You&#39;re welcome. Glad it helped :)"}, {"text": "this request got lost. it belongs under my request video. description link will lead you there."}, {"text": "never cared to attempt much Rach :)"}, {"text": "you mean, haven&#39;t learned yet, right? :)"}, {"text": "PLEASE SOME ONE POST A TUTORIAL FOR  - J.Sibelius The Spruce Op.75-5!! 50% SPEED. !!! pleaseeee "}, {"text": "I myself can&#39;t play that ;)"}, {"text": "teach us rachmaninoff sonata 2"}, {"text": "Home my home his home. Nostalgia in ewery note"}, {"text": "oh, mr.grey."}, {"text": "you&#39;re welcome, it&#39;s nice to hear success stories :)"}, {"text": "your comment made me smile :) hope you keep playing the guitar also!"}, {"text": "I&#39;m an avid Chopin fan now. Absolutely love his work. Guitar for me is secondary now!!"}, {"text": "You are a gem, I&#39;ve practiced this for a week now and have nearly got it . Your tutorials are clear and concise. I took up the piano one month ago after hearing this prelude and was determined to learn it! I don&#39;t know if I&#39;m a natural or not, but I have just about got it after a week of studying it, albeit it pretty slow for now! Thanks again!!"}, {"text": "both are used. this was discussed below."}, {"text": "Thank you! You know, I&#39;ve just noticed that in the 7th bar, you play the F natural, whereas in my sheet music the F is sharp in the 7th bar and goes natural in the eighth bar. Have I a misprint I wonder?"}, {"text": "you&#39;re welcome. long and slender is an advantage. mine are short though (aspect ratio distortion exists). good luck with the piece  :)"}, {"text": "Thank you. I am trying to learn this right now. Would be convenient, though, if I had fingers as slender as yours, to play white keys between and to the side of the black keys!"}, {"text": "Chopin and everyone that heard him play is dead. All we know is that he never went above mezzo forte. He played everything very quietly because he believed the piano should be played with respect."}, {"text": "And who the hell are you?"}, {"text": "that&#39;s nice. will you?"}, {"text": "This song make me wana play piano :)"}, {"text": "oh wow i like to learn this song but i think its pretty fast for me.. lol  i&#39;ll do my best"}, {"text": "LOL. do you read video descriptions? blame me, not chopin!"}, {"text": "Was Chopin deaf? The left hand accords sound terrible."}, {"text": "Everybody plays the passage from measure 17 with the stretto differently, one plays really fast and another slowly, accelerating only a little bit. What do you think is the most accurate way to play it? Do people know how Chopin used to play it? "}, {"text": "thankyouu i&#39;ll need it! :)"}, {"text": "good luck with it :)"}, {"text": "I&#39;ll try to learn this thanks!"}, {"text": "brain damage? ;)"}, {"text": "why are you allowing your right hand to depress the keys, long after the note value has come to its end?"}, {"text": "you&#39;re welcome :)"}, {"text": "i&#39;m here because of 50 shades of grey\n"}, {"text": "you&#39;re welcome, Richard. Congratulations on your performances."}, {"text": "Mr. Dukes...hearing your rendition of Beethoven&#39;s Moonlight sonata was nice, clearly you have musical talent. As for bbdhrggl and Chopin&#39;s prelude in E minor op 28 no 4, I found her excellent tutorial(s) very helpful many times and have learned this piece well enough, thanks to her and (in the opinion of others who have heard it in practice, whom I do not know) that it has been requested publicly. It was therefore played and applauded. To tutor by definition is to teach. Thanks again, bbdhrggl. "}, {"text": "thank you for sharing. &quot;tutorial&quot; is youtube terminology that applies to any video that teaches. there are different ways of teaching and learning. many have learned to play the piece from this tutorial  :)"}, {"text": "bbdhrggl, I was not advertising about John Bell Young&#39;s tutorial. I was simply sharing information you may have found useful. This is not really a tutorial by definition. There is no musical or harmony analysis, it is just playing."}, {"text": "Chopin z Polski to był gość!!\n"}, {"text": "receive a new comment, saw this again and decided to check. noted my previous answer below and decided to add an annotation to clear up the issue. my edition (Schirmer&#39;s) has parentheses around the F natural, apparently the manuscript was unclear there."}, {"text": "video description link will bring you to my website"}, {"text": "Happy for you that you learned this beauty. Re requests, please see my website for instructions."}, {"text": "please do what you score says. i had eye surgery around then and had trouble seeing. was that error annotated already? or a different one?"}, {"text": "Your dynamics are awesome. I have to perform this piece next month! :)\n"}, {"text": "GOD BLESS YOU! XD i needed this for my piano class in school :D"}, {"text": "to all, thanks for writing :)"}, {"text": "Thanks again, I have learnt a heap of good music from your channel. \n"}, {"text": "Ellie at piano!"}, {"text": "I wish you and your husband all the best, Diane! "}, {"text": "It;s sad that in America people know very little about culture: great composers, writers, directors (i.e., Antonioni, Bergman) and if they recognize a piece, it&#39;s not because they know the history behind it but because a supercommercial Hollywood movie had used it.\nBut it&#39;s not the people&#39;s fault, it&#39;s how they&#39;ve been brought up which obviously they can&#39;t be held responsible for. "}, {"text": "This is fabulous...... one of best versions and rhythm I&#39;ve heard yet of Op 28, no 4.  Most people don&#39;t get the pauses and rhythm right.\n"}, {"text": "congratulations. I think you have a good piano teacher who challenges you :)"}, {"text": "Thank you for posting this.  I&#39;ve been playing piano for two weeks and my Piano teacher has assigned this piece.  This is very helpful.\n"}, {"text": "Notebook &lt;3"}, {"text": "I feel it&#39;s too fast."}, {"text": "16:9 versus 4:3  camera or software distortion"}, {"text": "Why do the keys on that piano look so narrow?"}, {"text": "can you play w/o covering the keys? catching the chords by ear is good, plus focus on my finger movement. but best is to follow the score :)"}, {"text": "great, so glad that&#39;s the way for you! :)"}, {"text": "I want to complain ..i want to teach me...prelude op 28 no 24 please.. ^^ Make tutorial\n"}, {"text": "lol, learn to recognize a joke when you see one :)\nactually, i did invest in a better microphone, and a new camcorder. so you should donate :)"}, {"text": "no"}, {"text": "This is such a poignant piece and indeed makes me think of The Notebook.  My beautiful husband is in the end stage of alzheimers in a nursing home and he cannot walk or talk.  I have a lump in the throat listening to this.  But he smiles and laughs and this is comforting.  I may have this piece at his Celebration of his Life.  I am learning to play this thanks to the tutorial."}, {"text": "Thumbs up if it reminds you of The Notebook!"}, {"text": "thanks, you are funny :)"}, {"text": "Thanks for this."}, {"text": "lol. click the link in the description and choose &quot;requests&quot; in the menu.\n\nimslp is the best free site for classical scores"}, {"text": "wat?\n"}, {"text": "post request (see profile link). that&#39;s where I keep track. no need to send score if on imslp."}, {"text": "Hi there, could you consider making a chopin sostenuto in Eb major tutorial??"}, {"text": "I miss the legato in the left hand. If you play it slow, you raise the left hand too high.\n"}, {"text": "@Jkljkl2009 good luck :)"}, {"text": "@bbdhrggl One more thing. My piano lessons starts this saturday at 11:00 :D"}, {"text": "@Jkljkl2009 this is a good one for you :)"}, {"text": "Hi, I have talked to you recently but, please answer this for me. I want to play a chopin piece which one do you think I should I choose?"}, {"text": "@DinosaurPenguin2598 why do you feel that way?"}, {"text": "why was this cited for &quot;matched third party content&quot;? this is in public domain, imslp has it, naturally. do publishers not want me to teach it?"}, {"text": "thx honey\n"}, {"text": "@roxianealexander there was one error that was pointed out by a kind viewer early on, so I posted a correction as an annotation and a notice in the video description.\n\nPlease be careful. You must adjust the fingering to suit your hands. Jump or skip notes if necesary. Otherwise lingering injuries can occur. "}, {"text": "@bbdhrggl i am a novice piano player, gr. 7 but i&#39;ve heard this piece umpteen times &amp; as a listener I never noticed any error.  If the audience cannot detect any errors in the piece ...  Thank u for posting. It is helping me with the fingers, tempo &amp; much more since sight reading is not my strong point either. I don&#39;t know how u get your fingers to stretch like that and it looks relaxed &amp; painless when u do it. My hand is in near spasms on the bass."}, {"text": "@roxianealexander @sonnet2ix I apologize for misreading his comment. Thought the last sentence was intended for me."}, {"text": "@sonnet2ix I agree. this is a wonderful tutorial.  not sure y ur comment was received so poorly.  Very helpful tutorial. I am learning this piece &amp; fingering is my weakness.  The pianist is so relaxed, can&#39;t imagine saying anything negative about this."}, {"text": "@sonnet2ix thank you for your polite answer"}, {"text": "@sonnet2ix I don&#39;t understand.  I was thanking you for your video and responding to some of the rude comments toward you.  Go be rude to some of the people who&#39;ve insulted you.  "}, {"text": "@sonnet2ix So you think that comment deserve a serious answer such as &quot;please read the video description&quot;?"}, {"text": "You&#39;re so kind to put this up here.  It sounds great and even if a few notes are off, this is a great way for people to get started on the piano.  Thank you for taking the time.  For the people who complain: do your own.  Nothing wrong with pointing out an error, but be polite.  "}, {"text": "@pejpo made one mistake? sorry for being human ;) "}, {"text": "im sorry but u cant even play it right urself "}, {"text": "@100of1000 ah, I just saw the video description where it says to turn on the &quot;annotations&quot; for error correction. wish everyone would read my video descriptions and click the provided links."}, {"text": "@rrrulian , yes You&#39;re right. At about ~03:37 there is wrong note(played with middle finger). Not F, but F# should be. I did not notice it before, because I used another tutorial. But that was a long time ago..."}, {"text": "@rrrulian i didn&#39;t check, but most likely the slow version is correct. please go by your score (free on imslp), for perhaps I was wrong in both cases. yikes! lol"}, {"text": "Hi, still greats tutorials !!! Best we can find on youtube i think... Thank you really much for your help.\nJust a question :in the first part, at sec40, there is a note, with is different in the second part, at 3.37min.\nI am learning this song, and i don&#39;t know with note is the good one ;)\nAnyway, thx again !\n"}, {"text": "@bryceguy72 that way one spends more time improving than wasting time and money on what they think will help them when that time could have been used to get better and not worrying about the equipment."}, {"text": "@bryceguy72 one shouldn&#39;t always blame equipment and the technology. one should just &quot;trust&quot; it and work off what they have.\n"}, {"text": "@tribunomex are you using the same edition? editions vary."}, {"text": "Hye anyone can explain me why in the part of A# A# G in the sheet, you play A# A# B A# A,\n\nPleasei&#39;m a novice"}, {"text": "Wow you are so great! Thanks for the tutorial, it was really helpful!"}, {"text": "@ericmsandoval The person who runs the retirement home didn&#39;t tell me a good day yet. "}, {"text": "You have some great piano covers. It makes it easier to learn these great songs. I love playing these tunes on the piano...video game music is fun to play too!\r\nAnyway, thanks for the vids."}, {"text": "@jameslhenry100 how did that go?"}, {"text": "@jameslhenry100 I&#39;m sure they&#39;ll enjoy it. good luck  :)"}, {"text": "Thank you for the tutorial. I am going to play that in a retirement home soon."}, {"text": "@cheezwhizsucks clean up your language"}, {"text": "One thing you can do is vary it up a bit and use the rubato every few measures."}, {"text": "Great version, great emotion.\n\nOne thing to watch (like many other versions) is the rubato. Make sure you don&#39;t do the same thing over and over (rubato between every measure in the beginning). It starts to sound a bit predictable, like a roller coaster that goes up and down and up and down over and over again. It&#39;ll make the piece sound much more interesting!\n\nGreat video, though! Keep playing!"}, {"text": "absolutely beautiful. Thank you for the tutorial! "}, {"text": "bonjour \n\n\n merci "}, {"text": " bonjour \n\n j&#39;apprends seul sans cours   merci pour cette vidéo ...merci de donner de votre temps \n\n "}, {"text": "@TonyWRO Bach&#39;s organ composition has three staffs. did you look at it? there is a reason why so many composers wrote arrangements for it. Even you can alter it to your taste. The beginning mordent is easy to play. Don&#39;t need a tutorial for that. \n\nweird our discussion is under a Chopin tutorial. continue under the relevant tutorial? except, some of  those viewers are pretty mean, and st---id (teachers are never supposed to call their students that) . at least you appear reasonable."}, {"text": "@TonyWRO  Bach&#39;s version? He did not compose a version for piano. Do you have a score for the version you mean?"}, {"text": "@TonyWRO Bach wrote that for organ. So all piano versions are arrangements. The two most well-known are by Tausig and Busoni. Level 7? I did the Tausig tutorial and everybody hates it. ha ha."}, {"text": "Thanks so much for taking the time to do this! Really, really appreciate it :)"}, {"text": "@donaldprego  (because if there are many other errors i&#39;m better off redoing the entire slow tutorial)"}, {"text": "@donaldprego wow, thanks for trouble shooting. are the mistakes all in the slow version? I had eye surgery around then and had trouble seeing."}, {"text": "Pretty good job. . .unfortunately some of the parts you played slowly do not match what you played in real tempo. . like the very ending for instance when you play B-E-B    B E G#      B E G (slow version) it&#39;s supposed to be B - E A   B E G#   B EG\nThere are a few others as well. . . .might wanna check that out thanks"}, {"text": "thanks for the tutorial. heard this song on the weekend and decided to blow the dust off the piano. had a falling out with the piano in about 1994. lost interest, but inspired again!"}, {"text": "@ThehausofMarissa thanks, am happy you can&#39;t use my tutorials :)\n\nvulgar comment deleted. blocked too."}, {"text": "listening to chopin is like chopping onions :&#39;(\n\n;p"}, {"text": "@makobify \n\nOr, maybe he is just talented and has worked hard to develop it. "}, {"text": "Very helpfui.  Thanks much!"}, {"text": "Oh My .. what a treasure .. where were you hiding this ... absolute perfection .. and it seems you have the Sokolov temp as opposed to everybody else ..  I have heard many and this tempo is I am certain most correct.\n\ngracios"}, {"text": "This was great .. I was totally missing the double sharp at the stretto part at 5:06"}, {"text": "@billspintobean In my edition (Schirmer&#39;s), the editor put parentheses around the F &quot;natural&quot; symbol. Would be interesting to see which note concert artists play."}, {"text": "in 5:12 i think you forgot that it is tutorial :D:D"}, {"text": "your amazing "}, {"text": "@mountndew1 done"}, {"text": "@mountndew1 This was requested from Poland. Your request will help move it up the wait list."}, {"text": "It&#39;s beautiful! :&#39;) Thank you! "}, {"text": "@laurosa30 yes, one page. did you know the sheetmusic info is on my website? most classical music is in public domain (free)"}, {"text": "I&#39;m a guitar player, but i&#39;m definitely picking up a keyboard just to learn this! Thx"}, {"text": "@Faletui1 yeah it was in the pianist."}, {"text": "@Faletui1 dunno. it should be.  :)"}, {"text": "@rainboow567 thank you, pleasure to have you as a student. :)"}, {"text": "You are a great teacher .."}, {"text": "thank you :) been playing for 1 year now maybe, and only sometimes, and I learned this on an hour yesterday, accents are being perfected now but that will take a while i suppose ^^\r\n\r\nThanks again"}, {"text": "ugh. i want to learn how to play this so bad."}, {"text": "excellent video! Thank You!!! so goooood"}, {"text": "Hey, great tutorial. Just for everyone&#39;s benefit, the grace notes that occur in the piece can be played on!or prior to the beat. It is up to personal opinion."}, {"text": "@teakbridge101 Is that what you were taught? my edition has an acciaccatura, the performer may opt to play it b4 or after."}, {"text": "Very good!..one thing - the appoggiaturas are played wrong. They start on the beat, not off the beat."}, {"text": "U R awesome!!! THANK YOU!!!!"}, {"text": "this is excellent!! thanks so much. i began learning this piece a while back, but I gave up. Now i think ill finally learn the rest!"}, {"text": "Fab great piece."}, {"text": "Another great video!! Thanks again."}]