[{"text": "yum yum"}, {"text": "Why do you put the stick so low down in the mould? Surely it&#39;s not easy to hold. Surely. You&#39;ve made numerous videos on these lollies and presumably many batches in between and yet still you put them to the lowest possible position. Why? Why do that to yourself? It&#39;s a little extra awkward struggle that you can just avoid really simply. Perhaps with the thinner mixes the stick will fall down lower anyway but that doesn&#39;t mean that you can&#39;t try to have it in a more practical place. <br /><br /><br />Other than that keep up the good work. The recipes looks great and I&#39;ll be trying them with my partner Kevin."}, {"text": "Hi Gemma. I’m addicted to your channel. Everything you make looks so beautiful and delicious. I’m definitely inspired. I also love the music in the beginning of this video. What is the name of it, if you don’t mind me asking. 😊"}, {"text": "روعــــــــــة ممتـــــــــــاز جـــــداً 👍💝"}, {"text": "You are of your own kind"}, {"text": "Hi bigger bolder baking I love strawberry and really love mint would that go together in cupcakes or yogurt. I am big fan for chocolate as well."}, {"text": "You can be full from popsicles? How"}, {"text": "I wonder why there is dislike for this video 🤔🤔🤔.. whatever the fruits has dont to you?"}, {"text": "Love you and your video&#39;s Gemma!"}, {"text": "❤❤❤❤❤"}, {"text": "I&#39;m doing this now. Thanks for a simple recipe xoxoxo."}, {"text": "How about Frozen Fruity Cocktail Popsicles"}, {"text": "I was really sad and I found your videos and they made me happy ♥️♥️♥️"}, {"text": "Do you have to defrost the raspberries or you can put them frozen? :)"}, {"text": "Nice i like coconut milk with stobari"}, {"text": "I can&#39;t wait to try these recipes!! Can I sub coconut milk with something else?"}, {"text": "Beautifulllll and Delicious😍😍😍😍😍😍"}, {"text": "ooooooo😍"}, {"text": "Thats fine but the most important issue is.. this has 10 places.. what if i want 2 or 3 or 5? do i have to run under the warm water the whole thing? do the molds come out individually? in amazon dont say anything... WTF???? this can be very frustrating ..."}, {"text": "Ok good"}, {"text": "Fruity Frozen Milkshakes"}, {"text": "Can i use juice instead of real fruits?"}, {"text": "When i made the coconut milk that u showed that was amazing but it was not as thick as it was in this video. Can we do something to make it thick"}, {"text": "If you don&#39;t have any coconut milk, what can you use in substitution?"}, {"text": "Who else thought the spinach layer was kiwi? 😂"}, {"text": "Can we use simple milk instead of coconut milk?"}, {"text": "Good"}, {"text": "Some dairy recipes please thank you"}, {"text": "Do you use plain yougert or vanilla"}, {"text": "Can u share the recipe of mint lime Popsicle?"}, {"text": "Plz upload astronaut Dry ice-cream without machine"}, {"text": "I love these"}, {"text": "Omg i love the background music in the beginning of the video!!"}, {"text": "I don&#39;t like vanilla essence"}, {"text": "Are they hard to bite onto like ice, or are they soft like store bought taken out of the freezer?"}, {"text": "i want yogurt popsicle recipe too"}, {"text": "Can&#39;t find the link to the popsicle molds. A little help please? Thanks!"}, {"text": "you link to a different mold than the one in the video. it&#39;s a rounded mold whereas these are regular popsicle shaped"}, {"text": "You actually activate more nutrients when spinach is cooked and destroy the toxins in raw spinach"}, {"text": "Hi me annesha"}, {"text": "I love your dress"}, {"text": "OMG... Gemma I used your popsicle recipes this weekend for my kids&#39; bake sale. I used my vacuum sealer and people couldn&#39;t believe that they were homemade. I bought $97 worth of ingredients and we made $311 just on popsicles. Thanks"}, {"text": "hi"}, {"text": "She should collab with Rosanna Pansino"}, {"text": "Hi gamma I really loved way you made 5 different milk shake &#39;s and pops.I have shared your recipe with my aunt. She said its amazing ice cream sandwich. You have made."}, {"text": "How to remove popsicle from the moulds? My stick usually separates from the popsicle"}, {"text": "Hmm... I think I will try the popsicle with the spinach"}, {"text": "I like your food possessor that is so cool"}, {"text": "Fantastic"}, {"text": "You SHOULD GET A LOT OF COMMENTS"}, {"text": "YOU WORK VERY HARD TO MAKE THESE"}, {"text": "you can make ice cream with orange. i love that ice cream"}, {"text": "What video editor do you use?"}, {"text": "My mouth is watering because it looks really yummy"}, {"text": "ya does deserves more subscribes"}, {"text": "I agree"}, {"text": "please, could you tell the name of the machine which you are using. i love your video."}, {"text": "The peach and cream popsicles were just amazing!!!! I made them and they turned out awesome too! And thank you Gemma for these fruity yummy popsicle ideas!!!! I really loved them😊..."}, {"text": "Honestly I have been watching your videos for 3 hours straight I can’t stop. I love it"}, {"text": "Perfect for parties"}, {"text": "I am also a bold baker.I want to be a baker when I grow up"}, {"text": "Gemma please send more popsicle vidios.I have party at my house so totally will make that for friends but please send more want to make a lot of theese"}, {"text": "Love yummy popsicles"}, {"text": "Your recipe is easy to following, its really help me learn cooking😍, can you make of vegetable ice cream recipe? I really wanna make the kind of ice cream 😅"}, {"text": "Osam video mam"}, {"text": "Do you love oranges?"}, {"text": "Hi Gemma! In Chile we are almost at the end of spring, the days are getting very hot, and I’m planning on making popsicles, so my questions are: If I use a flavored yogurt, how do I keep it’s flavor with the smoothness that the cream gives to it but using reduced fat cream? And also if I use stevia drops, would I get a similar result? Thanks! love your channel!"}, {"text": "i wanna see yah in real life and make some with you!!!"}, {"text": "the popsicles looks so good u totally deserve many subscribers 😘😘😘"}, {"text": "i think popsicles are best for summer but there is also one more thing which you can eat in summer are pani puri i wish you try that you will love that on any india youtube channel you can find that and i wish you to upload that recipe"}, {"text": "don&#39;t you need to add sugar to the coconout milk on the watermelon popsicle recipe? to stop it from freezing solid..."}, {"text": "What I have done wrong? Beacuse my popsicle aren&#39;t getting of from the molds?😂😂😂😂😂"}, {"text": "If anybody is wondering you can no taste the spinach at all very delicious in Popsicle or smoothie"}, {"text": "the popsicle looks tasty"}, {"text": "Simple, amazing, LOVELY"}, {"text": "Where do you find your moulds.thank you"}, {"text": "Hi what is the name of your molder?"}, {"text": "what if the popsicles dont freeze .....at all coz the fruit puries r really liquid."}, {"text": "can you taste the spinig"}, {"text": "You are Sooooo creative with your Popsicles 😊 congratulations on a really wonderful YouTube channel."}, {"text": "I like pop"}, {"text": "it&#39;s the best video ever"}, {"text": "Gemma I live in Egypt, can I still purchase these popsicle containers?"}, {"text": "Peaches and Cream, Sweeter than sweet.."}, {"text": "She makes me feel hungry"}, {"text": "peaches and cream would be my favourite."}, {"text": "<a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=5m17s\">5:17</a> sweeter than sweet chocolate cheeks and chocolate wings"}, {"text": "Gemma, how would you do this if you didnt have a mold that has the lid come off?"}, {"text": "You are really the best"}, {"text": "Why won&#39;t you make merengues"}, {"text": "does a layer of watermelon and a layer of kiwi have a good combination and would it taste good ?"}, {"text": "Awesome! I will try this! The watermelon kiwi is what I really want! Looks delicious!"}, {"text": "is it hard to get the popsicles out of that mold"}, {"text": "hey gemma summer is here again can u make something to cool off in the sun plz"}, {"text": "awesome...  I really love all of ur recipes.."}, {"text": "I cannot wait to try these popsicles!  Glad I found you!"}, {"text": "AWSOME! Great Job."}, {"text": "your Popsicles are very healthy and nice"}, {"text": "please make a vanila mouse😊😊"}, {"text": "Wow!Thouse are wonderful👌👌👌👌👌👌👌✌✌✌✌"}, {"text": "I thought the mixture of spinach was that of kiwi.... the last one was just amazing..I wanna eat that 😋"}, {"text": "wow that looks delicious"}, {"text": "I like your recipes I think most liked recipe of popsicle because my favourite desert is popsicle and ice cream"}, {"text": "loved it...can.u.share some good fruit options with mango.."}, {"text": "WHERE WERE YOU ALL MY LIFE?!!!😲😲😲"}, {"text": "gemma your channel is awesome, but can u suggest something (popsicles) which is very very easy to make. if u have so pls share."}, {"text": "please uploads milk Popsicle stick ice cream"}, {"text": "awesome"}, {"text": "Please show only plain yogurt popsicle 😊"}, {"text": "can u make mango w/ coconut ive cream"}, {"text": "Gemma can I pour only watermelon and kiwi in the popsicle and not coconout milk"}, {"text": "I like ur recipe, keep up."}, {"text": "Gotta try this😋"}, {"text": "You are a brilliant"}, {"text": "Fruitsss Yummmy and healthy Love it.I always watch your show and try  your recipes, comes out great. thanks a lot."}, {"text": "Could you do a Cream Raspberry Chocolate Popsicle?"}, {"text": "Only 5 hours"}, {"text": "can I do strawberries and cream rather than peaches and cream and swirl it like the raspberry coconut???"}, {"text": "I love your popsicles....please make new more popsicles"}, {"text": "will this cause stomach ache?"}, {"text": "For the watermelon popsicle why did you freeze watermelon puree and coconut milk for 30 mins each??why did you not put them together and freeze??"}, {"text": "omg"}, {"text": "You are so AWSOME"}, {"text": "oh my !! they look lovely and the best part is its kinda raw food, so the  nutritional value still remain !"}, {"text": "Gemma, you should do more popsicle videos because these recipes are GREAT!"}, {"text": "can you plz make vdo to make pop sticklers with chocolate cake and nutella"}, {"text": "Would raspberrys and cream work if you don&#39;t like coconut"}, {"text": "Hello Love your natural popsicles. Bid fan.MMmm."}, {"text": "do some flavor with green n black grapes"}, {"text": "I like the way u talk!!!"}, {"text": "i&#39;m in love with your channel!! Could you teach me how to make soft sponge cake? I always try tnd make my best but i end up eating hardISH sponge :("}, {"text": "PEACHES AND CREAM, CHOCOLATE CHEEKS AND CHOCOLATE WINGS~~~~ y&#39;all, do you know annyeonghaseyo? XD"}, {"text": "<a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=5m17s\">5:17</a> OMG SHE SAID PEACHES AND CREAM ASDFGHJKL MA HEARTEU Nice video btw ;)"}, {"text": "i want to do it"}, {"text": "Hello Gemma Stafford may i suggest a iced tea recipie please"}, {"text": "Why am i watching popsicle recipes in january?"}, {"text": "If you dont Like coconut can you just do rasperies and crem?"}, {"text": "beautiful 😘😘😘"}, {"text": "I can spell ur Popsicle soooooo cool and ur frozen yogurt and mug recipes are awsome I wanna see u live may u succeed in every field of ur life and so less women are seen so hard working ur kids and family must be proud of u I salute women like u I love u and ur channel .GOD BLESS U"}, {"text": "That&#39;s nice and you have earned 1 more subscriber☺😁"}, {"text": "I absolutely do know that you love popsicles"}, {"text": "can we make a pomogranate  and Orange popsicle??"}, {"text": "great idea for my summer business.....awesome!!!!"}, {"text": "I think I have a crush on her"}, {"text": "You should make homemade churro ice cream sandwiches with your homemade ice cream!"}, {"text": "Hi Gemma! Can u suggest another green fruit or something else to do for the watermelon rind because I&#39;m allergic to kiwi?"}, {"text": "Can u make pudding"}, {"text": "Your popsticles r the best"}, {"text": "I think she has a problem wth the &quot;T&quot; because she pronounces like &quot;sh&quot;. Eh: washermelon instead of watermelon... it&#39;s kind of annoying but her recipes are the best..."}, {"text": "Hi Gemma, <br />Can you suggest me on how to get the Popsicle as soft and creamy texture, instead of ice taste."}, {"text": "so good I&#39;m going to try this"}, {"text": "I am obsessed!!! 😄 I make these all the time now and my family loves them! 😊 Thank You😊 You are awesome 😄😊"}, {"text": "r you irsh"}, {"text": "You should make a peppermint/mint popsicle!"}, {"text": "One of the Popsicles looks like watermelon"}, {"text": "very impressive and amazing ❤ keep the lovely spirit!"}, {"text": "Thanks Gemma for your great recipe! I am gonna make some for my bestie for her birthday."}, {"text": "I got a weird idea . You could just strain the kiwi puree and take the seeds mix with the watermelon puree instead of chocolate chips 😜😜😜"}, {"text": "How will be watermelon , cantaloup and honeydew popsicle 😎😎😎"}, {"text": "do you need to use extract"}, {"text": "Looks Yummy!😋"}, {"text": "can you yoos crem and hunny for the mics"}, {"text": "so cute"}, {"text": "like"}, {"text": "instead of orange juice can you use oranges like cut open the orange and then put the stuff inside the orange with the banana and the pineapple"}, {"text": "For cream, can you use milk?"}, {"text": "These are beautiful 😍"}, {"text": "love it...😍😍😍"}, {"text": "you are the best YouTuber you helped me a lot"}, {"text": "love your channel sooooooooo much please reply pleasee"}, {"text": "😊😊😊 love it taste very nice"}, {"text": "All your videos are so beautifully done. The cutlery you use is so beautiful! very inspiring 😍"}, {"text": "Hello! What kind of cream did you use in Peach&amp;Cream?  Sour cream, heavy cream or whipping cream? Thank you"}, {"text": "On with the lid, AND IN WITH THE STICKS !!!!!!!!!!!"}, {"text": "where do you get the ice cream molds?"}, {"text": "do more mug meals"}, {"text": "I have real watermelon seeds can I use those"}, {"text": "I tried this recipe and they tasted amazing.. so easy to make !!😊"}, {"text": "hello gemma I&#39;m your fan from philippines"}, {"text": "please make melon popsicle"}, {"text": "Why have i only discovered you now???!!! Oh well, better late than never! Love the recipes... its winter here in New Zealand, but I still crave ice blocks, so these are great! Thanks, Gemma. :)"}, {"text": "Hi guys .Let&#39;s try  to get Gemma to 1 million subscribers! She puts lots of work in to her videos she deserves it.❤"}, {"text": "I knew I just HAD to jab that like button and I did because of how wonderful You are and this awesome recipe as well as others. GREAT COLOUR(They look SOOOOOO decadent)"}, {"text": "i&#39;m from.Malaysia.I like all your recipes.They are really fantastic!"}, {"text": "By cream does she mean milk"}, {"text": "For the peaches one, what kind of cream should I use?"}, {"text": "I&#39;m from Turkey and I love you 💜💜💜"}, {"text": "so popsicle is basically frozen blended fruits? (the commercial ones i mean) i never tried one..."}, {"text": "oh ..... my .... god ........ <br /><br />they are so beautiful , have got to try.<br />how could you keep in such shape when you be able to do ALL this !"}, {"text": "Excelente muy bueno………………….Será q puedes subirlos subtitulados"}, {"text": "Can you use coconut cream"}, {"text": "i thought this was all natural and then... <a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=5m30s\">5:30</a> gross cow secretion"}, {"text": "I love your videos"}, {"text": "These are so amazing! But I hate coconut and papaya XD are there any substitutes for them both?"}, {"text": "omg! I love these recipes! 😍"}, {"text": "I love your videos they are so simple and I love your accent thx for the recipe"}, {"text": "I am new to your channel, Gemma but after seeing these popsicles,  I subscribed"}, {"text": "sory but I&#39;m really stupid with cooking so what even is creme?"}, {"text": "gemma can you make a kiwi,grape and cream popsicle?pleeaase"}, {"text": "no actual Kiwis were harmed in the making of this video."}, {"text": "I just made some, they tasted good!<br />But the hardest part about making them is I couldn&#39;t take them out of the mold :("}, {"text": "How about lychee and coconut water popsicle or sorbet (no machine)?"}, {"text": "I remember useing expierd jello for icepops"}, {"text": "replace chocolate chips with chia seeds if you don&#39;t like chocolate."}, {"text": "u r the best!!!"}, {"text": "Making the watermelon Popsicles now because I just bought a big watermelon! It&#39;s in the freezer now. I didn&#39;t have coconut milk, so I used vanilla yogurt. I was really mad at myself because yesterday I ate my last kiwi so I didn&#39;t have any!! I blended some apple with spinach and a bit of hemp milk and it was green:) so excited to wake up tomorrow with Popsicles!"}, {"text": "All citrus or melon Popsicles?"}, {"text": "how do you get your popsicles out so clean without them breaking or melting down?"}, {"text": "Why do you close your eyes when you taste them??"}, {"text": "Are u from Wexford i heard strawberries and i was like yassssssssssssssssssssss"}, {"text": "what kind of cream do you use?"}, {"text": "Okay now let&#39;s bake them."}, {"text": "Yum. I bet mango and coconut milk (lassi) would be really good. Great video :-)"}, {"text": "Gemma, should we cook / boil the coconut milk before consume it? can we consume it raw? thanks.."}, {"text": "Do you need freeze the fruits before you do this?"}, {"text": "can you do a frozen cake"}, {"text": "where can I get the exact measurements?"}, {"text": "I love these... could you do a piña colada one?"}, {"text": "Does coconut cream work just as well as coconut milk"}, {"text": "I&#39;m gonna be all over this."}, {"text": "cool video"}, {"text": "Could you do a cotton candy Popsicle?"}, {"text": "all are amazing love your videos"}, {"text": "can I use a milk instead of coconut milk"}, {"text": "can I use frozen strawberry in the first one"}, {"text": ":3"}, {"text": "Hi"}, {"text": "instead of cantaloupe and strawberry, can you use mango and raspberry?"}, {"text": "Instead of using a food processor, could I use a blender?"}, {"text": "I made Gemma&#39;s no machine ice-cream and it was a little too sweet for me, but i&#39;ll definitely give this a go because is all-natural sugars! <br />....that is once i cure my bronchitis tho🙁🙁🙁🙁🙁🙁🙁"}, {"text": "I have a question when you add the stick does it go all the way to the top? Or bottom depending how you see it"}, {"text": "These Popsicles are AMAZING! I&#39;m so hooked."}, {"text": "She should make a app and put the stuff from her website on her app GEMMA ! Make a app i would get it"}, {"text": "I love your channel😍 been watching our videos for hours lol"}, {"text": "+Gemma Stafford is it frozen fruits??"}, {"text": "subscribed! 😍"}, {"text": "hi gemma can I use regular milk instead of coconut milk"}, {"text": "i love your accent😍"}, {"text": "I love this!! I&#39;ve just bought yesterday my moulds (not online) and today when I got on Youtube this video came up!! :) I can&#39;t wait to try these mixes! They look funny to make and delicious to eat, I&#39;m also going to play around with the ingredients that I have at home...I can&#39;t wait!!"}, {"text": "Your Welcome💖💚💛💜💙"}, {"text": "I think one of the popsicles should have been honeydew, cantaloupe, and watermelon."}, {"text": "Phenomenally Delicious. <br />LOVE your recipes🌹💖😀"}, {"text": "Phenomenally Delicious. <br />LOVE your recipes🌹💖😀"}, {"text": "What if you don&#39;t have a food processor?"}, {"text": "thank you soo much I can&#39;t wait to make this"}, {"text": "what about a cheesecake popsicle"}, {"text": "Which is better food processor or blender?"}, {"text": "Why didn&#39;t u make this video before like why 😅😉"}, {"text": "So gorgeous Gemma! All of these ideas look great, especially the peaches and creme or the watermelon flavour!"}, {"text": "I wish there will be recipes for milkshakes and smoothies. They are one of my favorites...."}, {"text": "They are all so beautiful...especially the watermelon ones."}, {"text": "☺😊"}, {"text": "can you make something Whit pistaciho nuts or dragonfruit? x"}, {"text": "☺😊"}, {"text": "love it! ! you are so creative I love the One that looks like a watermelon! xx"}, {"text": "are the popsicles easy to take out? Because I think the fruit&#39;s stickiness will stick to the actual mold. Please tell me if it is easy or a method to get them out!"}, {"text": "I love the way these are all customizable"}, {"text": "Can you taste the syrup in the coconut/raspberry?"}, {"text": "Dear Gemma, <br />I got married two weeks ago and the ONLY reason why I put a food processor on my registry was because of your videos- like this one! lol &lt;3 &lt;3 &lt;3"}, {"text": "oh at first i was like what the heck is cantaloupe??? then i saw it was rockmelon hahah:D"}, {"text": "I really really hope u reach one million then two million then three million and so on pls i tried the last one it was amazing like i am in heaven"}, {"text": "You&#39;re seriously goals with your skills 💕"}, {"text": "Can you do a video on creative breakfast ideas? I always have trouble coming up with breakfast ideas I can be excited about."}, {"text": "R vanilla and vanilla extract different and if so can u replace vanilla extract with vanilla?"}, {"text": "i try this and its so so good thank for the recipe gemma stafford"}, {"text": "Your really amazing Gemma<br />I hope i get a shout-out<br />I Love You"}, {"text": "What food processor do you use?"}, {"text": "Jajaja yes I did hear the birds. So yummy my favorite are the first two and the last one..."}, {"text": "i hope you have reach 1 million subscriber! because im your fan of pastries!💖😊😆"}, {"text": "I really like how you get straight to the point and get making right away. A lot of channels have a 2-3 minutes opening talking about how much they love it"}, {"text": "Nice! Liked the fact that you don&#39;t need to use any sweeteners with these :)"}, {"text": "at <a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=5m40s\">5:40</a> her hair 💇 lol"}, {"text": "These look so good!"}, {"text": "I&#39;m glad you posted a video using only natural sugars."}, {"text": "waooo wonderful.but how does spinach taste with pineapple and banana?? is it really taste yummm??"}, {"text": "You HAVE to get your own TV show in the food channel"}, {"text": "can u try something with mango or a new type of mango popsicle"}, {"text": "How am I just now discovering this YouTube channel?! I&#39;ve watched 3 episodes in a row. Love your videos! So many recipes I want to try now :-)"}, {"text": "Gemma I dont know how you do it but you out do yourself everytime! You are  by far the YouTube Queen!!"}, {"text": "I done this for a sleepover my friends loved them thank you so much for the recipe you are the best"}, {"text": "Love this vid"}, {"text": "For a second I thought you were going to say that it only took 5 hours to make <a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=2m07s\">2:07</a> <br /><br />Your AMAZING Gemma!"}, {"text": "u should try making rainbow bagelsss"}, {"text": "YUM....YUM...YUM Great job! I can&#39;t wait to make some of these myself."}, {"text": "Can you strain the purée? Would it change how much you have? I don&#39;t really like seeds in my Popsicles."}, {"text": "Amazing recipes! Thank you for showing and sharing them with us! Definitely gonna try to make these lovely popsicles;)"}, {"text": "Gemma, what an interesting video! I loved it! These popsicles will be in  my freezer for the next months! My kids will be so happy.<br /> One question Gemma: did you add agave to the coconut milk in the last flavour popsicle?<br />Thanks!<br /><br />Patricia."}, {"text": "I...LIKE....PIZZA!"}, {"text": "Wow, I&#39;m loving ALL of the flavors, will definitely be trying them out over the next weeks, my friends will be so happy :D<br />Gemma, I love how creative you are, keep up the great work! Also, I want to thank you for not forgetting about your vegan viewers (whether they don&#39;t want to or simply can&#39;t have dairy). I&#39;m always in for a treat and I&#39;m super grateful for new ideas because - who wants to have the same old boring stuff over and over again, am I right?! I&#39;m impressed by the way you make food so much fun, your creativity (how do you come up with all those ideas?), your ability to reinvent and jazz up traditional recipes and, what&#39;s very important, at least for me: your recipes always work out. I&#39;m never scared to just give it a go and try out your recipes because not one hasn&#39;t worked out for me so far. And again, this shows that you&#39;re a true professional :)<br />Lots of love from Germany :)"}, {"text": "Washermelon???"}, {"text": "I love your videos so much!"}, {"text": "Essa mina não eera lá da gemma? você sabia"}, {"text": "I&#39;d just like to say that I wouldn&#39;t recommend agave if you&#39;re looking for a &quot;healthier&quot; sweetener. It is very high in fructose (up to 90%) which can be very bad in high enough amounts. By comparison high fructose corn syrup is 55% fructose."}, {"text": "Hi Gemma, I just wanted to say thanks again for emailing me, it made my day! ^-^"}, {"text": "gemma is it important to use cantolop<br />my spelling could not be right"}, {"text": "Hey Gemma Stafford<br />I really like your videos......well now and then I face problem in setting up gelatin<br />Could you please make a video on the right techniques of setting up the gelatin<br />Hope you are gonna help me<br />Thank you"}, {"text": "Aaaaaaand sutable for vegans"}, {"text": "hi gemma ! i&#39;m najwa from morocco .i like so much you recipies cos it&#39;s so simple and looks delicious . i will definitly try some of these recipies since we are in holidays . thank you chef . love you 😘"}, {"text": "Hello, Gemma! I watch all your recipes and even have tried some myself and they are all amazing! I also love your Irish accent! One suggestion: Can you post a video about how to make bueno cream spread? Cannot find it anywhere online. Thank you!"}, {"text": "i never had popsicles more than 2 days in my freezer ._."}, {"text": "Congrats!You got another subscriber!You deserve infinity subscribers!Im definitely sharing your channel with friends and family!Keep up the good work😃😃😃"}, {"text": "can i put banana instead of peaches"}, {"text": "How about something pink lemonade flavored?😃"}, {"text": "there&#39;s no lemon ? omg gemma we need to talk"}, {"text": "gemma please make a butterscotch homemade no machine ice cream"}, {"text": "oh, i love these!  what fabulous flavor combinations!  question:  do you think coconut milk/dairy-free yogurt and dairy-free creamer could work in place of the dairy versions?"}, {"text": "smoothie and  watermelon popsicles look great"}, {"text": "i love your new website!!!"}, {"text": "I tapped the subscribe button like you asked this channel is perfect not too hard"}, {"text": "Hii, I tried making it<br />But when I pull it out , they all broke in half <br />Plsss help"}, {"text": "My kids love for me to make your popcicles. I usually just do your Greek yogurt base and mix pureed fruit in it so we have a creamy fruit popcicle. they especially love pineapple the best."}, {"text": "cantaloupe and strawberry? I&#39;ve never heard of that combination before, is it good?"}, {"text": "Do you live in Wexford by any chance? I live in Dublin btw"}, {"text": "These are amazing! I really hope you can help me with my request! I&#39;m a big fan of your 2 ingredient ice cream recipes! :) However, no one has ever been able to re-make the italian gelato &quot;Puffo&quot; that I loved as a child. I do believe America has something similar; called Blue Moon. It would be a dream come true if you could re-create it! It&#39;s my favorite! :-)"}, {"text": "Healthy, vegan. I love it!"}, {"text": "Where did you get that Popsicle mold?<br />Also these look so good"}, {"text": "Where did you purchase your food processor?"}, {"text": "These are the prettiest popsicles ever!! It&#39;s supposed to be 117°F here in Phoenix today... I think I need ALL these popsicles today :)"}, {"text": "Instead of adding chocolate chips, you could also use blueberries. I absolutely love your channel! I&#39;m going to make the raspberry and coconut milk one today, I can&#39;t wait to see how it turns out!!"}, {"text": "oh! the raspberry cream popsicle looks so pleasing!♥♥♥"}, {"text": "Hi so I make you strawberry kiwi watermelon Popsicle and they did not come out of the mold. Is there something I should put on the mold so it doesn&#39;t stick or is there a different mold you think would work better. If you could help me that would be great. Thanks!! 😃😜"}, {"text": "Strawberry Cake please!!"}, {"text": "you are amazing and your recipe too can you do an ice cream by using froo froo morning coffee please"}, {"text": "its summer time!thank you gemma :)"}, {"text": "So nice love it"}, {"text": "can you make caramel fudge and I love your recipes :)"}, {"text": "+Gemma Stafford can u please do a collab with meg in whats up moms"}, {"text": "just tried this with whatever fruit i had around (mango and watermelon), hope they turn out amazing!"}, {"text": "Lookes yammmmy"}, {"text": "gemma can you make me mango banana ice candy. I love whenever I&#39;m still a 9 year old kid"}, {"text": "+Gemma Stafford Please make a tiramisu ice cream"}, {"text": "Can I add gelatine in my popcicle"}, {"text": "Absolutely love all your Popsicle creations 😍"}, {"text": "You can publish that video on 9th of June"}, {"text": "If your answer is the website I can&#39;t find any anniversary or mango. I hope you will be able to make a good big and bold recipe"}, {"text": "11th of June*"}, {"text": ":)"}, {"text": "Tats y I luv u soo much.. coz u reply to every requests.. u r the best"}, {"text": "Tats y I luv u soo much.. coz u reply to every requests.. u r the best"}, {"text": "I love green smoothie"}, {"text": "Omg these are absolutely gorgeous I need to try these they look so tasty!!"}, {"text": ": D"}, {"text": "☀ ♥ ☀ Looks delicious and perfect for summer! Thanks for these great recipes, Gemma!"}, {"text": "Can&#39;t wait to try this!!! YUM! Can you double or triple recipes? I have 5 children."}, {"text": "is the cream ap cream"}, {"text": "So good! I&#39;m definitely going to try it!"}, {"text": "Amazing!!"}, {"text": "Make salted caramel twix icecream!!💕"}, {"text": "can u make  ice cream without condensed milk"}, {"text": "Could you please make more gluten free recipes, especially baked goods? I&#39;ve loved your channel for a long time and was diagnosed with celiac&#39;s disease so I can&#39;t make a lot of your recipes and sometimes swapping out the flour for gluten free flour doesn&#39;t always work. Please and thank you :)"}, {"text": "+gemma I love your videos. I plan on trying some of them for my 2 yr old. thank you for the amazing ideas. ❤💚"}, {"text": "you just got a new sub"}, {"text": "Hey Gemma can you make a easy It&#39;s It&#39;s Ice cream Sandwich"}, {"text": "Wow these look better than store bought"}, {"text": "can you make raspberry lime popsicles, Or blueberry?"}, {"text": "dear Gemma, i discovered your channel last year and i get addicted ever since i have tried a lot of your recipes and i must say they are really yummy! thank you for sharing them! xx"}, {"text": "What brand food processor do you use?"}, {"text": "+Gemma Stafford instead of adding pineapple in that smoothie popsicle can we add frozen mangoes??? plss reply coz am gonna make it..."}, {"text": "I just wanted to thank you for all your amazing recipes. Me and my mom have made all of your recipes. Once a video is up me and my mom watch it and check in our refrigerator to see if we have the ingredients and if we don&#39;t have them we&#39;ll go to the store and get them. You have inspired me to bake and now I think it&#39;s an obsession"}, {"text": "do you have an alternative to kiwi i&#39;m allergic"}, {"text": "If the fruits are extremely sweet these would be wonderful"}, {"text": "healthy and yummy😍"}, {"text": "These look totally amazing! I made some the other week and they were scrummy! Blueberries and Greek yogurt!"}, {"text": "Thank u"}, {"text": "I love these 😍😍😍😍😍😍"}, {"text": "we are gonna live in a hotel that day and the day before it. I wanna keep it a secret."}, {"text": "Its on 11th of July."}, {"text": "Gemma can you give me an idea something for my parents&#39; anniversary? Something small to take  in my very small purse. Something mango because both of them love mangoes. I hope you will think about this. ☺"}, {"text": "Hi Gemma can you make vegan cake?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=0m44s\">0:44</a> Cantaloupe and strawberry<br /><br /><a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=2m23s\">2:23</a> Raspberry and coconut<br /><br /><a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=3m52s\">3:52</a> Green smoothie popsicle<br /><br /><a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=5m14s\">5:14</a> Peaches and cream<br /><br /><a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=6m49s\">6:49</a> Watermelon Strawberry popsicle"}, {"text": "Oooooh I&#39;m so going to try all of these out since i bought a popcicle mold just a few weeks ago. Thanks for these great ideas again! :)"}, {"text": "hi gemma you are so inspiring can please make a video on white chocolate lava cake"}, {"text": "Please give me one. Hot summer here 😅"}, {"text": "Yeah great way to beat this hot summer"}, {"text": "my Popsicles always seem to go crystallised and loose a lot of their flavour when I freeze them. is there a way to prevent this?"}, {"text": "this is what i was waiting for .thank you sooo much ...."}, {"text": "vegan in coments thinks this is amazing"}, {"text": "ummmmm"}, {"text": "hello Gemma, I don&#39;t get cantaloupe in the place where I live so can I do mango and strawberry do they go tother good? plz reply(I can say to my dad to buy it on the way back home)"}, {"text": "QUEEN of simple popsicles and mug recipes❤❤ keep it up"}, {"text": "i love the way she says &#39;banana&#39;. it makes me feel...happy  :)"}, {"text": "Purpleyum flavor icecream is the best ever wish u will give it a try.."}, {"text": "Ill gonna make this tonight.perfect for summer.. Ill share this to my workmates and friends...but im still addicted  to your pinacolada icecream...pls do make aome purpleyum jam flavor."}, {"text": "you keep proving that you deserve your subscribers. and more!"}, {"text": "I have a question, can I use mint instead of spinach?  :)"}, {"text": "Hi Gemma, I just bought a new popsicle mold and made popsicles twice following your recipe. Gemma can you please give me tips on how to take the popsicle out the right way without breaking or melting it because when I made the fruit and lemonade popsicle it started to break and for the cream and yogurt  popsicle, a little bit got melted when I took out after running it under warm water and melted in seconds and if I dont run under warm water for 30secs or more it doesn&#39;t even come out where as your&#39;s turn out nice and frozen from the thumbnail, can you please give me some tips. Thanks "}, {"text": "Gemma you should try some Indian desserts... like really with a twist...<br />Hope you like the idea :)"}, {"text": "LOVE THIS!!!"}, {"text": "I am Muslim and I like your recipes"}, {"text": "I love your recipes and I liked the watermelon Popsicle"}, {"text": "can u do more citrusy desserts? lemon meringue inspired? vegan lemon meringue???"}, {"text": "Just 5 hours 😳"}, {"text": "Can u make ur website into an app"}, {"text": "It&#39;s now winter here in Aus, and I want some! Love the natural colors :)"}, {"text": "Melon and strawberries!! I&#39;ve just found my new summer favourite &lt;3 &lt;3"}, {"text": "I love you idea my hero gemma and your creative and we need to say more but what I say"}, {"text": "Hi Gemma!<br /> I love your videos and all your recipes look delicious but the ones that I&#39;ve tried that involve baking never turn out righ for me , I guess it&#39;s because I live in a super high city, could make a video with some tips to adapt recipes to higher places? It would be very helpful. Thanks a lot."}, {"text": "DAMM! Gemma is almost at 1 million views!"}, {"text": "lovely and healthy!!"}, {"text": "On the watermelon Popsicle can we use different things if we don&#39;t like that fruit?😀"}, {"text": "the third one looked like kiwi."}, {"text": "Hi Guys! Let&#39;s beat the heat with this Refreshing and Awesome Fruit Popsicles.. Thanks Gemma Stafford for this another fun and bold yummy delicious Heaven..."}, {"text": "Watermelon Popsicle looks so good"}, {"text": "Yay! This is great! I was hoping you would do some summer frozen treats :D"}, {"text": "All of them look so pretty 😍"}, {"text": "You make me so happy :) you&#39;re a pleasure to watch! I love the new recipes :D"}, {"text": "How is this so beautiful"}, {"text": "The watermelon popsicle looked phenomenal! I was wondering; how do you clean your food processor so much for these videos??"}, {"text": "Do you soak the sticks so you don&#39;t get those splinters or do you use them as is?"}, {"text": "It is truly phenomenal Gemma!"}, {"text": "Thank you so much I absolutely love your videos and share them with everyone! Please keep going! Also I really like the Bold Baking Basics, they are very helpful."}, {"text": "Can u make Magonada Sno Cone for a next vid for summer"}, {"text": "And I&#39;m very excited you website updates!"}, {"text": "These are so pretty! And look DELICIOUS!"}, {"text": "Omg all these flavours!!!"}, {"text": "I need to purchase a popsicle mold and try this"}, {"text": "make raindrop cake!!☁💧💧"}, {"text": "what&#39;s the substitute for pineapple, because I don&#39;t like pineapple? I wanna try green smoothie popsicle (:"}, {"text": "I will be making all of these!"}, {"text": "What was the secret layer? I didn&#39;t catch it :/"}, {"text": "Cant wait to try these out😍 they look so good"}, {"text": "The raspberry and cream looks delicious! Coconut milk tastes so good!!"}, {"text": "Was there a bold baking basics episode this week?"}, {"text": "🇲🇽 🇲🇽 the moment when you realize that the watermelon popsicle reminds you the Mexican 🇲🇽🇲🇽 flag 💪😎😂 and not a watermelon 🇲🇽 🇲🇽 🇲🇽 🇲🇽"}, {"text": "What is this accent?"}, {"text": "Absolutely loved all the combinations! I also liked that all these popsicles contain natural sugar (I knw lil sweetener is added in couple of them) which makes them healthier &amp; guilt free 😊"}, {"text": "That kiwi popsicle... Please become alive through my youtube screen so I can eat you!!!"}, {"text": "Wow what great flavors and ideas for a healthy treat! I&#39;m definitely going to make these in the summer. And they are beautiful also! Thank you!"}, {"text": "Hey, I have a friend who&#39;s allergic to coconut, is there anything I can substitute the coconut milk with? It&#39;d be nice to make a batch for everyone but not have him excluded."}, {"text": "These look so delicious! Yum yum yum:) a suggestion for another video: can you try some summer smoothie recipes? Like maybe that green smoothie you eat each morning;D"}, {"text": "Which one is better <br />Your cookie dough or red velvet"}, {"text": "The watermelon one is so cute~"}, {"text": "BEAUTIFUL!!!"}, {"text": "+GemmaStafford hey! Awesome video! I tried your cookies and cream Popsicle and it stuck to the Popsicle mold. I put it under hot water for like 6 minutes and it still stuck. I found that it was only the Popsicles with the cream. The fruit ones came out easily. Do you have any tips to not make it stick? Thanks!"}, {"text": "AAAAAAH THESE ARE SO COOOOOL! How hot is it where you live, is it finally popsicle weather?"}, {"text": "l love this &amp; saved this video.thank you for sharing."}, {"text": "<a href=\"http://www.youtube.com/watch?v=BMh9S4Y9wrg&amp;t=4m05s\">4:05</a> Do you have any substitutes for orange juice? I have an allergy."}, {"text": "Your videos are awesome and I wish I could meet you"}, {"text": "😊😊😊"}, {"text": "Amazing flavour combos.<br />It seems just yesterday i had tried making ur summer popsicles..which were a huge hit...and see summer is back again...didnt realise how the time flew...Great Going Gemma...with BBB...👍👍<br /><br />You have a recipe for every season..every meal...all the year through...☺☺"}, {"text": "Is your strawberries and peaches frozen all the way? They don&#39;t look like they are but they don&#39;t look fresh either. Just wondering what stage I should use my fruit in😀"}, {"text": "I loved that watermelon Popsicle! (Perfect for Instagram)"}, {"text": "The watermelon looks sooo good!"}, {"text": "gemma today is my birthday can you make something themed about that"}, {"text": "Fantastic!! Thanks for sharing. I&#39;ll definitely look into making these soon :)"}, {"text": "You&#39;re literally the most creative cook on youtube... like literally how did you come up with these???"}, {"text": "love it"}, {"text": "Ahh I remember the lemonade fruit Popsicles I made last year. I think I&#39;m going to do it again! You are amazing Gemma! This brings me back! Totally going to try another Popsicle!"}, {"text": "is there any tip for a slow-melt popsicle? my younger daughter has problems eating and takes a long time with pops, which of course leads to melting which gets her freaked out and she won&#39;t eat anymore. any ideas?"}, {"text": "I made the peach one and it tasted amazing, thanks so much!!"}, {"text": "do a lychee popsicle or Carmel apple milkshake"}, {"text": "It isn&#39;t Summer yet"}, {"text": "The watermelon Popsicle looks AMAZING."}, {"text": "Where did you get your popsicle mold?"}, {"text": "they all look so good"}, {"text": "Another amazing recipe! I could watch your recipes for hours:)"}, {"text": "Fresh, clean, and refreshing perfect for summer! 🍉☀️"}, {"text": "Those healthy treat suit my craving!<br />But I tried this method of pureeing and freezing and it crystallized, I didn&#39;t like that at all =\\"}, {"text": "hi Gemma just wondering where did you get those popcicle molds ? great if u can reply 😀"}, {"text": "Can I substitute coconut milk with any kind of milk as long as I add the extra sugar? (I&#39;m allergic to coconuts &gt;_&lt; )"}, {"text": "hi gemma...good job i love ur vids especially this fruit popsicle vids...i live in a tropical climate hw can one preserve it frm melting fr lunch?"}, {"text": "*have us comment"}, {"text": "Hi Gemma - you are my baking idol! I absolutely LOVE to bake but sometimes I have a little bit of a sugar overload! 😂😎😬 I love how your recipes contain natural sugars but still taste ABSOLUTELY AMAZING!!! I look forward to Thursday&#39;s and I am so happy you now make 2 videos a week! Thank you! Aoife x"}, {"text": "I might try rasberry and mint<br />Its my favourite soda flavour<br />I know im weird"}, {"text": "You are so amazing! You should try a giant themed cake with fondant! You should have is comment a theme or get ideas from How To Cake It!   Love you!!"}, {"text": "Thanks a lot🌞🍌🍇✅👍✳️"}, {"text": "yum want to try one yummy"}, {"text": "I love your videos, thank you for letting us know some alternatives (like using stevia instead of sugar, or coconut milk instead of cow milk) Thank you thank you thank you!!! ♥ ♥"}, {"text": "Should I bake brownies or cupcakes and why? <br />It is for a special occasion"}, {"text": "mmmmmmmmm"}, {"text": "Gemmaaaaa the ice lollies looked  so pretty the take on &quot;Watermelon&quot; awesome..well done 🤗"}, {"text": "Really excited about this online account thing, will you guys eventually create an app for it as well? Also, where am I supposed to post recipes, pics etc. on it?"}, {"text": "how can i make limon ment flaver"}, {"text": "Hi Gemma I love all yours videos,I have a question. Where did you bay the popsicle cups?  Thanks"}, {"text": "Would blueberries taste nice to resemble water melon seeds rather than chocolate chips ?"}, {"text": "I am DEFINITELY trying all of these out. I lovvee ur summer recipes Gemma!"}, {"text": "Your smile is so BEAUTIFUL😍!! I love you Gemma💖"}, {"text": "I&#39;m only 10 and I get so inspired in your videos. I wish I can do the food that you make."}, {"text": "Why don&#39;t you have 1million subs yet ?!!!! U deserve it 😉"}, {"text": "You always make them so pretty! Especially the watermelon one. Love the new website for sure!"}, {"text": "I wanted to ask u some advice"}, {"text": "I think these are perfect for summer and even for doing with kids! I bet while babysitting on a long summer day the kids would love putting them together in the morning to enjoy after nap time!"}, {"text": "The watermelon idea is incredible !!! 👏🏼❤️ my favorite is the one with raspberry and coconut milk!!! 😍"}, {"text": "Which food processor do you have? I been thinking of getting one. Love all your recipes can&#39;t wait to try this popsicles."}, {"text": "you should try Peaches and strawberries it&#39;s amazing"}, {"text": "Can you please try to collab with How To Cake It or Rosanna Pansino?"}, {"text": "I love how simple your recipes are. When there are a million ingredients I usually think, &quot;Yeah, that&#39;s not happening.&quot;"}, {"text": "I am the 1,000 like"}, {"text": "I love this!! Its perfect for the little kids!!"}, {"text": "thanks for the amazing recipe... I realize your just getting to summer but some of us are just getting into winter so please don&#39;t forget to do some warm recipes too :)"}, {"text": "Gorgeous x"}, {"text": "vegan recipes !!! i love these so much"}, {"text": "YASSS KIWI MY FAVORITE did you know kiwi has more vitamin c than oranges"}, {"text": "If you don&#39;t like seeds can you sift your fruit like will it freeze the same?"}, {"text": "I AM SOOO HAPPY ABOUT THE WEBSITE UPGRADE😃😃😃😃😃"}, {"text": "beautiful colours, bet they&#39;re delicious"}, {"text": "Wow I love all the flavour combinations Gemma, but that peaches and cream is calling my name lol. So delicious"}, {"text": "You always have so many good ideas! They  look amazing..definitely going to make these when I&#39;ll have the time! Looking forward for your next summer treats and maybe new dairy free ice cream flavors :)"}, {"text": "Omg the watermelon one is sooooo cute"}, {"text": "WOW! i am going to have a summer party and i needed to buy popsicle cause i didnt know how to do popsicles bur after i saw the watermelon one my friends will be so delighted to taste it!<br />thx Gemma u r a life saver!."}, {"text": "You should do a video about breakfast smoothies- I&#39;m always looking for yummy new combinations!"}, {"text": "wowwww....it is so easy and i  like that,cool and you are so verry gorgeous gemma absolutely gorgeous....by way gemma do you a vedio how to make molten chocolate cake? and chocolate fondunt?"}, {"text": "These look delicious Gemma, I love your summer recipes! Thanks for the popsicle ideas these are perfect summer treats! :)"}, {"text": "Gemma, my family and I all love your recipes and look through all of them in the summer and try to make them all! We love you! +Gemma Stafford"}, {"text": "I seriously don&#39;t like store bought ice cream anymore since I started doing my own following your recipes. Healthy and yummy yay!"}, {"text": "Great vid Deffo gonna try these Gemma do more ice cream do rainbow sherbet 😘💖"}, {"text": "These are gonna be perfect for my summer diet and most are bo points so yay 😃"}, {"text": "Hi Gemma, wow this looks amazing will definitely give these Frozen Treats a try :) Thank You!"}, {"text": "I enjoy your videos so much!  Could you share your green smoothie recipe with us?"}, {"text": "Nice!"}, {"text": "how do you add a profile picture"}, {"text": "great video! thanks for sharing."}, {"text": "I added cut up blueberries instead of chocolate chips"}, {"text": "Seriously these recipes are out if this world"}, {"text": "i was really delighted with the last one. looks so cute. i cant help but smile while watching"}, {"text": "These look AMAZIN could u maybe do a homemade sorbet bid cause they are my favorite summer treat I love ur visa BTW  😊"}, {"text": "You should make homemade ice cream bars"}, {"text": "Great recipe! Definitely going to try this for summer! :)"}, {"text": "I&#39;m 11 years old and I get insipired by your videos and make them on the weekend"}, {"text": "very delicious recipe"}, {"text": "I love your popsicle garland!"}, {"text": "I liked the video even before I tuned in to the video 😘❤ Love Gemma"}, {"text": "Thanks for a good summer treat.luv u"}, {"text": "Amazing 😩💚 I have to make some ! <br />Thanks Gemma 💕"}, {"text": "Your picture staging of the finished Popsicles is fantastic! You both are very artistic."}, {"text": "My mouth is watering. 😍❤️❤️"}, {"text": "bu kaliplari nerden alayosunuz soylermisiniz öğrenmek  istiyorum da Teşekkürler"}, {"text": "You&#39;ve been doing really well with filming and with the redesigning of your website. Also I&#39;m loving how you presented the Popsicles on a bed of cut fruits, very tempting!"}, {"text": "The last one was a cool twist great job!"}, {"text": "LOOOOOOOVE IT!!!!!!!!!!!"}, {"text": "If i want to make a popsicle with strawberries and yogurt do i need to add any sugar or nothing like the peaches"}, {"text": "Yummy!! I love your recipes!! I&#39;ll have to try these !!"}, {"text": "☼"}, {"text": "lovely. .."}, {"text": "These look beautiful and thank you for the link to the Popsicle maker!"}, {"text": "love this!♡ <br />I have a Question Gemma, ¿Do you think you could make a big and bold dessert for this summer? Like something fresh and cold not only Popcicles, just something else really big and bold like you always do😁"}, {"text": "The peaches and cream popsicle looks delicious! Just wondering, did you use single or double cream? 😄"}, {"text": "they look delicious"}, {"text": "I&#39;ve been looking for a healthy dessert option! Thank you!  Pina colada flavored would be awesome too with the pineapple and coconut.  Time to dig out the blender!!!"}, {"text": "Spinach? I thought it was kiwi"}, {"text": "These look so good and are perfect for summer!"}, {"text": ":D Ahhhh great way to eat sweet stuff without being unhealthy. Making these soon! &lt;3"}, {"text": "your welcome :D"}, {"text": "Getting my summer holidays tomorrow, will have to make them to celebrate 😁"}, {"text": "tomorrow is my mom`s birthday...im going to do some of these popsicle for her because it is looking sooo delicious...thank u so much gemma...you are the best baker in the world"}, {"text": "very nice for summer, thank you so much for your recept !. Love !. 🌹"}, {"text": "Looks awesome!!"}, {"text": "Can you adopt me please?"}, {"text": "Love them all Gemma...the watermelon ones are adorable ❤️"}, {"text": "Wow, fantastic for the summer!"}, {"text": "Bravo Gemma!! I am going to try these for the summer and I know my husband will love them too ♥"}, {"text": "Okay, the watermelon one is REALLY clever. XD Of course, I&#39;d be tempted to just stick with the watermelon and strawberry (cuz I&#39;m a sucker for that combination!), but that&#39;s just me. XD"}, {"text": "Looks great! Oh, if you put blueberries in the raspberry and coconut you can serve for Fourth of July!"}, {"text": "that taste so good. And u have you subcriber"}, {"text": "Gemma, do you by any chance have another ice cream recipe suitable for diabetics? I  would love to make some for my dad, who&#39;s nuts for ice cream, but he really shouldn&#39;t have it ;o)"}, {"text": "I live in Cork and I grow tayberrys"}, {"text": "One question can you make desserts sugar free ?"}, {"text": "Wow! That looks fantastic! My mouth is wathering and, although it is winter here, I&#39;m feeling like having one of these popsicles -or just all of them LOL<br />Great combinations, Gemma! ;) Cheers"}, {"text": "I love you Gemma😀. You make the best recipes📒"}, {"text": "In my expirience,  i find that frozen fruit doesn&#39;t puree well. any tips?"}, {"text": "Love it ! Especially the watermelon popsicle !!!"}, {"text": "Gemma alwayzzz rockxxxxxxxx"}, {"text": "Thank you Gemma! These look good."}, {"text": "Omg they are awesome thanks !!!!!"}, {"text": "I really like that you&#39;re doing that kind of healthier recipes..  can&#39;t wait to try it out for summer! &lt;3"}, {"text": "I love this channel so inspiring🔐"}, {"text": "It lookes berry Good but I did it and it did not even work"}, {"text": "Omg yuuuummmm"}, {"text": "how can u b so creative gemma?!!💋💋😘😘❤❤❤❤ +Gemma Stafford"}, {"text": "thanks Gemma for making this lovely recipe . love your recipes soooooooooooooooo much"}, {"text": "Healthy ice cream! Thank you so much!"}, {"text": "Hey!!thanks for the lovely gorgeous yummy summer treat!!"}, {"text": "yum....😛😛😛"}, {"text": "so creative...very nice"}, {"text": "What if i don&#39;t have a food processor? <br />I tried your no machine ice cream recipe and it turned out awesome!<br />I had no idea that just 2 ingredients would do it all.<br />Thanks a lot for these wonderful recipes."}, {"text": "All the Popsicles are really decadent and gorgeous 😀😀😀"}, {"text": "I love this.😍❤"}, {"text": "I know right, this why gemma&#39;s is a star!"}, {"text": "what can u use if u don&#39;t have cream or coconut milk"}, {"text": "I love this recipe thanks soo much I was looking for something like this❤❤❤"}, {"text": "I&#39;m from Ireland 🇨🇮🇨🇮"}, {"text": "in my freezer even store ice cream doesn&#39;t stay for long. so how shall I freeze this popsicles?"}, {"text": "Cam I use tje coconut milk from a carton, or should it be from a can? And can I also mix and match the different fruits to create another popsicle flavor?"}, {"text": "Gemma you are so talented and creative! There is not one video that doesn&#39;t blow me away!! These popsicles look both amazing and delicious, definitely going to try these this summer :D"}, {"text": "Agave in America is very unhealthy. It is 57-90% fructose making much worse than High Fructose Corn Syrup which is only 55% fructose.  I am sure it is possible to buy Agave processed by artisanal companies in small batches using cold process methods but the vast majority of Agave in the US is highly over processed and very unhealthy.  Research it-it isn&#39;t hard to find the information.  Dr. Andrew Weil stopped using Agave sweeter in 2011 according too is own website because of the fructose content."}, {"text": "amazing video"}, {"text": "is there any replacement for the kiwi? cause i&#39;m allergic😭😭"}, {"text": "Back at it again with fruit popsicles, love all the popsicles that you make"}, {"text": "Heyy Gemma, these popsicles are way too pretty. I love them all. And I&#39;ve seen most of yoyr video&#39;s, all of them are so great. But can you also do a video of making homemade cream cheese? Thankyouu xx"}, {"text": "hi Gemma! I love all of these recipes! is there any chance you&#39;ll do a chocolate themed popsicle too?"}, {"text": "Gemma&#39;s subscriber for life love u so much ❤️❤️"}, {"text": "Hey Gemma... It looks so delicious... Greetings from Germany 😘"}, {"text": "Can I use almond milk in these recipes?"}, {"text": "World&#39;s most beautiful popsicles I have ever seen.I&#39;m  definitely making these❤😊"}, {"text": "lovely ;-)"}, {"text": "I love you so much, Gemma! &lt;3"}, {"text": "Gemma what fruit can we use instead of pineapple? a substitute for peaches too..dont find them much here...thanks"}, {"text": "Luv your recip"}, {"text": "gummy candy popsicles"}, {"text": "+Gemma Stafford Thank you for doing this."}, {"text": "and by the way this video is amazing"}, {"text": "this vedio is ossom Gemma aunty thank u surely gonna try"}, {"text": "eggless* sorry"}, {"text": "Oh yés, for pineapple n banana.. Sorry,the spinach what can i replace? Because kids here dont like spinach.."}, {"text": "I love all of these popsicles😍😍😍 There is no a fruit that I don&#39;t love😋😋"}, {"text": "HI Gemma! These look absolutely delicious and super easy! Thanks for sharing, can&#39;t wait for more recipes! :)"}, {"text": "Maybe show us home to make popsicles covered in chocolate 😋 or ice cream bars like Magnum that are covered in chocolate (:"}, {"text": "Can you please make Eggleston donuts"}, {"text": "Hi gemma"}, {"text": "I&#39;d love to try this Gemma! And I love the Popsicle Banderritas behind you &lt;3 really creative."}, {"text": "Yes i love this!!! Tq.."}, {"text": "YES<br />Time to get popsicle molds."}, {"text": "Thank you for the vegan treats Gemma  ♡"}, {"text": "Just from the intro these Popsicles looks so amazing 🍦"}, {"text": "these look so amazing ♥!!! im hungry even though I just ate!!!! by the way for the watermelon popsicle can I ditch the strawberries?  cause strawberries arent in season in india... :-("}, {"text": "Hello gemma...u r awesome...luv u n ur recipes...all are my fav flavour.unfortunately cant try it now..its freezing cold in mauritius...hope u will reply my msg ..thnkss..."}, {"text": "For people that are allergic to peaches and other stone fruit (Like me), what are some other fruits you can substitute for the peaches in the &#39;Peaches and Cream&#39; popsicle? I can think of strawberries off the top of my head, but I&#39;m sure there&#39;s other things too."}, {"text": "I have a dream: and it is to visit you one day and thank you personally for everything you&#39;ve been making. You inspire people around the world indeed! In Brazil, we say &quot;picolé&quot; (I love this word) for popsicle, and as we have lots of exotic fruit it will be deliciously challenging to create new recipes. Thank you so much and may God keep blessing!"}, {"text": "The coconut and raspberry looks like a match made in food heaven.... Can&#39;t wait to try them Gemma!"}, {"text": "I love your Popsicle recipes so much definitely going to try them"}, {"text": "the watermelon popsicle is just awsome gemma tanks gemma plz reply"}, {"text": "Is there a substitute to the coconut milk in the water melon ice lolly?"}, {"text": "OMG , this is perfect for summer season 😋"}, {"text": "looks good"}, {"text": "She deserves more subscribers"}, {"text": "what is bold baker?"}, {"text": "Please do a kitchen tour!!!"}, {"text": "I swear I love everything you make on your page.  these are things I can make for my friends"}, {"text": "made the no machine ice cream n vanilla. was so perfect"}, {"text": "Yummy I might have to convince my uncle to make these with me!"}, {"text": "These look incredible Gemma 😍  so perfect for summer!!"}, {"text": "yum...I m gonna try em ol...."}, {"text": "OMG they look soooo good especially the one that looks like a watermelon!!"}, {"text": "So true about watermelon and strawberry working very well together. Love blending both together for a nice and refreshing juice to drink."}, {"text": "Omg I&#39;ve to try this👏"}, {"text": "Ugh I can never get enough. So creative Gemma!💕"}, {"text": "I made your carrot cake for my grandmas ninety birthday please check dm on intagram my account is @izzyrubinson"}, {"text": "these looks amazing and heavenly !! keep up the great videos!!!!!! :-)"}, {"text": "really loved the watermelon one"}, {"text": "I thought the spinach mixture was kiwi :P"}, {"text": "Aw I got to see my food photos on the new website. These popsicles look so beautiful and tasty. My favorites are raspberry and coconut, and the watermelon, because is my favorite fruit  :)"}, {"text": "now that&#39;s what I call something cool for summer"}, {"text": "I love your Popsicle videos Gemma, can&#39;t wait to try them! P. S I love all your videos 💕"}, {"text": "These would cool you down on a sunny day and are healthy at the same time good for if you are on a diet and wanting a treat."}, {"text": "*Ice Lollies. ;)"}, {"text": "Omg these look so good"}, {"text": "I cant find that popsicle tray in my country 😭"}, {"text": "@Gemma Stafford please do come to India if you get a chance. You are so inspiring and the best thing about your recipes is that there is something for everybody. I&#39;m dying to meet you."}, {"text": "these recipes are very clever and healthy :) can&#39;t wait to try em"}, {"text": "they look so yummy"}, {"text": "that moment when popsicles are way prettier than u"}, {"text": "I adore u gemma I hope you notice me ♡♡♡♡♡♡"}, {"text": "making  this right  now"}, {"text": "They all look so yummy I&#39;m gonna have a hard time deciding which to make first!! And with school getting out in a couple days this is going to be something really cool to do with the kids and enjoy eating them as well! Thanks for the awesome ideas 😃😃😃"}, {"text": "5 hours is a lot I can&#39;t especially popsicles 😅😅😅"}, {"text": "Love ur videos"}, {"text": "Coooll"}, {"text": "omg! i will try thisss yumnn"}, {"text": "I love all of them ! They look so pretty.."}, {"text": "Gemma you are the best love your work and was hoping for a favour could you give us some recipes for thirst through the day as we Muslims having our holy month of Ramadan where we fast from dawn till sunset without drinking or eating and that was easy for my now I am a number two diabetic and that makes me so thirsty"}, {"text": "I&#39;m early for the first time!"}, {"text": "Great video as always and the thumbnail to this video is gorgeous btw 😍"}, {"text": "always waiting your video, you are my best Chef ever ..🌹°:)<br />l♡♡♡♡♡ve you, wish you live always happy healthy life Ameen 😙"}, {"text": "the popsicle that looks like a watermelon is GORGEOUS!"}, {"text": "this looks soooo amazing...i wish i could virtually taste it..."}, {"text": "I&#39;m early!!!"}, {"text": "Thanks gemma your reply just made my day"}, {"text": "These look AMAZING, Mrs. Gemma (is it okay if I call you that? It&#39;s sort of weird for me to call adults by their first name lol :)!! These will totally be on my list of recipes to make for Summer. Keep up the fabuluos work! :D xoxo, ~Gemma (GemzMyLens♥)"}, {"text": "Raspberry and coconut is the best combination for me I LOVE IT - Thank you : )"}, {"text": "11th comment"}, {"text": "Oh, it is so delicious. And guess what? I am waiting for your video today because it&#39;s my birthday 🎂"}, {"text": "11th comment yaxzzzz"}, {"text": "Woah!"}, {"text": "Hi Bold Bakers! I hope you enjoy my new Fruit Popsicles for summer. And make sure you sign up (<a href=\"http://www.biggerbolderbaking.com/sign-up/\">http://www.biggerbolderbaking.com/sign-up/</a>) on the all-new <a href=\"http://www.BiggerBolderBaking.com\">http://www.BiggerBolderBaking.com</a> to get tons of FREE features including saving my recipes for later and submitting your own recipe photos. Thank you for making the Bigger Bolder Baking Community so great!"}, {"text": "Hi gemma.i am your biggest fan.i have made your mug cakes and mug meals and they turned out great.keep up the good work on microwaveable mug meals.bye"}, {"text": "They look absolutely delicious!  Love the vid"}, {"text": "6th comment soooo early notification squad where u at!!?"}, {"text": "Hi, Gemma. Those popsicles look delicious, especially the watermelon one. Emma from Emma&#39;s Goodies, and Julia from One Kitchen-A Thousand Ideas would also be amazed. Thank you for sharing this wonderful recipe with us. What&#39;s the best method to make homemade ice cream? Have a lovely day, Gemma. 💖💖💖"}, {"text": "this looks so delicious gemma... can&#39;t wait to try it..."}, {"text": "awesome!!"}, {"text": "Yum!! That looks great!! :D"}]