[{"text": "I&#39;m starting a live stream in 15 minutes, talking about Kickstart first! <a href=\"https://youtu.be/w3W-w0EXEtc\">https://youtu.be/w3W-w0EXEtc</a>"}, {"text": "Is leetcode good for coding interviews for product based companies?"}, {"text": "Thanks for posting this, I like the commentary format. Instead of focusing on your mistakes in your commentary I would have liked you to explain your successes, I could not keep up with your solutions!"}, {"text": "+1 from the future commentary, great watch!"}, {"text": "Please do commentary and also explain your approach because it&#39;s not so easy to understand how did you think that this problem can be solved this way for example how did you figure out that in last problem you should use binary search. Thanks waiting for next video 👍"}, {"text": "I think the commentary is good."}, {"text": "For sure keep adding &quot;Comments from the Future&quot;. It&#39;s very interesting, and actually very educational to follow how a pro like you thinks and solves under pressure. It was also great to see that you ran into some of the same complications as I did. (Although I have no chance to ever place as high as you did so casually. I barely made the Top 200).<br />As for it being your first leetcode contest. It seemed to me that this week, all the top placed participants had an unusually high count of still buggy submissions compared to what I have seen in previous contests."}, {"text": "Use Sn-(sum of array)"}, {"text": "You are a legend, thanks for making this great video and explaining everything so calmly."}, {"text": "The best commentary &lt;3 Loved it."}, {"text": "Maybe to get rid of scrolling you could simply open the problems on 2 monitors?"}, {"text": "thanks a lot..u are doing great job..and this format is very best.."}, {"text": "This video was really good and commentary idea from future is also good make more such videos great work"}, {"text": "wow, Errichto reacts to Errichto !! amazing"}, {"text": "Someone explain how the recurrence works in problem 3, toss strange coins. I don&#39;t understand the dp * (1-p) part"}, {"text": "Great video I like the fact that you added commentary :)<br />In first task you&#39;re computing the common difference using formula: (last - first)/n. Why does it work? Is it a known formula? How can we proof that it&#39;s correct?"}, {"text": "What&#39;s your average wpm?"}, {"text": "Commentary from the future is always welcome"}, {"text": "The best commentary.. solved all my doubt thank u sir"}, {"text": "in your first try on first problem, if difference is 0 we get a IndexOutOfBounds right? so we should just check if diff==0 before going into the loop? -Edit nvm i watched through"}, {"text": "NEED TUTORIAL FOR STL!!!!"}, {"text": "your mid (low+high+1)/ 2 could be overflow"}, {"text": "Amazing idea to bring Errichto from future to do a commentary, Love it !!!"}, {"text": "Hi errichto! I like your content a lot.  If possible, please take a class on binary search"}, {"text": "Thanks for commentary"}, {"text": "thanks man. you&#39;re doing a great job for CP community."}, {"text": "You once told that we should write mid = low + (high - low)/2; to avoid overflow. There you wrote low + high"}, {"text": "i am learning from no 2 rank holder in codejam....that&#39;s enough for me to be inspired"}, {"text": "Not to look at leaderboard till contest. &quot;A new thing I learned from you :)&quot;"}, {"text": "Very nice. This is exactly what I&#39;m looking for. This is very cool to look this video right after the contest. Hope you will create more leetcode videos=)"}, {"text": "can you make videos on tries."}, {"text": "It&#39;s funny that I also didn&#39;t need headphones while watching a recording without sound :D"}, {"text": "Awesome 🔥🔥🔥"}]