[{"text": "dimitri, the new verge. how the fuck are you not installing the OS over when u get a new mobo? 1.25 million subs yall"}, {"text": "I use the old old i7 920 unit!2.8 ghz with 16gb ram!getting the small Ryzen 5 1400 with cheap but fast gamer parts!then next year its the monster Threadripper 1950x with max ram and what not for proper 4K rendering!"}, {"text": "Combination of Pedro Pascal and Chris Pratt."}, {"text": "Issue still occurs in 2019 with 2700x. Love Ryzen But Just cant stick with Amd at this time.  BUT Ryzen render time is amazing! 3770k took almost 1.5hr to render a 8gb video while Ryzen 2700x took 34mins!!!"}, {"text": "adobe recommended different drivers for my GTX 1050Ti -&gt; I downloaded a special driver for creative work... after that everything worked so much smoother.  maybe that is helping you as well"}, {"text": "Everyone says AMD is the future of the GAME. But in reality &quot; that &quot; future is never coming. Trust me I have been using AMD Processor since last 5 years . Let&#39;s stop forcing ourself to believe that."}, {"text": "The Ryzen system required numerous updates while the Intel system apparently didn&#39;t.<br /><br /><br />Don&#39;t you think that Ryzen being much newer is still experiencing growing pains?<br /><br /><br />As Intel&#39;s offering is much more mature, it shoud benefit from being older and has already gone through the same numerous updates. And perhaps most importantly has benefited from growing pains throughout the Intel line with spillover of things learned."}, {"text": "This is an intel add in disguise"}, {"text": "Big Fan of yours! love that specs bro! dreaming that kind of machine!!!!"}, {"text": "You r looking like the guy from the groot movie"}, {"text": "Editing off of ssd or nvme drives will help u out a lot will make scrolling through the timeline easy"}, {"text": "I have a Ryzen 1600x and I edit my footage off of a nvme m.2 drive makes scrolling the footage very easy and I have a gtx 1070"}, {"text": "What pc housing it is?"}, {"text": "Yawn ....😐Zzzzz Zzzzz"}, {"text": "Yo, u that dude who played star lord in guardians of the galaxy??"}, {"text": "Alt tab performance will make the machine seem slow. That is not good. Its an issue ive always had with amd since forever."}, {"text": "Star lord&#39;s into computers nowadays"}, {"text": "This video is a misinformation that should have been deleted. No fresh os instalation after swap mobo? Really? Have u not ashamed of urself?"}, {"text": "2019 here<br />I&#39;ve been using ryzen 5 2600 since almost 1 year<br />No problem here and i&#39;m really happy about this cpu."}, {"text": "people are getting burned from AMD now"}, {"text": "after 1 Year now Intel is fail, haha"}, {"text": "AMD sucks"}, {"text": "Hi. Regarding the slow loading of images in Lightroom, have you tried building smart previews for your images? Right now I have an i7 7500u and this does not happen to me."}, {"text": "No offense...but why tell us of all your problems with the AMD system, when it was due to your own laziness in not doing the fresh OS install from the start? If I had been watching this and was trying to make a decision on AMD vs Intel I might have stopped halfway and went out and bought Intel based on the first 5 minutes of your vid. <br /><br /><br />This would be like me doing a review on a car. Oh I bought a 2019 Camaro, and here&#39;s my review. It wouldn&#39;t start up, it wouldn&#39;t go when I pushed on the gas, but my Mustang ran just fine, so I had my Mustang on stand by in case I needed it....halfway into the video: oh by the way, one thing I left out was, we pulled the motor out of the 2019 Camaro before doing the review."}, {"text": "Just upgraded to Ryzen 7 1800x and it&#39;s just too good."}, {"text": "with all the bios improvements ryzen 1st gen is still great, and even better."}, {"text": "Using Ryzen 7 2700x 3.7Ghz for audio production and it slays! My first ever PC build after moving from Apple and couldn&#39;t be happier. The Apple equivalent would have cost 4 times the price."}, {"text": "I have a ryzen 7 1800x overclocked to 4.021 ghz and my mem at 3200 hrz and runs fine with a bit of water cooling and its always been a big toss up between amd and Intel I have had a lot of pcs over the years and from what I can see the Intel have tryed to keep the tech to them selves but amd have sorted the problem out and if you want a comparison issue it just depends on what you can afford and don&#39;t forget the dearest inst the best that&#39;s all I can say on this issue"}, {"text": "My intel system crashes and gets trash frame drops sometimes as well so take that for what you will"}, {"text": "star lord?? are you??"}, {"text": "Ryzen is Bad Facke chip and cpu....rip ryzen ..intel it great gaming life but i am using ryzen"}, {"text": "Do you have a parts list ?"}, {"text": "sooo... you spent my Sub on macbook... well, I will have to take it back.<br /><br />Kidding, but don&#39;t waste subs on macbooks."}, {"text": "Long Live AMD"}, {"text": "I got ryzen 7 2700 x and its really good"}, {"text": "Starlord reviewing ryzen 7"}, {"text": "i agree, that ryzen required clean install of windows."}, {"text": "Can we partition NVME to make additional drive"}, {"text": "Mine is Ryzen 2 2200g"}, {"text": "starlord? 🤔"}, {"text": "Guys, if you do series video production and heavywork you need intel not amd.. if you love gaming go for amd. also Amd Threadripper is an excellent choice for workstation."}, {"text": "You look like Starlord"}, {"text": "Is this Chris Pratt&#39;s new channel? <br /><br />Nice vid keep up the good work"}, {"text": "why did i assumed tht hes from the guardian of galaxy"}, {"text": "Screw intel I can buy a badass ass 6core 12 threads ryzen 5 2600 which is same stats as a i7 for only $162"}, {"text": "Probs gonna run the boss Ryzen 7 2700x gtx 1660"}, {"text": "I am buying the CPU with 1700x next week, thanks for the review."}, {"text": "The latest lightroom is just crap, in general. Google the lagging issue and it&#39;s normal.  Was so bad on both my intel and amd machine that I went back to LR 5.7."}, {"text": "He looks like on of the guardens of the galaxey"}, {"text": "Ryzen is better in the light editing, if you want full power AMD stuff, get a Threadripper. Will slap Intel out of the state."}, {"text": "Walmart version Chris Pratt"}, {"text": "You need amd therad wipper"}, {"text": "&quot;Oh yeah I have a complete Intel build here just incase my Ryzen build has issues&quot;.<br /><br />I can barely afford one good pc let alone two, how do you guys do it??"}, {"text": "Tell my friend INTEL is better.... He wont understand"}, {"text": "Meh ."}, {"text": "Ryzen is not optimised for Adobe? Surely you mean the other way round lol"}, {"text": "what about now in Mar 2019"}, {"text": "Intel for no blue screens , no care about drivers update , build and run"}, {"text": "3 months is not that much time i think, there hasn&#39;t been many new things that come out that require more specs."}, {"text": "Do you recomend it for gaming and streaming on youtube aswell?"}, {"text": "you answered from <a href=\"https://www.youtube.com/watch?v=zoEvVmU5eC4&amp;t=0m00s\">0:00</a> Lmaooo"}, {"text": "you may want to go ahead and install that 3200mhz ram.... ryzen cpu performance is tied to ram speed oddly enough. You should be able to reach your target 4ghz after the ram upgrade"}, {"text": "So it&#39;s worth it right? How about Adobe After Effect in 4K sequence? Does it smooth like proxies Adobe Premiere? But how a obout your screen? Is it 4K or just Full HD?"}, {"text": "Idk why but i have very good luck with gigabits board with Ryzen"}, {"text": "Running 1700x @ 3800 for a year, with memory @ 3000 with no issues. <br /><br />everything is super stable and no issues at all (except a dead motherboard but that&#39;s not a cpu issue)"}, {"text": "<a href=\"https://www.youtube.com/watch?v=zoEvVmU5eC4&amp;t=0m01s\">0:01</a> are you Chris Pratt?"}, {"text": "I done the exact same thing, I have a 7700k build with win 10 64 bit, I built a 2700x Rig and just dropped in my Samsung 960 Evo and Toshiba OCZ RD400 NVMe and windows did the refresh thing where it sorts all the drivers out, but its not been without issues, some program that worked fine before either don&#39;t open or detect my CPU like speedfan. Some apps opened then just shut down without prompting. So looks like I need to do a complete fresh Windows install. And also ive noticed my USB ports on my case front don&#39;t all work only 1 out of 4 working, weird."}, {"text": "WOW.... bad review... so all these issues this guy was facing and he still recommends Ryzen.... hmmmm okay.... i understand he had to do a fresh install, but thats just the basics."}, {"text": "Wow! I just found out that Chris Pratt does reviews!"}, {"text": "Sounds like 3months wasn&#39;t enough for you to test the Ryzen 7 out.  It was just enough for you to fix all your fuckups."}, {"text": "should i go with r7 1700 or r5 2600 <br />i want to do gaming editing streaming <br />and gone use a b450 msi mobo <br />plzz tell me"}, {"text": "Bad audio quality"}, {"text": "I bought a pre-built rig and have been slowly upgrading it. I replaced my RX 580 with a GTX 1080 and am planning on replacing my Ryzen 5 1600 with an Intel i7-8700k. If anyone’s wondering on which processor to get. I would highly NOT recommend getting AMD for gaming. I mainly play CSGO and my AMD processor performs like trash. It does have good multi tasking capabilities but if you’re primarily gaming I would 100% go for Intel."}, {"text": "you have no clue lil man did you install the drivers intel to amd without the correct drivers you are a noob---now try amd to intel without drivers"}, {"text": "I went from a 1700x to an 8700k"}, {"text": "Unsubscribed"}, {"text": "Amazing wallpaper - Please can you share this wallpaper with me"}, {"text": "using pc benchmark intel is better UserBenchmarks: Game 113%, Desk 113%, Work 105%<br />CPU: Intel Core i7-8700 - 109.8%<br />GPU: Nvidia GTX 1070 - 121%<br />SSD: Corsair Force MP500 NVMe PCIe M.2 120GB - 161.7%<br />RAM: Corsair Vengeance LPX DDR4 3000 C15 4x4GB - 101.4%<br />MBD: Asrock Z370 Gaming K6"}, {"text": "i stopped after qork station"}, {"text": "Went from a asus with Intel to Amd and msi...man, I thought asus was bad with their software... Msi is terribad."}, {"text": "getting ready to build one now, because the price is finally in an acceptable range"}, {"text": "This intel processor is more expensive than ryzen."}, {"text": "Wasted half the time of this video cos you did not format your drive for a clean install as you have a new cpu! C&#39;mon man, that is quite basic!"}, {"text": "I see your coffee mug says &quot;Toronto&quot; on it? I was born and raised there! &lt;3<br />Used to live in Both Scarborough and Mississauga. Lawrence and Galloway was my neighborhood at one time. <br /><br />I would be interested in hearing how you got to Canada, I say this because you do not sound Canadian LOL."}, {"text": "You&#39;re also leaving out that the ryzen CPU does all of this at a significantly lower cost than an Intel processor"}, {"text": "Question <br />If i was to get a r3 1200 right now from a fx6300 and do a clean install then upgrafe to a r5 2600 later down the line would i need to do a clean install for the upgrade? Obviously i would need to get a mobo and ram."}, {"text": "2019 here<br /><br />Been using Ryzen 5 2600x for about 4 months, really happy with the performance i got for the price i spent"}, {"text": "I’m confused between i5 8600k 6c/6t vs the i7 8700 6c/6t (non K version). If I get the 8600k, I’ll try to overclock it to 5ghz. I’m someone who does a lot of video editing and gaming and I’m going w/ the GTX 1660Ti graphics card. So the main question is that is it worth putting few dollars more for the i7 8700 (non K) or just go w/ the i5 8600k and OC it to 5ghz.<br />Not sure about AMD Ryzen’s cause I’ve heard that they have heating issues (don’t know if AMD have solved the problem) and also they wear out after 7-8 months.<br />Inputs are appreciated. :)"}, {"text": "Just replaced my 3770k with a 2700x. Completely happy with it. I need the extra cores more than single core performance"}, {"text": "Matt Damon?"}, {"text": "What kind of amateur are you to not do a clean install 😂"}, {"text": "Would you say getting the R7-2700x be an upgrade to an i7-7700k?"}, {"text": "this was a great video, super helpful."}, {"text": "Question, 8 cores? Why would you not go with the Ryzen 5 2600X? The 6 core 4.1 clocking is stable. Motherboard is Crosshair vi"}, {"text": "I have a ryzen 7 1700 and have it a 4.0<br />Ram at 3400 I&#39;ve only had the PC running like this for about a week but have had almost no problems (except when I wanted to go farther with ram and system wouldn&#39;t post lol)"}, {"text": "How has your air cooling system been doing?  I want to overclock for the first time bu I can&#39;t decide whether to use air or liquid cooling."}, {"text": "I clean install every six months regardless. Keeps the bloat to an absolute minimum."}, {"text": "His hair was different at the 1 minute mark than just a few seconds later, mirrored video or he changed his hair!"}, {"text": "Sounds like BS."}, {"text": "I want to do video editing, I do not have any graphics card, What processor will be good for me. Please reply me\r<br />\r<br />1. AMD Ryzen 5 2400G Processor with Radeon RX Vega 11 Graphics\r<br />2. AMD Ryzen 5 2600 Processor \r<br />3. Intel core i5 8400\r<br />4. Around This Budget any other procesoor\r<br />\r<br />N. (RENDER FAST)"}, {"text": "Ryzen is the best i have ever experinced. lol .  sad the motherboards for gen 1 were unreliable but that&#39;s been fixed"}, {"text": "A 1700x ? c mon! go 2700x or go home"}, {"text": "But, what about Intel Hardware acceleration?"}, {"text": "hello, quick question im in the market for a single screen but &quot;multi monitor&quot; setup and noticed your LG monitor and your multi tasking what model of the LG monitor do you use?"}, {"text": "please ¬¬)  will you consider each second in the life you save doing something instead other thing?  how many time do you waste in bathroom, ?  don&#39;t you watch any TV show ? don&#39;t you waste time watching NY Knicks or Miami Dolphins?  iF you take the list of how many minutes in your life are a waste of life, you will cry. one example is this comment by me:  <b>I could invest the 10 minutes of this video in 10 minutes studyng french, instead watch 10 minutes of a random unknown man and his computer and his life why should I be interested in his PC and his Ryzen 7?</b>"}, {"text": "This Chris Pratt never disappoints."}, {"text": "The one and only positive thing about longer render times, is that forces you to take a break. Editing is like painting a canvas, its important to stop, drop the brush and take a step back sometimes, or just walk out of the room entirely. All my best ideas come to me when I take break, go outside, make some coffee, do something else. With that said, yes, Intel is going to be a better co-worker for you in the end.<br /><br />Edit: Im not down talking AMD, I use a 2700 at home and I have no issues with it. However at work, I use Intel and the only difference is speed. But its not a huge difference, but its noticable."}, {"text": "Do i really need to switch to ryzen?  I face hard time with intel."}, {"text": "Why would you NOT reinstall Windows if you change from Intel-&gt;AMD? It is just asking for trouble."}, {"text": "Loving my 2700x"}, {"text": "I barely got stable 60 fps in minecraft :( do u guys know why?"}, {"text": "you may want to consider installing linux, you&#39;ll never have to search for a driver again, they&#39;re all pre tested unlike the microsoft ones that get released and break your hardware."}, {"text": "Okay. So on a totally unrelated topic. I know this video is well over a year old but at that time CS go was still in old game. I never really got into it because the graphics are trash. The animations are choppy and horrible. And not to mention what is up with the hip fire. Being is that I&#39;ve never played this game I&#39;ve only judged by YouTube videos in content that I&#39;ve seen elsewhere. Can you aim down sight? Or not? Because if you can&#39;t aim down sight in this game why do people still play this crap. LIG. LET IT GO."}, {"text": "ryzen is great, I,m getting incredible performance (and value) since I went with a refurbished in a tight budget but also I could get great graphics since not many 13&quot; have good graphics. but there is bugs here and there, when i lunch a heavy program with music playback, the music gets buggy for a few seconds and the wifi chip sometimes need restarting. but all and all very pleasesd"}, {"text": "Looks like the actor for star lord wait a minute..."}, {"text": "Not only does he look like chris pratt, he knoes it.  Spending 5mins bashing a chip THEN saying it was all because you didnt do a clean install is absolutely shocking!  Respect lost.  Did you not want to loose the footage already made??"}, {"text": "i&#39;m really excited to have a rizen, <br />but to be honest i&#39;m a little concern about that lightroom problem.<br />since i&#39;m a photographer, that could be a major issue."}, {"text": "True, bought a ryzen 2700x because of all the hype and kinda regretting it. Getting low FPS on 1440p when streaming/recording while playing. :( Not to mention my system completely freezing when slightly OCd or rendering, Fans still running,  sigh."}, {"text": "what is this monitor name ?<br />how much [ ]&#39; ?"}, {"text": "just get intel...."}, {"text": "I have devils canyon i5 and 1060 gpu I have had this computer for years. I ordered new case yesterday, I plan to build complete AMD machine, the price point isn&#39;t worth it for intel and nvidia.  I debated this tonight with my wife she is pro intel and nvidia. Sure intel and nvidia can get better FPS but unless you&#39;re dropping thousands on a intel/nvidia setup you&#39;re not going to be hands down better than curret AMD based systems.  Ryzen imo is best CPU on the market for the price point, it can&#39;t be beat.  I don&#39;t need 200FPS+ its meaningless overall in games. The game is going to run stable at 60fps as it would at 200fps+. I am going to shoot and kill you the same at 65FPS &quot;lag free&quot; while you&#39;re getting 500FPS. As long as the machine completes my daily tasks and allows me to play games smoothly its all that is required or needed. Everything else is ego stroking imo and in grand scheme that doesn&#39;t matter."}, {"text": "I got my 1700x at 4 ghz solid."}, {"text": "The issues you saw were all software related ones."}, {"text": "Try it again with the 2700x"}, {"text": "if you was just upgrading your cpu, ram, gpu or psu then you wouldn&#39;t need a fresh OS install since the OS updates by itself but if you changed your motherboard you would then need a fresh install if you change your platform or not"}, {"text": "Dude you didn&#39;t clean install Windows before the test. This test isn&#39;t credible."}, {"text": "I Really like you do the effort to find out what causing the issues. Good video."}, {"text": "never owned intel or nvidia and never will AMD all the way"}, {"text": "Is there Anything like &quot; ryzen motherboard &quot;. This guy is blaming processor for board he had"}, {"text": "i&#39;m running a AMD  Beast 2700x  who else is tell me your experience"}, {"text": "where did u get that plant"}, {"text": "I want your alien wallpaper"}, {"text": "Building my pc now. Intel i7 8700 or ryzen2700x??? Mostly gaming btw"}, {"text": "my 8 year old phenom x6 1090t running @ 3,9 ghz lol"}, {"text": "i downloaded adblock to avoid these annoying ads. Now I have to listen to more ads from content creators about their sponsors? smh"}, {"text": "I don&#39;t know when people decided it was ok to toss their OS drive in any computer but, I&#39;ve been seeing it more and more lately.  Kinda lazy considering a fresh install only takes a few minutes.  Do a fresh install and avoid issues like this if you change your motherboard, let alone an entire platform.  I actually thought this was common sense."}, {"text": "Should have restarted your 3 month test once you did the clean install man. That just makes the first half of the video unless."}, {"text": "So what if you dont hit 240 frames lol. After 60 frames the human eye can&#39;t view the difference lol.<br />My point is that you dont bloody need 300 frames to play csgo"}, {"text": "I don&#39;t know about others, but I prefer 1080p60 than 4k30"}, {"text": "I&#39;m so happy to find out in the comments section that you are the one with mistakes instead of AMD. How the hell do you just restore and not do a clean install of things? Holy shit thats pretty sick for a benchmark! Like are you serious? LOL<br /><br />Anyways, I liked th video aside your issues, this &quot;lets see how it went weeks later&quot; should be a thing."}, {"text": "amd hardware still sucks, no surprise here."}, {"text": "This video is over a year old and it sounds like it was worth it to wait a little bit longer. I now have a 2600X and haven&#39;t had any issues with memory, slowdowns, crashes, or performance. I have the CPU locked to 4.0 ghz, and spent a little more on fancy Flare X 3200 CL14 RAM.  Using the Ryzen DRAM calculator I entered all the appropriate timings and subtimings and it works perfectly at the advertised 3200mhz/cl14 speeds.   It doesn&#39;t have the frequency advantage of an overclocked Coffee Lake CPU but for my use it&#39;s an amazing system.  Even for emulation, I can run fancy CRT shaders and 2x or 4x internal resolution and even though it&#39;s nearly maxing out a single core, that single core cranks out full speed.<br /><br />AMD has had a lot of issues that needed to be smoothed out, but now the platform seems mostly mature and we can expect that the Zen 2/3xxx series will be even better.  My hope is that those CPUs will be overclockable to 5ghz but we will see."}, {"text": "In 2011 i Upgrade my PC to 2600k Because of Battlefield 3 (With No issues Until December 2017) and i have Only Upgrade to My 8700K December 2017, With no Issues 1 Year Later.... So what i mean is.... Intel Forever...!"}, {"text": "apparently ryzen makes mother boards."}, {"text": "honestly dont agree at all. i have a 2600 and use Lightroom without hiccups, and i EASILY play games and stream on it at 144hz while streaming at 1080@60 on good settings. you didnt give it a good enough chance"}, {"text": "AMD Ryzen 5 2600x is better than Ryzen 7 1700x in gaming imo"}, {"text": "Is that Chris Pratt?  Lol ik it&#39;s not but you kinda look like him"}, {"text": "Are you now able to play 2k,4k 144hz gaming with no tearing, frame drop?"}, {"text": "How about now, since it is 2018?"}, {"text": "You use programs that way above my head.  Lol<br />I am just a gamer."}, {"text": "I honestly am laughing at the issues that you mentioned about before an entire reformat. Any hardware swap with CPU and even graphics card. Especially with motherboard.  Anything like that you always reformat. Old drivers automatically clash with new and systems teams to integrate with what is initially installed. Kinda common sense in the computer world. First line how if you dial boot any HDD of any type you lose speed"}, {"text": "Lol the fact that he said he couldn&#39;t get 240fps on low made me wonder because the fx 8350 with a 1050ti gets 240 on low easily"}, {"text": "What is your monitor model?"}, {"text": "i Am also Using Ryzen and It is Worth to Change It..<br />Hope to see ya"}, {"text": "hahaha, man, you didn&#39;t do a clean install!?!?"}, {"text": "AMD guys refuse to accept anything other than it&#39;s perfect!"}, {"text": "Are you Russian?"}, {"text": "any idea how much of this is valid for the 2700x?"}, {"text": "3mos is good enough."}, {"text": "Can anyone help me and tell me can i overclock my 1700 but i don&#39;t hv liquid cooler"}, {"text": "I still like Intel better. Very smooth and fast."}, {"text": "Lol.. he is hyped for his 8C - 16T.. <br />Wait a few months until Ryzen 3900x which is 16C- 32T  And we will see how Editors will be shitting on Intel for being &quot;a Bottleneck&quot; xD"}, {"text": "It&#39;s first video of your channel and I didn&#39;t like it. It will be the last.<br />No fresh install. No updates. And you blame amd?<br />You can afford for intel processing. However we can&#39;t and expensive become greedy.<br />So If we don&#39;t support amd this time we might face worst in future and also we get nice Cpu work for everything mid range not highend for you."}, {"text": "really detailed review!"}, {"text": "Its even worse than just some hardware not being tested with AMD. There is hardware marked as incompatible with AMD by the vendor. So you need to know what&#39;s actually compatible."}, {"text": "BIOS hassle=downfall, of the little engine that could!"}, {"text": "Then why don&#39;t you use your f*<b>***</b> until machine if it&#39;s so much quicker, oh you did the whole video is talk about how quick Intel is"}, {"text": "Make video about 1year usage of AMD and  Intel I hope this will useful ..."}, {"text": "Dmitri should work for the Verge. He has about the same non ability when it comes to building PC&#39;s."}, {"text": "I swear we have the exact same aesthetic preferences. Everytime I watch one of your videos (which isn&#39;t super common cuz I don&#39;t watch PC content) you have a new case, and it&#39;s always my new favorite case. Don&#39;t know if I&#39;m just a basic bitch or we are twins but..."}, {"text": "What case is that?"}, {"text": "So does cs go get high fps after reinstallation"}, {"text": "I OC my 1700 to just 3.4 and with a 1060 6G It runs 1080 games great."}, {"text": "I&#39;d be curious to see you do this again, now over a year later, just to see if all the problems have been solved between updates to first gen and new features of second gen."}, {"text": "I was disappointed at first because I was looking to make the switch to AMD and it sounded like you had alot of issues.....  <br /><br />Then you said you didnt do a clean install of windows when changing the processor......<br /><br />I mean... lol.  thats common sense type stuff right there."}, {"text": "мой любимый корпус"}, {"text": "Lol computer language is so tough..drive frame rate gigabyte processor blabla,i am watching it like blank face..wat r these things 🤣"}, {"text": "Blaming AMD for your woes only to share later you did not do a fresh install of the OS? You forgot?"}, {"text": "Great video.<br />Thanks for the information. What case and fans is that @ the <a href=\"https://www.youtube.com/watch?v=zoEvVmU5eC4&amp;t=2m56s\">2:56</a> marker...?<br />Thanks"}, {"text": "picture loading isnt an issue for me in lightroom, its the loading of the actual lightroom UI"}, {"text": "Am a bit late to the party here but going to jump on the AMD wagon. Adobe anything isn&#39;t optimized for any Ryzen CPU&#39;s. That or Adobe will drag the CPU. <br />Ryzen 2600<br />RX580 8GB<br />32GB<br />1TB SSD<br />2TB Hard drive<br />500GB M.2<br />Don&#39;t have a single problem."}, {"text": "&gt;doesn&#39;t get a clean install.<br />&gt;blames amd <br />&gt;has 1m subscribers<br />&gt;uses premier"}, {"text": "Cool video, excellent work, thank you!<br />I think that LR is optimized for NO CPU in the whole Universe!!! Try CaptureOne, instead.<br />Also, I&#39;d be very interested in seeing the performance of your rendering benchmark for the new Intel i9-9900K.<br />Keep up the good job!"}, {"text": "where is a link for the rgb fan shrouds...toss me a bone anyone?  (yes, I know what google IS, want to buy through a referral link to support the channel ;-)"}, {"text": "lightroom is no problem at all on my 2700x. I believe most of these problems have been fixed with the new generation. can&#39;t say for premiere because I use DaVinci resolve but apart from that i didn&#39;t have any of these problems."}, {"text": "That was actually a nice advertisement !!!"}, {"text": "I’m new to all this stuff. What does everybody mean when they say ‘clean instal’?"}, {"text": "That may have been the single most fair and balanced review in the history of reviews."}, {"text": "Allright youv emade me click the sponsor link because the sponsor is just that good"}, {"text": "What monitor is that?"}, {"text": "what size is your monitor. its huge!"}, {"text": "nigga looks like chris prat"}, {"text": "More than likely your imaging software is probably single threaded. Which would explain why your Intel box is faster than ryzen"}, {"text": "Great review :)"}, {"text": "Jump to <a href=\"https://www.youtube.com/watch?v=zoEvVmU5eC4&amp;t=4m51s\">4:51</a>, rest is useless"}, {"text": "Dude what is that case tho??"}, {"text": "haha that shit about cs go, i experience it quite often on my intel machine. biased much? this pretty much happens on every machine because cs go is optimized to run on potato computers. so yea, no. sad"}, {"text": "<a href=\"https://www.youtube.com/watch?v=zoEvVmU5eC4&amp;t=7m18s\">7:18</a> also my clock is set at 3.68Ghz. (ASRock X370 Gaming X) What&#39;s your voltage please?"}, {"text": "My cryorig cooler is connected just like that. I tried for an entire hour to fit it vertically as is the norm but something about the bracket wouldn&#39;t let me. Is that ok? <a href=\"https://www.youtube.com/watch?v=zoEvVmU5eC4&amp;t=7m12s\">7:12</a>"}, {"text": "Updates are good. Updates are efficient!"}, {"text": "For workloads Ryzen is great, But if you want strictly gaming, you gotta go Intel. 😉"}, {"text": "Since I&#39;ve switched to a ryzen 2600x a week ago its been way worth it from 6400 intel. Way way way better and I got a good overclock on my I5. Just runs better with the ddr4 also. I&#39;m really stoked since I&#39;ve gotten it."}, {"text": "i love your monitor bro"}, {"text": "The heatsink looks like a r6 siege dron"}, {"text": "So as a photographer that uses LR mainly, you don&#39;t recommend the Ryzen 7 ?"}, {"text": "I want a graphic card for my PC... And I think I can&#39;t buy any cause I don&#39;t have money..."}, {"text": "Why would anyone even consider putting a pre-installed drive in a new build!?! Sure you can get away with it nowadays as Windows 10 is so accomadating but STILL. . All your files and programs should be on an accompanying hard drive so an SSD reinstall is super-painless."}, {"text": "This is what when you upload new video every 2 minutes"}, {"text": "chris pratt long lost brother"}, {"text": "Intel still the best!!!"}, {"text": "You will not hear this information on the AMD fanboys reviews..."}, {"text": "Could you test this difference with Black magic&#39;s Davinci Resolve?<br />That NLE is wonderful with colors..."}, {"text": "You look like a white Indian Guy!"}, {"text": "How can you switch hardware &amp; not format the system!? Straight away... Come on dude..."}, {"text": "i know i&#39;m not the first one to notice that you look like ........ u know what i mean"}, {"text": "my ryzen 5 with a gtx 1050ti runs csgo maxed out over 144fps??"}, {"text": "with the new i9 ,ryzen is way back!"}, {"text": "conclusion from this vdio..RYZEN is multitasking?.."}, {"text": "A lot of issues in this video have not 1 single thing to do with Ryzen... they are motherboard issues... I keep hearing this term &quot;Ryzen motherboard&quot; there is no such thing as a Ryzen motherboard"}, {"text": "So how does it compare now with the second generation Ryzen and thread ripper  available?"}, {"text": "You bought the 7 1700x and you have your own dedicated graphics card ? You are basically paying extra for the x that you are not using, thats alot of money for a letter"}, {"text": "&quot;new bios giving better stability&quot; typical of a new platform, early adopters get all the bugs which get resolved over time.<br />Then again I&#39;m using a Ryzen 5 1600X on Linux Mint 19 and it works flawlessly with good stability."}, {"text": "What case is this @ <a href=\"https://www.youtube.com/watch?v=zoEvVmU5eC4&amp;t=2m51s\">2:51</a>?"}, {"text": "What is your motherboard btw?"}, {"text": "Got to reinstall that OS when changing comps. I learnt that one the hard way too."}, {"text": "What did you switch from?"}, {"text": "Switched from amd fx6300 to i5 8400 and never looking back.Couldnt find a ryzen 5 system that was budget for gaming."}, {"text": "i will build a pc in the comming days and it will be a ryzen.<br />i know that i can get similar performance for not much more money with intel systems but....<br />do you know why you can buy a i7 8700k for 300 dollar?<br />why intel finaly starts to do more than 4 core cpus?<br />competition!<br />amd ryzen force them to lower price and enforce innovation.<br />so i will build a amd system to  help amd to survive because for pc enthusiasts, amd s survival is one of the most important things you can imagine"}, {"text": "I&#39;m interested in to know if Ryzen CPUs are friendly for virtualization?  If the option is hidden, besides enable virtualization for the motherboard, any special instruction to use this chip?  Thanks."}, {"text": "What monitor are you using? And will it be good for photo editing?"}, {"text": "What keyboard is he using??"}, {"text": "Sponsored by Ryzen!"}, {"text": "I got an OEM HP about 7 years ago with an AMD a6 and it&#39;s still running very well."}, {"text": "Thanks for your review, it actually helps!"}, {"text": "2700x tho 😎"}, {"text": "Go AMD, he admitted that its user error (no surprise) and he&#39;s rendering in 4k? C&#39;mon son, even Intel stutters. A bit of confirmation bias, but the numbers don&#39;t lie, Ryzen takes it."}, {"text": "I&#39;d start off with the positives first next time.... AMD is putting Intel to shame to this day and should be recognized for it. Every techtuber I watch has some negative undertone when covering AMD and its ridiculous."}, {"text": "so ryzen is better for multitasking where intel is good for one thing at a time or small amount of small programs. i have ryzen 1700  and im doing fine, i create things in 3 (usually with unreal engine 4, blender) and hardly am doing anything like gaming or anything that only needs one thing running at a time"}, {"text": "On many games the performance is comparable although there are some that are in favor of Intel too (I mean most are, but still not THAT BIG).<br />I&#39;m a person that likes to switch a lot between games and programms without closing them, so Ryzen should be better for me + I don&#39;t care about the performance that is lost due to it much since my monitor is a 144Hz anyways.<br /><br />I just hope that my Gtx980 won&#39;t bottleneck a Ryzen 7 (it shouldn&#39;t but there&#39;s always a small posibility of it happening since the standard has gotten to the Gtx 1050 and above Gpus.<br /><br />A Ryzen 7 should technicall be better for streaming too because of its multitasking but don&#39;t quote me on that one, it&#39;s just what I&#39;m guessing.<br /><br />And I always liked to get the products from companies that I already trust so Amd is on the list (I also have a gen 7 i5 but I experienced some small input lagg that I don&#39;t like on it in comparison to an Fx 8320 which had none) + I kind of like supporting competition too which means supporting Amd is what I want atm.<br /><br />All in all it just depends on what you prefer as a gamer because if you have no plans of doing any work like editing or just basic multitasking with some more demanding programms then the i7 should be better for you (it can squash some more juice out of your pc than the Ryzen).<br /><br />The Ryzen 7 should be better for more multitasking people and people that just do more work with their pcs but I don&#39;t know why Amd products always seemed more unstable in comparison to Intels (maybe just my thoughts, haven&#39;t tested that many Intel products yet anyways)."}, {"text": "always do this a clean install makes the difference but remember to back up your old files for easy transference"}, {"text": "So the way you do your video is to shit on AMD and kiss Intel&#39;s ass and then after a while tell us that you&#39;ve done something wrong and that AMD actually runs fine? This video is so confusing lol"}, {"text": "WTF, I get 300+ FPS on a ryzen 5 1500X + GTX 1060 6GB?"}, {"text": "what do you recommend Ryzen 5-7 or i5 i7 8th generation both with 1080ti, my monitor will be 144Hz G-Sync , mostly for gaming, I can&#39;t find good reviews to decide"}, {"text": "great video!!! :)"}, {"text": "Which is better? Ryzen 5 or ryzen 7?"}, {"text": "so good fps and no stuttering after fresh os install?<br />wanna buy a ryzen but dont want fps drops or stuttering when using a 1080 (:"}, {"text": "I believe the issue with high frame rates is resolved in Ryzen Gen 2. Or so I saw/read, sorry cant find the link"}, {"text": "a lot of the issues you are having with certain programs is because they are not optimized for AMD... MANY programmers, game developers etc have come out and said that they had not been focused on optimization for AMD but WILL"}, {"text": "Can you tell which cpu should i buy for 4k video editing &amp; 3d animation ......Intel i5 8th generation or AMD Rayzen 5"}, {"text": "You should have had two totally separate installs on both PCs opposed to swapping the boot drive."}, {"text": "I have been running Ryzen 1700x at 4.1 Ghz using the default ASUS ROG mobo overclock software that comes default."}, {"text": "TOO LONG DIDNT WATCH? was it worth it or not?"}, {"text": "Great vid can’t wait to get my 2700x build ;)"}, {"text": "Can anyone tell me which case that is?"}, {"text": "I have a kabylake rig and ryzen 2 rig. First thing I noticed was the extra heat from the ryzen. General performance was fine, but when I did audio production, the ryzen was a bit slower than the kabylake. Your random crashes are probably gpu related and not cpu. As far as gaming, haven&#39;t noticed anything that is significantly different. Also it&#39;s important to note that ryzen&#39;s physical architecture is much closer to haswell than it is anything intel 6+ gen. In summary, it&#39;s good enough that I wouldn&#39;t care which cpu I had, but I would definitely  prefer nvidia gpu over amd radeon gpu, because the crimson/adrenaline drivers are just a bloody mess still. When we first went from catalyst to crimson, I had consistent crashes for a long time, ouch."}, {"text": "European Chris Pratt?"}, {"text": "He should upgrade to threadripper long time ago.  But good job and r yzen."}, {"text": "HardwareCanucks when you mentioned using an external drive and having issues with Ryzen versus Intel because other product makers don&#39;t optimize their products for AMD, should have been mentioned.  That&#39;s not AMD&#39;s fault.  Most of the world thinks Intel is the only CPU maker in existence."}, {"text": "I&#39;ve noticed that YouTube reviewers talk about rendering times for videos more than anything else. <br />Y&#39;all know that probably 98% of people or more have never edited or created a video, right? <br /><br />I&#39;m a researcher, so I&#39;ve had to cut videos from interviews at work, but I&#39;m not trained, and I have to use my company provided computer."}, {"text": "Ur Ram freq is too low to hit the 4,1 u need at least 3000 mhz on ram to go 4 ghz + , that&#39;s ur problem. Cheers."}, {"text": "so you tell me the first half of the video is you bragging about a mistake YOU did?! a clean install is the first thing that one should think of when changing the mainboard to another chipset / socket...<br /><br />this is not AMDs fault in any view..."}, {"text": "what&#39;s the point of the first half of the video if the issue was just user error?<br /><br /><br /><br /><br /><br />nvm just saw the video was slightly over 10 minutes long"}, {"text": "Wouldn&#39;t increasing the bitrate make it LESS cpu-intensive?"}, {"text": "No anti-static precautions when handling components? Tell me now, &quot;Is it safe?&quot; (With apologies to Marathon Man.)"}, {"text": "“chris patt “ in da house😁😁"}, {"text": "Hay man, nice video! may I ask: which Nvidia driver works better with Adobe Premiere?"}, {"text": "And about optimization, isn&#39;t it software developer&#39;s job to optimize their software to hardware it could be used on? Stop trying to make it look like it&#39;s AMD&#39;s fault that Adobe does not want to optimize their software..."}, {"text": "Starlord?"}, {"text": "dobra Dimi tell me what this lg monitor is what kind of model ?"}, {"text": "Seems that the softwares require a refresh for amd and possible instruction sets"}, {"text": "I think you&#39;d have experienced the same (or similar) setbacks if switching from AMD to Intel. I think it has to do with API files and how they&#39;re configured differently for each processor so I think a complete OS wide will be needed in both cases. (I think)"}, {"text": "Issues with the external storage sounds like a motherboard issue and not a CPU one."}, {"text": "Im re-watching this video and Im currently running a athlon x4 950, I&#39;ve found with more bios updates everything has generally gotten slightly faster and more stable, Im actually running almost stock voltage and I&#39;ve OC&#39;d the cpu to 4.0ghz (4.2+ voltage was far too high in reality vs what the bios said and I wasnt comfortable with it)"}, {"text": "Pc giveaway on my channel !!"}, {"text": "Summary - He installed the Ryzen without doing a clean windows installation and experienced a bunch of problems. After doing a clean windows installation and updating all the Ryzen drives, the problem he experienced before are fixed."}, {"text": "If you support AMD, Intel will lower it processor price. intel just expensive. AMD is the future."}, {"text": "Any updates but using the 2700x instead?"}, {"text": "Which graphic cards on both?"}, {"text": "as for the inconsistencies with sata and usb you&#39;ve experienced, it&#39;s just the motherboard you chose, the msi x470 and x370 i am using does not have problems like that. my only gripe is my 2700x occasionally hops up to 5.3ghz on hardware monitor on all 8 cores for a few minutes at a time. not too sure why thats going on."}, {"text": "could not get 240fps in csgo with a 1700x? i was able to easily get that stable with a OC 1600 i used running 4.8ghz clocks with a 1070 in 4K at max settings. i&#39;ve since swapped to the 2700x, it&#39;s definitly a step above the 1700x in multi core performance. you&#39;d be able to install the firmware on your mother board and just swap the cpu as well if you wanted to try it."}, {"text": "My first PC build... Kind of got on the hype train and got a 1700x system, and it&#39;s way more than what I need. Still fun and reminds me of an Athlon Xp system that someone called Rhys (lol) gave me years ago. Can see why people spend 2-3k on a PC now..."}, {"text": "i had a 955 amd black edition... i switched to a amd ryzen 1700x... totally worth it... i use linux and i edit a lot of photos and the combination of multithreaded photo editing software with ryzen is just amazing..."}, {"text": "good stuff very clear video"}, {"text": "what is that video editor?"}, {"text": "3D.."}, {"text": "Review is obsolete."}, {"text": "AMD addressed their shortfalls and they deserve the rewards. Good to see consumers supporting."}, {"text": "Good video, informative. So looks like my no-go for AMD is confirmed. Unexpected crashes. Clearing CMOS to make it work again etc. Still I am the opinion, that AMD is good for gamers, but not for productivity. I had this opinion eversince and I am not going to change that any time soon, although I would really like to see that AMD platform is so stable as Intel Platfrom, <br /> I really do."}, {"text": "I can&#39;t find this exact RAID Enclosure storage!"}, {"text": "I just built a computer with a Ryzen 2600x and the SAME Fractal Design Meshify Case but in White TODAY. and this pops up on my recommended. Google what are you watching me with?"}, {"text": "&gt;not doing a clean install on a different CPU the first time. I&#39;m glad you learned."}, {"text": "There is something wrong with your system if you cant get 300+ fps in csgo , Im running an R7 1700 and a 980ti and im getting 300-350 consistently."}, {"text": "So AMD sucks, got it."}, {"text": "Honestly, I just don&#39;t get how the saved 40 hours a year are worth getting an expensive PC - let alone switching to a platform that has compatibility issues with software or hardware one already got used to.<br /><br />What&#39;s the point of running heavy processes in the background, when one is doing so little of it? Is this PC used by more people and is occupied 24/7? :-)<br /><br />It&#39;s a fine processor, but the argument is rubbish. That said, it&#39;s not the worst I&#39;ve seen.<br />Gaming forums are full of people moving to Zen or Intel HEDT, because they got impressed by compression times..."}, {"text": "whats the name of your case ?"}, {"text": "I think about buying r5 2600 or zen 2 for gaming and rendering"}, {"text": "The Ryzen 7 is very new so an updated BIOS and chipset drivers are important.  The drivers on the install CD are almost always flaky."}, {"text": "Man u would make a greeeeeeat actor.U should apply to hollywood for a movie best role."}, {"text": "What? Ryzen 1700x and a 1080 couldn&#39;t run CSGO at 240 fps? A 1050 Ti w/ a pentium can run it a 120+"}, {"text": "You don&#39;t know what you&#39;re talking about, so stop talking."}, {"text": "Why do i keep thinking every time his video shows up i remember chris pratt surely im not the only one who thinks he looks like chria pratt"}, {"text": "dude, clean install of os is required almost every damn time when u switch hardware in ur system (storage excluded)....logics ?"}, {"text": "Mever had a problem with ryzen and adobe. You are using wrong drivers or something else is causing problems."}, {"text": "ive had the ryzen 7 , for awhile and damn im happy"}, {"text": "No it was not"}, {"text": "I know this is old, swap you MB with a better X370 board or ditch ASUS. I am a fan of Gigabyte and MSI. The latest bios as of this post I was able to hole a 3.7GHz at 1.3v and 3200MHz at 3000MHz. this is the first time I was able to get memory and cpu oc to hold after reboot and cold start."}, {"text": "I am groot ?"}, {"text": "<b>FUCK RYZEN</b>"}, {"text": "well i never own amd or ever get chance to use it...i am always like i have to go there then have to go there, so i bought rog laptop gl 552 for gaming(had no choice..bummer..its like gaming is my on time food, cant live without gaming) ..so right now i am using intel on my rog, i was feeling like intel limitized the capabilities of any extreme thing which want to perform more but intel tell them to not to overpower performance....i will def try to get gaming cabinet and use amd ryzen for sure,, gives me feeling that it will do much better than intel..also i heard a lot that intel heats up a lot. Overall Video was great and helpful ..<br /> Thanks mate for the tut...Happy Hunting"}, {"text": "Give me a system that just works in production....<br /><br /><br /><br /><br /><br />Mac: Hello again"}, {"text": "CHRIS PRATT"}, {"text": "what do you edit on"}, {"text": "YES OR NO?"}, {"text": "Funny, i can also confirm almost all the things you have been saying.  Except for the Adobe ones, since I don&#39;t use it.  But similar experience from the AMD Ryzen platform.  i would be interested in your experience with a  AMD GPU also, over the Nvidia. In what going all Red would offer, over the Nvidia Card.   I have far less issues with an AMD Video Card then I did with a Gforce card.   So I would be very curious as to what impact that would have on your  ADobe performance issues with Ryzen."}, {"text": "Intel still wins and AMD knows it"}, {"text": "LOLz.  Some of these fanboy comments are just as bad as sony and Microsoft fanboys."}, {"text": "But what if you were on an 8700k?"}, {"text": "What jacket are you wearing"}, {"text": "what monitor?"}, {"text": "Could u plz tell me if its performances with 3d software like max, maya, Zbrush"}, {"text": "Windows??  Well that&#39;s your problem right there!"}, {"text": "Getting a ryzen 1600 soon yay"}, {"text": "It&#39;s nice to see what appears to be an unbiased review from somebody, since most people (at least to an extent) are Intel or AMD or Mac fans and just enjoy bashing whatever the opposition puts out.  Its refreshing to know that you use all three without prejudice. <br /><br />I&#39;m personally admittedly kind of an AMD fanboy -- I kind of think of it as a &quot;bang for your buck&quot; thing where Intel=Viper and AMD=Corvette.  Sure you get a bit more performance, but is it enough to justify 2-4 times the price?  To some people it might be, I just don&#39;t think it is for me."}, {"text": "oh boy just tweak it in proper way,<br />it\\s better $/perf"}, {"text": "what an accent comrad"}, {"text": "which pc case is he using? thx"}, {"text": "Hi I Want  Photo shop  CC 2018 supported pc"}, {"text": "im Having an AMD A10 but it crashes some time when Im running Autocad...A computer Salesman said AMD cannot handle too much HEAT unlike INTEL.... what do u think about it?"}, {"text": "Fak Adobe"}, {"text": "1600x at 3.85, 16gb 3200mhz, and Vega GPU. It doesn&#39;t game like Coffee Lake. Doesn&#39;t multitask like Threadripper. But it&#39;s damn good at everything."}, {"text": "I was gonna get a Ryzen 5 2600x but now am really confused :("}, {"text": "hey dude, you looks like chris pratt lol"}, {"text": "What case were you using for the AMD build?"}, {"text": "When did Star Lords brother start building PCs?"}, {"text": "If Intel beat anything close to an hour, or half hour, i would say it would be worth an Intel. But by a few sec or mins lol"}, {"text": "can you do a editing in premier tutorial series? I think it would be super cool with the quality of your videos, and would help the new youtubers."}, {"text": "Wait.... What did you do to fix the light room performance issues"}, {"text": "Is it that bad in Lightroom? I am planning to upgrade to ryzen but I use it all the time along with Premiere..."}, {"text": "what type of LG monitor is that?"}, {"text": "Im on a ryzen 5 1600 and i stream off of it no problema"}, {"text": "WHY EVERYONE SAYS AMD IS BETTER? AMD SUCKS!"}, {"text": "whats the name of that case ?"}, {"text": "I&#39;ve never understood the whole proxy thing with premier.  I edit with Vegas 14 and now 15 and my editing is smooth in 4k without proxy bs.  I&#39;m on a rzyen 1700 @3.9ghz and only 16g of ram."}, {"text": "Ryzen 7 series are still very expensive here in our suck country!"}, {"text": "God sake Dmitry... Even swapping an intel cpu on the same platform causes instability on the system how the F did you expect your Intel based OS installation work properly?"}, {"text": "2600x or 2700x gaming and multitasking? (while gaming) (not streaming or editing/mining in meanwhile tho)"}, {"text": "To give a review on a processor as a whole is dumb. There is so many variable that will determine the performance of this chip. Ram, Motherboard, video card, the hz of the ram, and so on. You need to be giving this review with context to the rest of your setup. If you under power this chip and run it with a shitty video card and ram it won&#39;t perform well. But if you run it on a machine like mine with 16 gb 2400 hz DDR4 ram and a 1070 Gtx NVidia it is a beast."}, {"text": "Hey great video, thanks for all the Ryzen info, but I&#39;d like to know what Nvidia driver you rolled back to, that improved Premiere performance?  I have a GTX 1070 GPU and I&#39;ve been having dropped frames with just 1080 footage.  I&#39;ve tried rolling back drivers, but no luck.  My AMD Radeon 580 card playback is much better, but I know the Nvidia card should be the more powerful and better Premiere experience."}, {"text": "So in the end, AMD is still stuck on the same gravel road.... Ever since I have a computer ... (1990s if i remembered correctly).. AMD systems always have some hiccups that comes with their system (Math co-processor problems anyone?). I don&#39;t think this is going to change soon. AMD is fine for a guy who knows his computer. But for anyone who just wants everything to work without any effort or the knowledge to fix drivers should just stay the hell away from AMD."}, {"text": "Buy iMac or Mac book pro. Final cut works a dream. But if you like challenge of all these problems then fair enough."}, {"text": "Which monitor is that ? It&#39;s gorgeous"}, {"text": "I guess I&#39;ll go to team blue"}, {"text": "One problem i having with ryzen is that. once u awake from &quot;SLEEP MODE&quot;&#39;, my fps drop a lot when playing games. for example csgo. it drop till 15fps"}, {"text": "Very good informative video. thanks."}, {"text": "That Be Quiet Dark Rock cooler looks gorgeous!! But i&#39;m happy right now with my Ryzen 1700X OC@4.0 with custom watercooling*<br /><br />*spoiler alert... CAR COOLANT AND METAL HOSES."}, {"text": "You computer was buggy from browsing porn sites."}, {"text": "What&#39;s that case? Looks nice and compact."}, {"text": "Jay make a video on the 9th gen mainstream intel chips! :)"}, {"text": "watching video on my ryzen 1700 desktop, waiting for 2800x"}, {"text": "Ты мудак? Оставляй описание своего пк в описании"}, {"text": "R U Chris Pratt?"}, {"text": "what monitor is that"}, {"text": "So, you had much less than 3 months, because you didn&#39;t re-install your system at the start? Misleading title."}, {"text": "Intel has an unfair advantage - the Intel compiler checks for Intel H/W and performs the best code optimizations possible. When compiling for AMD/Ryzen it outputs way less than optimal binary code (deliberate/malicious choice?). There have been a few conferences recently where developers have discussed and been guided for better AMD/Ryzen optimizations. Until all the major apps are recompiled with optimizations specific to AMD, the problems you presented will continue. Hopefully we might see all major app providers begin to advertise an &quot;optimized for Ryzen&quot; tag line in the coming years. <br /><br />That said - I loved your video! It was very interesting to note that you have frame drop issues even with proxy files  even after all the $$$ spent as this was precisely the reason I spent most of last week researching a new Ryzen build. I was blaming my old rig and you have saved me from days and weeks of potential frustration and bewilderment about why my video editing issues were not resolved after all the hope anticipation and $$$ spent - not to mention the precious time researching for parts and bargains!<br />You&#39;ve  affirmed and justified the decision I made just this afternoon to postpone my Ryzen build by a quarter or half year until the insane prices on RAM and GPUs come down to saner levels (thanks to the crypto mining boom), and not make purchases in a hurry! I went for a mobo upgrade and purchase  for my old AM3+ X4 CPU in the interim. <br /><br />Thanks for the great effort!"}, {"text": "AMD is shit and unreliable"}, {"text": "Thanks for the vid man!!  My main concern is photo editing"}, {"text": "so Yea or Nea?"}, {"text": "Cinema sins voice : Discount Chris Pratt <b>DING!</b>"}, {"text": "you need to follow up on this. Ryzen is way more stable now."}, {"text": "does amd ryzen  support virtualization ?  i want to work on 2 or more operating system together like windows 10 ,linux 7.3 suggest me which processor best for me<br />for virtualization"}, {"text": "some issues seem to be motherboard related not CPU."}, {"text": "i7 8700k &gt; Ryzen"}, {"text": "What is the case you are using on your intel build?"}, {"text": "Out of curiosity is your ram Samsung B-die ram? If not that is probably why you cant get to 4.0 OC stable as B-die ram seems to be the secret to Ryzen performance. Hell I had one set of FlareX ram that I got after the initial release because I thought hey if it&#39;s branded for compatibility it must be compatible! I couldn&#39;t have been more wrong I got wayyyyy better performance and stability out of a TridentZ kit running Samsung B-die than I did out of my FlareX."}, {"text": "Interesting. Although I am a tech, I ordered an Intel based machine (time, money.). Your build seems excellent to me."}, {"text": "Ryzen is very bad for gaming"}, {"text": "When did Chris Jericho start doing PC YouTube videos?"}, {"text": "of course you fail when you JUST CHANGE MOTHERBOARD over an old windows OS..."}, {"text": "Great for editing and multimedia, not worth it for gaming :)"}, {"text": "i mean the 8700k is better in pretty much every way. soooooooooooooooooooo..................."}, {"text": "good day i know this an old video. i am planning on going from my amd fx8300 to ryzen 1800x but i dont know after a lot of videos i have seen the intel 8700k is the one to go for. is that true yes or no.. and am planning on getting the ASUS Rog Strix Z370-F Gaming ATX Motherboard for intel or Ryzen.. whats your thoughts?  ( mem i will be using is HyperX FURY (4x4GB) 16GB DDR4 2666MHz )"}, {"text": "I think CSGO only uses 4 cores of a cpu too."}, {"text": "Gotta love that peeping tom backdoor Intel has in their chipsets though.  Am I right?!"}, {"text": "The switch is a great console and i won&#39;t hear one bad word against it. Good day sir! I say good day!"}, {"text": "Used to be AMD fan from the start, but the moment has come; I had to say,  Intel undoubtabely beats Amd, especially in gaming, where one core performance counts. Pity."}, {"text": "oh for fuck sake. You changed processor and motherboard and didn&#39;t install fresh windows..........."}, {"text": "AMD has a new CPU on the Ho-Ryzen"}, {"text": "Cool Video Dimitri"}, {"text": "I&#39;ve tried installing OS drives from an older systems into a new systems and have never found it to be a good idea, no matter how much I scrubbed the old drivers, cleared the caches and manually installed all new late version drivers. Every time, I have ended up with a system that is buggy in so many ways you might think the PC is haunted."}, {"text": "I went with a Ryzen Threadripper 1950x to build my Premiere workstation and it has been a nightmare. Super glitchy playback and unacceptable dropped frames compared to my cheapo laptop which plays everything as smooth as butter. I did a Windows reinstall but I haven&#39;t done a CLEAN Windows reinstall (other than my initial install) so I guess that&#39;s next.  I honestly think Adobe stuff just isn&#39;t caught up to this new CPU architecture and has bugs. I&#39;m hoping Adobe is paying attention and working on optimizing their stuff for Ryzen."}, {"text": "fuck intel"}, {"text": "I have to be honest here.  You switched out fundamental hardware in the computer and didn&#39;t do a fresh install, then reviewed on the problems you had, that you created.  That&#39;s really unprofessional and just poorly done.  Sorry to hear that guys, i really enjoyed a lot of your content and your common sense approach to the PC world, especially as someone who is knowledgeable, but not an enthusiast."}, {"text": "Im wondering why you didnt choose to do this with Ryzen 1800-X instead of 1700-X"}, {"text": "I am still using a 2600K    xD"}, {"text": "hello you still have problems while gaming? I&#39;m very interested"}, {"text": "Wasted 5 minutes of my time only to be informed that this &quot;reviewer&quot; did a hardware swap without a OS clean install. That&#39;s like fixing your ikea furniture but skipping a few steps and expect it to be firm."}, {"text": "Have these stability issues been ironed out yet in 2018?"}, {"text": "Good PC"}, {"text": "What? Adobe lightroom not optimized for Ryzen? :( Still torn between i5 8400 or Ryzen 5 1600. Any help?"}, {"text": "What&#39;s the monitor he is using?"}, {"text": "don&#39;t forget about upgrading motherboards every intel upgrade! ryzen boards are good till 2021"}, {"text": "Is ryzen still sluggish in Adobe Lightroom? I cant make up my mind over 7700k and 1700x since i have them both for around the same price with the motherboard included in that."}, {"text": "why the fuck you wanna make a 4k video with a guy just like talking?"}, {"text": "YT recently suggested the is video and I would love to see the hardware list for the build used in it, especially the case (I love those 200mm fans!)."}, {"text": "I won&#39;t switch. My i7 2600 is still rocking everything that needs to be done and even though I had nothing against faster processing times, it&#39;s not like a lot has changed. If I can get a way beter system than I have now for a reasonable price, I think about it. But Ryzen isn&#39;t a revolution, just a good step for AMD."}, {"text": "Windows 10 is in my opinion one of the worst operating systems Microsoft ever created. That is why I am sticking with Windows 7"}, {"text": "Upgraded to Ryzen 7 1700 with a clean Windows 7 install and it works great!"}, {"text": "Will this work for AutoCAD?"}, {"text": "Hi hardwarecanucks,  I just stumbled upon your video  can I ask what kind of monitor that you are using?  What make/model?"}, {"text": "what would you suggest with i7 7800x vs ryzen 1700x vs ryzen 1800x for 4k video editing"}, {"text": "If you think a Ryzen 7 8 core is not worth it then you really got something wrong with you."}, {"text": "nice cpu cooler"}, {"text": "Hey Dmitry do you still use this machine or did you move onto something else?"}, {"text": "So basically you&#39;ll get even the most polished programs crashing, devices misbehaving and a lot of headache before you&#39;d make your system somewhat stable by stopping nvidia updates? Sound like a lot of gimmick."}, {"text": "Guardians of the Galaxy? :O!!"}, {"text": "What kinda render times would a Ryzen 5 1600 put out under the same load (like editing 4k while multitasking)?"}, {"text": "Why on gods green earth would you not do a complete fresh windows install when changing motherboard and cpu!?  With a name like HardwareCanucks it didn&#39;t occur to you what a mess you were going to make of your drivers especially when switch lowest level component manufacturers!?!?!   To even mention those problems BEFORE mentioning that stupidity is misleading and provides useless info. 99% of the people out there would NEVER assume to do that for anyone of 1.000,000 super common sense reasons.  Why you even do such a thing beyond absolute laziness is totally beyond me..  First of all you are going to have so munch duplicate and conflicting registry data on top of core drivers for all the buss&#39;, memory, PCIE, USB controllers, northbridge and cpu functions... IRQ madness with two completely different systems at the lowest possible level... ABSURD!  At the very least it would be beyond obvious that your new fancy hardware would fall flat on its face RE performance because it&#39;s doing 9x the work for every single machine instruction..  You drive 10 under in the fast lane don&#39;t you?"}, {"text": "Have a nice day!<br /><br />Any one can help pls. how to Oc. @4.8 GHz. - @5.0 GHz .                              Thank you very much...<br /><br />CPU: i 7 7700 k<br /><br />CPU COOLER: Cooler Master V 10<br /><br />MB: Msi z 270 gaming pro carbon.<br /><br />RAM: 16 GB. 2 x 8 GB 3600 MHz<br /><br />SSD: 256 GB Samsung (2.5 cm.)<br /><br />HDD: 500 GB Sea gates 7200 rpm. (3.5 cm)<br /><br />PSU: Cooler master silent pro M 700 watts.<br /><br />FAN CASE: 2 x 120 mm. push out / 1 x 200 mm. push in<br /><br />Monitor: Orange LED TV 32 Inch"}, {"text": "I&#39;m looking to upgrade from an I7-3770 to a Ryzen 5 1600 because my motherboard is pretty outdated and I want to future proof my PC. Think its worth it?"}, {"text": "Which model of LG&#39;s monitor is in this video?"}, {"text": "So, all your problems were not even close to Ryzen related.<br />Fist problem was due to the well known error &quot;user ID10T&quot; because of not reformating the HDD and moving the whole lot from Intel to AMD just like that with a bunch of drivers conflicting.<br />Second problem is that some crappy cheap as hell products bought from Lidl not working... yeah ok... Ryzen to blame.<br />and last problem was nVidia&#39;s drivers misbehaving with adobe&#39;s software somehow.<br />Bottom line, your platform is working good as you expected and all the problems you had were because of other companies (or persons)"}, {"text": "How its performance in Virtualization??? I have to select processor for kernel compilation in virtual enviroment???"}, {"text": "is the sweet spot editing in Skylake and then rendering in AMD? :)"}, {"text": "championship although efficient court ingredient search clothes devote contribute sure fit chief."}, {"text": "Definitely do a clean install!   Shesshhh :)"}, {"text": "This YouTube reviewer is by far the dumbest , his own mistake not doing clean install was causing the video editing problems, instead he bashed Amd for half the video, and  praised Intel the whole time.<br />Then next problem was caused by nvidia drivers, and again blamed on Amd the half the video. What a dumbass."}, {"text": "What is that case please"}, {"text": "Managed to buy a Ryzen 7 1800X for 290euro today (i&#39;ve some connections). Upgrading from an i7 4790k. Pretty excited to see how it performs"}, {"text": "What kind of case is that at about 3 minutes?"}, {"text": "im goin to buy 1800x gskill flare x black asus rog crosshair vi hero m2 samsung 500gb evo"}, {"text": "go to threadripper 1920x"}, {"text": "It&#39;s a new ship you got to respect is going to be bios updates and great that they&#39;re doing them"}, {"text": "Not adobe friendly ????"}, {"text": "Great video. Thanks"}, {"text": "What kinda motherboard are you running? I been building computers for 29 years I do graphic editing &amp; manipulation and website design &amp; run different operating systems in vmware plus tons ever and ryzen is gawd.. I am using msi on everything besides the 1700x"}, {"text": "Aww man. I was going to go AMD because I do photo editing... should I stick with Intel then for Lightroom and Photoshop?"}, {"text": "What were you thinking ? It is completely a new platform not just new cpu, you cannot use same the windows. Sad part is most people will watch first 4 minutes of the video and say, I knew it, Intel is better..."}, {"text": "There is something wrong with your BIOS settings, virtual memory, storage buffer memory and most importantly that AMD optimization routine. Intel machines are rubbish as compared to AMD in graphics plus cost to performance ratio. If you think that a company like AMD can release such a massive revolution like Ryzen without even testing for minimal driver compatibility and incompatible cables thing, dude it&#39;s impossible. The video though technically pretty sound ended up sounding like an Intel ad. I have used AMD for 15 years and now using Intel too (after the APU switch). Intel sucks for basic and mid range segment systems in graphics and features. The only major drawback of AMD systems WAS heat. It&#39;s more or less gone now. The drivers will be coming soon, so will be the firmware updates."}, {"text": "How about an update now? Have any updates alleviated previous issues?"}, {"text": "<b>A challenger appears</b><br />Intel i7 8700k<br />Ryzen 1700 has fainted"}, {"text": "whats the monitor?"}, {"text": "Let&#39;s see how ryzen stacks up after the Spectre and Meltdown patches."}, {"text": "i notice that too when i play games i get drops fps too mm i have the 1700 ryzen"}, {"text": "Adobe software is crap."}, {"text": "What Corsair tower is that I can&#39;t find it?"}, {"text": "Не погано )"}, {"text": "I aint got time for this bullshit...thats why I use mac"}, {"text": "So in other news, I&#39;ll stick with Intel like I have since I first started building PCs."}, {"text": "Time to install Windows. <b>bass drop</b>"}, {"text": "chamo esa pc esta bella"}, {"text": "When the update hits Intel to stop hacking then that AMD is going to look even faster. :D"}, {"text": "Heard about those problems before in a channel - he went back to Intel *fail*. Always always reinstall Windows, update bios if possible, get the most stable drivers n codecs and best version n settings of software. If it doesn’t help - tweak, Google and wait for updates."}, {"text": "What case is the one with the bug fans in the front?"}, {"text": "My ryzen 1700 experience has been great and had no frame drops in premiere or lightroom so far. Did you make a clean win10 install and updated your drivers?"}, {"text": "To be fair even with Intel CPUs Lightroom CC is an unoptimized mess... Heck evento Aobe has said it"}, {"text": "Remove the Adobe Premiere and try Blender."}, {"text": "Are you russian? Nice channel btw."}, {"text": "Umm.. is ryzen 5 1600 still worth in january or february ?? Im gonna upgrade my g4560 soon"}, {"text": "wish I could afford to even LOOk at a new pc like that"}, {"text": "This guy has a Slavic accent and the typical broad squareish Slavic face."}, {"text": "Dude,  what brand is that black sweater?  I&#39;m looking for one exactly like that.  Where can I get it?"}, {"text": "So much superficial crap in this video."}, {"text": "wait, does amd cpu&#39;s need drivers?<br />never used drivers"}, {"text": "I&#39;m getting some really bad performance out of my 1700x! for whatever reason i cannot stream and game with my cpu hitting 100% cpu usage. I updated my bios and my chipset to the newest version&#39;s. Somebody please help"}, {"text": "Dude can you help me?i have ryzen 5 1500x and rx 580 but i pay cs go 70 fps only and league of legends 40-70!!!Why?its crazy..."}, {"text": "Is Lightroom still slow on Ryzen?  I had not heard about this problem before"}, {"text": "So that&#39;s why Frys put back i7 7700k back to $299 from $269"}, {"text": "which version of windows would You recommend installing on new computer 10 , 8 or 7? so it work best with premier pro"}, {"text": "Thanks for this review, it was very informative :)"}, {"text": "can i live steam with this ryzen 1700x?"}, {"text": "So you made a noob mistake and made a video about it.. 😂 Good job."}, {"text": "sir, can you tell me what program are you using and what output settings and if there is any afterwards resizing or anything like handbrake adjusting ? because your videos are very sharp yet low sized specially in 480 looks better than my 1080 output with perfect size, it would be so appreciated &lt;3"}, {"text": "Can&#39;t see how could anyone thumb down this awesome video backed with hard work of trying out different permutation of configurations"}, {"text": "coffee lake it is"}, {"text": "which LG monitor is that in the background...?/"}, {"text": "Will you be sticking with Ryzen then?"}, {"text": "what camera r u using?"}, {"text": "Ryzen “gaming”. 😂"}, {"text": "So....&#39;tech&#39; guy doesn&#39;t know that you need a clean install when changing to a different CPU and motherboard. Thanks for admitting it at least, something that several reviewers haven&#39;t done yet."}, {"text": "Yeah, It&#39;s a piece of shit."}, {"text": "You would be better off with a core i5 8600k. Costs less, clocks 4.3Ghz per default and has great OC potential.<br /><br />I just abandoned my 1800x because the max 4Ghz were a pain in the...... Now went for a i7 8700k which works nicely at 4.8Ghz - did not even delid it.<br />It just blows the 1800x out of the water in gaming and production. Encoding a movie with x265 takes 25minutes less with the 8600k despite having 2 cores less - but the 800Mhz more per core destroys the 1800x.<br />Gaming is also much better now as the 1800x actually became a bottleneck in CPU heavy games which prevented my GTX1080Ti from getting fully utilized.<br /><br />I regret that I gave the Ryzen platform a chance. It&#39;s bad for gaming and productivity. Coffee Lake is the way to go."}, {"text": "running amd 1800  4.4 stable     best comp i have ever been on    sli 1070   gaming beast!    64 gigs mem    4 ssd   1200 psu     white tower case"}, {"text": "What is the name of the cabinet/case model?"}, {"text": "Thank you for your dedication. Very much appreciate your extended benchmark of use."}, {"text": "With the 8600k defeating the 1800x on most benchmarks and costing less $$$, it&#39;s not worth it anymore :P"}, {"text": "I&#39;m not entirely getting it. I&#39;m working with 1080 50p on a 6700K at 4,6GHz and I don&#39;t have any hiccups and everything plays instantly..."}, {"text": "Rendering speeds is one thing, but scrubbing timeline and realtime preview is another. In premiere it might be ok but my experience with After Effects and Photoshop has so far been dreadful using the Threadripper 1950X. Despite being overclocked to 3.8GhZ. All with the latest Bios and a clean install, using a gtx 1080Ti and 128gb og 2400Mhz Ram and a 2gb 960 Pro m.2 SSD. I will never recommend THreadripper or Ryzen for After Effects, Photoshop and Lightroom, stay far away!"}, {"text": "Couldn’t the issues also be the GPU and not solely the CPU ? 🤔"}, {"text": "Use Linux Mint with AMD... ok it will cause many things.. like Adobe won&#39;t work.. but you have Blender :) and many other programs which end up working better on Linux than adobe and Intel on windows :)"}, {"text": "You need to match AMD with ATI/AMD cards."}, {"text": "I chose  i5 8600 but i think ryzen is something positive for market. People got better choice becose FX series was little fail."}, {"text": "Numbers say no, but my eyes say yes ryzen in smoother in everything, drawbacks dolphin sucks on ryzen along with hackintosh.. it&#39;s a nogo."}, {"text": "its not Ryzen its-self that struggles sometimes.. its shit Windows 10 my friend ! .. its Windows that conflicts with AMD drivers .. been using a PC for 20+ years now .. Microsoft has always been 2 steps behind AMD..<br /><br />when using AMD, always do a clean install of Windows &amp; never let Windows attempt to download &amp; install its own so called recommended drivers ... just take the time to actually download from the manufacturers &amp; always install manually.."}, {"text": "you videos are the first youtube vids i have come across that i can really notice the 4K working on my 4K monitor :D"}, {"text": "Did you check your power supply voltage.. You are pushing alot of stuff there.. I have seen really weird things in my IT years and the inconsistency with the speed on the Thumb stick and other things like the drop in frame rate and back up again  can be from a Video Driver or POWER. Not being consistent on read write speeds. I have even seen video goo crazy Squiggly lines because of a PSU. Everything fine but weird stuff starts to happen. I know you know what your talking about and enjoy the show but just wonder if that may have bearing on the situation.."}, {"text": "intel fanboys are not welcome here, all they do is post false comments."}, {"text": "He&#39;s bitching about this setup throughout the whole video but at the he sais it&#39;s been worth it and he loves it. What a complex man."}, {"text": "What case is your intel machine in? That case is beautiful!"}, {"text": "Good one thank you.  Very helpful approach.  After watching going to Coffee lake.  I don&#39;t want to hunt down issues.  thanks again."}, {"text": "No gaming statistics after refresh/clean system?"}, {"text": "DAMN THAT&#39;S A BIG COOLER"}, {"text": "Hello Which CPU, Ryzen 5 1600 or i5 8400 should I use for ultra gaming, photo editing, video editing etc . Plz reply friends . Plz suggest among these CPU&#39;s only please. Plz reply friends."}, {"text": "i love ryzen !<br /><br />this is my bad girl :D<br /><br />this is my rig:<br /><br />SilverStone Primera Case with Window Matt Black -<br />Corsair RM1000x 1000W 80 Plus Gold Power Supply -<br />ASUS ROG Strix X370-F Gaming Motherboard -<br />AMD Ryzen 7 1800X Processor (OC @ 3.8ghz) -<br />Fractal Design Celsius S36 Liquid CPU Cooler -<br />G.Skill Flare-X F4-3200C14D-16GFX 16GB (2x8GB) Ryzen DDR4 (@ 2933mhz) -<br />ASUS ROG Strix GTX 1080ti 11gbs -<br />Kingston SSDNow UV400 240GB SSD (Operating system) -<br />Kingston SSDNow A400 480GB SSD (Gaming) -<br />Seagate Barracuda 2TB ST2000DM006 (Storage) -<br />ASUS VA326H VA Curved 144hz Adaptive-Sync Gaming Monitor (Main) -<br />LG 24in 60hz (Streaming monitor) -<br />G.Skill Ripjaws KM780 RGB Mechanical Keyboard Cherry Brown -<br />G.Skill Ripjaws MX780 RGB Laser Gaming Mouse -<br />MSI DS502 7.1 USB Gaming Headset -<br />C922 PRO STREAM WEBCAM<br /><br />cinebench:<br /><br />cpu highest score 1628<br />gpu highest score 121.42"}, {"text": "testing a ryzen with CS GO??? WTF"}, {"text": "late to the party ► Got 1700 @ 3600, 2933 ram, and asrock 370X mobo -- took about 50% off the video rendering that my 1st gen i5 was struggling with. Plays games while watching videos on YouTube and streaming np -- about 25% cpu usage which seems amazing. Watching you play games while rendering makes me want to try streaming while rendering to see if that would be possible. Have had the system since may 2017."}, {"text": "The case looks sickkk"}, {"text": "Investing into a product can lead to a discovery of its true potential."}, {"text": "EDIT: This video was released just to light a fire under Intel&#39;s ass :D"}, {"text": "Upgraded my unRAID NAS server to a 1700X. Great so far!"}, {"text": "Ryzen 2 will please you like no woman could."}, {"text": "Apples vs Bananas.  Intel 6700k is a overall better performer.  while Ryzen 1700x can handle a larger workload. For the kind of work you are doing you would probably be better off with the i7-7820X"}, {"text": "But testing and messing with a Ryzen system/testing also cuts into productivity. ..."}, {"text": "Never touch a screen only simple humans touch their screens."}, {"text": "This guy just has a face you want to throw a brick at very smug and arrogant it&#39;s just a punchable face"}, {"text": "I think it was a bit unfair to mention the issues you had in Premiere that ended up being related to the nVidia drivers, because this has nothing to do with the CPU.<br />Also it&#39;s not the processor that is optimized for an application but the other way around."}, {"text": "Please try all this in Windows 8.1, Windows 10 is very crapping internally. I would like to see the benchmarks in that, we might be surprise, just like Windows XP was beating Windows Vista when it came out although Vista was huge crap. But it&#39;s worth the testing because so we can find out if all issues might be from software and not hardware."}, {"text": "Switching from Phenom II X4 955 to Ryzen 7 1700 @ Stock, I can say it is a much better experience. Not that it would be unexpected, hehe."}, {"text": "Still waiting for a decent Ryzen + 1070/1080 max-q laptop."}, {"text": "LoL that plot twist in the middle"}, {"text": "I&#39;ve never run a CPU that&#39;s newer than 2nd gen so I&#39;m no expert but why is your machine struggling to stabilize at 4GHz?  Is it just you who&#39;s experienced this or have others with Ryzen got this kind of issue as well?  (I call it an issue XD 3.8GHz its pretty high)  I have an Intel i5-2500K clocked at 4.5GHz no problems, so maybe it&#39;s just that Ryzen&#39;s higher core count means less overclocking ability.  If anyone knows why this happens I&#39;d be glad to hear what you think"}, {"text": "Can&#39;t believe you wasted the first 4 minutes of this video complaining about issues caused by plugging your existing Windows installation from an Intel system into the new AMD architecture. You didn&#39;t give credit to it being a new platform, and I&#39;m having no issues running my Ryzen&#39;s memory at 3200mhz CL14 with the latest BIOS updates as of a couple months ago."}, {"text": "the rear fan didnt move inside the case?!"}, {"text": "1950x here, my only question is what is your memory latency rating on passmark for the Ryzen/TR series?  I got gskill 3200 going but I get horrid latency rating even though everything else is top 1 percentile."}, {"text": "Now i am curious about you using 1950x. :)"}, {"text": "What 4 drive Silverstone raid box is that?"}, {"text": "So, for 5 minutes all this talk about how it drops frames and freezes in games was to tell us you didn&#39;t do clean install?"}, {"text": "why not match with an ATI card.."}, {"text": "Do you have the Componentlist of your AMD Machine? Looking for some inputs for my new system ;)<br />Thanks"}, {"text": "those probleme are software related  its not the fault of the cpu   devlopper will eventually optimise their produduct for ryzen"}, {"text": "Great video! Very informative! Love the accent!<br /><br />Question: I currently have an i7 700K cpu and I have the option to switch to a Ryzen 7 1700X. I&#39;m a gamer and video producer. Should I make the switch or stick to what I got?"}, {"text": "Please intel fanboys, &quot;Ask me about my Weiner !!&quot;"}, {"text": "ANYONE KNOWS WHERE CAN I HIS HOODIE? Unboxing Therapy also wears it FFS, i need it so bad!"}, {"text": "just cannot help it. for a tech review, it just weird that you did not do clean installation. sure hope intel did not pay youtubers for a fake review."}, {"text": "Why do you look like Chris Pratt?"}, {"text": "You need to edit out all those demonic hand signs."}, {"text": "Time is so important"}, {"text": "I wonder why I keep getting these dumb ass videos on my recommended, even when logged off...."}, {"text": "Whats that for a PC Case where the Ryzen is build in?"}, {"text": "What are you going to do with your old intel based rig?"}, {"text": "how many cores is it maxing out with the 7?  debating the 6 core 5 1600x or the 8 core 7 1700x and can&#39;t decide if the extra $80 is worth is"}, {"text": "Of course no one has tested on AMD.  They haven&#39;t done shit in years, why should companies take the time?  It&#39;s been basically a niche for years, just to say that you own one or some fucking bullshit like that. I own a 1700 now and it&#39;s irritating that shit doesn&#39;t work (Pro Tools and my sound drivers for one; clean installs don&#39;t fix everything).  It&#39;s definitely like 20C cooler than my 4.2 GHz 4770K, and I get a better overall performance for sure.  Just gotta wait until people take AMD seriously so we get shit that works.  Then it&#39;ll truly be a truly competitive market.  Or, at least, a level playing field with no excuses.  It&#39;ll kick Intel in the ass hopefully.  Either way, I want stable shit that doesn&#39;t overheat like a toaster when I pay hundreds of dollars for a single component, please."}, {"text": "So for workstation and content creation, ryzen. For gaming, Intel consumer chips. Still the same result."}, {"text": "I&#39;m so glad people are buying AMD cpu&#39;s so that it makes my next intel purcahse even better! Thank you all! :)"}, {"text": "weird, I have had issues where I had to take the SSD from my Ryzen machine to a intel machine then BACK to the ryzen build and the performance is actually better.... weird"}, {"text": "Hi I&#39;m planning to upgrade my PC with a new AMD build.  However, I&#39;m wondering do I need to buy a new OS? I&#39;m currently using windows 10. Any advice is welcome. Thank you."}, {"text": "Just bought my Ryzen 7 1700 and X370 Taichi. I&#39;m stoked!!!!!"}, {"text": "A good video but I do not render so many videos so I stuck to Intel but then again I am old and drive a Toyota ;-) !"}, {"text": "Super helpful review"}, {"text": "I like these videos. Nice video and editography. The video focus is nice."}, {"text": "Nah shoulda bought a 8700k much better all around."}, {"text": "Basic run down : <br />If you want to do rendering, cpu intensive stuff all day... get Ryzen.<br />If you are a gamer... which most of you are , don&#39;t you dare say AMD is better. Intel all day long, for that single core performance. Not to mention ... you can do all that multi tasking rendering stuff with Intel as well... it will be a little slower. SO WHAT?<br />Tell me how i&#39;m wrong? O yea ... you can&#39;t"}, {"text": "PLEASE REVIEW THE ALIENWARE KEYBOARDDDDD"}, {"text": "on a serious note.. coffeelake i3 or i5 8400 with b260  ? vs ryzen 1600 b350 paired with a 3gb 1060 <br /><br />any suggestions ?<br />trying to make a build under 700$<br />mainly for esports"}, {"text": "Братан, все-таки райзен или кофилейки?"}, {"text": "All my gaming friends are so sad with Ryzen."}, {"text": "I7-8700K WOULD DESTROY THIS"}, {"text": "You had the other computer on standby. Could you not have created a workflow where you were doing your editing selecting and other work on your Skylake machine and pass off your project to the ryzen machine for rendering? You could be using both machines at the same time and that would really help your multi tasking"}, {"text": "Whoa, whoa, this is the first time I&#39;ve seen someone address Lightroom performance, this is good info. I was pretty much 100% decided on Ryzen 5 1600, you&#39;re saying that a 4 core intel at a higher clock would do better?"}, {"text": "im on ryzen 1700x with x370 prime pro mobo and i&#39;ve been getting random crashes where display and all perfs shut down but computer fans stay on. power button doesnt work during that time and i have to turn off/on psu to fire my machine back up. it does it at complete random."}, {"text": "Random photographer app - &gt; important app (lul) . I didn&#39;t need a clean install, I only upgraded the drivers after installing the cpu"}, {"text": "I know this has nothing to do with the video, but would you mind sharing the link to the wallpaper on your background&#39;s pc? That sort of monster, looks neat :)"}, {"text": "Hey buddy, I watched your video about the chair, so how is it doing? Still good?"}, {"text": "Important apps :v"}, {"text": "I had the FX 8120 which was a great multi tasker and i did well in gaming.I noticed only one game were my later I7 3770 simply blew the Fx 8120 out of the water and that was Arma 2. The old Fx were great for multitasking and production work but not for gaming. The same thing with Intel and AMD now and when we look at the power of the R5 1400 then we see almost the same single core and multi core performance. when they manage to ramp up their ipc then they are rally a threat to intel. Like before(Fx 6300) i would look into the R5 1600 because of 6 cores you have more option&#39;s and especially for streamers out there. 8 cores are good for content creation but most people will never use them when only gaming and streaming.."}, {"text": "would you like to compare ryzen 5 with intel i5 8600k ?<br />i would like to hear your review , i was watching your old vids &quot;Forget the intel i5 ... Buy a RYZEN 5!!&quot; . it was i5 7th gen but what about 8th gen?<br /><br />thanks before"}, {"text": "First 5 minutes of this video is totally useless."}, {"text": "Your need a 16 core thread ripper. Lol"}, {"text": "3 months with Ryzen then Intel drops their new line of chips that destroy Ryzen.  Exactly what I told people was going to happen as soon as Ryzen was benchmarked.  Per the norm Intel offers far better per core performance.  Ryzen is pointless for anybody that doesn&#39;t need the higher core count (rendering etc) which is a VERY tiny percentage of the population."}, {"text": "Has anyone seen Steam Hardware stats, over the last month AMD took a massive nosedive in sales compared to Intel on CPU side and Nvidia on GPU side.<br /><br />Trend was there for years but last month it just took off. I don&#39;t get it, this is happening exactly when Ryzen is out."}, {"text": "I&#39;m worried because I&#39;m about to build a PC to edit and record music and probably casual streaming or recording videos so I thought about  getting a Ryzen CPU, but if i get audio recording or editing software issues I&#39;ll kill my self"}, {"text": "You say &quot;Ryzen is unoptimized&quot; but really it&#39;s Adobe that hasn&#39;t optimized their software.  Linus gets into this where many of Adobe&#39;s software don&#39;t take advantage of the high thread counts that exist on the high end of AMD or Intel&#39;s lineup."}, {"text": "I soon will update my rig and even though Intel is probably the best idea for me, I will get a Ryzen just for the sake of supporting the market competition and because fuck Intel and those &quot;upgrades&quot; that they do each generation."}, {"text": "I have the Ryzen 5 1600x, was using a GTX 1060 6Gb and was having constant video driver crashes. Changed out to an ASUS RX 480 8Gb ROG and not a single drive crash since."}, {"text": "nonon it&#39;s not ryzen that&#39;s unomptimalised for premier. IT&#39;s that premier is not optimalised for ryzen. It&#39;s two different things"}, {"text": "Where can i get adobe animate?"}, {"text": "What is the mouse plugged into?"}, {"text": "To tl;dr, brand new architecture needed a bit of time to catch up in terms of stability and testing compatibility. As expected."}, {"text": "bro you look like oberyn martell"}, {"text": "I&#39;m considdering upgrading to ryzen but i also need a new gpu.<br />I&#39;m running fx8350 @4ghz and an r9 290, and i only game at 1080p, what should i upgrade first and to what?"}, {"text": "according to you, the ryzen is not recommended, so i will not buy, you discouraged me."}, {"text": "Holy Hell...all kinds of stuff works poorly with Ryzen. Thanks...i&#39;ll stay Blue and Green."}, {"text": "So if I want dropped frames and crashing...go Ryzen🤣"}, {"text": "what case is that on the intel build that you use for case reviews! :o"}, {"text": "I have the Ryzen 1700x, I&#39;ll upgrade when there will be 7nm processors available."}, {"text": "I never get how people don&#39;t do a clean install of their OS when they replace key components in their system like Motherboard, CPU and RAM"}, {"text": "Intel Vs AMD = ROCKY IV <br />LOL"}, {"text": "about time AMD started giving Intel a reason to innovate for the consumer market again. I am real excited to see what Intel&#39;s response will be."}, {"text": "i love my ryzen 1300x"}, {"text": "AMD FOR LIFE. FUCK INTEL, TEAM RED"}, {"text": "I would have to disagree with the idea of render times being worth it ,..but I must admit, I most often just do my rendering at night while asleep or have it running without me as I do lunch or whatever.<br />For me the productivity would actually decline for this reason,.. as time lost while actively at my keys and aggravation over sluggish performance i would notice on a daily basis,.. and it rendering twice as fast I would never notice at all as both are just as &quot;done&quot; when i wake up."}, {"text": "i was about to buy ryzen, but no igpu....want a plex server with ryzen"}, {"text": "I’d bet that amd will listen to you and implement a fix, but hopefully now before gen 2.<br /><br />Mine experience has been stable and the light video rendering I️ did with my 1600 has been great (I️ use VSDC)"}, {"text": "From what I know, Premiere works better with higher clock speeds rather than more cores."}, {"text": "AMD went 0-60 real fuckin quick and now they&#39;re going even harder. Check out what ryzen mobile is bringing."}, {"text": "Just picked up a Ryzen 1700X with a RX 580. Waiting to use it though... lol"}, {"text": "Its good thing no one games nowadays. <br />Everyone bought 1800x or TR because nowadays 99% of consumers fold at home, edit and stream....<br /><br />/s"}, {"text": "Ide like to see a coffeelake comparison if you could do that"}, {"text": "Without account for costs? No pricing evaluations, the idiot says it is &quot;worth it&quot;. This is just clear evidence of an AMD shill. Paid for Advertising by AMD. AMD = Advertising Moar Deceptions. Intel ain&#39;t no saint, but the lies spewed here are clear and obvious. Any time savings for the rendering, always already lost in the time and effort to trouble shoot, debug, and stabilize crappy product launch by AMD. Any concept of &quot;worth it&quot; was NOT objectively accounted for. And now that we see what coffeelake has to offer, sunken costs into an Ryzen build especially in the massively overpriced Ryzen 7 is clearly NOT worth it."}, {"text": "Interesting,  good professional experience   the time saving in the last minutes might score users some edge in quick ontracts"}, {"text": "Will you be doing a follow up video about Adobe Lightroom and premiere since the software updates. I️ see a lot of videos on premiere and would like to see a few on Lightroom if possible. Looking into doing a Ryzen build for photography in the future."}, {"text": "To say that cpu is not optimized for this and that software is a false statement. Software is not optimized for hardware."}, {"text": "I am glad that people like you are buying Ryzen. The new I7-8700k 6core 5ghz stable chip would not exist if it were not for people like you. It is only because of the competition that Intel had to step up. Now it looks like I9 processors with up to 16 cores will be available.. at what cost I don&#39;t know but I can only say thank you to you Ryzen owners for keeping AMD alive so I can purchase stable good quality processors from intel for a reasonable price. I use to buy AMD but after experiencing incompatibilities like you have experienced I will never buy one again. So again thank you. I eagerly await my new 8700k."}, {"text": "yes the nintendo switch was worth it"}, {"text": "The solution for proplems you came up with is Radeon RX VEGA !!! Ryzen just can&#39;t tolerate nvidia hardware. 😊"}, {"text": "Thats a beast of a heatsink"}, {"text": "What AMD doesn&#39;t want you to know.... WAIT STATES IN THE I/O....... stutters....stutters....deal breaker.   Intel I/O is the real deal."}, {"text": "I was between a ryzen 7 and an i7 7800x as their performance is very close even though Intel has 2 fewer cores, however the single core performance destroys ryzen. While single core performance wasn&#39;t huge for me upgradability was for sure a consideration for me. If I get an 8k drone in a year or so I can upgrade all the way to an 18 core without changing mobo and ram. Ryzen on the other hand I&#39;m capped at an 8 core"}, {"text": "what cpu cooler is he using?"}, {"text": "Try an AMD graphics card instead."}, {"text": "how is the performance on linux os like ubuntu.. and linux mint...???"}, {"text": "I have a 1600x at 3.9ghz. My only complaint is that my memory kit, even being on the qvl I cannot get it to run at 3200mhz. However, it is very stable at 2933mhz and I&#39;m ok with that because I got the kit pre-price hike. I do notice that it won&#39;t hold as stable of a frame rate in overwatch as my 4790k did. But still hits my 144fps goal most of the time. Overall, I&#39;m very happy with the switch and glad to be back on an AMD CPU."}, {"text": "Eh, fuck AMD!<br />Fuck ATI!<br />Intel + Nvidia was the best solution 20 years ago, is still best and will be so on..."}, {"text": "it seems devs are still optimizing for intel chips ( or just to lazy to update their platform to include ryzen)  this is why there are programs that are sluggish"}, {"text": "So basically the first half of the video is complaining about how you messed up by not clean installing windows and the issues that came with that."}, {"text": "i went from skylake to the ryzen 1700x, and i had no issues. actually it improved my workflow and rendering time in adobe ae and sony vegas, and in gaming i have also same performance, so it was woth it for me."}, {"text": "For a budget build, would it be better to get Ryzen or Intel? I want to build a gaming PC for under $600. Yes, I know it&#39;s a low price for a PC, but it&#39;s the best I got. I was deciding on either the I3-6100 or the Ryzen 1600. What are your guys&#39;s thoughts?"}, {"text": "I mean give Ryzen a year or two to catch up with compatibility updates and Ryzen will truly beat intel."}, {"text": "<b>Was the Switch Worth It?</b>"}, {"text": "hmm... then if the game fps not stable, it will given some negative effect when playing VR game due to missing frame movement that might causing a slight dizziness in high speed action or movement"}, {"text": "I am running a normal 1700, without the &quot;x&quot;, and it is clocked to 4032mhz, with my GSkill FlareX 3200c14 ram clocked to 3486mhz. I consistently get 1765-95 on Cinebench, and once in a while get a frozen screen. But it is extremely rare. I love Ryzen, and have decided that I hate Intel for ripping us all off for so long. Glad AMD is pushing the competition. We all expect to get a few hiccups on the AMD&#39;s since they are so new, but the other side of that coin is they also get better over time. And every improvement is exciting."}, {"text": "where are your raptors?"}, {"text": "Building a new desktop setup around Black Friday / Cyber Monday sales... still going Ryzen 1700x."}, {"text": "anyone know where i can find that block wallpaper?"}, {"text": "I love that CPU cooler for real!"}, {"text": "CHEAP PEOPLE FIGHTING FOR INTEL OR AMD BECAUSE THEY CANT BUY BOTH...LOL"}, {"text": "I have been almost &quot;always&quot; an AMD user, for the good and mostly for the bad. Some months ago I changed my R9 Ati card for a RX 480, paired with a 8320 processor I saw a lot of bottleneck, so I bought a whole new system based (under my wife permission ha ha ha) on a Ryzen 1700x and the truth is &quot;this is a new world for AMD&quot;, years passed without anything to talk about fighting against Intel, always Intel. AMD was for low price machines and for low-medium PC enthusiasts. With Ryzen that&#39;s over, I&#39;m not telling anyone that AMD won the final battle, of course not, but they won a big one after, at least, 10 years of losing, they are back in the game. Now Intel has an opponent and a market to fight for...... that they had for years abusing their wallets (that sounds like apple, anybody?). <br /><br />Ryzen 1700x works incredible well with multitasking and very nice for gaming, all AAA games that I have on Steam runs  High to Ultra, depending the demands of each game (don&#39;t forget that I own a RX 480, not GTX 1070-1080, back there wife said NO, absolutely NOT ), as always, an Intel gamer will say: but i7 or i9 are better for gaming, hell yeah!, but they should give AMD a try for the whole PC objective and experience: working, enjoying and gaming..."}, {"text": "do you use red for 4k footage? if so get a red rocket or red rocket x and leave it disabled, its hugely increases timeline scrubbing speed."}, {"text": "I absolutely love this channel."}, {"text": "whats the case"}, {"text": "Just give amd time amd has just got back into the game for a little bit they are still learning &#39;again&#39;"}, {"text": "That case needs to hurry up and get released"}, {"text": "Your content is amazing! But the white guy looks creepy and french 1800&#39;s era"}, {"text": "The you update you BIOS  ¿"}, {"text": "You should try the oc again after all these bios updates! Maybe You get lucky this time."}, {"text": "Are you using ECC Ram on Ryzen? I do think with all the workflow you have it would be much better to go for ECC than for RAW speed. Just my 2c. Как всегда прикольное видео, спасибо :)"}, {"text": "Chris Pratt cannot been unseen"}, {"text": "I didn&#39;t even look at the channel name before I thought &quot;he&#39;s French Canadian&quot; my co-worker is French Canadian and talks the same."}, {"text": "Off topic but I&#39;m changing from liquid to the dark rock pro 3 air cooler. Having no experience with air coolers I was wondering if anyone could tell me if I should pwm my rear exhaust fan to match the cpu fan curve? It looks like Dmitri just has a solid dc voltage going through his exhaust. Surely that would restrict air flow when the cpu fans spin up no?"}, {"text": "Which ver of ryzen 5 should i buy along with gtx 1060 n msi gaming amd ryzen B350 tomahawk ?"}, {"text": "What&#39;s the model of your monitor?"}, {"text": "Watching this on my old crappy Rig with Intel i5 2400 and GTX 1060. time to buy Ryzen. enough of Intel Darkness."}, {"text": "That Sigma lens though..."}, {"text": "did adobe add in ryzen support perks? did any company add in ryzen support perks?? so why are we shooting AMD and no one has added ryzen patches?? this has been with almost EVERY reviewer."}, {"text": "When you build your PC and Kaby lake launches the next day then Ryzen is announced..."}, {"text": "I was in a film competition recently and I got to use my ryzen 5 machine with davinci resolve. Rendered a 7 minute film in like 4 minutes. In fact it was so fast we went back in and fixed a few more things and rendered again and still met the deadline on the contest. Another competitor in the contest said he was rendering in the car on a laptop in the parking lot of the drop off point. So ryzen 5 1600 was great."}, {"text": "Since a month and a half and have built myself a gaming rig with a Ryzen 1600 with the stock cooler. Works fine! Good that you mention some things like that it is an user experience and not a review. Because yes, if you just do not start clean and you come with your products you used on the Intel, like that external drive bay, and have compatibility issues.<br />Still, Ryzen is a new platform which has lots of buggs and issues but that will happen on any new platform and other new things in life. That is why there are many BIOS updates. <br />Last month, I checked, there were no 3200MHz+ compatibility for RAM on my motherboard and today I saw that they have added a lot more speed. Also 3066MHz which I am running my 3000MHz Corsair kit on, instead of the 2933MHz setting."}, {"text": "How do you have all these stuff? What kind of work do you do. Man am so jealous"}, {"text": "What monitor is he using in the review?"}, {"text": "why 2 exports per video?"}, {"text": "So conclusion is, it was your fault not reinstalling OS. It never worked to change from one manufacturer to another, without reinstallation."}, {"text": "lightroom sucks on multicore machines.  It&#39;s not ryzens fault, loads of multicore intel PC and mac users have the same issue"}, {"text": "using a 1600 OC&#39;ed to 3800 with 2999 RAM and I am happy with it."}, {"text": "amd cpus will never be good for gaming, specially if you play mmorpgs online games<br />intel will always be the best option"}, {"text": "Definately worth the swap. As a multitasker its a fantastic CPU."}, {"text": "What if you don&#39;t do any rendering? Is still a good buy? The extra cores sounds nice"}, {"text": "Youve never had to do it with intel because ryzen is brand new architecture. Of course youre going to have to uodate the bios."}, {"text": "A few days after the Coffee Lake reviews (October 5th announcement) the conclusion sounds a but like consumer bias (I bought it, so it is great). IMO honest conclusion is that you should have waited for 3 months :P. After all, the 8700K outperforms Ryzen in most x264 rendering benchmarks and has no penalties in gaming and single threaded tasks whatsoever. (Very cool case btw)."}, {"text": "Yeah can&#39;t w8 to see 8700k smash ryzen it&#39;s gonna be much better for gaming and productivity should be at least same if not better."}, {"text": "ryzen is garbage for high fps gaming, casuals will be fine tho."}, {"text": "I&#39;m a homosexual lizard from a galaxy very far away. How will this product work under high speed 0 gravity galactic conquest?"}, {"text": "I use Ryzen 7 1800X in my new gaming rig and it works fine , never had any problems with it and it performs like a beast!"}, {"text": "so idk 1700x does worth it  ? yet"}, {"text": "it was the drivers. and MAYBE bios<br />when you said clean install I couldn&#39;t stop laughing at your ignorance."}, {"text": "What case is he using? The one with big blue fans."}, {"text": "Why is shorter render time so important, since you stated that you can do other stuff while rendering?"}, {"text": "Please re-test after the Win10 Fall Creators Update.  I&#39;m reading huge gains for Ryzen in Planetside 2 after this update."}, {"text": "I appreciate this video."}, {"text": "1800x, 1080ti, 3333 ram on c6h (not stable higher), fucking love it"}, {"text": "are you german?"}, {"text": "It&#39;s been quite obvious that adobe products can&#39;t use more than few cores anyway so that&#39;s why Intel has the edge. Also many games have been optimized for Intel since AMD was away for so long that nobody really cared to optimize for any other platform... It&#39;s nothing to do with Intel being better, and all to do with software companies being idiots."}, {"text": "Well, this platform is still very new, so i think it&#39;s natural thet there are some bugs to iron out. I&#39;m sure Ryzen 2 will be much better, just like Sandy Bridge was much better than Nehalem back in the day."}, {"text": "Im debating a Ryzen 1400 vs i3 8100"}, {"text": "Try final cut ;)"}, {"text": "What monitor are you using?"}, {"text": "So what you&#39;re telling me is I need a Threadripper, right?"}, {"text": "What&#39;s the name of monitor you&#39;re using in vid"}, {"text": "This is why I love my 8700K.  Excellent productivity and THE BEST GAMING EXPERIENCE.  Ryzen is eh in gaming.  8700K is the king of all tasks."}, {"text": "I sold my 4790k system to a buddy who wanted to get into PC gaming at a good price and got my self an 1800X got a bit lucky and have it at 4.1 Ghz OC stable tho ram is still a bit hard to tune in sitting at 2666 atm on a kit rated for 3600+ but that was my own fault for not getting a kit that is tested for the platform. I have noticed absolutely no drop in FPS on a 144hz screen because I game at 1440p with a 1080Ti so the GPU is normally capped b4 the CPU gets capped. I have gained HUGE jumps in fps when I multi-task and I do that A LOT. Between rendering art 3D/ 2D while watching a movie/video while I&#39;m in a call/discord and browsing the web while I stream and game (I have 3 screens) the 4790k choked hard on that much work at once. My 1800X has been showing almost no drops in frames when I multi-task the hell out of it. I have an i5 6600k mini itx build for just gaming and built it in the Node 202 to be a Xbox look-alike system that I have painted white with 2 Xbox 1S controllers Bluetooth synced to it and it is set to auto log in on start up and launch Steam in Big Picture Mode automatically so it runs and works just like an Xbox but with an i5 6600k OC (4ghz) and a GTX 1080 SC and 16 GB of ram (2666 I think). Sorry Xbox 1 X, you tried. If you want to just game then the i7 chips are not even a smart pick anymore ESP with the new 8k line up having 4 and 6 core &quot;low tier&quot; options from Intel. I don&#39;t regret switching one bit and im so happy AMD has brought some much needed competition to the market. I love Intel CPUs but I cant back a company that doesn&#39;t innovate and ups costs of their products that have no major updates. I hope Ryzen will force them to make even better CPUs and we as the consumers will benefit."}, {"text": "Your motherbords firmware is not BIOS, it is UEFI."}, {"text": "That was way beyond short time reviews :o<br />It made me rethink about the meaning of the reviews..."}, {"text": "Multi-Level Feedback queue schedulers"}, {"text": "Short video, but objective and very informative. Good job."}, {"text": "What monitor is that?"}, {"text": "PLEEEEEEEEEEEASE! REVIEW THESE<br />Aigo CRYSTAL ATX<br />Aigo ATLANTIS<br />Both available at amazon."}, {"text": "As a pro editor in the UK, I was of the opinion that scrubbing was managed by the gpu as is the case with after effects. Also, increasing data rate frequently decreases render times, not increase, in my experience. Love the videos Dimitri!"}, {"text": "Case?"}, {"text": "always clean install when you change hardware, especially cpu. Not clean installing is like spending 10 days without taking a bath and using deodorant to compensate."}, {"text": "clean install and frequently updating your bios helps...the bios update is only necessary cuz ryzen got released before the mobo manufacturers where ready<br /><br />amd was like: well, we&#39;re done, ready or not, here we come<br /><br />thou, I oughta say, ryzen is pretty smooth and very cool<br />AMD did not disappoint me and once my 1080 is outdated I will go to team red full time again<br />not a fan of Nvidia, I mean, yeah, it&#39;s kinda fast, but I don&#39;t like that you sometimes have to reinstall the drivers completely over just updating them<br />and if you don&#39;t update, sometimes games won&#39;t even work properly...never had that issue with AMD cards..."}, {"text": "Windows reinstall was night and day with my Ryzen 1600, I love it definite improvement over my old FX8320"}, {"text": "coffee lake ? you mean skylake re-branded :p"}, {"text": "F"}, {"text": "im so mad i missed the 6XX massdrop"}, {"text": "its funny because my MacBook with final cut can scrub 4k footage in real time with ease. Just stop funding dog shit adobe."}, {"text": "Awesome Video Dmitry! <br /><br />I am suddenly in the market for a PC upgrade again after my GPU killed itself by overheating, so this video couldn&#39;t have been more timely for me! <br /><br />Coming from a 4770k and DDR3 RAM, I can&#39;t wait to see how much Ryzen will speed up my workflow and make my 4K cuts easier!"}, {"text": "Wow this video is clickbait. No where on this video does he explain if the Switch was worth it. I thought it was, especially since i can play Zelda BOTW on the go."}, {"text": "Ryzen has been amazing, simply because I had an fx 4300 xD"}, {"text": "You have all that free hardware, why don&#39;t you have your own server, for file sharing, and workflow?"}, {"text": "only have to see the too big CPU cooler, and i know, Ryzen 7 i way too hot if you could load it to 100%, so not worth it?"}, {"text": "We, the G-Shock wearers are SMART!"}, {"text": "AMD sucks."}, {"text": "Lightroom just runs like crap on everything."}, {"text": "What&#39;s your sweater? Love it. Sorry way off from the video LOL"}, {"text": "meh, ill stick with intel this round, maybe next gen ryzen will have ironed out most issues."}, {"text": "Maybe I can afford a new PC by the time Ryzen 2 comes out... hope its clocks are good and fast... 4.5 GHz would be nice with all the corrrressss"}, {"text": "Have an R5 1600X and can only get 3950 outta it .. but with them close to $200 and even seeing 1700X available below $300 it is still much cheaper than CoffeLake - I dont feel short changed in the least . GPU is where the $$ is better spent .."}, {"text": "Strange how there was a SATA power problem.  I wonder if maybe increasing the chipset voltage would help?"}, {"text": "Just to make it clear.<br /><br />AMD IS NOT MADE TO PLAY CS:GO ! <br />BUT! its made to play BATTLEFIELD !!!! so deal with it ^^"}, {"text": "3 Months with Intel 8 Cores - Was the Switch Worth it? for 144hz monitors sure it would"}, {"text": "Woah, you swapped to an entire different CPU and motherboard platform and didn&#39;t think to clean install Windows? I guarantee you that most of these issues stem from that."}, {"text": "BIOS update is the <b>first</b> thing you should do on Ryzen. Windows wouldn&#39;t even boot without it for me. Once I updated, everything was great. The PC even started quicker!"}, {"text": "when you reinstall your OS it will reinstall core files for CORE CPU drivers, this doesn&#39;t surprise me, just like when my boss when from a 6270 to my old 8120, he had OS corruption, GG always do a fresh install when you have a chip set swap"}, {"text": "So u don&#39;t know u need clean installs everytime you change platform? Really? Come on..."}, {"text": "the coffee lakes are stupid expensive though in comparison"}, {"text": "You should expect updates like crazy with any new tech. Especially when the product was rushed."}, {"text": "no one is watching 4k videos anyway :D <br />I don&#39;t even use full screen"}, {"text": "what happened to the 1800x??? why is nobody talking about it anymore?"}, {"text": "How...how could you <b>NOT</b> think to perform a clean (Windows) install, when switching to an ENTIRELY new platform? O.o  /bumfuzzled"}, {"text": "Comparing 8-Core to 6-Core while talking mostly about multi-threaded performance/multi-tasking. Scientifically, I would call this... normal."}, {"text": "Wha-a-at? You mean a brand new processor architecture needs a lot of bios updates? Say it ain&#39;t so!"}, {"text": "You saved 10 hours of render time but did you spend less than 10 hours diagnosing and fixing all of the problems you had?"}, {"text": "Yeah I&#39;m really happy with my Ryzen 7 1700 build. Can&#39;t get it past 3.8Ghz on the OC but that&#39;s enough for me.<br />I think the Meshify from Fractal is really sexy. Bummer it wasn&#39;t released yet, when I build my PC. But I love my Phanteks P400S TGE anyway."}, {"text": "I did put my SSD from my notebook into my desktop PC a while ago whitout reinstall, and after the 10th BSOD, I realized that was a pretty bad idea."}, {"text": "I have an 1800x and 1700x.  I&#39;m a Software Engineer and computer hobbyist.  They are absolutely great chips."}, {"text": "what&#39;s the name of your &quot;INTEL CASE&quot; ? just the case"}, {"text": "My experience with r5 1600 and 8GB ram, opening 30+ tab on chrome didnt make it bow down LOL.."}, {"text": "If you switched to Amd, why not get a full amd only build?"}, {"text": "How is ryzen on virtualization? Thinking about getting it for multi boxing mobile games on multiple android emulators.<br />intel vt-x vs amd-v for virtualization? any pro suggestions?"}, {"text": "Pals Darnass lead This is  really   mythicap  {ideo drop"}, {"text": "Hi! Can you please post a link to that external Silverstone external unit? Thank You!"}, {"text": "that 40 hours a week 😂😂😂 it looks like and ad even when i like ryzen 😂. anyways thanks we have something which is more helpful than a benchmark."}, {"text": "Ryzen, all new architecture, of course the BIOS updates are going to be needed. You didn&#39;t even bother pointing that out. The RAM compatibility you should be able to hit 3200 now. I have some Hynix memory, which is normally crap on Ryzen OC to 2933. OCing on Ryzen is just way more involved than Intel. SOC voltage, ProcODT ohms settings can help a ton with getting stable OC on your RAM. Geardown mode is another one that can help if you can&#39;t quite run CR 1.<br /><br />Of course software is going to have to optimize for Ryzen because of the infinity fabric and CCX cores being a way different configuration to Intel CPUs, which EVERYTHING is optimized for, for years now."}, {"text": "Ryzen 5 1600 @ 3.39 (Stock cooler) with Corsair 2x8G @ 2933 on the Gigabyte AB350 Gaming 3 with ASUS 1050 EX (2GDDR5) most games i play on ultra settings 1080p like bf1 45+fps , bf4 60fps ,etc. and its just great i started loving AMD with the Ryzen processor and i highly recommend it for everyone"}, {"text": "How meany FPS you get in CS:GO after OS reinstall?"}, {"text": "I jumped this year from 2500k/780ti to 1700x/1070 and i am super happy with it. My Ryzen also runs at 4,1GHz on all cores with 1,35v."}, {"text": "Weren&#39;t you in Guardians of the Galaxy?"}, {"text": "I would suggest cleaning up the timings on the RAM a bit and higher RAM OC.  Ryzen really likes better timings(CAS latency) and you should be able to get better speeds out of the memory.  Those are really easy to do and should help with some of your issues with Adobe products in general.  Adobe likes the same stuff Ryzen likes on RAM.  When it comes to the usb issues I don&#39;t have that same issue.  But I&#39;m using an Asus rog crosshair vi x370 mb."}, {"text": "what about thermals ?<br />I noticed an air cooler for the processor.<br /><br />Would liquid cooling and increasing frequency to the processor make any good changes ?"}, {"text": "I&#39;m running a Ryzen 7 1700.  It is very comfortable at 3.6 GHz and 1.2V.  I&#39;m very pleased to be supporting AMD again."}, {"text": "An excuse for a fresh install is a good upgrade."}, {"text": "I&#39;m still going with coffee lake intel. If it ever stays in stock lol."}, {"text": "RY ZEN VS SKY LAKE  YOU SAY RY ZEN WOULD COFFEE LAKE MAKE A DIFFERENCE"}, {"text": "what is that blue and yellow 6 wheeled lego looking truck next to your keyboard?"}, {"text": "watching the RYZEN videos with interest. Most interested in the performance with Capture One and Resolve 14 Studio."}, {"text": "My experience with the Ryzen 1700X has been similar. I was really blown away by how much multitasking I can do, like streaming at high bitrates, while still browsing the web and checking email with no noticeable slowdown, while also running video renders in the background."}, {"text": "I cannot understand why people complain about the necessity of frequent BIOS updates and tweaks when they are dealing with new technology. Hello, it&#39;s a new fucking processor with new and advanced architecture, of course it&#39;s going to go through an adjustment period. I can&#39;t stand when people say stupid shit like, &quot;well I don&#39;t ever remember needing to (insert operation here) with my Intel CPU&quot;"}, {"text": "How can he save 10 Hrs of render time and waste far more hours with the Ryzen stability issues (external HD, USB, Adobe, USB, etc)? Ryzen stability should improve over many months as apps and hardware are tested. But who has time to wait around  &amp; reading countless forums for solutions? I applaud his forthcoming review highlighting good and bad."}, {"text": "What ever happened to the external storage box? I&#39;m curious how well it worked for you."}, {"text": "Why are you previewing your project in the full resolution? You’re stuffing pixels where they don’t exist!"}, {"text": "So this is worth it for youtubers and 3D renderers. Tasks most people don&#39;t have on a daily basis."}, {"text": "What&#39;s your monitor? I&#39;m interested in getting UW display or 4K"}, {"text": "Wondering how this compares to the new Coffee Lake architecture."}, {"text": "Who renders stuff????... so stupid, people surf the web and play games."}, {"text": "Shout out to that Squad download ;)"}, {"text": "i use 1k raspberry pi,s stack faster than anything you can buy apart from a quantum computer lol"}, {"text": "Every Video i See from these tubers.... they&#39;re cowboys, they make simple mistakes... They&#39;re winging it..  it&#39;s cringeworthy/"}, {"text": "And just for gameing ? is it any goog for that `?"}, {"text": "Intel have less latency cause its working with 1 die only in real times audio, calculation intel still a lot better than amd (probaly his baddest point) but amd can handle lot of info without overloading  (multitasking)"}, {"text": "I remember the good old WoW days when I used my AMD Athlon 3200+. Everyone knew AMD CPU&#39;s were better for gaming. I haven&#39;t done a lot of research but it looks like Ryzen is better for streaming."}, {"text": "Love the checkup"}, {"text": "Had the same thing with the reinstall just plugged my drive in and went for it. <br /><br />Only after I borked my SSD Samsung sent me a replacement so I went for a fresh install, FPS in some games doubled was insane. Took me 2 weeks though with my replacement drive to realise I wasn&#39;t in High Performance mode though.<br /><br />Only bug that&#39;s still annoying me is when I wake up from sleep the computer slows down, time desyncs and games run slower or weirder mind you being able to boot in 8 seconds it&#39;s less of an issue more an annoyance."}, {"text": "Hey, I&#39;m new to computer building, but this video really deterred me from going with ryzen. I spend a lot of time with adobe prodcuts, as well as blender. Can someone help me out?<br /><br />But also, how much RAM are you using? Frame drops are extremely common if you are running 16gb, no matter what your system."}, {"text": "Looking forward to your reveiw of Coffee​ Lake, i think the 8700k Will beat 1700x overall big time."}, {"text": "Seems like it&#39;s not fair to make half of the review based on a old windows install..."}, {"text": "Plus AMD usually supports their sockets for the long run, whereas anyone using Intel the past year and a half, has seen about 5 platform changes.<br /><br />Now you should make a workstation PC with one of the Threadripper chips, it&#39;ll blow away the Ryzen for this kind of work."}, {"text": "Switching from Intel next upgrade"}, {"text": "i have a 1700x build as well and am running a TridentZ RGB 16GB kit and I noticed a very clear performance boost between 2667 and 3200Mhz. try getting a 3200+ on your ram and let us know?"}, {"text": "Hey Dmitry, what DAC and AMP do you use with your 6XX? I&#39;ve got the 650 and am looking for an AMP to power them. I&#39;ve already got a Cambridge audio DAC, but I really need an AMP to power these."}, {"text": "Love my Ryzen 1700.  I don&#39;t have a particular hate for Intel except for the fact they haven&#39;t done anything innovative with processors for the last 7 or so years due to lack of competition, which was when I had bought my sandy bridge processor. Multi threaded wise Ryzen still beats the new Intel coffee lake processors especially when you consider price to performance. I will purchases AMD as long as there isn&#39;t a significant performance loss compared to intel, because having a choice due to competition is by far the most important thing to me. To be frank there still isn&#39;t enough competition."}, {"text": "Ryzen 1700X @ 3.9 GHz and I&#39;ve had very few issues at all. I can only get my RAM to 2933 MHz but I&#39;m sure if I wanted to I could loosen the timings and get it up to the advertised 3200.<br /><br />I built this as a machine for multitasking, rendering, streaming, etc, but since I&#39;ve been so swamped it&#39;s been pretty much just gaming when I can and multitasking, which it takes down no problem. Can&#39;t wait to upgrade to a hopefully smoother and more polished Zen 2."}, {"text": "Be sure to turn off Windows desktop scaling when using Adobe CC products.  I&#39;ve noticed both Lightroom and Premiere run really badly with it turned on, took me a while to figure that out.  I think it&#39;s a known issue but there is no fix available right now."}, {"text": "So it&#39;s do it right the first time and everything is fine ...lol"}, {"text": "Everyone knows when going to a new system, you need to format, if you want a proper stable system. Why talk about all those problems for 10 minutes, with out saying what the problem was first?... ffs..."}, {"text": "I get 300fps on CSGO low settings with a 1070 and  Ryzen 1700 3.9GHZ :^)"}, {"text": "Memory issue ? You are kidding right ? My corsair vengeance lpx cl16, 3200mhz easily reached 3200 with docp mode thanks to recent bios update on my b350 strix, rock stable with my 1600x oced to 4ghz(without voltage increase). Ryzen is the way. By the way, forget expensive gskill memory kits, corsair vengeance is perfect and cheaper"}, {"text": "+HardwareCanucks And what about Ryzen for designer programs like AutoCAD, Photoshop, audio editing, etc? Does Ryzen beat Intel in those programs too? As I see the Ryzen multicore is good for video editing, but did you compare it with Intel QuickSync? Ryzen is still better without QuickSync for video editing? I am neither Intel nor AMD fan, just pure power matters atleast 5+ years for me in a cost efficient way.<br />I am just asking because I&#39;m planning to upgrade from i5-4590( I had before fx 6300) to i7-7000k or ryzen 1700(I&#39;m not sure the x version worth 100 USD more here). Back then I had fx6300, but unfortunately most games and programs(80-90%) used only 4 cores despite of AMD releasing 6-8 core CPUs, so I hope this won&#39;t happen again with Ryzen. I know that I will need CPU power even 5+ years later for everyday work with AutoCAD, audio editing and gaming. Which CPU do you recommend, i7-7700K or ryzen 1700?(Both price&#39;s are around the same, the 1700X costs about 100 USD more)."}, {"text": "3.92GHz on a Ryzen 1600 and it runs VERY cool. Can run 3.95GHz but I stepped it back just to be safe. So far 3.92GHz has done well doing some pretty insane stuff! Next upgrade will have to be an 1800X, I really want an easy 4GHz if I am going to upgrade. That or I will wait for the next gen. Even with 6 cores, multitasking is amazing. Using OBS while gaming at 21:9 while listening to music and a handful of other things goes without a stutter paired with my EVGA 1060 6GB Super Clocked. Oh and this is with a stock cooler. I am VERY impressed. I only have 4GB&#39;s of system RAM in at the moment too! Waiting on the rest to arrive!"}, {"text": "when you render at high bitrate but YouTube caps at 17 mb/s <br />Feelsbadman"}, {"text": "I&#39;ve been running a 1600 @ 3.75GHz for a few months. It&#39;s great!"}, {"text": "I get it, new architecture, new system, bound to have hickups. Except that this was exactly the same reason why I spent a lot of money on my Intel based system 10+ years ago. The hickups the stuttering the memory based management and pc restarts were all there. I&#39;m not going back to that ever again.<br />Just as you wouldn&#39;t swap out your Tesla to a Ferrari. Looks cooler, much faster and you might get to a from b faster but you would need to spend a LOT more money on it constantly and noisy as hell, works with gas instead of electricity.<br />To me this ferrari is amd vs. a Tesla (except, i get it, amd is cheaper now)..."}, {"text": "My experience has been really good so far except a few crashes but still using old disk so that might be the problem"}, {"text": "2666 on memory? Weird, I&#39;m running 64GB @ 2800 and I didn&#39;t even try. Maybe I&#39;m just lucky. And yeah, a lot of Adobe apps are not threaded very well."}, {"text": "OF COURSE ITS WORTH IT. AMD will only get better and better the more money they get in sales, and eventually be a strong competitor against Intel, like it was in the past, when AMD falls off then intel gets lazy and greedy, you must support AMD to ensure that computer processing improves, because monopoly is bad for everyone, when AMD is hitting their peaks its worth to buy their processors, I bought an AMD back in 2002 and it was killer, I loved that piece, but Dell Kiked me and only sold intel, as I wanted to get my first dell back then because I&#39;d never had one before."}, {"text": "What kind of PC enthusiast are you that you don’t do a clean install specially if you are changing mobos and CPU!"}, {"text": "Digital Foundry found some strange things with ryzen, when they tested game performance on Windows 10 and 7 it performed better on 7. <br /><br />Though I&#39;m guessing it&#39;s because it&#39;s a new platform that is using software made for Intel, it&#39;s only early days.<br /><br />Another thing is the AM4 platform will be used in the next few years unlike Intel changing them every time plus Ryzen in the long run will get better with improvements coming next year."}, {"text": "can i ask you something bro? <br /><br /><br /><br />how&#39;s groot?"}, {"text": ":)"}, {"text": "I had issues with my R5 1600, when working with thousands of RAW photos from my Sony A7II...i thought that my system is having a hiccup or something...<br />and I just realized that one of my HDD where on faulty status...<br /><br />When I switched to a new HDD, the hiccup was all gone, and running as fast as it could<br /><br />And yes, i realized all of these, after couple of months using new Ryzen system..."}, {"text": "Ryzen is unoptomized for Adobe Lightroom or is there some problem with the Lightroom?"}, {"text": "You could edit on 1 then save it as a project then render it on the other pc"}, {"text": "I love my Ryzen 7 1700. I got it for $270. Overclocked it to 3.85GHz. My previous CPU was a i7 4770k. Waiting till tax season to upgrade my Zotac 980 ti Amp Extreme."}, {"text": "I enjoyed your video,I am still on 3770K from 6 years ago and I am a gamer.I want AMD so bad but I think I will wait,no real difference in gaming so far."}, {"text": "Did you remember to install the latest AMD motherboard chipset drivers?"}, {"text": "what was the silverstone box &amp; what alternatives are there? that said, i think i&#39;d want only a single drive with an on/off switch, there was one DIY channel that did a one physical button turn on an internal drive+backup, would be cool to do that since i wouldnt need a large drive during every boot"}, {"text": "I have a high end gaming PC and I&#39;m going to be streaming through a separate PC for Twitch/Mixer. I&#39;ll use x264 encoding on the streaming PC so I was thinking a Ryzen 1700 might be the way to go. Or is Intel (at a similar price point) still better because of instructions per cycle/second? I&#39;m just using an older GPU on the streaming PC for a display, not for encoding so I need the best streaming x264 CPU."}, {"text": "Also for a brand new architecture, there will always be aome issues. Plus I would not put it past Intel to put as many roadblocks as they can in AMD&#39;s way."}, {"text": "Lastly... You made an entire video talking down on Ryzen because you failed to follow their recommendation to run off of a clean install of Windows 10. It&#39;s a MUCH better platform for a plethora of reasons, and I promise you most people won&#39;t miss the 7-13% increase you get in FPS ONLY at 1080p going with an i5/i7"}, {"text": "You&#39;re going to have to entertain a lot of updates and revisions on a new architecture... Everything&#39;s been designed with Intel in mind as they&#39;ve been the industry leader for God knows how long... He happy that there&#39;s competition and innovation happening and stop trying to rip apart a company that is assisting the consumer and progress of much better technologies at affordable price points.... This video is really unnecessary."}, {"text": "Not sure why this has so many likes this is a bullshit, biased review... So many inaccurate complaints about a lot of &quot;issues&quot; that have already been fixed. Gaming on my 1800x is much smoother than my 7700k in Battlefield... What the fuck is he talking about??"}, {"text": "I got a 8750FX and a Phenom 995 to trade for a 1700X. You read that right. 12  cores for your 8 cores. And it comes with a blazing 30 GB of DDR3 RAM in total. I&#39;ll settle for 16 GB DDR4 @3200 with that 1700X. So you&#39;ll get 2 CPU&#39;s with liquid and air cooling, 2 motherboards, 8 sticks of RAM in exchange for a 1700X with proper cooling, the AM4 mainboard supporting it and 2 sticks of 8GB DDR4  @3200. That is such an awesome deal, 2 computers in exchange for one while getting 4 more cores! Imagine how much more you can do with this! I&#39;ll even give you free shipping, that&#39;s all on me. So what do you say| :D"}, {"text": "Sorry, the 1700X turned out to be one of the biggest pieces of crap of all time.  What a waste of $500.00 bucks!"}, {"text": "So I bought this prebuilt pc with ryzen 3 1200 with a A320 motherboard should I upgrade it by buying a motherboard then the cpu or the cpu then the motherboard I&#39;m planning on buying a ryzen 5 1600x"}, {"text": "So basically use Intel when editing and use Ryzen as a render server. :/ Oh well.....I wish there will be motherboards that can dual chip Ryzen and Intel."}, {"text": "Great review. I am sold going to stay with Intel.   Thank you!"}, {"text": "Good to know the clean install fixed your problems. i am about to upgrade and i was just going to keep my same install from a intel system im now not going to do that"}, {"text": "hey i am planning to upgrade to my CPU and GPU, my primary use <br />is to record game-play  and stream with obs studio and i would use 2 <br />monitor 1 is 1080p for primary game-play and the other monitor is 720p <br />for secondary purposes, i planning to buy ryzen 1600/1700 or i7 8700k or<br /> i5 8th gen CPU, and for GPU i am planning to buy 1060 6GB, however i do<br /> have 1050ti oc edition form zotac, will 1050ti perform better with <br />streaming and recording game-play or do i need to upgrade to 1060 6GB <br />for future proof, can you kindly suggest me a good CPU &amp;  GPU <br />please??<br />my current specs<br />cpu- intel g4400<br />mobo- gigabyte B150 ds3h<br />GPU-  zotac 1050ti oc edition <br />ram- hyper X 8gb (1x8) (2133)<br />stock cooler<br />SMPS- 500 watts cooler master<br />should I upgrad my power supply?? and will 2 monitor work fine in 1050ti oc edition?"}, {"text": "Wait until you get a 8700K. Your render times in premier will drop dramatically. Getting it to 5 Ghz with some 3200Mhz ram will give yoy roughly 1.5x the render performance of the 1700x."}, {"text": "Why is it so bad at LR and PS?, I use that a lot too :("}, {"text": "An actually useful review!"}, {"text": "i5 8400 or ryzen 1600 for gaming?( Gpu: gtx 1060, ram :8gb)"}, {"text": "Review after 3 months, properly stating to do a clean install in order to get the best performance, and going into popular hardware/software. Great unbiased, and properly timed review! Also, the bitrate increase is definitely making a difference. Video looks great, couldn&#39;t tell what it was until you stated it out!<br /><br />Recently sold my i5-2500k(7 year old) machine since I never use it anymore, but still in need of a desktop for heavy usage &amp; gaming apps here and there. Love how budget friendly Ryzen is while still providing great performance. Don&#39;t want to spend a fortune again on something I won&#39;t be using on a day-to-day basis."}, {"text": "Running my 1700x 1440P and 1080ti max settings on any game i have come across."}, {"text": "Fall creators update will deliver much more performance for ryzen and other many cores CPU"}, {"text": "Once I got my memory stable at 3200 mhz and higher I love my Ryzen system.<br />I do some video conversion gaming and music while constantly you tubing so it works great for me."}, {"text": "Talking from my 1600x build, I swapped the motherboard and memory plugged everything in again and bam, worked like a charm (even with my MB that needed to be RMAd). I haven&#39;t had any issues with anything. Yes you can&#39;t tell the games apart that are actually optimized for Ryzen and not. Didn&#39;t reinstall anything. Overclocked it runs at 54 degrees on air O.o"}, {"text": "Love your channel mate, your videos are very professional and you explain everything, its not just your opnion but you show some facts too... Well done!"}, {"text": "Always do clean OS Installs.  ALWAYS.  It&#39;s so important."}, {"text": "I Also had to Refresh the Windows 10 OS , I think the firmware has a Glitch / Bug , whatever they call it . Bug fixes , But, I found after 2 months that the bios was`nt Properly updating . I reported it and found everything to working just fine now !!! I also had an GPU update that was`nt Properly running as well . After reporting the issue , I have not had a Problem Since !!! going on Nearly 6 months now . Very happy with the New addition to my PC work space , even though it is just a R5 1500X Skew . Hoping for an update in the Future to the , at least , R7 1700X skew , or even the R7 1800X , What ever happened to the R7 1800 skew ??? Was that a limited time production , I have`nt seen it since Launch . Ive looked every where for it . i DO remember the release of it but have not seen it since nor have i seen but a hand ful of vudeos on the skew . Hmmm Maybe i will look some more . Any way , Another Great video D !!! KEEP UP THE GREAT WORK !!! PEACE BRAH !!!"}, {"text": "what was the case on the intel machine ?"}, {"text": "All these issues aren’t AMD problems they’re software developer problem that need to get their act together and start optimism for Ryzen"}, {"text": "What case is that?"}, {"text": "I too was having crashing issues with my Ryzen 1700 system until I switched to the Asus 1701 BIOS. After that, it was much more stable. I also was able to OC my system to 3.8Ghz and my RAM is stable at 2800Mhz."}, {"text": "Happy Ryzen 1600X owner here. 3.9GHz and 3200MHz RAM on MSI Gaming X370 motherboard. have not had any issues whatsoever as a daily driver in 3 months. Rock solid. Most stable PC I have owned so far. Not as fast in games as Skylake but close. Coffee Lake is going to rock! But I will stay on this for now."}, {"text": "Coffeelake=Paper launch"}, {"text": "I love my 1600x, with a asus mother board I was able to overclock it with one click of a button to 3.9ghz @ 1.375 volts. With a corsair liquid cooler it never gets above 70 degrees even under hard benchmarks. I also had no problem getting the memory to run @ 3000mhz all I had to do was load a pre loaded profile took about 4 seconds to do. This machine has handled everything I throw at it with ease. This was my first PC build ever and I&#39;m so glad it got through it with no hiccups at all."}, {"text": "Dude,  I&#39;ma fan of yours, but not seeing the need to clean install an OS is unacceptable for a reviewer. However thanks for being brave enough to accept the mistake publicly and correct it."}, {"text": "Wait but I&#39;m getting 300fps + in CSGO on a FX 6300 + GTX 1060 build??? Ryzen wut?"}, {"text": "Thank you for not starting off &quot;herp derp gaming&quot;. Ryzen just aint gonna be worth it for that market, good stuff."}, {"text": "The 1800X would&#39;ve been better than that 1700 for your proxies. I have two stable 1800X systems. One is overclocked @ 4.155Ghz and the other is overclocked @ 3.9Ghz. My workloads are running like a beast now. Also, I&#39;ve compared my overclocked systems to my brothers 1700 system which is clocked to 4.0Ghz. Although it is a bit slower, my lower clocked 3.9Ghz Ryzen 1800X system wipes the floor with his 1700 system! My girlfriend just decided to sell her i3 pc. She&#39;s upgrading to Ryzen. After seeing my 1800X&#39;s performance she has decided to get a 1800X because she has a fashion blog and we both agree that the 1800X will pay for itself after she&#39;s edited, rendered and uploaded her first video to her blog."}, {"text": "No Ryzen isn&#39;t un-optimized for Lightroom, lightroom is un-optimized for Ryzen. Adobe makes shit software and isn&#39;t even keeping up with using more threads on high-end CPU....which is what you&#39;d imagine content creators are using."}, {"text": "Make the move to Atomos external recorders and Pro Res dude. You will never have a dropped frame again."}, {"text": "Question dimitri. Is it worth it to upgrade to ryzen platform from am4 even though gpu&#39;s are hard to come by?"}, {"text": "Ive always loved AMD. But Intel usually has the upper hand in refinement and software quality, as well as developer and company ties that make the products almost required for Microsoft to live on. I think Ryzen will eventually mature like FX series did. But it sure is taking forever. Its not like Intel where 99% of any funny business gets fixed in the first month of launch."}, {"text": "You mean to tell me you&#39;re gonna trash talk ryzen when you didn&#39;t even bother to update bios let alone do a clean install. I only updated my bios and none of your issues happen to me on my 1700, you&#39;re obviously intel fanboying quite a bit in this vid, disappointed in you."}, {"text": "STOP FUCKING TOUCHING THAT SCREEN! JESUS. So basically AMD sucks."}, {"text": "I need help . please give me suggestions on external 4 or 5 bay hdd enclosure with usb 3.0 or type c with support for single, raid 0,1,5 and so on but no jbod please. leave suggestions below and thanks in advance"}, {"text": "After that BULLSHIT 8700K review and the obvious Intel shilling you guys do, I&#39;m gonna say pass, I don&#39;&#39;t give a fuck what you guys have to say anymore, goodbye, unsubscribed."}, {"text": "What did he upgrade from?"}, {"text": "???   why would you not have had a clean install for Ryzen ...that is a little un fare to AMD if you have been tweeting re problems which was to do with you not the system ..thx for being honest re this and the video"}, {"text": "Excellent analysis video Dimitry"}, {"text": "AMD so bad yet so good compared to Intel. Those guys at Intel must be chewing their hankies."}, {"text": "oh shit! I&#39;m waiting for my purchase to arrive, and NOW I&#39;m hearing about problems with Lightroom?!<br />Oh well, at least I hope it won&#39;t make Tensorflow slow."}, {"text": "I WANT THAT RGB FAN FRAME"}, {"text": "If you have 2 machines, then why not just use the Ryzen machine for editing and the intel machine for everything else?"}, {"text": "ive always been with amd, but im waiting to see how cannon lake goes, 8700k isnt much better than the 7700k from what ive seen so far, so coffee lake doesnt seem like the best upgrade path for me, if the next ryzen cpu&#39;s have faster single core performance than the coffee lake cpu&#39;s then i might stick with amd, but gaming on this am3+ platform has been a bit frustrating, its taken me 4-5 years to get it stable lol (9590 lyf)"}, {"text": "why are u not using the 43inch monitor??"}, {"text": "Coolto see somebody really uses as much the ecosystem that it feels like he s using every bit of the chips inside it and exploring. Wish i could learn too making videos and using my machine like that."}, {"text": "Which monitor should I get for 1000$"}, {"text": "User error.<br />As soon as you said you threw an existing OS onto this system from Intel to AMD and did a repair install, I stopped listening."}, {"text": "One of the few channels that turns an ad into an art."}, {"text": "I have a 1700x and when mining you can only use 8 threads with monero. Otherwise the hashing power goes down."}, {"text": "This is very informative! 👍🏻👍🏻 Opens up another option for me to choose on upgrading my i5-2400 CPU and DDR4-1333mhz which I’ve been using since 2011."}, {"text": "Also... Ryzen is cheaper? At least right now it is... or is the new intel stuff cheaper? idk."}, {"text": "man i have my 1700 at 4 ghz and my 3200 b-die now at 3466 wit 14-14-14-34 timings...<br />i have reached 4.15 so far on my cpu and 3600 on memory with 16-16-16-36 timings..<br />i dont have the issues you have...at all...you must be doing something wrong or you have a old bios<br />and im running 5760 x 1080 resolution plus a 4th screen and my system is actually running very very cool"}, {"text": "Do I spot the new Corsair RGB fans on the shelf behind you? Guess we can expect a review of those very soon"}, {"text": "ALWAYS fresh install when changing a motherboard..."}, {"text": "Been on Ryzen 5 for a few months now coming from a 4690K... It&#39;s fantastic. I haven&#39;t noticed slower framerates in games. I&#39;ve perhaps lost a frame or 2, but nothing I&#39;ve noticed. In multitasking and general use, it&#39;s been much smoother. I think the vast majority of users would be happy with either, but I&#39;m glad to support innovation, so Ryzen it is."}, {"text": "99% of people don&#39;t render video, cool review"}, {"text": "eco-system? wait wut?"}, {"text": "I really appreciate this video."}, {"text": "Well kinda funny that you brought up lightroom and that it didn&#39;t work well on Ryzen. I decided to go with Ryzen and your first video was one of my deciding factors. My main goal was to speed up Lightroom which is a terribly slow program on most machines. I was previously using an older i7 processor and a standard HDD through SATA. My new one is a Ryzen 5 1600x and a 1TB M.2 drive and it is blazingly fast (as blazingly fast as LR can be lol) compared to my previous computer. Imports are quicker and I have almost no load times when cycling images. I&#39;m using the MSI x370 Gaming Pro Carbon board. LR doesn&#39;t really make use of the graphics card except for one specific function so it doesn&#39;t really factor much into it from all the research I&#39;ve done. Tony and Chelsea Northrup have a good video on LR computers and that is where I learned that storage speed is everything for LR. I&#39;m enjoying your videos and glad I found you. Keep up the good work."}, {"text": "What&#39;s that case"}, {"text": "Ughhh so torn between the 8400 and the 1600 😑😑😑"}, {"text": "I&#39;ve had zero issues running my Ryzen 7 at 4 GHz on my ASUS Crossfire VI Hero. I&#39;m also able to run my Corsair Vengeance memory at 3066 MHz with no problem. I don&#39;t understand the issues with hitting 4 GHz on a supposedly faster chip. It doesn&#39;t make sense. I&#39;ve no crashes or reboots ever at 4 GHz and my 1700 was only $269. It&#39;s a great CPU and great value."}, {"text": "Lightroom is the slowest pos ever"}, {"text": "im at 3.925 ghz at 1.38 volts..... 3400 mhz ram speed (2 sticks of trident z for 16 gigs) at stock voltage and timings <br /><br />no problems at all.... no frame drops or bugs in my coding programs.....<br /><br />you defiantly seemed to get unlucky with the silicon lottery."}, {"text": "n ligo"}, {"text": "Ryzen I find still is a vary vary new like for example 1st ddr 4 memory controller"}, {"text": "How are you not able to push the frames on LOW in CS GO? No joking serious question.<br />Buddy of my pushes 200 with ease on the R5 1600...! Are you sure all is well with the system?"}, {"text": "Where can I get that Ryzen wallpaper?"}, {"text": "So i have a 1700 running at 3.8ghz at like 1.3V iirc with 16bg of corsair Ram running at 2993mhz on a gigabyte ab350 (newest bios) and i have been suffering from sudden &quot;Memory Management&quot; Bluescreens during rendering or sometimes gaming. Might try clocking down that ram."}, {"text": "This video is total bullshit. It took way too long to disclaim you basically totally screwed up by being lazy."}, {"text": "Can I run VMware workstation on Ryzen with emulation on different vms ?"}, {"text": "Great review. As usual."}, {"text": "the lightroom and other weird quirks, crashes is why i went back to intel"}, {"text": "in best regards...ryzen single thread perf are highest on 1600x, 1800x &amp; 1950x..other than that. slower."}, {"text": "Why would you ever swap hardware without reinstalling the OS??? This is crazy to me. Of course remaining drivers etc will  cause problems. Why would you trust Microsoft to clean your machine for you? It doesn&#39;t take much time to format a drive and reinstall. I pretty much end up doing this on a yearly basis at this point to keep my machine clean and quick."}, {"text": "Thing is intel last true arch was Nehalem and Skylake, new chips are minor revisions. Ryzen is stable as a rock now (after may updates)."}, {"text": "Wow 40 hours a year in savings is HUGE when you are doing that kind of work."}, {"text": "Now it&#39;s possible to run some 3800-4000Mhz CL19 @3466 CL14 on Ryzen, some brutal improvement even if you are running 3200 CL14."}, {"text": "When you swapped your OS drive to the AMD system you mentioned doing a &quot;refresh&quot; of windows. Was this window&#39;s Sysprep you ran or something else? I ask because I was planning to use Sysprep when I make the switch since it&#39;s supposed to make the OS hardware-agnostic and reinitializes all hardware detection/installation.  I&#39;m an IT professional and regularly use Sysprep at work however I have not done an OS drive swap with it to Ryzen yet- though I have built Ryzen systems for work."}, {"text": "very goog review ! much better than this short term reviews from  most of the  well known reviewers !"}, {"text": "I recently built my first ever custom PC around a Ryzen 5 1600, and it has served me very well. but i only edit in 1080p, not 4k. and i am running a gtx 1060, not a 1080. No bottlenecks, so stutters in editing or gaming. I was able to his 3.8GHz on the stock cooler and XMP is rock solid with my 3000MHz CL16 ram kit. <b>I love Ryzen!</b>"}, {"text": "CPUs don&#39;t get optimized for video or picture editing software... It&#39;s the other way round and Adobe hasn&#39;t spent any time in doing Optimizations for Ryzen."}, {"text": "4 minutes into the video talking about problems you disclose you didn&#39;t do a fresh windows install? That&#39;s SO LAZY! Where is the due diligence? You enjoy building toys and shooting b-roll but then you don&#39;t do the software side properly? WTH man? What does this say about any of your previous reviews/benchmarks?"}, {"text": "Yikes too many problems, I&#39;ll stick with Intel for abit longer"}, {"text": "your desktop wallpapers are beautiful, where can i source them"}, {"text": "when u are reviewing something,do some research or work before doing it,,"}, {"text": "Threadripper when?"}, {"text": "you need the x370 board like hero or the rog board , for the multi drive ."}, {"text": "lol the bottom fan on the crossair case is about to fall off lol , no crossair for me :)"}, {"text": "R5 1600 @ 3.85, DDR4 3000 @ 2933. No issues here, superb value for money. Thumbs up! Thanks for the review!"}, {"text": "No, it did not hold up.  It was quickly destroyed by Intel&#39;s chips......in all aspects.  Even if Intel costs more, it&#39;s overall better in various ways, either faster per core or faster overall, with cheaper motherboards (which can negate the extra cost), and has a better usable shelf life in general.  So congratulations AMD users....you got played.  You paid to barely be top dog for like 3 months.  Meanwhile, those who went Intel will be top dog for <b>years</b> to come."}, {"text": "Being an early adopter of the R5 1600 was a bit of a headache, between trying to get it to at the very least accept the XMP profile on my 3000MHz Ballistix, which I had to settle on 2666 for awhile on, and dealing with constant slow boots, I wasn&#39;t sure what to think of it. I was almost tempted to retreat to my FX-8350 and call it a day, but every BIOS update that&#39;s come out thus far has helped tremendously with stability and overclock potential, even letting my RAM go to 3200 now. In the end I probably should have waited a bit if I didn&#39;t want to deal with all those initial problems, but it was well worth it."}, {"text": "Ryzen certainly wasn&#39;t the supreme monster we had hoped it would be, but it did manage to provide a workable platform to do whatever it is you want to do. I agree with every point made in this video."}, {"text": "I don&#39;t recommend that cooler with this CPU if you&#39;re looking to get everything out of it.  Sure, you can use it, but at that point you&#39;d be better off with a NH-D15 if you really wanted air.  These R7s perform better when kept cool.  It&#39;s not just cooling capacity either, it&#39;s how fast it can dump heat in sudden high load.  Water has much better absorption."}, {"text": "My 1800x on a custom loop runs great at 3200 low latency memory. At 4.1ghz core I get 1890 in cinebench R15 multi core and 490 on CPU-z single core. For reference the 7700k gets 494 single core in CPU-z. Increasing my memory from 2933 to 3200 and them tightening the timings raised my CPU-z single core scores from 440 to 490."}, {"text": "Uuuuh really nice case from fractal design &lt;3"}, {"text": "Why i well NOT gona buy ryzen in 3 words : SHIT FOR GAMING ."}, {"text": "This review seems very biased tbh"}, {"text": "Pretty obvious that you sohuld do a clean install on a new motherboard"}, {"text": "So Ryzen has bios and driver issues. <br />Skylake had similar issues when it was released.  Coffeelake will have issues too. Probably just not as many.<br />I actually kind of like getting new bios and drivers, so AMD is great fun."}, {"text": "Let&#39;s use a intel os ssd and base my review on issues that could be attributed to that. Lazy review setup."}, {"text": "I am watching the video and saying something is wrong and it isn&#39;t Ryzen. Then you said I did not do clean install and I laughed, looked over at my 1600X build and thought, &quot;Damn glad I followed instructions&quot;."}, {"text": "I found I had to overvolt the memory to get 3200mhz on a set of Corsair Dominator LED, I don&#39;t think the voltage reported on the motherboards is accurate to the required/recommended voltages on the memory."}, {"text": "rest in peace you were good ... for a while HAHAHAHAHAHAH mm this i7-8700k is nice!"}, {"text": "I&#39;m really happy with my 1700x on a Crosshair VI at 4.0Ghz and 16gb pf Ram at 3.200mhz"}, {"text": "I finally upgraded from my fx8320 overclocked to 4.3 ghz to a ryzen 1600... everything is so fucking fast now. I can stream my art better. Games run better. Multi monitors stuff is better. It is just a world of difference"}, {"text": "I wonder how I7-8700k will match up with the same tasking."}, {"text": "Anyone done a ryzen for music production yet.. I use X5687s Dual Socket LGA1366 for music Production but my MoBo just  died after bios update attempt. (pissed) Intel S5520HCV. Was wondering what ryzen is saying for music production. VSTs and stuff"}, {"text": "You know back in the day you&#39;ve made some really quality and honest reviews. I really preferred your work over that of the most of the other tech tubers. Sadly, it seems like nowadays Intel&#39;s money got the best of you. It&#39;s a lucrative job but ask yourselves for how long will you enjoy the access to that vault?"}, {"text": "So in other words you owned  your self for three mounts cos you were lazy.<br />Its what we call unprofessional,"}, {"text": "RYZEN 5 1600 HERE I GO !"}, {"text": "I have similar problem with adobe premiere and Ryzen 1700 O.C at 3.9Ghz. I know I have to do a fresh install (what a dam work) What nvidia drivers are you using? Thanks!"}, {"text": "Does the darkrock work fine with the flarex ram? Maybe some other suggestions?"}, {"text": "Next time install NZXT 62 water cooler for CPU"}, {"text": "Why am I not surprised, I don&#39;t even expect my system to work if I change graphics vendor. Let alone change all the basic hardware with different subroutines."}, {"text": "I7 4790k to Ryzen 1700 for gaming and streaming worth it?"}, {"text": "what case is thar ?"}, {"text": "Нравится мне твоя подача материала, Дмитрий."}, {"text": "Refugee praise ongoing turn liberal diagnose chemical integration."}, {"text": "I see the video quality difference!"}, {"text": "i love my ryzen but i went from a gen 2 intel core i3 so obv it was gonna be better"}, {"text": "Biostar Mobo, 1700x, 32gb trident 3200 ram, deep cool captain, sc2, and it won’t post despite everything turning on. I only have these issues with ryzen builds. Last time I had to temporarily switch out ram."}, {"text": "Why would you make a video complaining about stuff when it was your oen fault? Don&#39;t you think it&#39;s kind of obvious that you need to clean install windows for an entirely different platform? That&#39;s like....very basic tech stuff."}, {"text": "i just love that CPU cooler"}, {"text": "where are you man? i miss you"}, {"text": "Yup, would be nice to have proper PC to play games like ARK or such with over 40 fps without lags... It&#39;s so fricking expensive to make proper computer."}, {"text": "can&#39;t wait for next review video with coffee lake :D"}, {"text": "Great review, thanks for taking the time to thoroughly test stuff like this out!!!"}, {"text": "Love my R7 1700, i have build 2 with that cpu ;p"}, {"text": "Luckily your 10 hours spent on reinstalling and troubleshooting Ryzen has been catched up with Ryzen :D"}, {"text": "I still have fx-8350 and the good thing about AMD cpus are that they can render at the background without causing significant slowdown on system. Eg. I can watch youtube videos while rendering."}, {"text": "hi nom related sorry but i cant seem to find any or make any headway here, So I&#39;m playing on my tv now and I am struggling it&#39;s a quality TV but I&#39;m finding it hard to spot people and 60hrz is breaking me in fps Ideally I need or want a 120hz gsync 1440p that I can mount. Would really like any suggestions"}, {"text": "@hardwarecanucks which brand is your keyboard?"}, {"text": "I have been using Ryzen 1700 for 2 months now, for web development. It&#39;s been GREAT. I have no way of comparing with a similar intel chip so..."}, {"text": "Sorry, new build using a re-activated version of windows from another computer ? No, no no. New machine, new OS."}, {"text": "Slow lightroom = fail. Intel it is."}, {"text": "So coffee lake is here. Are you guys gonna switch back from ryzen?"}, {"text": "I recently upgraded to Ryzen and (finally) did some testing with it. Long story short, it&#39;s able to record better quality videos at smaller file sizes (by recording at 1440p instead of 1080p with my hardware encoding limits). Using Vegas Movie Studio actually let me use a different encoder with a bit better render times and better render quality. I normally like to render out a file that&#39;s not completely lossless but not Youtube quality so I can use it later for other projects if need be. Been trying to do my own video for it but been sidetracked with life in general (for the past year even) but I think I&#39;m finally closing in on this so yeh..."}, {"text": "Another thing; why did you even bother to cover anything prior to the actual formatting of your PC? AMD&#39;s actually pretty clear about this sort of thing when installing a new CPU. In fact so is Intel. That&#39;s just what you do. The fact that you didn&#39;t is bizarre."}, {"text": "Rendering times and general video timeline work with Ryzen is absolutely superb. <br /><br />I&#39;ve experienced no end of problems through my own fault - BIOS, RAM, Boot times - but the price/performance and savings on the CPU allowed me to move more budget into a GTX 1080 GPU.<br /><br />That just wouldn&#39;t be possible with an Intel/Nvdia build.<br /><br />Great succinct review of the pitfalls and performance gains of the system Dmitry. ✌️"}, {"text": "Do more videos like this when you can. I can&#39;t wait to see your 3 month Coffee Lake comparison."}, {"text": "What about a really complex multitasking, for example AE render + heavy brushes photoshop <br />drawing+3 browsers with online videos? How many (and how much) cores are loaded during render?<br />   <br />Should I buy TR 1920X or 1700/8700K will be enough?"}, {"text": "Everyone says I7 8700/k is better while those people buy a 1070 when the least that you should buy with it is a 1080 ti"}, {"text": "im gng to buy i7 8700k instead of 1700x !!!!"}, {"text": "Wow... a .2 second delay in Lightroom... how can you live like that :o"}, {"text": "@HaedwareCanucks Well bugs are to be expected on a brand new platform with a ground up architecture, think Nehalem in general or more recently Haswell E X99 which wasn&#39;t even a brand new ground up architecture it was only a new platform.<br /><br />Ah I should probably do a reset then because I was having problem with shutters just on the desktop when the system has been on for a while so either I got used to it but I don&#39;t think so or it sorted it&#39;s self out, anyway if you were looking rock solid 100% reliability you don&#39;t buy stuff that is new."}, {"text": "go red team! :D"}, {"text": "meh now cheap evga öld ones önly one fan now i got zöötäG ^ ^"}, {"text": "There are people who buy Mercedes and those who by BMW..."}, {"text": "Unable"}, {"text": "We&#39;re running a Ryzen 5 1600 &amp; also a Ryzen 7 1700 @ 4 Ghz, 3333 RAM low latency timings &amp; rock solid stability. AMD&#39;s come a long way since launch. Had some early hiccups, but as the platform matured, it&#39;s been a great investment. Easy to cool, cheap to run, fast as hell &amp; reliable.<br />The last few years I built so many of the same Intel rigs, it got boring. Now that ppl are seeing the value you get with Ryzen, I build about 3 Ryzen PC&#39;s for every 1 Intel."}, {"text": "Meshify C or H500P i&#39;m looking to get a new case for my Ryzen system and i&#39;m stuck between these two. Thanks for anyone who replies!"}, {"text": "Switch to 1800x"}, {"text": "Oh NO! My #1 productivity application is Lightroom! I guess its Intel for me, at least Ryzen has kicked Intel into better performance and better pricing"}, {"text": "is that an ASUS motherboard? always prefer Gigabyte from not having issues with the peripherals. ASUS rush mobos out of the factory with fancy leds but they are not stable!"}, {"text": "who changes a motherboard and keeps the old os installation? Dimitri this is basic I.T 101! its hard to do it all from scratch sure but you ALWAYS do clean format and installation to the new hardware so that the o.s can install ONLY the needed drivers and not keep garbage that will eventually cause issues!"}, {"text": "When you play yourself by not doing clean install."}, {"text": "why mirror the image??"}, {"text": "Seems like nothing really changed in the last 20 years. AMD is great if you keep up with updates and like to tinker around and aren&#39;t mad by the occasional bug. Intel is usually loads more expensive, but it&#39;s mostly hassle free.<br />This review is great though, Hardwarecanucks for life!"}, {"text": "Its strange that all the amd fanboys complain about the mobo prices for the 8600k when theyre forced to spend just as much on high speed ram for their ryzen systems. Its ridiculous."}, {"text": "Ryzen only problem are low oclocking capabilities which would be fixed with  Zen+ 12nm pinnnacle ridge cpu-s which would come in 3-4 months"}, {"text": "this is not englisgh or american channel!! he have some non american/english accent  ,more like swedish/balkan  and similar"}, {"text": "A clean install could be exactly what I need to solve all of my issues... Amazing video work btw, looks beautiful!"}, {"text": "I appreciate your consistent camera work that is always on point."}, {"text": "Some nice real world scenarios here."}, {"text": "Hi, I was wondering since you will be testing the coffee lake from intel in a working environment when you get it, will you be testing out the 16core AMD CPU&#39;s as well since from price point they are in a similar category? And talking about coffee lake CPU&#39;s is it viable to test them since the time of launch there as not been a single CPU available to purchase?"}, {"text": "I&#39;m running a 1700 @ 3.8GHz and I&#39;ve loved it so far. I&#39;m happy that AMD made some really good chips again."}, {"text": "I&#39;ve been running an 1800x since May, and I had several frustrations along the way.<br />(Asrock Fatal1ty x370, 120gb MP500 m.2, 16GB G.Skill RGB 3000Mhz, GTX 970)<br />So first after getting my Windows install happening (long story short, windows 7 install, m.2 patch, migrate to m.2, upgrade to win10) I managed to kill the RGB on my RAM modules, it just did not want to OC beyond 2400Mhz, so I&#39;ve left it at 2166 on the new kit.<br />I&#39;m still having issues with USB3.0 and 3.0 external drives, they drop connection for no reason and no power settings change has helped.<br />Gaming issues are between the OS and the Nvidia drivers, running Overwatch on lower settings (for lower response rate) causes it to crash (something between the fps from the game and the monitor conflict and Overwatch thinks I lost the graphics driver). Setting everything back to ultra settings with 60fps cap is stable again.<br />Also I managed to brick the first board I bought, an Asrock x370 Killer SLI. I&#39;m planning on doing a clean transfer over to the original board and see if any other problems will be fixed.<br /><br />All in all, no regrets buying this setup. I plan to use it for the next 8 years, or until I simply cannot keep up anymore."}, {"text": "if you have a gtx 1080 what is nvidia, why did you do a radeon driver?"}, {"text": "I already said ryzen is SHIT!"}, {"text": "Isn&#39;t fresh install on a new system the best thing to do when building a new PC? It is the most basic thing to do, if you are an IT personnel this should be the first thing you do. It is on MSDST and A+ course???  Why would you use a OS that has been used on intel then put on amd and expect it to be good? This should be basic knowledge in building PC&#39;s!!"}, {"text": "VBR 60-90Mbps for 3840x2160p30 are u fcking me right now? first of all use CBR and secondly use 35-40Mbps, most of your footage is stable there isnt much movement, go ahead and compare my settings with CBR and 40Mbps vs yours, u are nothing to see any difference, yes even on YT after compression."}, {"text": "Very strange that I can OC my Ryzen 1700 to 3,925Ghz (1.425v) with 3200 15-15-15-38 (G.Skill V). BIos 1.9 from MSI And you are using the Flare memory sticks. So why 2666mhz? North bridge needs to be set between the 1.1v -1.2v and not auto. Also memory needs to be set at 1.5v .<br />So far my system works just fine, but I do see that applications are more optimized for Intel platform. Hopefully this will change in the future.<br />The fact that Ryzen gives us an update next year on the same platform (AM4) is just perfect.<br />I&#39;ve had a couple of Intel CPU&#39;s before, like Sandy Bridge 2600k that OCed at 5Ghz, but after that Intel just seems to get more greedy then ever.<br />No soldered chips, cheap paste with higher temps.<br />And the fact that they asked a too much money if you want more cores than 4.<br />Thank god for the competition and hopefully will see Zen+ early next year."}, {"text": "Save 40 hours a year rendering?  How many hours are wasted updating BIOS, reinstalling Windows, swapping NVMe drives, etc, etc?"}, {"text": "All of this is fucking common sense to anyone with half a brain, Games or the API&#39;s in general weren&#39;t designed for multi core chips over 4 or 6. But this is slowly changing Vulkan is the first one but more are being created to help use more cpu cores. Will cpus be able to relieve some of work flow from gpu&#39;s? Maybe would be nice in the future"}, {"text": "Ryzen 7 - crash more things faster!  (I gave up with the general jankiness of my Ryzen rig and went back to my i7-6850K@4.4 and only regret is wasting time trying to get Ryzen to run stable)."}, {"text": "You can&#39;t compare 4core 4 thread cpus to 8core 16 threads, shit doesn&#39;t work that way sorry!"}, {"text": "Wait. has he always had nose bling?"}, {"text": "Don&#39;t touch the screen"}, {"text": "1st gen adopter. Of course there will be some hiccups along the way. But it&#39;s not a negative thing, thanks to 1st gen adopters Zen2 will be so much better thanks to user feedback etc."}, {"text": "I have the 1900x @ 4.2ghz coming from a 5ghz 7700k, I love my 1900x. Everything seems so much smoother."}, {"text": "I&#39;ve been happy with my Ryzen 1600 for the last 4 months that I have had it. Gaming performance is the same at 3.7GHz compared to my i5 4690K at 4.3GHz so I side-traded in game performance and other tasks that don&#39;t utilize lots of cores, but man. It really does make a difference in multitasking. With some things (such as compiling code and virutalizing) I was limited to doing just those tasks. With this, I can have a lot more going on at once. Still waiting for AMD to flippin release info so I can get CPU temps on Linux though -.- A-OK on Windows obviously and apparently FreeBSD guys said &quot;screw this&quot; and wrote working code anyways. But Cmon AMD, get with the program"}, {"text": "So I have a question that I&#39;d be interested in seeing your opinion on. With the effective death of big multi GPU systems, why are motherboards only getting bigger? I notice all these builds people make on Youtube these days have these massive cases and big motherboards with like, one graphics card and a ton of empty PCIE slots. Why hasn&#39;t mATX come back in a big way? With Intel and AMD&#39;s newest offerings, I notice there is almost zero mATX support, but tons and tons of massive ATX and even EATX mobos. I know miniITX gets a bit of support these days, but what if I want more than 1 PCIE slot, but not a million of them, and want to build in a nice, medium sized case, and get the best of both worlds? Why this trend to bigger rather than smaller and more convenient?"}, {"text": "But can it run crysis?"}, {"text": "La poussière ! xD"}, {"text": "Hesss you have crop the video on 18.5/9 for my s8+"}, {"text": "HardwareCanucks you gotta get the really low latency ram mindblank shows that it&#39;s ALMOST just as viable as the 7700k in regards to high framerate gaming with it &amp; other most applications speed up with it as well..."}, {"text": "I&#39;ve been using my Ryzen 1700 @ 3.9 and 32GB RAm at 2933(or whatever it ends up being) for a few months now.. Nothing but great perforamnce. I came from a 2600k at 4.7. Did a clean install, as I always to this, and I had zero slowdowns and issues. Gaming performance has been about the same as my OC&#39;ed 2600k. Did not necessarliy gain any FPS in many games, but I did not lose any either. But the multitasking.. My god.. It is fenomenal. I don&#39;t have to worry about crap in the background anymore. I can have my brower up with 50 active tabs and game, with NO slowdowns.. and my 2600k would stutter occationaly and suffer from this. As a normal to poweruser standpoint I love my ryzen.. Of course.. Always want more FPS.. But I&#39;m running a 144hz screen with g-sync and 1080 ti. To be honest.. I can&#39;t feel the difference if the fps are around 110 og 144 on my screen with the g sync on. But that&#39;s just me. All in all.. Very happy with my system."}, {"text": "Thank god i didn&#39;t buy ryzen i was about to get it but idk"}, {"text": "Using 1700 for 6 months, no complaints so far,  my 3000 mhz unsupported ram runs at 2933 with no problems, I use it at 3.8 ghz 24/7 with stock cooler.  I upgraded from 2500k, so for me difference was night and day especially in rendering and CPU intensive games like BF1. You should update your BIOS regularly, my board already had 7 BIOS updates."}, {"text": "Shit post. Always fresh install on a new platform FFS."}, {"text": "Is Ryzen not optimized for Adobe Lightroom, or is it the other way around???"}, {"text": "I realize it&#39;s probably going to take some time but can&#39;t wait to see the Coffee Lake comparisons to see if it&#39;s worth the switch for you. Getting ready to buy at the end of the year."}, {"text": "good stuff m8"}, {"text": "just fyi x99 had a  horrible launch"}, {"text": "I hope RYZEN laptops will be available soon.  A surface maybe (wink) I&#39;m a road warrior and that would be amazing"}, {"text": "Awesome video thanks!"}, {"text": "Support RYZEN!!!"}, {"text": "Hi Dmitri, if you want to know why the Adobe Lightroom is slow, it is clearly not the Ryzen&#39;s fault. It&#39;s the fukken Adobe. Adobe&#39;s Lightroom engine is a load of crap. Inefficient and comes with unnecessary modules which is just like bloatware. Also they are not using modern or open source APIs like OpenCL and OpenGL or Vulkan to make use of the whole CPU and GPU power. Even if you use Intel&#39;s highest end Core i9, it will still runs slow AF. Adobe need to get their lazy ass off and fix their inefficient and bloatware Lightroom."}, {"text": "You play squad?"}, {"text": "I love my 1700x I think it was worth it easily coming from a i5 4760"}, {"text": "Hey Dimitry, do you from Russia or do you know talk Russian?"}, {"text": "i see what you did there flipped the video around so your pointing in the right direction you can&#39;t fool me what is is a lie is this hole video a lie who are you where is the real canucks!!!!<br /><br />ps love your vids"}, {"text": "Great review - I had similar stability issues from not doing a clean install - but after clean install, my only remaining issue is high ram latency ( I&#39;m running a gskill hynix die @3200MHZ on an msi pro carbon x370) - around 85 ns is a kick in the shorts on certain processing and ram intense tasks."}, {"text": "Used lightroom on my ryzen System (1700) too, had no Problems"}, {"text": "SUPPORT AMD TO STOP THE INTEL CPU MONOPOLY!"}, {"text": "Cliffs: AMD is garbage, as it&#39;s always been. Intel 4lyfe."}, {"text": "well I am planing to go to a thredripper with with 18 cores ( I know over kill but meah  I dont get a new build to often) with  a 1080 ti and a m.2 ssd in my new build from My old ( and now dead) system that had a Intel LGA 1366 i7 with 4 cores a 780 ti and a old 1 TB HDD so I am excited to see what I can get out of the new build when its done."}, {"text": "PLEASE ANSWER ME. WHAT IS YOUR MONITOR??????????????????????????"}, {"text": "Awesome video, and glad to see some real world testing instead of short term benchmarks, and I know when I do a system rebuild next year, it&#39;s for sure going to be a Ryzen 3, or 5 system with at least 16GB of RAM. The only thing Intel is good for in my work flow these days are Chromebooks, and the one Pentium 4 system I keep around duel booting Win 98SE and XP for old school PC gaming."}, {"text": "someone got the new Corsair LL RGB Fans"}, {"text": "I am new to this Proxie, could someone explain it to me?"}, {"text": "So basically AMD is like the Android of computers.  So many problems but cheaper but if you&#39;re smart those problems are easily fixed you just have to not be lazy and research.  While Intel is expensive as fawk but it&#39;s more polished. <br /><br />In the end I think both AMD and intel hates apple either way lol"}, {"text": "I rather not be the guinea pig and adopt a new untested platform, that&#39;s your guys&#39; job, techtubers ( ͡ᶢ ͜ʖ ͡ᶢ)"}, {"text": "This is why I love this channel. Perfect"}, {"text": "So that must be why my Linux box takes longer to wake from suspend than boot..."}, {"text": "if you have both an Intel PC and an AMD PC why not use one for rendering that renders better and the other for photo editing that does photo editing better with monitor that has a PVM switch with HDMI 2.0 or displayport 1.4a so you can do 4k ? get the most out of them with a high speed direct link to the NAS or to a switch that links both to the NAS <br />For us who cannot afford 2 PCs and a 5 drive NAS well this video probably does not apply but if it does the Ryzen 7 is slightly worse in abode photo editing and way better in adobe video editing thus why use both the Intel machine and the AMD Ryzen machine saving the file once finished to the NAS to share files on and across on the local network"}, {"text": "Just haaaad to hit that 10 minute mark for that revenue didn&#39;t ya."}, {"text": "not sure if it was my ultrawide monitor messing with the aspect ratio or you all using different video samples, but the aspect ratio in this video is all over the place, black bars above and below randomly"}, {"text": "Totally agree that scrubbing with Premiere(AE too) is a sluggish mess, can be really annoying but when you hit render, oh boy... I almost have the same setup, albeit I&#39;m on a non X 1700 and with a Skylake 6700K on standby, I would switch from time to time between my workstations and primarily work on the 6700K and then use my 1700 as a render slave if need to (Media Encoder uncompressed/lossless to Handbrake for web compression/preview)."}, {"text": "Maybe your board/chip combo is a dud. I have seen a lot of Asus issues with Ryzen.  I am running the asrock x370 taichi with corsair lpx and have had no issues in games, autocad, sketchup and sketchup rendering as well as corel and photoshop. Running at 3.9 on my 1700 with 2933 ram."}, {"text": "Legit review. Can&#39;t believe I took months to subscribe."}, {"text": "i switched from a 6700k to a 1700 because of the core count (i`m a 3d modeler and sometimes i render). The 6700 was doing just fine but in render times in vray, corona and others 1700 wins. thankfuly i havend had any issues with the 1700 and ryzen ecosystem . (i dont know how many people acctualy works on their pcs but it would be nice if you could do some 3d aplications testing in your charts) <br /><br />nice review and congrats on your render time saveings"}, {"text": "I had the phanteks halos before they were cool can I have a cookie pls"}, {"text": "ya that win 10 os reset is a joke. Don&#39;t use it I&#39;ve run a few tests in my office. I placed drivers and other markers into the system and after the reset the drivers sys and inf files were still there."}, {"text": "what Nvidia Drivers work in Adobe?"}, {"text": "what do you expect from a new architecture give ryzen the same time to mature as intel has been able to do the last 10 years and let software developers optimize for ryzen sence most softwere and game developers have only had intel to optimize for"}, {"text": "Intel fanboys in denial phase. Next year comes: anger, bargaining, depression and finally acceptance in 2019."}, {"text": "Alright, so basically since Ryzen is such a brand new platform, pretty much nothing is optimized for it yet which is to be expected. If you want to deal with a few strange glitches, bugs, and slight-downright annoying performance slugs in some programs, then go ahead and buy Ryzen because no matter what it is still a better deal than an Intel CPU of the same caliber."}, {"text": "I purchased a 1700 about 3 months ago as well and have been extremely happy with it.  As my main uses are rendering and CAD, I think the 1700 is a great fit without being overly pricey or making and major sacrifices.  I have been fortunate that my chip as had no problem running memory at 3200 and being stable at 3.8ghz with minimal voltage (1.25v).  Makes for a great workhorse and really appreciate your approach to reviewing the platform.  Thanks!"}, {"text": "Just got a new ryzen 1600 5 days ago and loving it!"}, {"text": "Ryzen 3 months later=S.U.C.K.S."}, {"text": "are you the guardian of the galaxy guy?"}, {"text": "everyone is trying to shove the 8700k down my throat and telling me my 1800x is garbage, sick of the intel fan boys"}, {"text": "Is HardwareCanucks the most honest techtuber channel of the big ones on youtube? for me it&#39;s a totally yes"}, {"text": "Is Ryzen better with Linux now? I want a 1600X but I hear ryzen is not good for linux."}, {"text": "Ahem.... why not to use 2 PCs? Sure, you would need to move some files but there are tasks that are independent. Even if you need to move files, a 10Gbit connection to a NAS (e.g. Synology can be used to share &amp; store the files.<br />Oh, you are authorized to use more than one monitor for multitasking. Just sayin&#39;"}, {"text": "&quot;Ryzen is unoptimized for Lightroom&quot;... I think it&#39;s the other way around :D"}, {"text": "1st gen ZEN vs 8th gen CORE<br />intel is polished and amd is prototype<br />no wonder it has issues, its a mark1 prototype or something completely new.<br />which is why I expect to see double digit gains in ipc AND clocks from zen 2 and zen 3.<br />intel can only polish an arch so far until you hit its limits.<br />Intel needs a successor to core and they need it fast or else zen will overtake them."}, {"text": "After only 1.5 months with my new Ryzen 1700, I&#39;m positive, and still love it.<br /><br />Few things to point out if anyone is considering buying them this holiday season:<br /> - OC&#39;ing is fantastic for me, even air the stock cooler. I&#39;m able to hit 3.8gHz @ 1.275V<br /> - Some MOBO&#39;s have issues where they are unable to keep the VCORE set to AUTO in the BIOS. My biggest complaint. But thankfully with Ryzen Master I can get around it. I have an ASRock Taichi, hope it&#39;s patched soon.<br /> - Get good RAM, ~3000 - 3200, there&#39;s only 2 different RAM sticks that are fully compatible at full speed on the Ryzen platform now, and they are a bit pricey. My G.Skill Trident Z (3200) only get to 2933 rn. Still waiting for a BIOS update for better compatibility.<br /><br />I still love it considering what still needs patched. Hope MOBO devs hurry the hell up tho. Gaming is terrific and Ryzen Master let&#39;s you change clock speed and voltage so easily. Never had the CPU above 60C during gaming, even on BF1. Stock cooler is very nice. Runs my torrents, games, services all perfectly and with a snap. <br /><br />If you&#39;re willing to deal with some compatibility issues that may arise, it&#39;s worth the extra cores and nice gaming performance. With what you would save compared to some of the Intel 4+ core equivalents, this is the best deal hands down. Save your money and invest in a better GPU for better gaming performance or whatever else.<br /><br />I should say tho, if you plan on being lazy with upkeep and updates on your system, and just care about games, you could get an i5, but even the 1600 is still a better deal. It all comes down to how focused you are with working on PC&#39;s. It was a nice deal for me, been dealing with computer builds for a few years now."}, {"text": "I settled at 3.8Ghz as well on my 1700. Takes a lot more voltage for me to hit 3.9Ghz just isn&#39;t worth it. I am running DDR4 3200 @ 16-16-16-36 successfully."}, {"text": "Exporting @ 40-60mbs for youtube? Doesn&#39;t uploading to youtube automatically compress the video to a much lower bitrate than that? If it does, is there a reason to export to such a high bitrate, if your main platform is youtube?"}, {"text": "Omg I hate how my Ryzen chip performs in Lightroom something I use all the time!"}, {"text": "You moved the OS drive from an Intel system to an AMD system, without a fresh install of the OS and drivers.................... (accusing stare)  lol"}, {"text": "40 hours in a year isn&#39;t a whole lot."}, {"text": "Yeah clean Windows install definitely recommended. But great platform overall indeed. Definitely awesome to do such heavy multitask and not notice hangs."}, {"text": "My Ryzen 7 1700 is at 3.9GHz on a Coolermaster Hyper 212 Evo. Its a solid platform. Get you one."}, {"text": "So productivity goes to Ryzen then gaming is to Intel... Gonna buy both then."}, {"text": "THe thumbnail was kind of a deadgiveaway :3"}, {"text": "Yowza, Ryzen is looking pretty good."}, {"text": "I have an R7-1700 on an ASRock X370 Killer SLI and while there were hiccups in the beginning, like for instance, W10 was taking literally FIVE MINUTES to load, after a BIOS update and a few Windows updates, it loads in less than 30 seconds.  I&#39;m VERY happy with my 1700.  I overclocked it to 3.5GHz just for fun but I haven&#39;t noticed much difference in performance."}, {"text": "Could it be an optimization issue with the ryzen and app compatibility  with developers needs more time to be straightened out, But the time saving wow"}, {"text": "Any review on the halos rgb?"}, {"text": "What&#39;s the name of the case of the Intel machine? I love it!"}, {"text": "dirty windows pleb ,,"}, {"text": "Can build Hyper 212 turbo in this Nzxt s340 case?"}, {"text": "Try gaming at 2...<br /><br /><br /><br />Seconds per frame and then tell me 2 fps is bad"}, {"text": "But now Coffee Lake is out...  Ryzen is great though so much promise, just needs a little more time to mature I think."}, {"text": "The key with Ryzen is to keep up with BIOS and Chipset Driver updates as it gets better every update. Next BIOS updates will add NVMe RAID to all Ryzen Chipsets"}, {"text": "Tech channel that swaps Mobo/CPU, doesn&#39;t install fresh OS. What?"}, {"text": "So... Are you telling us you need to format when switching from intel to amd? DUH?<br />And are you telling us a 4 year old platform is more tested than a brand new platform? DUH?<br />Early adopting, you can run into trouble. The fact that you need to update your bios that often should tell you they are working on it constantly."}, {"text": "i7 for gaming and Ryzen for heavy editting I guess then, i7&#39;s are great for gaming and also if you make YouTube videos and don&#39;t want to spend too much and want great gaming performance too"}, {"text": "You waited how long to update the BIOS? Should&#39;ve been done day 1. SMH"}, {"text": "I was desperate for a new CPU for multitasking &amp; rendering. I was going to wait for Zen 2 but my Athlon 640 was holding me back so much that I caved in and bought an R7 1700. It was impossible to do anything on the Athlon. I never knew this but buying a new CPU can significantly decrease loading times! I went from 1-2min loading times to 5seconds! I don&#39;t even have an SSD yet."}, {"text": "The pc i just built is ryzen 7 and 1080!!!!!"}, {"text": "So basically, Intel is better for high refresh rate gaming"}, {"text": "Talking about witching platforms.<br />Doing camera switches.<br /><b>I see what you did there</b>"}, {"text": "Great video, Dimitri."}, {"text": "upgrade to i7 8700k"}, {"text": "I&#39;ve notice a  bit of a slowdown on my 1700x and found the culprit. I use a UPS with a java based monitoring system, the java run time had a cpu penalty of 8-12% (drops 4 to 8 fps on KeyShot) which some times happen sometime it don&#39;t. I initially solved it by switching USB ports but later on it just continued with the penalty. Further investigation is that when my Firefox was updated to the latest release, the UPS monitoring ported to IE11. So on W10&gt;Settings&gt;Look for Control Panel&gt;Programs and Features&gt;Turn Windows features on or off&gt;(default W10 installation is tick which I wasn&#39;t aware off) untick Internet Explorer 11&gt;OK and problem solved."}, {"text": "Why did u took old gen 6700? 7th gen would work more well comparing to ryzen. And fps drop in game is a big issue in ryzen. Thats why i prefer intel. Ryzen has more core so multi tasking is better. But intel makes powerful cores with high ghz and throttles games to the max fps. :) and this is the actual talk now there are so many small issues with ryzen. Did u have to format all the partitions when u installed win10?"}, {"text": "Running my 1700x at 3.9 ghz and its a beast! I can push it to 4.0 but just for the sake of keeping everything cooler and quieter running a tad bit lower :P"}, {"text": "What about threadripper ?"}, {"text": "I only got into watching these vids as im betting on AMD stock (for a few reasons) the information that i get from this site is really great value add content for those who are looking to make money on some of these companies. great job!"}, {"text": "tldw answer is in first vids title"}, {"text": "Give it time. I have hope!"}, {"text": "What happens when ford &amp; general motors decide to butt heads? The winner is the consumer.<br />What happens when Intel &amp; AMD decide to butt heads? The winner is us.<br />In both cases, Which is better? is an easy question, but it doesn&#39;t always have an easy answer. There tend to be some pros &amp; some cons.<br />Without competition, Intel would be charging $800 for a single core Pentium that ran at a bit more than one GHz. They talk about &quot;tick tock&quot; but they produce real improvements when somebody points a gun at them.<br />Like the natural contest between political groups, let&#39;s call them left &amp; right, you tend to get strong supporters who talk absolute shit and would commit murder for things that are completely fictional &amp; incorrect. When you get serious competition, you get serious lies &amp; dishonesty. Doing accurate and honest assessment of things, can be difficult. People sort of expect you to be a part of their war, whether you think you&#39;re a participant or not."}, {"text": "I also did the Windows &quot;refresh&quot; instead of clean install when I got my Ryzen 1600X 4 months ago but I haven&#39;t gotten any crashes or aberrant behavior. Been loving it."}, {"text": "Very good review. I will definitely forward to some buddies."}, {"text": "Wtf are you like 7feet tall?"}, {"text": "Clean install PC benchmarks are misleading .. i constantly have around 130-150 processes running in the background .. some people claim to have only 70 on a fresh install ... so multi tasking on an daily driver PC might be different than those fresh installs."}, {"text": "Swap out your CPU for his and don&#39;t say nothing!!!"}, {"text": "How was it to edit footage of you talking about yourself editing footage of you talking about Ryzen?"}, {"text": "Can the halos fans have different colors for multiple fans"}, {"text": "Adobe was shit on my intel machine, and the trend moves on to Ryzen, some software never changes."}, {"text": "This kinda makes this video the only legitimate long term Ryzen platform review. Thanks for all the feedback and guinea pigging it for us !"}, {"text": "I&#39;ve been on my machine for a few months now (Ryzen 7 1700x &amp; ASUS X370 board) and I freaking love it. I came from a Sandy Bridge i7 so it was a more significant jump for me, but even with my 970 i&#39;ve been having a great time with it for every day use (Gaming, virtualization, etc.). I would like to get into some rendering / video editing so this video is some really good insight on what I can expect / look for. Thanks Dmitry!"}, {"text": "Well like you said if i had problems of course i did but it was expected since it was a new architecture. My Ryzen system 1600X OC to 4.0GHz with 1.45 Vcore with turbo LLC setting in a Gigabyte AX370 gaming 5 Aorus board which sometimes spikes up to almost 1.500Vcore YIKES (IK ik unsafe 24/7 voltage but ehh YOLO PLUS push the system load too much it will crash and burn LMAO but stable if not pushed too hard like Benchmarks will) my ram which was a pain in my A$$ is Corsairs Vengeance LPX rated at 3000MHz 4/8gb 16GB total system ram which was stuck and only booting at 2666MHZ with todays bios which i think its F9a i can not only run it at 3000MHZ but i managed to get it booting into win 10 at 3200MHz with 4 sticks Noticed that i gained FPS in games also, GPU is a RX480 OC @1390MHz buying soon will be the 1080Ti when i can find one around $400. The rest of the system is blah... 2 hdd WD blue in raid 0 @ 640GB, Corsair 750HX PSU, CPU cooler Phanteks TC 12 DX single tower push/pull, case is a lian li which i HATE and will replace soon"}, {"text": "So, what did we learn? NEVER switch your platform without doing over your OS - the resulting system won&#39;t be worth the time saved at all. A professional should know that by default, though. Learn from your mistakes, Dimitry!<br /><br />I do not consider the external hard drive cage not working or Lightroom being poorly optimized AMD&#39;s faults by the way, especially not the latter. Adobe just gotta step it up!<br /><br />Can&#39;t wait for Pinnacle Ridge next year and Zen 2 the year after that, either, that&#39;s when I am finally gonna leave the world of the quadcores behind me."}, {"text": "viewsonic XG 24 / 27 ?"}, {"text": "I wonder if you have the USB 3.1 and SATA cable signal streanth issues with other Ryzen motherboards, as it may be a vender specific issue than then a chipset issue. I still had lots of issues with a 100 series intel board and it took Gigabyte two months to release bios updates that let my memory work right and stop all the crazy error messages. That was vender specific, so I would not go out and say its an i7/Intel chipset problem, but here you are suggesting the issues you had are a ryzen/AMD chipset problem but you have no explanation of why you belive it is the whole chipset. (not saying your wrong but I would like some background).<br /><br />Tnx."}, {"text": "Hey, Dmitri mentioned doing a &#39;format&#39; of the os drive to get is onto the new system. I&#39;m going to buy a new mobo and CPU soon, anyone know how to do this?"}, {"text": "I built a Ryzen 5 1600 + RX Vega 64 system and everything went butter smooth. Everything worked 100% at first try and I couldn&#39;t be happier with the system. It&#39;s good to have an AMD system again."}, {"text": "go to threadripper"}, {"text": "Is he running Flare Xs at 2666mhz? If so WHYYY?"}, {"text": "I need the Fractal Design case!"}, {"text": "If a software is running slow, then it isn&#39;t Ryzen that is messing up, it&#39;s lack of software optimizations."}, {"text": "my 7600k@5ghz hackintosh is ungodly fast in lightroom. About twice that of my Ryzen 1700x@4ghz in windows. I want the 8600k@5.2Ghzs and would pay silicon lottery to get one."}, {"text": "You have my 2 favorite cases on display. Can you please put one besides the other to see the size difference??? Meshify C vs HP500P size matters??!!"}, {"text": "Ryzen is still a relative baby, and newcomer in this Intel world of computers. With the greater uptake and use of Ryzen, the software developers will eventually tune their programs to make more efficient use of it. So hang in there, as Ryzen is still growing, maturing, and with the support of the people, will eventually force the hand of the software developers to pull their fingers out of their bums and update their coding. I foresee the rising number of cores being utilized in our cpu&#39;s the main driving force, so thanks to Ryzen for pushing Intel to also release more cores. It&#39;s a pity though that Ryzen was not initially released with higher clock counts to take on Intel properly with their single core performance advantage. This has allowed Intel to play catch up and hence maintain its lead in the performance stakes.<br /><br />The take away from this video, is that you  have 2 very good, capable, fast machines that you could easily adapt into your workflow, and get more efficient use and productivity utilizing the best parts of both systems. use both of your machines. One to do your manual editing, the other to do your rendering. Work from a 10 gigabit network drive, and use a kvm switch or use a software solution like &quot;Synergy&quot; to combine both or more machines as one giant workstation.. Rendering videos can be also taken on by both or more machines."}, {"text": "you say you saved 10 hours in render time but how many hours did you spend with a downed computer or chasing fixes?"}, {"text": "the description says dmitry"}, {"text": "Lil&#39; question: what is the other PCIe card in your system? I can&#39;t figure it out :/"}, {"text": "Why not X299?"}, {"text": "Глупый вопрос конечно, ведь смотрю канал не так давно<br /><br />И нарочно пишу именно так, вдруг мне ответят<br /><br />Почему Дмитрий?<br />Новая мода использовать славянские имена? Ведь внешность не походит на происхождение имени"}, {"text": "New architecture has kinks with other hardware not even tested with the new technology.....sounds like when people complained about plane wifi being spotty when it first came out."}, {"text": "That&#39;s really disappointing with lightroom. I use that software a lot."}, {"text": "My 6700K doesnt boot with 3200Mhz Ram (3000Mhz max.). My Ryzen on the other hand does 3200Mhz no problems."}, {"text": "Dmitry, what codec do you use for editing? I feel like you shouldn&#39;t have frame drops, especially with proxies at 720p. But editing in the H.264 codec could be the problem. Try converting to a more edit-friendly codec like DNxHR, CineForm or ProRes. I&#39;m able to edit 4k content with color grading on a laptop with an i7 7700HQ and a GTX 1050. Not accusing you of not doing that, juts throwing this out there :)"}, {"text": "What camera do you use? Quality is magnificent."}, {"text": "Always nice to blame AMD for your mistakes..."}, {"text": "love your work keep it u p:)"}, {"text": "Can you make a video on how to optimize PC to work on Premier at it&#39;s best?"}, {"text": "I was really looking to upgrade to a Ryzen system but to hear it has even worse performance in Lightroom is a no go for me (Lightroom is pretty trash regardless though)."}, {"text": "new platform bugs, ugh!  reminds me of x79 chipset.  I will wait for the next generation of Ryzen, if at all."}, {"text": "So you did no gaming in those 3 months?"}, {"text": "Sounds like someone needs an i7-8700K."}, {"text": "Thank you"}, {"text": "What Logitech keyboard does he use?"}, {"text": "would you recommend ryzen for lightroom and gaming ?"}, {"text": "I love the thumbnail for this video."}, {"text": "Time to go Threadripper."}, {"text": "Very interessting points of view. :)<br />I&#39;ll have you know that I hadsimilar issues switching from my i7- 2600k to a i7-6700. Though I did not even &quot;reset&quot; my windows."}, {"text": "What video editing software does he use?"}, {"text": "Any plans to upgrade to threadripper?"}, {"text": "I&#39;m just gonna leave this here:<br /><br /><br /><br /><br /><br />Ryzen is shit."}, {"text": "Hey Dimitry,<br />I feel you with Lightroom. Kind of a annoying issues with Ryzen but I will not switching back.<br />If you have any updates about those Adobe F*ckUps with Ryzen - let us now! I would be very pleased with it.<br />Till then, I will every now and then the latest (Beta) Bios Updates.<br /><br />Thumbs up!"}, {"text": "All of these things are anecdotal and can&#39;t specifically be blamed on any one component.  I have a Ryzen 1700 system, all of the problems you are experiencing, well, I&#39;m not.  Given your guys CL scores are so high, compared to the rest of the reviews, I&#39;m starting to think you&#39;re in someone&#39;s pocket.  Maybe you guys should start MEASURING things, FIND THE ISSUE, and REPORT THE ISSUE, rather than giving us OPINIONS."}, {"text": "I have a Ryzen 7 1700x (Stuck at 3.8ghz also), 32gb of RAM (Stuck at 2933mhz not the full 3200mhz though), on an Asus Prime x370. I have had it relatively stable, other than RAM issues before certain bios updates of course. I don&#39;t use Adobe though, I use Blackmagic Design Davinci Resolve, and Fusion 9. I did have an issue with Blender crashing while rendering with the CPU until I upgraded the bios again, and upgraded Blender to version 2.79, and that has been fixed lol. I can&#39;t do anything though if Blender is being used though, it does max it all out hah.<br />I have to admit I am very pleased at my system overall. Wish I could of also pushed 4ghz also, but I still am happy it is working where it is at :)"}, {"text": "Very useful information and a great story about the journey."}, {"text": "I&#39;ve had my Ryzen system (1700) at 3.9 gigahertz 2993 megahertz on the ram and my 1070 and my god I love the 1700 so much it really helps me to edit videos and multitask more, it&#39;s also amazing for streaming! (btw sad that you got the worse part of the silicon lottery)"}, {"text": "I got my 1700x to 4.1"}, {"text": "This makes me want one even more, maybe not the 1700x. But still makes Ryzen more appealing."}, {"text": "So enlightening! Love your work."}, {"text": "I&#39;m really happy with my Ryzen 1700@3.8! It gives me x2 performance in 3D rendering (also in gaming you don&#39;t lose anything) compared to my old i7-3770K@4.2! x2 performance for same price! And now I planning upgrade to THREADRIPPER 1950X to get x2 more performance compared to Ryzen 1700@3.8! Now I&#39;m AMD fan!"}, {"text": "You get what you pay for. Intel has just been killing it since the core series came out."}, {"text": "IMHO, clean install is a MUST.  I’m shocked that it wasn’t the first thing you did.  Oh well, lessons learned...  😁"}, {"text": "tl;dr: wasnt worth it, 6700k or better is sufficient enough and better"}, {"text": "I edit my videos with MS Movie Maker and create thumbnails with Paint, I guess I don&#39;t need Ryzen =P"}, {"text": "Conclusion: don&#39;t fucking buy ryzen, because it is bugged as hell. Now you can easily buy the 8700k which is almost the same price as the 1700x and get better performance in every aspect + no bugs."}, {"text": "So, now you need Threadripper to save more time"}, {"text": "frames dropped so hard they almost ended ww2"}, {"text": "will the Ryzen platform perform better with AMD graphics tho?"}, {"text": "Really? I never thought a tech reviewer would make an error like that.Dirty running Win 10 with leftover intel chipset and ME drivers...<br />You also left MCE on @ your 8700k review, which skewed the results.<br />Makes you wonder what misguidance we are getting fed by those &quot;Tech reviewers&quot;."}, {"text": "I&#39;ve been taught to always make a clean install with every new build I&#39;d made."}, {"text": "That have always been the case with amd they don’t optimize drivers too much. Reason why even more expensive i am keeping intel"}, {"text": "Dimitri hates the Nintendo switch CONFIRMED!!!"}, {"text": "Drops to 80fps with 1700x and 1080ti in cs:go"}, {"text": "My phone hated the video, black bars."}, {"text": "Never give up my 1700 @ 4050.. Love it!"}, {"text": "lets hope amd fix this issues, and doesn&#39;t poop on us like they did in the past."}, {"text": "Why is the side panel off on your meshify C?"}, {"text": "No clean install? n000000b"}, {"text": "Very nice structure of the Video. Thank you!"}, {"text": "Adobe needs to optimize their software for ryzen. adobe does not use all of ryzen resources and thats where the problems lie. moving foward more content creators will be using ryzen , especially for people who are now starting off. they wont have the capital to spend large amounts of money on an intel x299 system."}, {"text": "Great review"}, {"text": "Why did you put a 21:9 video inside a 16:9 frame?"}, {"text": "Run faster memory and setup custom timings it make a massive difference."}, {"text": "TLDR:  always do a clean install of windows when swapping major hardware."}, {"text": "Good review, mate! As always top notch quality content from you guys. Keep up the good work!"}, {"text": "Great video. Was nice to hear the good and bad things and also the mistakes you made that hopefully can help others. I can&#39;t wait to see how the 8700k stacks up when you do that video. Would have been cool to have 8 core X299 comparison as well. Various price points but is it worth the price if there is time savings. Keep up the good work man."}, {"text": "4.20 Schoolboy error mate!  Good Video :)"}, {"text": "This type of review where it focuses are the user perspective instead of benchmarks is much more usefull. Good job."}, {"text": "My experience has been up and down. I think maybe my issues now is it not getting along with my WD Blue m.2 SSD. So going to try to move my OS to the Evo this weekend. And with more growing support in linux. I may give it a go and install linux on another drive."}, {"text": "I&#39;m building an 1700x to be a VM server. It would be cool to see people review that sort of thing."}, {"text": "This guy needs to reduce his caffeine intake, he&#39;s too hyper, talks to fast. Slow down."}, {"text": "go to 8700k and  u will never go back to cheap AMD."}, {"text": "I must have gotten really lucky with my ryzen 5... Non x 1600 overclocked to 4ghz with the ram clocked to 3200mhz and it was stable. Even did an extended Aida test and worked perfectly."}, {"text": "Last try....I Need that blue wallpaper!"}, {"text": "My Ryzen 1700 is performing great for gaming, cad, and light video editing. However, I could only get my Dark Rock Pro 3 to exhaust towards the top, how did you get yours exhausting out of the back?"}, {"text": "and am still here using i5 2380p"}, {"text": "So far I do love it. But I&#39;m still a little sad, that I can&#39;t get my RAM to run at 3,000mhz"}, {"text": "that video couldn&#39;t have dropped at a better timming. i need to build a new PC for an employe at my office . she&#39;s already doing PS/ILL. and she will start doing PPcc/AF soon. I was looking for the 1700 or some i7 7700 build. Even threadripper 1920x was on my mind. With 32GB ram , all ssd/nvme drive . the part that got me is the productivity part of the r7 .<br /><br />She will still have to look at email, youtube , edit video in PP as doing some stuff in PS ... in other therm ... she still need to do the usual &#39;businnes&#39; task even during rendering. <br /><br />R7 look good for that matter  ... will it be enough tough ? do y need to step in TR theritory ?"}, {"text": "I always enjoy your videos, but spending the opening ~four minutes, almost half the video, criticising a platform with no mention that the problems came from not following guidance (clean installing when moving from a completely different platform) isn&#39;t particularly fair. Hopefully most viewers stuck around beyond the five minute mark, but this /is/ YouTube."}, {"text": "Would love to see a benchmarks on Lightroom performance on Ryzen vs. Intel. That&#39;s where I spend most of my time... Importing, building smart previews, going from image to image, exporting... etc. How big of a slowdown is it?"}, {"text": "One major thing people forget to take into account is that Intel has a hold on it&#39;s instruction sets. So AMD cpu&#39;s have to convert and decipher those instruction sets on the fly. That&#39;s why you see the performance difference you do in certain games. Now if games have both Intel and AMD instruction sets you will either see the scales flip around. <br /><br />This was an issue for cyrix CPU&#39;s back in the day, the Cyrix had issues trying to run Quake even though it should have been able to handle it with flying colors. But due to Cyrix not being able to efficiently translate Intel&#39;s instruction sets ( Intel had a monopoly on it back then ) the cpu ended up looking like it was incapable. This issue is still around today but people today know it as &quot; optimization &quot;"}, {"text": "valve need a update for ryzen and other amd cpu&#39;s"}, {"text": "Can the halos Dan also be used with nzxt hue +"}, {"text": "If you run your 1700X at 3.8GHz, 3200MHz on the memory shouldn&#39;t cause problems. It works for me, although I can&#39;t go any higher on the CPU no matter what."}, {"text": "Just use the 8700k overclocked!"}, {"text": "I switched to the 1700x several months ago and, while I see why it is appealing for some people, I&#39;ll be switching back to Intel in the near future."}, {"text": "You could have run an i5 6600k at 4.4ghz and gotten better results in Lightroom and Adobe due to clock speeds"}, {"text": "I‘m happy whith my Kabylake PC. I mostly game so I went for the i7 instead of R7 for those higher FPS and by the time of buying Ryzen had too many issues imho."}, {"text": "&#39;Ryzen is really unoptimised for Adobe lightroom&#39; No Dimitri, Adobe Light room isn&#39;t optimised for Ryzen yet.  Very misleading video."}, {"text": "It&#39;s called an all new platform from a smaller manufacturer...... By the time AMD is on Ryzen + or Ryzen 2 I&#39;d expect a very stable architecture."}, {"text": "Interesting what you say about Lightroom with Ryzen, and a bit of an unpleasant surprise to be honest. Does Ryzen&#39;s performance in Lightroom make Lightroom &quot;a chore&quot; to use? Is this experience based on the photos and LR catalogue stored on hdd or ssd or what?"}, {"text": "Your Adobe problems are just that; Adobe problems. They need to optimize their software. This is an entirely new platform from the ground up. Give AMD the same amount of time to iron the bugs that Intel has had. Or do we all forget X299 and the shit ton of issues it&#39;s had?"}, {"text": "only one problem.... i7-8700k. for a few dollars more you get something thats better for professional applications as well as gaming. Ryzen isnt bad.... its just been completely overshadowed."}, {"text": "lol i hit 200+ fps in csgo with my ryzen 3 1200 and a gtx 1060..."}, {"text": "Hi There, what&#39;s the monitor that you&#39;re using on your rig? Tks!"}, {"text": "10 hours saved (and used trying to get the system stable)"}, {"text": "Awesome Info, Nephew wanted a new ryzen rig, so I upgraded him with a 1600 and he loves it. But for me and now seeing more and mroe videos like this, im glad i am waiting and hoping the 2nd gen Ryzen&#39;s will be better performers! I believe we will see improvements AMD has done this before and 2nd gen chips are normally better anyhow, I hope I like AMD and want them to do well, I still waiting!"}, {"text": "wait your 1700x 1080 system couldn&#39;t rech stable 240 fps in csgo lowest settings? i have an r7 1700 and the exact same gtx 1080 and i have at least 280fps constantly with max settings and my cpu/gpu usage is under 80% when playing csgo"}, {"text": "i play on 4k whit 2 1080.. and i have a 5820k, is it a good idea to switch to ryzen 7 1800??"}, {"text": "I had a lot of ALOT of problems when I switched to ryzen. I ended up doing a complete reset and everything is fixed lol."}, {"text": "You got unlucky because mine 1700+ is running at 3.9 just limited by me for stability and my memory is 3000 mhz.<br /><br />Use with premiere every day. Not using Nvidea but the old 290x"}, {"text": "im watchin this in 480p"}, {"text": "he tooks money from intel"}, {"text": "all of those ryzen issues are Ironed out at this point... I had every issue you explained. But after a LOT of bios updating and Hair pulling Ryzen are now exceptionally Awesome<br />Playing Battlefield 1 at 144p 144Hz getting 144Fps no problem"}, {"text": "lol nice ad.<br />Now I know it&#39;s exist :)"}, {"text": "I have a 1600 and use it for gaming its done well above and beyond from what I expected I am very happy going the AMD route was skeptical at first but no regrets what so ever."}, {"text": "Thank you."}, {"text": "What is the best video editing software out there?"}, {"text": "Dimitry is loosing his accent."}, {"text": "I am still wondering why not more professional YouTubers are using a dedicated rendering rigg.  <br />It is really easy to set up a second system as a server that is only used to do the actual work. Then you could even use your netbook to do the editing."}, {"text": "Can you try using Capture One instead? I&#39;ve heard that it flies with Ryzen. Adobe is a waste of money."}, {"text": "I didn&#39;t format my SSD, I changed my mobo and CPU and Windows booted up without reinstalling anything."}, {"text": "yeah my Ryzen 5 1600 may not provide more fps in games, but now i dont have to think twice before opening new applications when rendering videos. now my HDD&#39;s have become the bottleneck ..! :p"}, {"text": "I wait for Dmitry. I see Dmitry. I smash the like button because I know killer cinematography and editing coming up. :D"}, {"text": "I&#39;ve been having memory issues with my R3 1200. It will either boot-loop when I boot it up, or when it first starts, 8GB or RAM (half) is hardware reserved. I&#39;m pretty sure it&#39;s the mobo and not Ryzen, but I&#39;m not sure if it&#39;s even worth worrying about. Usually a few restarts can get be back running at full RAM. But the process repeats itself every next day or so."}, {"text": "So a brand new platform having early issues becasue its literally a &quot;new platform&quot;.<br />Wow. Who would&#39;ve thought that? LOL."}, {"text": "I clocked my ryzen 5 1600 to 3.8 and I was having a lot of problems with my corsair 3200 memory, couldn&#39;t make it run above 2666 with the latest bios update for my MSI x370 Krait. Luckily after installing the latest Beta bio I can run my memory to 3066, still can&#39;t get to 3200, but I&#39;m quite happy with 3066"}, {"text": "Beautiful review Dimitri.Very well made and informative. I like that u are putting attention to every detail. And that makes your videos awesome.<br />P.S i hope i spelled your name correct."}, {"text": "Sooo basically you did not do what AMD said you should do in the first place and blamed it all on the system? Soo basically it is your fault?"}, {"text": "Can you tell me what editing program you use. I&#39;ve been asking so many people and no answers"}, {"text": "What driver did you revert to?  I can&#39;t get CUDA accelerated decodes reliably on any driver &gt;= the 381 series on linux."}, {"text": "GTX 1080 is no longer supported by Adobe."}, {"text": "R.I.P. RYZEN"}, {"text": "I wonder if AMD will fix the Infinity Fabric High Latency issue in Ryzen 2. And, I wonder how they will do it. I feel like they need to put some kind of embedded HBM or GDDR5 cache memory so lag in games don&#39;t happen. But, I&#39;m not a CPU engineer.<br /><br /><br /> PS--Though, embedded HBM/GDDR5 cache memory for a CPU would be brute forcing it and not an elegant design. And, also hike up the potential price point."}, {"text": "If we consider that Ryzen is the 1st generation it runs pretty well. Skylake is 7th iteration of the same platform, so it would be pretty bad to have these issues."}, {"text": "8700k tho"}, {"text": "Can’t you render way faster with CUDA though, with your GTX 1080, and save even more hours? Or do you need the GPU for multitasking?"}, {"text": "You know some applications and games won&#39;t play well with 8 cores, hell there&#39;s even games that don&#39;t work well with anything that has more than 4 cores."}, {"text": "I don&#39;t have any problem at all with lightroom (ฺBtw mine is 1800x)"}, {"text": "I think you have software issues mostly. Its not CPU related based on your explanation."}, {"text": "Great review!! How has the Meshify C been looking...does the front panel get dirty easily??"}, {"text": "Built my first computer earlier this year so naturally I went with the ryzen 1700 and I couldn’t be happier, it games great and renders videos nice. 10/10 will buy the refreshed zen 2 when it arrives!"}, {"text": "thanx for the reveiw it&#39;s been 3 month since i have my 1700x (my 6700k died) i like it but i must admit the 8700k is only a few percent slower in r15 etc but faster in game so ... i regret buying it a bit"}, {"text": "Do you use the &quot;YouTube&quot; Export setting in Adobe Media Encoder for YouTube or a selfmade preset? :)"}, {"text": "I don&#39;t notice a difference in video quality when using a higher bitrate than 16.. That&#39;s the default for YouTube 1080p and I&#39;ve tried to go up to something like 50 and I didn&#39;t notice a lick of quality difference."}, {"text": "Do not forget the price you paid for the 1700x."}, {"text": "CSGO is poorly optimized for ryzen... If you check the cores that are utilized there is only one at 70% the rest vary from 9% to 21%...  I had to disable threads to get more performance..."}, {"text": "I suggest you to try Vega 56 in OpenCL mode for Adobe Premier."}, {"text": "So, got problems anyone on the IT crowd would&#39;ve said could have been solved by a clean install and is saying that a still maturing platform, when pretty much every single program out there is and have been optimized to work on Intel CPU&#39;s, is having problems in some apps and programs? meh....it happens a lot.<br /><br />And, seriously, now the ball is on the programmers court. THEY have to optimize for the Zen platform. AMD can launch CPU&#39;s that are hundreds of years ahead of Intel and still have problems on said programs. Raw power alone will not get you too far.<br /><br />And that the greatest problems for AMD going on IMO. No matter how good their hardware gets or their updates make them, without the programs it uses getting better for it, they will always will lose to Intel (in some aspects). And that what Intel wants, that&#39;s HOW Intel nearly destroyed AMD to begin with..."}, {"text": "Switched to Ryzen, installed Windows on previous intel system SSD, was not overclocking one bit with all latest drivers/software, reinstalled Windows on a new m.2 drive and overclocked to 3.9ghz and 2933 on the memory stable. Ryzen definitely has it’s weird quirks."}, {"text": "The life of a tech youtuber: they build a PC so they can edit a video about that PC they build and get views, so they can get money and upgrade that PC, so they can edit a faster and better video about that upgraded PC."}, {"text": "Please don&#39;t touch your screen. This is triggering me"}, {"text": "I think you should try threadripper. 16 cores and 32 threads. Talk about production and getting stuff done. :D"}, {"text": "Strange I have a 1700x at 4.0ghz 3600 ram asrock taichai 370mb evga 1050 modular cpu and my system gets 1901 in cinebench 15 and maxes cs at 300fps with a 1080ti at 2k res.    My system runs circles around yours."}, {"text": "I tried to do a clean install after the same thing happened to me with my m.2 ssd and the os cannot boot unless my old drive is in the system as well. Any Help?<br /><br />AMD Ryzen 1800x<br />EVGA Hybrid 1080<br />32 gigs Corsair DDR4 Vengance LP<br />Crosshair VI Hero Motherboard<br />250 GB 960 Evo M.2 SSD"}, {"text": "Ryzen 1700x<br />Asus Crosshair MB<br />16 gb EVGA ddr4 @3200 mhz <br />3.8 all cores<br />1.350 volts"}, {"text": "i7 8700 vs Ryzen 7 1700x"}, {"text": "My 1600x at 4ghz runs like a dream."}, {"text": "Loving the 21:9 aspect ratio : )"}, {"text": "Dimitri, time to get rid of those eye bags... take sometime off i guess man"}, {"text": "Wonderful video! Also, the lights in your videos are just awesome. Congratulations!"}, {"text": "Whats with the black bars? Did you do it for the new phone&#39;s 18:9 ratio?"}, {"text": "AMD is always eventually a horrible letdown?"}, {"text": "For the sake of an explanation for the discrepancy between Intel and AMD in CS:GO - it&#39;s how the netcode is compiled. Most cheap online - especially Source Engine games - use Intel compilers for the netcode. In a really simple nutshell; Intel CPUs can process their netcode in a single hardware pass. Others need it to be decompiled first by the OS libraries before it can be processed thus taking a two-pass process. Netcode needs to be processed before the next frame can be interpreted. So AMD is forced to deal with the process overhead incurred by CS:GO which makes this game an invalid benchmark. SO STOP USING IT!!!"}, {"text": "The Switch wasn&#39;t worth it but Ryzen is good <b>hides</b>"}, {"text": "sneaky little detail, inverting the video for a moment when u were pointing to the &quot;wrong&quot; cornor :D"}, {"text": "Hey you switch to ryzen just because of cores?? But Intel offers more clock speeds... I don&#39;t get it..."}, {"text": "how about 8700k as workstation??..."}, {"text": "Great review man. Best long term use review out there"}, {"text": "Here&#39;s the real take-away: Intel is better at everything other than video production. And that&#39;s the truth.<br />I REALLY wanted Ryzen to be something more than it is, but alas, they&#39;re just not there yet.<br /><br />The &quot;hiccups&quot; you experienced along the way may not have been a big deal for you, but for the average user they would have been crippling. Only a very small percentage of computer users have your level of hardware/software knowledge."}, {"text": "got dat 10 minute"}, {"text": "Am I the only one who randomly gets the Blue Screen Errors using this 1700x in Windows 10??? That&#39;s my only issue with this setup."}, {"text": "Ryzen is great, but only 8 boards from the entire platform are actually good and usable (6+ core CPUs)"}, {"text": "Ryzen render server? Idk if Adobe supports that or not...<br /><br />It&#39;s really interesting to see how well ryzen performs against your skylake build, especially from a real experience and not just numbers (but I do love graphs). It would be good to see a video comparing Coffee Lake 6C/6T to 4C/8T though!"}, {"text": "You sound so ignorant and behind by months and months compared to other tech tubers. After the first month of ryzen all of the other tech tubers told viewers  that you ABSOLUTELY HAVE to update all your bios and do a clean install in order to get full performance out of a ryzen system. It was 100% your fault that your system had that much instability. Do your research"}, {"text": "Hopefully with the adoption rate, applications will have better support soon.<br />I&#39;m loving my ryzen so far, had it since March. Like you said, the multitasking you can do is crazy. I mostly game on that system but I play at 4K 60fps so don&#39;t need all that crazy FPS. I do play CSGO with Nvidia FastSync on though but I get enough, smooth FPS to wreck people. I found out that turning off shader cache and power optimization to max on nvidia cards smooth things right out."}, {"text": "Wait till ryzen 2 it will be amazing"}, {"text": "i love you"}, {"text": "I am also dealing with window crashing errors."}, {"text": "Now switch to Threadripper!"}, {"text": "Editing with a hat, swag!"}, {"text": "Oh thanks man I was just looking for a vid like this"}, {"text": "Great and useful info! Thank you. <br />Although... I may be wrong, but I think you are reading your texts from some kind of a prompter. <br />Write shorter sentences than! Have you read Hemingway? Stop being Byzantinian, Dima. Became Westerner already!"}, {"text": "Adobes code in general needs a rewrite from top to bottom , everything Adobe is a crazy resources hog. Great review guys keep up the good work."}, {"text": "I appreciate you being straight with the fucked up bugs and the awesome pros"}, {"text": "Switched from an i7 4770k@4.0GHz to a Ryzen R7 1700 (left this at stock clocks). <br />On intel, premiere took a crazy amount of time to render, and I had general PC slowdowns pretty frequently.<br />However on the 1700, premiere is ridiculously fast, and my system never gets bogged down, ever.  <br />As I&#39;m only gaming at 60 Hz, high refresh rate isn&#39;t something I have to hit, so the lower clocks of Ryzen are fine for me. <br />This is by far one of the best component upgrades I&#39;ve ever done!"}, {"text": "Disable Performance Bias in the Asus bios (it will overclock your overclock giving you issues and needing way higher voltage to be stable}"}, {"text": "multitasking while watching a &quot;4K Video&quot;.. sure Dimitri, sure... i know what you meant by &quot;4K Video&quot;.. lmao"}, {"text": "I also upgraded to Ryzen 1700X recently, and beyond some cooler compatibility issues, and having to update my Windows installation ISO file, and the BIOS. Everything has been great, it really is an absolute beast for productivity, working with 3D in Blender and video editing is an absolutely amazing experience, if you have the patience and technical skills to overcome the first struggles during assembly and installation. I can only recommend it!"}, {"text": "I’m so happy so happy to see AMD making a comeback. Many younger people know nothing about this platform so thank you for the review and the update. AMD with ATI video cards was the platform of choice for power-users and gamers at one time.  ATI was a Canadian company that was bought by AMD a few years ago. ATI and Nvidia were locked in a battle for the best video cards and Intel and AMD were doing the same with processors.  There was always something new and great coming out. We were getting huge upgrades every few months.  <br /><br />I’ve seen comments where many people ask “Why should I care about AMD?” We need the competition. Intel got caught paying computer companies to not use AMD processors a few years back.  They got fined for it, but AMD has taken years to recover. Once AMD was out of the picture,  the pace of innovation slowed down considerably.  We need two major companies producing video cards and processors. At this point, we won’t be seeing new products like we were in the ‘90s and the ‘00s but hopefully we will see some competition in price and new features. I’m looking forward to at least having a choice for the first time in years."}, {"text": "If rendering times are important to you, why not use Final Cut Pro on your MacBook Pro, it can edit 4K video with no proxy and the rendering times can easily be half that of Premiere."}, {"text": "I had the same problems with my 1800x until I did a fresh install of Windows and keep the Bios and drivers updated.  The latest Bios that came out let&#39;s me actually get 4.1 Ghz in most things, but in a few games it will crash, so I leave it at 4.0 Ghz.  Also if anyone is thinking about going with Ryzen, it loves overclocked memory.  On Intel memory speed doesn&#39;t really do much of anything, but on Ryzen it seems to make a big difference."}, {"text": "Ryzen is best for at least 4years"}, {"text": "personally really enjoying my Ryzen 5 1600x. But in perspective I upgraded from an FX8320e."}, {"text": "I would like to see a year update with Ryzen  now that you are using a clean install of Windows. (So 9 more months)"}, {"text": "You surely could use more cores for your use case. Why not switch to Threadripper or Skylake-X?"}, {"text": "That be quiet! cooler is so damn sexy, I forgot you we&#39;re talking about Ryzen!"}, {"text": "Most of the problems you brought will get better as the platform matures."}, {"text": "holy shit that&#39;s a massive cooler"}, {"text": "am i the only one who is like tripping out over the plant??? there&#39;s some deep slightly disturbing symbolism with the plant...... its like he wants to give it IRL feel in every frame every video but we have become so disconnected with nature that he can&#39;t get a real one... just can&#39;t.. like foreshadowing our transition to bladerunner a world with no more wood"}, {"text": "So you took more than half the video to tell us your system didn&#39;t work properly because you needed a clean installation..."}, {"text": "I love how in-depth this channel is God I&#39;m so glad I found this channel. Awesome review, comparison!"}, {"text": "Maybe you should give the x370 ASRock Taichi MB a try. I can confidently say that ASRock has the most quirks figured out for ryzen. You can look at the reviews, maybe even give them a call."}, {"text": "Thank you for this video it was super helpful!!! I guess i&#39;m really surprised how quiet and cool everything. I got an r5 1600 and a Ma9 Cryorig and I don&#39;t really approach more than 55C in any game. Its about 75C in prime95 @ 3.8ghz but have never seen that temperature in any workload I do. Mostly Adobe photoshop/illustrator/unity with twitch or youtube in the background. I&#39;m not really doing CPU intensive tasks (im just learning those programs in my spare time) I just feel its crazy how much more CPU i could utilize still.<br /><br />My friend upgraded from a i7 2600k to an r5 1600, hes a bit bottlenecked by his r9 280x so he hasn&#39;t noticed higher frames in his games but he happily runs a server, 2 android bots and plays games without any FPS drops. He said he either had to shut down the server or bots with his i7 2600k when wanting to play games and its whisper quiet with the same hyper 212 evo."}, {"text": "Wait... so you went from a 6700k to a 1700x... well no sh*t it&#39;s gonna be better as a workstation. The new 8700k however should give it a good run for its money."}, {"text": "thats what a review should be!"}, {"text": "Dimitri you have to understand not many brands want join partner with AMD, too much Nvidia and intel bias. Thats why alot of compabilities and hiccup issue xD still im happy with my Ryzen 1600, Vega 56 and my newly bought Acer ED273A 4 hours ago"}, {"text": "best choice when it comes to workstation/gaming builds. they stomp on intel when it comes to value for money and multithreaded power. so yeah, it&#39;s fucking worth it if you&#39;re not chasing 240hz gaming"}, {"text": "I really hate to reinstall windows.... Any good tip for doing that? In regard of making the new system as fimalier as possible?"}, {"text": "You didn&#39;t have to update Bios since INtel is on the Core2 arch for the last 5+ years. Dimitri have you seen X99 platform? it still gets updates for stability 3 years since launch. Also am with a 1700 at 3,6 and RX480 and get &gt;300fps in CS go at 1080p maxed details."}, {"text": "See, this is why I avoided day 1 reviews. THIS kind of content is actually useful and helpful for potential buyers. Day 1 &quot;reviews&quot; and coverage are completely useless in comparison to this kind of coverage."}, {"text": "Dude if you make a simple mistake like fresh windows instal on a new system and after you say you had some problems with it, dont make it look like its their fault when it&#39;s actually yours for not following the standard procedure. I&#39;m not an expert of anything like that, but even a kid knows that. And no, I&#39;m not an amd fanboi, just stating the obvious."}, {"text": "Great videos but amateur tech skills"}, {"text": "So Starlord is doing PC stuff now."}, {"text": "So I used to run a 4930k in my system, which I&#39;ve since upgraded to a 1600x, should I re-instal windows on my machine too? Before that I was running an FX-8350, and I&#39;ve been using the same boot drive all this time."}, {"text": "Looks like you need the best of both worlds AKA 8700k"}, {"text": "Not usually sold on sponsored products but the halos seem really interesting. Bought some cooler master rgb fans which sounded awful and thought “gee wouldn’t it be great if my fav. fans could have rgb”. Well seems like someone thought of that :)"}, {"text": "Was I too late?"}, {"text": "I&#39;m curious on how coffee lake will stack up for workstation use."}, {"text": "Great info and very useful to finally get a long term view on the Ryzen system! Thanks!"}, {"text": "OMG STOP TOUCHING YOUR SCREEN."}, {"text": "I just use my pc for gaming, should i get a i5 8400 when B series mobos, or get a r5 1600?"}, {"text": "Demetri, can you see if the dark rock pro 3 will fit in the p300?  Pls?"}, {"text": "Привет май нигга"}, {"text": "I just got your monitor ! doesnt the bottom bezel drive you crazy? couldnt LG make the screen all the way down? still  a great monitor :)"}, {"text": "How can you not reach 240+ fps in cs go? I push 240-300fps in overwatch no issues at all with 1600X and gtx 1080 amp extreme."}, {"text": "What kind of hdd would you recommend for animation production/storage of said files, as well as using it for my large game library? I have a Samsung 850 Evo as my main drive, but need a large capacity drive that&#39;s reliable for storing completed work and games safely. I looked at the 6TB WD Black, Red Pro and Gold drives, but couldn&#39;t decide which is best. Any help would be greatly appreciated."}, {"text": "Is that SS Rival?"}, {"text": "in my case Ryzen has been a godsend...i was stuck with an FX8350 that was sluggish both at gaming and multi-tasking, evn if on the second one wasn´t that bad, i don´t game much so the performance loss on some games is not really a concern, and since i have a 60hz monitor and a 1070...i can´t complain at all...for my work stuff and multi-tasking...fuck me if i say i won´t b switching my cpu untill something that gives me a decent enough improvement comes...right now my R7 1700 is running at 3.95Ghz(can´t get it tobe stable at 4Ghz) and i have a 16GB kit of Gskill RGB at 2933Mhz so workflow and gaming is okay and im defnately happy with it, gaming performance and single-core performace may not be the best but since as said i don´t game that much...i have no complaints at all, really fucking happy with my 1700"}, {"text": "Hai Dimitri"}, {"text": "First xdddd"}, {"text": "Once I get the parts for my Ryzren System I will attempt to get it working with Windows 7 X64. Windows 10 will present a lot of issues that would hinder my work flow. It has too many annoying security features. I really hate the windows 10 UI. I do not like having to install third party software just to get my classic start menu back. I hate the windows 10 Smart Screen. I really hate that its constantly overriding good Drivers and replacing them with Bad Drivers. Its also constantly crashing and has a major issue with resource allocation."}, {"text": "It&#39;s good that the early adopter issues seem to be over. I am really strongly considering a Ryzen 7 to replace my 7700K. I really want to get back in to video production, and those extra cores would definitely be something i could use. I am also considering the 8700K, but tbh, i am really not happy with Intel and their choices to artificially lock their older platforms compatibility with so much stuff, both when it comes to software, but definitely also hardware."}, {"text": "My Ryzen 1700x is pretty nice... 4.1 oc... with 3200 ram"}, {"text": "I once commented on your video saying your 1080p camera looks so good, it almost looks like 4K, now that your camera is 4K, OMG, it looks better than Linus&#39;s videos"}, {"text": "I&#39;m noticing a pattern, Adobe software isn&#39;t fully optimized for Ryzen.  But the other issues are mostly because Ryzen is brand new platform.  Things just work with Intel, because the platform is ancient by comparison and they&#39;ve had plenty of time to work out the kinks.  Ryzen is just going to get better over time."}, {"text": "after long time bought a new 1080p monitor lg 22mp78vq (was using 720p) and watching ur vid in 1080p. looks sick !!"}, {"text": "Great vid, but I have to wonder how useful Ryzen is for the average customer. You obviously can benefit from all the cores and threads, because encoding video is a major part of your CPU use, however, I don&#39;t know one friend or family member that would benefit from Ryzen over Intel. Intel simply performs better for everybody that doesn&#39;t encode video."}, {"text": "you people out there and your stupid 240Hz and 4k overkill lol get a life"}, {"text": "please try to switch to 8700k"}, {"text": "clean installs seem to fix a lot"}, {"text": "So im stuck with a decision to make idk if i should get an i5 6600k or a Ryzen 5 1500x"}, {"text": "Guys and Dmitry,today i bought Corsair RM850x PSU . it&#39;s warm in normal mode and fan not spinning. Is it normal?"}, {"text": "Because Ryzen is new tech, and Intel is 10 years of evolution, we need to support AMD so we can have a Good Product on 2018/2019, if Ryzen wasnt a thing we have 4 cores overprice CPUs until Intel wants to continius doing his thing"}, {"text": "So if Cofee lake can save you the same amount of renderring time but is stable and makes no compromise in gaming performance and compatibility, its definitely worth it. Cant wait to see your test and comparison."}, {"text": "This video seems like an excuse for a sucky platform which it is. And also multitasking argument is not applicable anymore, 8700k is already released and crushes ryzen while the cost is the same."}, {"text": "Now do the same thing with Coffee Lake and check if it&#39;s worth it against Ryzen :3"}, {"text": "Can you use the 7900X for a few weeks to compare to the ryzen platform?<br />It would be awesome to see this comparision."}, {"text": "Some of those early issues really come down to Zen and AM4 being so new for AMD and the PC market as a whole. It&#39;s going to take some time for app optimisation to catch up, and AMD have been doing their best to resolve incompatibilities with regular driver and BIOS updates, which is great to see. I&#39;m using a Ryzen 7 1700 and I&#39;m only running it with a 3.7 GHz all core OC, but I&#39;ve briefly and successfully tested at 4.0 GHz with Cinebench R15 and 3DMark Fire Strike, so it&#39;s nice to know there&#39;s at least a little bit more headroom available to me.<br /><br />I feel like the last thing that needs to be ironed out is high speed memory support for kits of memory using memory ICs that are different to Samsung&#39;s B-die chips. My 16GB kit of Corsair Vengeance LPX 3200MHz is a Hynix M-die kit, which I believe is one of the &quot;worst&quot; ICs when it comes to high speed Ryzen compatibility, with Hynix A-die being somewhat better, Samsung E-die being a bit better again, and Samsung B-die being the best. Not quite sure how any of Micron&#39;s ICs fit into the equation but I believe they also work decently.<br /><br />Once I update my BIOS again (running a Crosshair VI Hero), I&#39;m going to try out The Stilt&#39;s memory timings for Hynix kits and see if I can get 3200 MHz working stable with my R7 1700 at 3.7 GHz."}, {"text": "AMD is better platform, in 2 years you can upgrade only your CPU and save a lot of money"}, {"text": "Well compared to skylake x most advantages are gone."}, {"text": "i&#39;m loving this channel for this kind of videos"}, {"text": "For every even amount of likes ill gain a fps"}, {"text": "Too much cancer on the comments here. Move along guys. It&#39;s just kids flame baiting."}, {"text": "what about ryzen 5 1600?"}, {"text": "Good to hear that ryzen is working for you can&#39;t wait to see the coffee lake experience as I&#39;m tempted to get either the 8700k or ryzen 1700 not sure if the hundred dollar difference from Intel would be worth having higher clock speeds but lower thread counts probably gonna just go to ryzen but I also don&#39;t want to jump the gun. Will be buying the new system at the end of November so hopefully prices will be decent than."}, {"text": "It looks like you were on the right track with the G.Skill FlareX memory for 3200MHz, but in your task manager shots I&#39;m seeing 32G of RAM. That means you are either running a dual-rank kit or 2 16GB kits. Both scenarios are not ideal on Ryzen&#39;s 1st gen DDR4 controller at the moment. I&#39;ve had to jump through some serious hoops to run my 32GB TridentZ RGB kit at 3200MHz stable with my C6H and 1800X."}, {"text": "AMD needs to fix Ryzen&#39;s AVX performance!"}, {"text": "I have a question, i got my 1700 to 3.9Ghz at 1.3625v and works perfect but i have some problems with the RAM i have it to 3099mhz don&#39;t have timings in mind but it&#39;s 18s, the problem is it doesn&#39;t feel that smooth even when my Cinnebench score is 1725  and i had a bad crash a few days back so i&#39;d like to know what RAM frequency is good, how low can i get without loosing too much, thank to anyone that responds !"}, {"text": "Like you, 3.8-3.9 with high voltage. A better motherboard (X370 8 phase vs B350 3 phase) did produce about 100 Mhz higher; 3.925. I can run higher but voltage and temps are too high and stability is hit or miss once you break 70C; and I&#39;m using water cooling."}, {"text": "I need that colorful wallpaper!"}, {"text": "About having to update your BIOs so much etc., that&#39;s typical of any new platform, including Intel&#39;s, which they have nearly every CPU they come out with.  So saying you are having to do stuff like that on Ryzen, a brand new platform, versus a mature platform, which the 6700K is <i>(versus such as for example the i9s, and even the 7700K CPUs),</i> is due to invalid expectations, not a fault of AMD, but is par for the course, particularly any brand new architecture."}, {"text": "My 1700 runs fine at 4ghz. Even some unverified memory runs at 3060 mhz. You must have one of the worst chips ever."}, {"text": "Great video, this is probably one of the most useful reviews I&#39;ve seen on internet about Ryzen.<br /><br />So, Ryzen has democratized CPU core for all of us :D<br />Been years since I had been yearning for more core without busting my limited earnings. Couple that with better power consumption and TDP than Intel counterparts, this is great. Although, RAM compatibility has been an issues, but seems like those been much improved by now.<br /><br />Good to be a PC user these days, not only for gamers or people with bigger budgets only."}, {"text": "Looking forward to the Coffee Lake comparison for video editing!"}, {"text": "I can only imagine your editing specific programs can be updated to work better with ryzen, especially when you say it works better on a macbook which obviously has inferior hardware."}, {"text": "Q code 8 is Ram sett your ram propper,  lower latensy and fine tune your overclock on it. and a better cooler and i think youre Cpu gona be great .  1700x all cores att 4,1 mhz  1,36 v. 3000 rgb corsair Intel ram over clock to 3133,36 mhz  Chinabench 15. score att 1788."}, {"text": "Previous video: Switched to Ryzen. TOTALLY WORTH IT!<br />Now: Was it worth it?"}, {"text": "To fix cs lag on ryzen, you need to add “-threads 8” to the launch options"}, {"text": "I&#39;ve had no regrets moving to Ryzen. It works flawlessly for me, and I can see it lasting longer for me than my last build did. Just a note for people thinking about Ryzen, please make sure to spend money on good, fast RAM. AMD&#39;s Infinity Fabric tech in their Ryzen chips benefits HUGELY from high-speed memory. Due to compatibility issues, I ended up getting 2133MHz memory, and while it was still faster than my old system, i was able to get a stable 3000MHz at 1.35V on my memory (after the latest BIOS update for my B350 Tomahawk Arctic board), and it&#39;s made a HUGE difference. I went from a CineBench score of under 1000 to almost 1300 just with the memory clock alone."}, {"text": "Adobe software is made for mac then ported to pc, why it sucks on amd chips"}, {"text": "I get 400fps+ with a i5 7600k and a 1060 in cs on low settings (also on cache)"}, {"text": "I love my R5 1600, might be a bit lacking in gaming though (Compared to the 8th Gen Intel CPUs)... But otherwise it&#39;s great :)"}, {"text": "Poor Intel,having bad nightmares....amd"}, {"text": "Seriously you&#39;ve been tweeting about Ryzen woes all of this time when you didn&#39;t even bother to do a clean format?"}, {"text": "Why aren&#39;t you using the 43&quot; monitor anymore?"}, {"text": "Just made me realise that coffeelake is where I&#39;ll be updating too."}, {"text": "Give That CPU a Little more Voltage Man! 1.308v is on the Low side for 3.80Ghz. Try 1.330v most of your Issues will be solved! <br />Not worth cheeping out on Voltage Trust me."}, {"text": "Ryzen !<br />nuff said"}, {"text": "Any reason upgrading from a 7700K?"}, {"text": "if you are having trouble getting to 4ghz on Ryzen try cooling your VRM more and possibly drop voltage a bit. I was having trouble too but t was just because the VRM was hot. now I&#39;m at 4.017ghz at 1.347 volts all day stable."}, {"text": "Ryzen is dead"}, {"text": "To be honest, Lightroom is an overall very un-optimized program to begin with. Yes, Intel chips may be able to handle it better, but Adobe really needs to work on the app as a whole to make it run better across more hardware."}, {"text": "Good to hear you were able to fix your issues.  I&#39;m planning a similar build for similar reasons.  Either a 1700 overclocked or waiting for the 2700 to release in spring.<br /><br />Hopefully I get the smooth experience like your fixed one rather than needing to troubleshoot."}, {"text": "Ryzen. Meh."}, {"text": "So Adobe need to get off their ass and update the software"}, {"text": "Dimitri are you gonna review Cooler Master M600L, budget case for $50"}, {"text": "Did that say 2,300mhz on your memory clock??"}, {"text": "I have a Ryzen 5 1600 and it runs fine at 3.8GHz, and the memory, which is rated at 3200 is running at 3600MHz, which I think is fantastic."}, {"text": "20"}, {"text": "now go to coffee lake and see if you have any of those bugs or issues. Bet you wont."}, {"text": "Whats up with AMD cpu&#39;s and stutter?"}, {"text": "I switched from my 6600k to a Ryzen 5 1600, I just took out the old mainboard, installed the new platform, just plugged everything in like before and I had no problems at all :D"}, {"text": "1700th viewer..😂😂"}, {"text": "So will this change with coffee lake i7?"}, {"text": "Your previous video on the RyZen switch is what actually pushed me to team red. I too just reached my 3rd month as a RyZen system user and while I too had my share of hiccups, I&#39;m a happy camper overall. Thanks, guys."}, {"text": "The ram should be running at 3200MHz makes a huge diference"}, {"text": "Amd fanboys be denying"}, {"text": "Coffee lake review?"}, {"text": "Would you give it away?"}, {"text": "hi dimitri how are ya"}, {"text": "im wer"}, {"text": "short answer: 4me, no"}, {"text": "i have one and i&#39;m delighted"}, {"text": "Sixty-fifth"}, {"text": "Top 15"}, {"text": "160th"}, {"text": "Вижу новое видео - ставлю лайк! :)"}, {"text": "wow never been so fast"}, {"text": "Awesome🤗🤗🤗😇"}, {"text": "Fith"}, {"text": "Last"}, {"text": "Not first"}]