[{"text": "So here is something that I really have never seen it people and that is to deaden the piano so that you can really be precise. Not the time. It is just amazing how people are not able to hit when they want. It was an exerciser I stole from percussion. Especially if you are practicing on a keybosrd where you can use tools like piano teq to kill the sustan. Just playing a triad will challenge most. Not all the time but once in a while m it&#39;s just like not using your pedal but taken too far"}, {"text": "Love it. Fine line between being relaxed and looking like a duck. You sir look cool as fffffzzzzando<br /><br />I wish people could see me say nice things because I keep getting called a hater."}, {"text": "Summary of the video: that feels good"}, {"text": "Once again great video master, thank you!! i drop it there (op. 10 no. 2), maybe you could find it interesting. you certainly already know all of the tricks anyway :P <br /><a href=\"https://www.youtube.com/watch?v=dRxJ5qq5wS8\">https://www.youtube.com/watch?v=dRxJ5qq5wS8</a>"}, {"text": "Common, you did practice with your student while teaching ! :) I did encounter Edna&#39;s teachings on rotation. Interesting things, but should be implemented with stuff that you already play well. I now think more about opening my hand to reach instead of rotation. Hope you are having wonderful time Josh. Wish you all the best!"}, {"text": "Completely agree with this technic!"}, {"text": "Tiffany Poon does some vlog type videos where she shows herself practicing pieces she’s prepping for performance. It would be amaze balls if you did the same!!"}, {"text": "Is some of the tension issue just the need to build muscle strength and endurance like an athlete or is all about technique?  I am playing Chopin op10 no4 and my LH tends to frequently wear out not on the parts with extension but during the ascending cramped scales and I’m especially starting to tense up in the forearm right before the long descending C# minor scale after having played the long ascending part causing great decrease in evenness/accuracy in my scale when played at fast tempo even though I can easily play this scale at very high tempo if I take break for even few seconds to relieve the tension.  The faster my tempo the more intense the cramping, especially over 144 (goal~160).  I can’t see how I can change my technique.  I try to play as lightly as possible with fingers as glued to keys as possible.  My RH never wears out or gets tense it seems.  I have never played a piece that required this much sustained speed in the LH and I wonder if practice alone will eventually build my muscle up to where it needs to be?<br /><br />I love your videos and if I am ever discouraged you always seem to get me back at it with renewed confidence that I will progress.  Thank you."}, {"text": "<a href=\"https://www.youtube.com/watch?v=HZYmizHYwhE&amp;t=1m44s\">1:44</a>  sounds like a 1960s ad haha"}, {"text": "Many thanks Josh!"}, {"text": "I love the way Benjamin Steinhardt explains rotation. When it all comes just  from the forearm speed is sacrificed a lot, with the tendency being that the fingers stop moving in response. When rotation comes from the palm where the muscles in the fingers are, it means it’s possible to acquire tone control without feeling a pull in the fingers. Rotation from the palm encourages the fingers  to lift and drop as one unit rather than lifting each one in isolation from each other. It compliments  the natural horizontal motion of the keyboard☺️<br /><br /><a href=\"https://youtu.be/vT1t0VzvX0w\">https://youtu.be/vT1t0VzvX0w</a>"}, {"text": "I really enjoyed the live demonstration of how to practice a passage. And i&#39;m really impressed how fast you can learn it!"}, {"text": "Inspiring, makes me feel like practicing. Great tips for practicing <b>Smartly</b>"}, {"text": "Your sight reading is insane !"}, {"text": "Always love tips like these as they give us more ways to practice and add new techniques to our “arsenal”. I found them very useful, particularly for some passages in my exam pieces that I found very difficult (funny coincidence: another Schumann piece). Thanks, as always, Josh"}, {"text": "Awesome video as usual!"}, {"text": "Out of any of the concepts I&#39;ve ever posted about, avoiding tension and playing with freedom and ease is perhaps the most critical thing you can learn to achieve better expression, better fluidity in your playing, and sounding more professional overall. I hope the tips in this video help in your studies!"}, {"text": "Je"}]