[{"text": "Finnaly i can now start playing games in school"}, {"text": "Playing games like stardrew valley, don&#39;t starve together, sims 4 some simple games you still want to play work!"}, {"text": "is there anyone on youtube who is not sponsored...all of them doing fake reviews"}, {"text": "Back the IT lab pcs had locks on it, so we were playing gta from pendrives."}, {"text": "Ol so i have 4gb of ram on my pc i need 8 to ryn a game and i was thinking of buying a 16gb usb flash drive will i be able to play the fame on it?"}, {"text": "Which usb stick is good for gaming? Want one for 20 dollar maximal"}, {"text": "can i use a normal usb<br />if the usb was too big is it gonna lag"}, {"text": "Im on my way to tapping silvers on school computers lol"}, {"text": "I cant believe it, its peter quill"}, {"text": "i think the stutters are because steam is also running off the drive causing it to need to read data for both i would assume it would work great if you installed steam to main drive and than just set the usb stick as a steam library i did this with pubg just to test and it loaded way faster than off a mechanical drive (pubg really likes random read speed because unoptimized asset loader)"}, {"text": "Intro should be the marvel intro"}, {"text": "Why am i here i have 1000 gigs still good vid"}, {"text": "Игорь"}, {"text": "So my work computer wont let me download Steam, SO can I Put Steam on that and the games and will it work on my work pc then?"}, {"text": "THIS IS <b>SAVAGE</b> BRO"}, {"text": "Does this increase graphics"}, {"text": "does usb serves as a RAM??"}, {"text": "YOU mean if you put that stick on The pc The games Will run faster"}, {"text": "Eso debe llegar a Chile weon!!!"}, {"text": "Can u use it if d usb has stuff in it?"}, {"text": "FUCK THE 3.0 !!!I NEED A SIMPLE 1TO USB GAMING KEY 2.0 WHO CAN RUN THE MOVIES OF THE GAMES OF MY PS2 !!!!!!"}, {"text": "Does it help the gpu?and higher the performance?"}, {"text": "Lol 😂 one Pakistani is talking"}, {"text": "REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE"}, {"text": "It&#39;s 128 GB of free space to pull RAM from, it&#39;s a pain in the ass to set up the pathway but USB is just as good as actually upgrading your RAM space. USE ALL THE PORTS :P"}, {"text": "Weak controller means any mixed read writes will choke it."}, {"text": "Wait so you install a game, place it in the USB and you can play it without lag? I&#39;m confused"}, {"text": "made in 2016, now in 2018 all my friends play csgo on the train"}, {"text": "Fortnite on a school computer! I&#39;m coming"}, {"text": "I download games on my flashdrive just to play at school lol"}, {"text": "What game was that on <a href=\"https://www.youtube.com/watch?v=maYuTnci4ys&amp;t=2m14s\">2:14</a>"}, {"text": "Can you play roblox on the usb whit internet? Plz answer  my pc can run it but hasent enof storage and dont want to buy if it dosent work"}, {"text": "xD guys I got my 128 GB USB for 7 AUD."}, {"text": "I solved the problem with the USB not downloading and crashing steam. <br />Step 1:Format the USB to NTFS this will stop crashes and should download properly like on a hard drive.<br />Step 2:In disk management Make your primary Partition is your Storage device not the USB with windows on it.  <br />Some reason windows picks your USB.... as primary idk why. <br /><br />It solved my problem."}, {"text": "CsGo had glitches because it is made by valve"}, {"text": "PLEASE CONVERT IN HINDI"}, {"text": "I don&#39;t think the bottleneck is the interface speed, USB 3.0 should be more than plenty fast. The bottleneck will be the flash media and controller used on the stick."}, {"text": "I need some advice, i&#39;m trying to install Portal onto a 32 GB USB Drive (I have only 17.1 GB of free space on my hard drive) and I want to record the game on Fraps. Now, I haven&#39;t tested this yet because I don&#39;t know if they game will lag out, but before when I tried to record with fraps to the USB drive (with Portal on the hard drive which brought my space down to 13 GB) I experienced lag every second, but if I run just the game alone there is no issue. Will there be lag with the game (without recording) on the USB drive? My computer has 8 GB RAM."}, {"text": "fortnut or naw"}, {"text": "Chris Pratt hahaha"}, {"text": "GTA V would totally fit but wouldnt run well."}, {"text": "can you make a video how you can transfer steam games in to a usb and use it to play them in a xbox one please?"}, {"text": "Can a normal usb do it?"}, {"text": "Is this a mini pc"}, {"text": "soo basically i can install and play games on this kinds of USB drive but is there anything i should know first b fore using these kind of Drives/storage?"}, {"text": "פ"}, {"text": "will it be also good for league of legends ?"}, {"text": "<b>when the usb is faster your hdd</b>"}, {"text": "You look like chriss prat"}, {"text": "See I&#39;m a broke boy and I can&#39;t afford a pc to game on, so I had to get real crafty. I got a computer from school that actually didn&#39;t run too bad. However I don&#39;t have access to an admin account so I can&#39;t install any games. So what I did was look for random games that had the word &quot;portable&quot; at the end of it. (Basically a repack of a game) now I have loads of games like diablo 2, gta San Andreas,  max Payne, n64 emu, and many more. Now I have to retake grade 10 because I&#39;ve been playing the legend of zelda in class every day."}, {"text": "For a second i thought he was chris patt"}, {"text": "O.k. the major question here is will a 64 gigabyte flash drive such as a Sandisk Cruizer Glide be faster than a 7200 rpm hard drive? I&#39;d be using it for Far Cry 5 offline. I&#39;m gonna try it soon."}, {"text": "try running a os and play games off it at the same time (ignore this if thats what you did in the video)"}, {"text": "lol I use my USB to play games at school"}, {"text": "i have 2 2 tb external hard drive and i have 100 games instaled on them work fantastic"}, {"text": "People are now becoming worried about TIME. Wow! Amazing dumb generation."}, {"text": "Can I do it on any USB stick"}, {"text": "ITS A FLASHDRI... SHUT UP YOU WANNA BE COMPUTER GENIUS"}, {"text": "bro u know what ur talking ab just next time english please"}, {"text": "How to format it?"}, {"text": "You look like Chris Pratt"}, {"text": "Што , русскей штоле?!"}, {"text": "Looks windy outside."}, {"text": "You really remind me of chris pratt"}, {"text": "Can I connect an Xbox pad? Use it on a standard laptop?"}, {"text": "So you can bring one or two games with you?"}, {"text": "how much is that USB X"}, {"text": "But can it play minecraft"}, {"text": "do this support on laptop"}, {"text": "what for games can you play with that usb"}, {"text": "We can’t play online ?"}, {"text": "Youre getting hiccups due to USB power saver settings."}, {"text": "I&#39;m gonna get like few tb flashdrives put em all in my computer and yah I got like 4 times the space of my hard drive"}, {"text": "Can u do it on a chromebook"}, {"text": "Flash drive not USB HAHAHAHA"}, {"text": "can i buy this for high graphic gaming purpose"}, {"text": "sometimes my game lag can it fix lagging in my game"}, {"text": "Do you like fcp"}, {"text": "You look like starlord"}, {"text": "Do I need to install steam on the Stick itself, or can I just install the games in a library on the stick with Steam installed on the main Laptop drive?"}, {"text": "Can I just use that memory to add to my dedicated video memory?"}, {"text": "I have been doing this almost 4 years, also using external hdds"}, {"text": "I have been playing games like Dota 2, GTA V on my Sandisk &quot;micro&quot; USB 3.0 (64 GB) for like a year now and never actually faced any hiccups, not even freeze frames."}, {"text": "Looks like starlord!!!"}, {"text": "Now im going to download gta5 on a USB because i&#39;m bored"}, {"text": "Were do you got that ?"}, {"text": "Is the USB version really slowing it down? From the numbers, that doesn&#39;t seem to be the problem. Also does the USB have similar drive levelling commands or will the drive wear out unevenly and quicker?"}, {"text": "Isn&#39;t the conclusion, that it might work, but CSGo sucks."}, {"text": "So I can put fortnite on this and play it at school even if the computers don&#39;t allow it"}, {"text": "*An USB Stick"}, {"text": "Ohhh my micro SSD is still beefier then those grandma sticks :p <br />No but seriously my micro ssd is like 256gig or 500gig I can’t remember but I remember the $150 I paid for the damn thing"}, {"text": "do you guys think I could play fortnite off of this usb stick, if so would you mind telling me"}, {"text": "Now I can play sims in class"}, {"text": "yh back in africa played prince of persia"}, {"text": "<b>You could get a usb with bigger size and install windows there(you can find the way i believe) and then do everything there instead of whatever you did because it used you&#39;r normal speed and everything its just that steam is installed in a flash drive and that is boring ._.</b>"}, {"text": "i can play world of tanks on ultra with a usb 2.0 stick at 120 fps with no lagg or something i have no plan why cs go stutter"}, {"text": "LoL u use google translate, huh? lol random hiccups in csgo :DDDD"}, {"text": "Just a tip: If you have two 64 GB flash drives you can run them in raid. With that you can have faster speeds and the same amount of storage!<br />Nice video though!"}, {"text": "it&#39;s hoping that it can bear the hard fps count and let pc in easy relaxed , then it is awsome"}, {"text": "my ps crashed when you put the game files on the usb i thought he edited in until i tried closing full screen"}, {"text": "Okay I&#39;ve done this before. Nothing amazing."}, {"text": "You have to format USB Stick with something that can optimize it to be SSD, not HDD. Because USB can handle chips (like SSD), same as drives (like HDD) or even discs (like ROM), you have to specify what your USB is, how to format it, and based on that format, its gonna be used. NTFS are the worst for USB Sticks, you could get way better from FAT64 and big sectors, but thats big waste of space. Then, you have to tweak your I/O. Standard Windows OS dont have I/O control, so you can experience freezing kind of issues, because something has been transfered, and something else cant (will pause/freeze), until its complete, but because of this I/O throttle, issue will be continuously. Windows Servers have I/O control (so anyone can request data from device thats been used), so it can handle lots of requests, and each one wont wait to get what he is up to, but it cost CPU power, because OS will monitoring everything, and scale throughput based on requests or so. For lots of files and RAID kind of storage (as things that server has to manage at once), its CPU efficient (usually powered by Intel Atom), but on USB with games, I/O control may take 100% of CPU power, things will be smooth, but if that game depends on your specific CPU power, gaming experience will be ruined. So again, not worth gaming on USB Stick.<br /><br />Can you test about SD and gaming? There are micro SD cards with speed up to 95MB/sec, they are not so expensive (low capacity), and cheap converters for micro SD to USB 3 (slim variants usually die at full speed), so you can even make a little RAID with HUB to bottleneck USB port. They doesnt have storage controller chip, so they are gonna be controlled by your MBO (not like USB Stick who got his own controller). Maybe testing in several RAID variants to see the difference. They drain way too low power, doesnt heat at all, got super speed, but storage is a problem (more expensive then SSD/HDD/USB Sticks). Its usually used on Servers for cache (just one of them, where constantly something has to be written, deleted, etc.)."}, {"text": "i am watching on 4k"}, {"text": "does the hyperxstick improves gaming?"}, {"text": "this guy he didn&#39;t show us how we can use usb stick for gaming"}, {"text": "Your saying i can play csgo on any computer i put an and will work?"}, {"text": "Omg....... Its chris pratt"}, {"text": "So if i buy a usb stick i can download games to it will my laptop be able to play them"}, {"text": "the stick is ugly as fuck imo"}, {"text": "idk im play gta5 off a 3.0 high speed usb on my ps3"}, {"text": "Jurassic World 3 Leaked Footage"}, {"text": "it buy on india"}, {"text": "Ah you install steam on the usb, that&#39;s where I went wrong with my external library! Steam would only recognize a game as installed on the computer I downloaded it on, and I couldn&#39;t import the library or use the desktop shortcuts (even though I could click on them). Now I know what&#39;s up, thank you! I&#39;m running off an external HDD, not a USB though."}, {"text": "but my pc not showing increase in ram"}, {"text": "can you do a step by step tutorial please?"}, {"text": "I think you are actor"}, {"text": "Does it work if you install steam on it and play it on chrome book"}, {"text": "I already do this, you have no idea how many 360 games you can hold on 50GB (2GB on system, 16GB on stick 1, 32GB on stick 2)"}, {"text": "i gamed off USB and never got any difference to be honest..... maybe you should try loading steam from computer"}, {"text": "YOU DONT NEED TO PUTT STEAM ON IT... you just need to putt a catogery and lod steam form pc"}, {"text": "you could just keep long power and sata cables going behind the motherboard tray in 2 systems. this way if the cases have thumbscrews you can quickly plug in an ssd and place it vertically. then you can just unplug your ssd when your done and take it to your other system. if you are really looking for a convenient permanent solution you could use a dremmel tool to make a cutout in the back of the case to slide in and out the ssd and plug it in outside the case."}, {"text": "the freezes in csgo was your internet."}, {"text": "I guess Chris Pratt gave up Holywood and went on to pursue his dream as a tech savvy"}, {"text": "these lords mobile ads tho.I hate it"}, {"text": "i had a crappy pc with 100gb storage and installed my games only on usb sticks"}, {"text": "I actually have a full windows 10 OTG install i can take to multiple computers that has nvidia drivers, steam and a bunch of games. Not practical for daily use, but great for testing!"}, {"text": "i used to run a few old games like fallout 2 from a flash drive. i kept fallout 2 on a flashdrive so i could play it at home and at high school when i would skive in computing classes"}, {"text": "<a href=\"https://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m11s\">3:11</a> you got shookth"}, {"text": "That usb stick is a savage!!!"}, {"text": "Hah, before seeing this video I actually migrated my WatchDogs and Witcher 3 installs onto my SanDisk Extreme 64GB USB3 drive (250MB/s R/W) when I still rocked HDDs back then. It made a HUGE difference with the loading times vs HDD and was my preferred method till I went and bought like 4TB worth of SSDs xD"}, {"text": "I just want to play doom on what ever I want"}, {"text": "Ok yeah Chris pratt, but also Finn Jones (iron fist). Anyone else?"}, {"text": "(polish)<br />ale mi nowość...<br />Sam używam dysków USB do trzymania na nich gier od ponad kilku lat <br />I używam zwykłych dysków a nie jakichś &quot;specjalnych&quot;"}, {"text": "this was for a test and it worked<br />what I did I took the league of legends files of my friends pc then I put it in my pc in local disc F where I have 500 gb <br />then I opened the game and it worked"}, {"text": "Gay pice shit"}, {"text": "Bruh, you&#39;d make millions as a Chris Pratt stunt double, wtf"}, {"text": "My laptop had not good storage that little guy gave me a lot of storage"}, {"text": "I want this for gaming please I don&#39;t have money"}, {"text": "Is... Is that a little Trabant? I want a little Trabant :("}, {"text": "So this USB allows you to run a game without installing it on the pc you want to use?<br />I mean this would be amazing for my night shift!"}, {"text": "i carry worms armageddon on a regular 2.0 usb stick, works fine everywhere i play it."}, {"text": "Believe it or not newer games will work better due to better optimisation for higher capacity memory. Often during the load times in BF1 multiplayer for example, during the load time the map will be loaded into your ram modules and will no longer utilise your hdd to load textures during game play. This can be a little different in an open world map like GRWL where the area and textures are much larger and constant buffering is needed and will vary from game to game to say the least. Therefore, only load times will be affected depending your read speed."}, {"text": "Hey,  it&#39;s Starlord from Guardians of the galaxy."}, {"text": "ist this a external procesor or an usb stick just to put games on and it changes nothing????????"}, {"text": "try raid 0 + ram disk for cs:go"}, {"text": "haaha lag"}, {"text": "How do you think we play CSS at school in LAN&#39;s without loading it onto the server and being detected ;)?"}, {"text": "In highschool we would put counter strike and halo ce on USB drives and never an issues"}, {"text": "I bought a USB to start gaming but I accidentally shoved it up my ass."}, {"text": "Some games read from the disk to memory more often than others."}, {"text": "whoever came up with this is a genius"}, {"text": "i use a 2tb external hard drive to game :3"}, {"text": "What is a USB stick"}, {"text": "Image you losing this."}, {"text": "Wait, So with the gaming USB..  Your running the game completely on the USB? Or is it just an add-on to the computer.<br /><br />Cuz I have a sucky computer and am wondering if my bad computer will make the games run any faster."}, {"text": "This is what my pc dose and I don&#39;t use a USB"}, {"text": "I was actually just starting to set up a USB game library to take on trips with me, though it&#39;s even more temperamental on mine, since my USB stick is from 2009"}, {"text": "I tried minecraft on it and it works perfectly"}, {"text": "So if I plug this into a laptop it lets me play better looking games?"}, {"text": "your intro got my sub"}, {"text": "<b>Dont be a sucker.... Dont buy USB with &quot;super-branded-speed&quot;.... Just buy simple SSD 120 gb for 70$ and be happy in ALL GAMES! =)</b>"}, {"text": "this usb is SSD??"}, {"text": "I did this all the time in high school with a USB"}, {"text": "The lag is cs-go could have been from game DVR and most likely had nothing to do with the computer."}, {"text": "lol 666k subscribers"}, {"text": "Anyone know exactly HOW to install steam on a drive cause im gonna get a Hyper X savage soon."}, {"text": "Anyone know exactly HOW to install steam on a drive cause im gonna get a Hyper X savage soon."}, {"text": "I want a USB drive that can run EXEs so I can use it on something that can&#39;t!"}, {"text": "Чувак у тебя каштаны во дворе. Ты с Киева. А еще у тебя модельки машинок с совка"}, {"text": "HAHHELOOEE GUIZ MAIH NAEHM IS DEMETRIEH"}, {"text": "This guy could be the son of Ricky from Trailor park boys xD"}, {"text": "pls use a 2.0 stick next time and test GTA V on it :D"}, {"text": "that USB stick has more storage than my computer :("}, {"text": "Rush b ?"}, {"text": "I helped my grandmother move candy crush to a usb drive"}, {"text": "Kingston&#39;s drives are great for large file storage, but their 4K (small file, 4K as in 4-kilobyte) read/write, especially write, speeds are abysmal, like with most other USB drives. Sandisk&#39;s Extreme USB series is far better for booting - a Live USB system booting from my 64GB Sandisk Extreme (original) works pretty much as seamlessly as on an entry level SSD, though file copies cap out at 250MB/s, half the sequential speed of an average SSD. Still, their 4K IO speeds hang around 10 to 20 MB/s, in contrast to the 1MB/s 4K speed on the drive used (and this Kingston&#39;s 4K write is more than an order of magnitude slower). Why am I talking about 4K speeds, not sequential speeds, which are what pendrive manufacturers use for their marketing claims? Because Live USB performance depends greatly on reading from and writing to small files, like system libraries and utilities. The only problem with the Sandisk Extreme USB series is that the original line is on the verge of discontinuation, the Extreme Pro line is way too expensive for the size and performance (Sandisk&#39;s portable SSDs and the Samsung Portable SSD T3 are both much better in terms of bang-for-your-buck) and the newer, cheaper Extreme Go line is not far better than competitors in 4K speeds."}, {"text": "this guy looks like chris pratt"}, {"text": "Chris Pratt ?"}, {"text": "HardwareNaCucks"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=2m37s\">2:37</a> thats how i always play dont worry"}, {"text": "How  about instaling windows on usb  and gaming on hdd,   any problems, stuttering?"}, {"text": "ssd lose vroh."}, {"text": "иди на хуй"}, {"text": "If i&#39;m not at home so i use my usb-drive 64GB to play WoW on a friends-pc or in some gamingCafe&#39;s too. really easy to do ;D"}, {"text": "Imagine like when youre invited to a Lanparty/ Bootcamp and u dont wanna bring your PC with you, then u juast take the games on the USB STick and Plug´n´Play :D Great Portable Game Libary!"}, {"text": "its the internet connection that is the problem. a computer is built to connect to the internet but now instead it has to take data from the drive which might note have the capability to send that much data and collect it back."}, {"text": "subbed cause I saw Transitor"}, {"text": "How are you a cannuck?"}, {"text": "Why&#39;s there a Trabbi on his desk?"}, {"text": "I thought that the whole pc was built in USB."}, {"text": "Who else thought you&#39;re stucked when the CSGO went stuck?"}, {"text": "What camera did you use? I wannnnt it"}, {"text": "star lord omg 😱😱😱😱😮😮"}, {"text": "i play Halo CE on a 4GB USB... same old USB... I only play modified singleplayer maps ;-;"}, {"text": "Boys the lesson here is: If something can&#39;t run CS don&#39;t buy it."}, {"text": "WTF hahahaha"}, {"text": "What is the name of the monitor?"}, {"text": "if u plug the hyper x savage in a usb 3.1 port, it read with nearly 400 MB/s, i tested it"}, {"text": "Does anyone else think he looks like chris prat"}, {"text": "Gaming on a live USB running Ubuntu? I do that all the time I just installed warthunder on a separate disk so that I can use it every time and run it. I have to figure out how to use directs 9, 10 or 11 since opengl reduces framrate from min 15-18 fps to min 8-15 fps."}, {"text": "*FROM a USB"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=1m04s\">1:04</a> Lovely cut there."}, {"text": "Fak, we can&#39;t rush B if we use that USB Stick"}, {"text": "hello my personal laptop has only 512 of graphics so can I play games on the hyper x foes it supports high graphic games or it is just for storage pz ans"}, {"text": "this guy reminds me of Chris Pratt. he looks like a twin or something"}, {"text": "You look like Chris Pratt"}, {"text": "USB was developed and created by a indian"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m07s\">3:07</a> game&#39;s name pls :D"}, {"text": "tfw a 65euro flashdrive has more gb than your pc"}, {"text": "but does it run crysis?"}, {"text": "Corsair GTX"}, {"text": "usb c?"}, {"text": "Gamed over a network once, meaning I had the game installed on another machine and launched it on my PC. Basically just to see if you could do it."}, {"text": "cool editing!!! i subbed"}, {"text": "Well, USB-Sticks aren´t really made for writing the hole time. They just made for &quot;put something on it and forget it there&quot; so i think thats the reason, why its so instable i would say"}, {"text": "thanks this is what i was looking for"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=1m03s\">1:03</a> fidget spinner<br /><br /><br /><br /><br /><br /><br /><br />I&#39;m not sorry"}, {"text": "imagine we play bf1 on this!"}, {"text": "This give fps?"}, {"text": "Hopefully games get released on USB instead of Disks. We need cheap USB sticks that can store minimum 500GB so that games can be 500GB. Because 8 MB/s is too slow to download 500GB game."}, {"text": "Can I put console games on this USB?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=1m12s\">1:12</a> HOW DID YOU PLACE IT LIKE THAT!?"}, {"text": "im poor :("}, {"text": "this dude looks like vintage genetics"}, {"text": "I thought it was downloading free games to USB.. to play"}, {"text": "What games where you playing?"}, {"text": "NO! I am Dimitri!"}, {"text": "Who the fuckis Dimitriisnt that matt Damon???"}, {"text": "Dude is that gtx graphic flash drive or ram plz tell I don&#39;t know plz"}, {"text": "I play on a SSD stick!"}, {"text": "I use game off a external HDD with version of Portal and Unreal Tournament on college computers... I mean as research obviously..."}, {"text": "starlord v:"}, {"text": "i use a 1tb seagate hard disk :P"}, {"text": "Seriously 😂😂😂 I thought The Game Ran On It 😂😂😂"}, {"text": "I thought the USB runs the game"}, {"text": "can It play minecraft?"}, {"text": "wait, is the usb a computer or a speed booster"}, {"text": "Not &quot;on&quot; a USB stick. It&#39;s gaming OFF a USB stick."}, {"text": "Installed for 2 minutes  rise of the tomb rider downloaded it 2 days cuz my internet sucks dick"}, {"text": "Chris Pratt?"}, {"text": "Spongebob : I NEED IT!!!"}, {"text": "try usb-c"}, {"text": "i thought we are using usb to increase some game performance on low end pc.but this video is different...."}, {"text": "Were is the 1tb USB stick"}, {"text": "NOW I CAN SNEAK MY STEAM GAMES INTO SCHOOL"}, {"text": "Are you Dutch Chris Pratt?"}, {"text": "I misread the tittle <br />I though it would make it the world&#39;s first USB Gaming Console"}, {"text": "Wrong title"}, {"text": "wait so is the usb stick a little GPU?"}, {"text": "so can i do the same with a sandisk 64 gb usb just to have windows on that i have no money for a hdd"}, {"text": "guys if u have this usb plug it in the back straight in your motherboard not in you front io it wil be slightly better"}, {"text": "what camera are you using?"}, {"text": "I used to do this back in highschool, with a 250gb portable hard drive, had a small steam library other games like Halo, Starcraft, Diablo 2, Age of Empires 2, my spare blocks weren&#39;t overly boring :)"}, {"text": "Not trying to be rude but i can&#39;t watch cause that accent is thick lol XD :D :) :b"}, {"text": "Aren&#39;t Intel SSD&#39;s bad?"}, {"text": "SKASE!"}, {"text": "Could you also use a sd card for gaming on games like Watch Dogs 2?"}, {"text": "lol i game off an SD card, not a USB"}, {"text": "any chance for an update, has this gotten any better? would be cool if companies like steam ensured this as an option, schools and some stores/restaurants have public gaming systems, you could just plug your usb in and play your games there with friends"}, {"text": "Keyboard!!????"}, {"text": "Can I use for the sims ?"}, {"text": "i used sd card for games"}, {"text": "from did you buy this fantastic USB"}, {"text": "hacks"}, {"text": "I have usb4"}, {"text": "just found this channel. subed. love it"}, {"text": "I play GTA San Andreas using a chep 2gb usb stick"}, {"text": "Lol. I thought this thing out preformed by Pc . xDDD"}, {"text": "cs go is optimized with an ass"}, {"text": "Lol I have to game with a USB stick on the daily since I have a netbook with 32GB eMMC storage. It&#39;s a 32GB USB 2.0 drive, yet somehow even with my crappy specs (Atom @1.33GHz, 2GB RAM, Intel HD graphics), I can run TF2 at 30 fps on lowest settings with not much stuttering at all."}, {"text": "this guy looks like Chris Pratt&#39;s brother"}, {"text": "it took the same time to install on my pc"}, {"text": "i game off of external usb drives, powered by usb not external power, using usb 3.0 and its great, even games like crysis work just fine. the only downside is slightly longer loading times for levels but once its loaded everything i believe is in your RAM so no slowdown!"}, {"text": "can i use network usb stick on ps4?"}, {"text": "Could you play sims on it?"}, {"text": "First thing I saw was Chris Pratt? Awesome added bonus!"}, {"text": "Can I just plug this into a monitor Nd play?"}, {"text": "very misleading title"}, {"text": "I have been gaming with a USB drive for years now. when I was in school, I was the kid playing medal of honor or Skyrim when everyone else was playing flash games. Recently managed to set up fallout 4 to run off a 3.0 flash flawlessly at 85 fps."}, {"text": "No RGB 0/10"}, {"text": "Oh cool! I have the same model ssd (OCZ trion)"}, {"text": "👈👈😁😉😊😙😚🙏🙇👌👍👍🤘🤘💋❤"}, {"text": "is there any way you could redo these tests, except on linux to eliminate some of the overhead? that would be amazing!"}, {"text": "i have a 117 GB USB will it work with that"}, {"text": "yes roller coaster tycoon 2"}, {"text": "How about on an external SSD?"}, {"text": "I&#39;m running boot camp on my mac and I bought the digital download of bo3 on steam and I own it but can&#39;t install it if I get a 128gb USB stick could I download it on to the USB stick and plug it in whenever I want and play"}, {"text": "u joking ? this usb stick is better than my pc :D"}, {"text": "Didn&#39;t knew Chris Pratt had a YouTube channel"}, {"text": "i got 32GB X("}, {"text": "yeah i think it is cs go its fault i also gets these short freezes at joining aand buying."}, {"text": "Peter Quill? Guardians of the Galaxy?"}, {"text": "what speakers are those?"}, {"text": "...or &quot;Running Games From a USB Stick&quot;."}, {"text": "Is it as savage as it sounds???"}, {"text": "ThroughPoot"}, {"text": "i play minecraft on gameband. i play broforce and call of duty 2 on usb. althought i have no memory more to put cs go there"}, {"text": "hy laptop hdd is 128GB so i play all my games on a usb3.0 sandisk 64Gb"}, {"text": "what about GTA 5?"}, {"text": "Thank you"}, {"text": "yt"}, {"text": "try it on Rainbow Six Siege"}, {"text": "In 11th and 12th grade, there was the full version of Quake 3 on the school&#39;s network drive connected to the computers, along with games like GTA: Vice City. Naturally, I brought a few flash drives (8GB+ was a bit expensive still.) to put the games on along  with my other files and had Quake 3 ready and then shared among the other kids in class. So when the teacher gave us free time, I basically shat on everyone in Quake 3 XD."}, {"text": "yep ... Mr .Dimitri your really familiar ... Chris pratt"}, {"text": "what is the game just after CSGO test?"}, {"text": "Desert logic one senator exception partnership history relative sophisticated"}, {"text": "Got a 256GB USB on sale for $45 and threw DOOM and ARK onto it and the only issues I&#39;ve encountered were the updates and installing the massive games on there. The benefit of being able to make it portable and free up room on my SSD while improving load times is awesome."}, {"text": "what is the name of game at 2-55?"}, {"text": "dude have you tried changing the usb properties like the removal policies to enable caching. See if it improves your CSGO.<br />Interesting device though"}, {"text": "i got a 457 gb usb or external lol"}, {"text": "I once installed Steam on a USB 2.0 stick. It was awful. Steam was so slow I just gave up on it."}, {"text": "I think it would work better on a 3.0 raid would it not?<br />By that I mean plugged directly into the pc no array to bottleneck the speed."}, {"text": "if i put this in my pc can it boost the performence stats"}, {"text": "he looks like owen from jurassic world"}, {"text": "mack this raid 0"}, {"text": "The freezes/pauses/slowdowns you experienced in the more demanding games are due to the flashdrive&#39;s poor 4K random speeds. Try the Sandisk Extreme Pro 128GB instead. It has 4K speeds that are about 10x times faster than the Kingston!"}, {"text": "If we could use two 3.0 USB at the same time it would be perfect, we could save the game into both USB and have faster DATA transfer which can allow a much better gaming experience."}, {"text": "eik nx dimitri blt"}, {"text": "Back in 2007, I began gaming on a USB in college, since I was in school all morning until evening, I would play games and emulators off my 3 different flash drives during breaks or free time.  I remember somebody brought in Quake Arena when our Professor was absent and they shared over the network and setup a server in the computer lab and we had a LAN party (My very first, good times)."}, {"text": "Well 128GB is not much for games, since most big games to day is almost 40/50GB so you would only have around 2-3 games on it, if you want to play big games,"}, {"text": "i played mario on a usb stick"}, {"text": "i playd on a SD card"}, {"text": "hey, I hav gt610 2gb edition, intel core2 quad q9400, 8gb ram, does that mean im poor?"}, {"text": "he lools like chris pratt on guardians of the galaxy and Jurassic world"}, {"text": "lol 4k gaming from a usb? chumad?"}, {"text": "the industry really fucked us customers over with the usb 3.1 gen 1 specification, basically allowing manufacturers to call their old products new ones and lying to the customers. They should fire the people who made that spec."}, {"text": "lol squad running smooth, ahahahaha that game need a faction of programmers to be created in order to smooth out that game"}, {"text": "Read This if your an idiot<br /><br />Read More"}, {"text": "There&#39;s something about the drive that I don&#39;t understand fully. If I had an ok or weak laptop, could I play games on it with the drive?"}, {"text": "-ͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨͨ- <i>did you know i could do that</i>"}, {"text": "How would I make games run off a USB at school?"}, {"text": "HARDWARECUCKS"}, {"text": "you should have put the operating system on the USB stick too"}, {"text": "i&#39;ve got a 2 TB external harddrive that i can carry with me instead."}, {"text": "How about gaming on a USB SSD?"}, {"text": "<b>WAIT WHAT KEYBOARD IS THAT AT </b><b><a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m22s\">3:22</a></b><b>??!!</b>"}, {"text": "Will it work with raspberry pi 3?"}, {"text": "external SSD plus USB cable"}, {"text": "or... go with esata ssd"}, {"text": "its very goooooood"}, {"text": "hello i dont get this so the usb has like a gaming shit on it"}, {"text": "So is the USB using the computer its plugged intos resources?"}, {"text": "is he canadian?"}, {"text": "I have the same exact USB Stick"}, {"text": "I have a 64GB HyperX USB"}, {"text": "gotta admit he looks a lot like Chris Patt lmao"}, {"text": "How about getting two of these in raid 0 would that make them faster?"}, {"text": "Damn too bad I already thought of this idea"}, {"text": "Hellos, ^^ can you be able to download games from origin from this USB drive/external hard disk, because when I use my 1.90 TB one, it says that it cannot be used on that specific device?"}, {"text": "I actually had all my games on my generic usb so I could play games on the library computers when I was in highschool.<br />I even put my computer games from my personal pc onto it and played them at home so my technologically disabled parents would let me because they thought that storing games on my computer&#39;s hard drive would &quot;damage the computer/give it viruses&quot;"}, {"text": "So can I use the usb without a computer? I&#39;d like to game but don&#39;t have a computer."}, {"text": "I will be honest im stupid and this is probably a stupid question but you almost made it sound like if you have a good monitor no matter how shitty the PC is you could plug this in and play games"}, {"text": "the install speed on steam is just steam. Updates and downloads take way too fucking long."}, {"text": "GET A PORTABLE SSD"}, {"text": "can we play gta 5 on this usb?"}, {"text": "I gamed GTA san andreas on a usb stick with USB 2.0 actually, worked completly fine for me :D<br />I used it to bypass the school computers installation blocking XD"}, {"text": "USB STICK MASTERRACE"}, {"text": "did linus fired you??"}, {"text": "Could League of Legends be played off a USB?"}, {"text": "can i request dota 2 gameplay? tnx"}, {"text": "You changed your shirt 3 times for the intro. That&#39;s dedication."}, {"text": "Right now I&#39;m using my WD Passport Ultra 1 Terabyte of space"}, {"text": "I played GTA 5 on usb 2.0 and no lagg but longer loading speed"}, {"text": "i know right he looks like the Star Lord (chris pratt)"}, {"text": "Say if you use a office/school computer and u hook this thing in could u play SQUAD 30fps?"}, {"text": "BLASPHEMY!!!!!!"}, {"text": "It&#39;s all fun until those 10,000 read/write cylces are done."}, {"text": "what ediing software is that?"}, {"text": "Because CSGO was busy giving that USB cancer. Once you stopped and stepped away from the whole CSGO thing it healed gradually to be cancer free and happy once more as it didnt need to CSGO anymore :) The end."}, {"text": "if I have a low capacity macbook pro could I use this to boot camp windows"}, {"text": "gaming online may not be the best option 😁😁😁"}, {"text": "&quot;UEZB&quot;"}, {"text": "this usb is the same size as my ssd. <br /><br />840 pro life I guess"}, {"text": "i have gamed on a thumb drive and the thumb drive being only usb 2.0 and well playing overwatch i experenced no slow downs at all"}, {"text": "Hmmmn... Could be fun trying to buy one for each usb slot xD"}, {"text": "Strangely CS:GO works fine playing via my NAS. Probably going to end up storing most of my games on my NAS and take my HDD out of my PC just having the SSD for the ultimate silence."}, {"text": "i subcribed , now ive heard that if i sub you , ill get a free copy of cod iw pc"}, {"text": "Could the freezes be caused by this USB stick? Have you tried any other? I&#39;m gaming from a very cheap 64Go USB 3.0 stick and have no such problems."}, {"text": "who actually uses USB3 drives anyway, ive got thumbdrives that dont even saturate USB1 spec :P"}, {"text": "Can we save PS4 game data on that USB?"}, {"text": "Is that Nigel Good I hear?"}, {"text": "That Usb has more space than my pc"}, {"text": "put ten of those in raid 0"}, {"text": "very cool video!"}, {"text": "For Runing Windows 10? this works? or its more eficent buy a external usb 3.0 hard drive?"}, {"text": "I remember how I installed GTA Vice City on a flash drive. We played it when we were at school and it was so much fun. Only the save files tended to corrupt."}, {"text": "Before i got a gaming PC I had to use my HP stream which is for like youtube but it didn&#39;t have enough space to install FSX that i bought in store so I saved it on to my 2Tb external hard drive with usb 3.0 and it worked quite well."}, {"text": "Why was csgo glitching? because its all fucked up. VALVE FIX CSGO!!"}, {"text": "I have played GTA San Andreas on a 16gb USB 2.0 Kingston"}, {"text": "I don&#39;t game on the USB stick as of yet. I use them for mostly videos to attach to my TV set so I don&#39;t have to disassemble my external hard drive and move it. I be glad to try to use the USB as an external storage for a PS4!"}, {"text": "hahahaha😂 starlord took a break from saving the universe😂"}, {"text": "wait so does this need your computer to run games well?? please help!!"}, {"text": "marry me?"}, {"text": "Can I please have feed back on my channel"}, {"text": "So this is a tiny computer?"}, {"text": "Wait. I don&#39;t understand. <br /><br />If your PC is only 2 of ram. <br /><br />And you buy this USB. <br /><br />It run. Heavy games. With out lag ?"}, {"text": "ik why csgo freezes cause gaben is a fucking a**hole and wont increase gaming performance for the game and only put in skins"}, {"text": "CSGO freezes for me, Rainbow Six Siege runs smoothly. Go figure."}, {"text": "awesoooooooooooooooooooooooooooooooome!!!!! YOU ARE SUBSCRIBED!!<br />What is the best headsets for gaming under 1.5k indian rupees  or 25$"}, {"text": "I have some games on a USB 3.0 external hard drive, some off a internal hdd and some on a ssd from my experience USB harddrives at least the one I have are no faster nor slower than a internal one. obviously the ssd is faster than both though"}, {"text": "Conclusion: Don&#39;t play CS:GO with a USB"}, {"text": "Just buy an ssd and forget about it for the next year or so."}, {"text": "Subscribed after watching <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=0m20s\">0:20</a>"}, {"text": "for some reason all valve games have an issue with freezing up on USB. its not the USB it&#39;s the source engine."}, {"text": "uhhh... is dis compatible with USB 2.0?"}, {"text": "Flash storage isn&#39;t made for continuous reading and writing. Wouldn&#39;t expect it to last all that long."}, {"text": "y my nme is Dumitru"}, {"text": "so Chris Pratt is reviewing some stuffs while saving the galaxy.."}, {"text": "Looks like a chubbier version of Chris pratt"}, {"text": "I guess a portable SSD might be a bit more reliable."}, {"text": "m..wht is that ?"}, {"text": "Omg you look like Chris Pratt!"}, {"text": "why did you go to your plant when you said &quot;yep&quot;"}, {"text": "bounce on composition encounter."}, {"text": "Press 0 over and over again"}, {"text": "So if I have this I don&#39;t need that good of a PC, or no?"}, {"text": "wait does that usb make your space a terabite? and then you plugg it out and then u have terabite of space????"}, {"text": "why did you call it a usb stick? slightly misleading"}, {"text": "that usb is more power than my laptop wtf"}, {"text": "dude..... where the fuck is your eyes??"}, {"text": "Never knew you could do that. That&#39;s time I played games from a USB it was a USB 2.0 device and they were just flash games."}, {"text": "I put mario and halo on an old usb in High School and they played very well. high fps on the old school computers. Good times."}, {"text": "My name is Dmitri too!!"}, {"text": "next: OS on a USB ?"}, {"text": "I have a very bad pc, i can run CS:GO at 46 fps avg., will i be able to get better fps if i use the stick?"}, {"text": "whats the big deal in this , i used to do it all the time"}, {"text": "why is it 4k"}, {"text": "2000subscribers"}, {"text": "Is this USB Stick giving you dedicated RAM?"}, {"text": "we used to play cs 1.6 like that ^^"}, {"text": "savage"}, {"text": "chris pratt is that you??"}, {"text": "lol is no one going to comment about that headshot @ <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m10s\">3:10</a>"}, {"text": "That USB stick is really &#39;Savage&#39;."}, {"text": "What game was he playing at <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=2m44s\">2:44</a>"}, {"text": "the usb stick is just like any normal 8gb usb just that it is 128gb right?"}, {"text": "it has the mm cw X"}, {"text": "Sure you can game on it, but how long will it last? That&#39;s the question. Get an SSD folks, seriously, not that much larger. Thx for test hardware canucks ;)"}, {"text": "i have gamed off of a usb flashdrive in the past for the most part its a ez way to hold a ton of games just for a rainy day or if u share a house pc u can at least have a few things to your self ganes movies pics songs as safe as in ur backpak all in all it is a way to think about saving space on ur pc without all the pain of wires and its size makes it less space needed to store and carry"}, {"text": "I HAVE A FUCKING TERABYTE FLASH DRIVE WTF"}, {"text": "necesito esa wea"}, {"text": "song playing throughout the video ??"}, {"text": "what lens?"}, {"text": "got a 2tb for 11$ ebay(china)"}, {"text": "there are actually many reasons why not to play on USB stick. They are way less reliable than normal SSD. They are not meant to be used extended times either. Heat can kill them prety fast, and they can even kill your usb port when used too heavily"}, {"text": "you are the russian youtuber with best prononcion i seen"}, {"text": "DON&#39;T DO IT!! I played rise of the tomb raider and I was 60% in and one day my save was just gone..."}, {"text": "the new macbook pro just doesn&#39;t care...!!"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=00m23s\">00:23</a> well hello Star Lord"}, {"text": "waaaaaait wait wait, you were sittin&#39; on it?"}, {"text": "Странно что тут так мало русских коментов"}, {"text": "sleep snap operation generous planet interpretation"}, {"text": "lol, gaming on tiny devices is fun.. a installed minecraft on a 1gb sd card and still get decent fps for the laptop"}, {"text": "ur eyes beautiful &lt;3!"}, {"text": "I once got a USB and downloaded a bunch of small games on it then  I would (when there was no teacher around ) play them on the school&#39;s computer then unplug and no one was any the wiser."}, {"text": "dang that usb stick is 113$. i can get 3tb hhd for  80$ xD <a href=\"http://www.newegg.com/Product/ProductList.aspx?Submit=ENE&amp;DEPA=0&amp;Order=BESTMATCH&amp;Description=HyperX+Savage+USB+&amp;N=-1&amp;isNodeId=1\">http://www.newegg.com/Product/ProductList.aspx?Submit=ENE&amp;DEPA=0&amp;Order=BESTMATCH&amp;Description=HyperX+Savage+USB+&amp;N=-1&amp;isNodeId=1</a>"}, {"text": "I will sub to anyone who subs to me and likes this comment so i know"}, {"text": "It would have made more sense to install Win 7 or Win 10 onto the flash drive then install Steam and your games. If you just install Steam and games onto the flash drive this causes confusion and extra work for the computer for certain games. You can run into registry issues, RAM processing, temp files, and the computer has to use files both on and off the flash drive, utilizing more RAM and CPU to figure out where is what, and where it needs to be. Installing Windows and then Steam and your games all on one flash drive could make the results more consistent with games."}, {"text": "this is what I do for my brothers games since he doesnt have his own PC where he can download his own games"}, {"text": "I was able to play WoW from a USB stick, back in the 2.0 days of USB ports just fine. THe only drawbacks were the slower load times really."}, {"text": "Lol I play mine off a USB because I have no space on my pc"}, {"text": "3.0 USB Port? I play video game and I never have freezing on all my usb and no slow down time on them. Fast installing time and no crash."}, {"text": "I put games on USB stick for a long time, wait when 500GB sticks become available on the market(prob coming in 2017) we already have the 256GB at the moment, when 500GB hits the market, the Internal Harddrive and External pasport going down in the market, because USB sticks getting cheaper by day, i&#39;ve seen people bitching about Emmc sucks and SSD rules, but remember a USB stick, 3.0/3.1(type c) can smoke(outrun) the SSD on top of that, just add a 7 port USB HUB loaded with 500GB sticks is very easier than breaking open a case and add a SSD inside..."}, {"text": "4000Subscribers"}, {"text": "high games can work but have to be good programmed else it will kill it than you should have a USB 3.1 type c"}, {"text": "ONLY USB 3.1 HAVE MORE SPEED OF HDD SATA 3.0GB/S OR HDD/SSD 6.0GB/S. USB 3.0 HAVE A REAL SPEED OF A 3.2GB/S."}, {"text": "Would this improve a ps3 slim? not the best at computers and shit (just good at games)so dont jude :3. for example if you simply plugged it in would it be better like improve the game overall?"}, {"text": "Even back in the past, when we had only USB 2.0, I was playing with idea of using USB sticks to sell games on, bit like cartridge on consoles. Having obvious advantage of not using space on hard drive, ability to keep saves with a stick and ability to patch game once and it is patched for any system you use it on. It even wouldn&#39;t remove ability to install game and it would install it with latest patch on the drive. And with USB 3.0 speeds, technology wise, we are not limited too much anymore. It is only price wise.<br /><br />Now sure some of those things can be done today too. You could easily do same thing as on video. And steam already backs up your saves to cloud. But still, installation wise and portability wise it would be nice to have this. Since today, games taking 30, 40, 60 or even close to 100GB are not so unusual And it is not a problem if you have fast internet. But not everyone has that. Game on USB drive could solve some of the issues. I could take it to someone with faster internet and have them download update for me. It would provide me with whole game, not like for example Fallout 4 where you get only part of the game on disc, rest is downloaded, even if you buy it on disc.<br /><br />Not to mention lower need for hard drive space. Because you don&#39;t buy 500GB or 1TB or even bigger hard drive just for your programs and movies. At least on my end, most of it is used by games.<br /><br />And it would add save portability on games where you don&#39;t have it. Sure Steam has it. But GoG for example doesn&#39;t. And while I don&#39;t blame GoG. Maintaining such cloud is expensive, it is still awesome feature I would love to see. I can&#39;t even count how many times I had to restart game, because I lost files with new Windows installation.<br /><br />I even tested few games by running them on USB 2.0 external drive and while loading times were long, a lot of them performed just fine, as long as everything they needed was in RAM. Which will be true for most games."}, {"text": "lol that bit after announcing we are gaming off a usb stick lol"}, {"text": "People have been installing games to flash sticks and external HD&#39;s since the dawn of time though..."}, {"text": "is it the usb making the computer able to process the games that have that good graphics or is that the PC"}, {"text": "Can you do a colab with Rocket please"}, {"text": "no i use a 1 tb HDD"}, {"text": "so if u get something like a 2tb external hardrive... will it work to game on a laptop??? also thnx for this vid, the only quality one that i was looking for"}, {"text": "i always have this issue in CS:GO  on  <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=2m30s\">2:30</a> everytime i play I&#39;m not playing on a USB or an external Hard Drive i&#39;m using my Internal one anyone got a fix?"}, {"text": "Have you ever gamed on USB stick? My current PC is slow as 2.0 USB stick..."}, {"text": "never knew a stick could be savage. FUCK YA"}, {"text": "nice idea"}, {"text": "how I play csgo"}, {"text": "Russian Chris Pratt."}, {"text": "😱 wow because most people don&#39;t play steam games off of an external hardrive anyways!!!"}, {"text": "I gamed on an usb stick. GTA:SA   Good old times :D<br />no lags or other things :DD"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=0m25s\">0:25</a>  <b>the cringe is too strong</b>"}, {"text": "Step1: Highlight the numbers <br />Step2: Ctrl and F <br />Step3: Put 9 in <br />Step4: Enjoy :)<br />051541451431641621571721571511441234567881234567812345678123678326470547 2996473257499999650199625379989999993413269916749953349999914649932724997 2994567802992569930199056769909927336781467998299634699818991169966144990 2997364561990129985699801329959999012615302799995324993243699019923412993 2994567801993569980299356789939923456725634569974326992644399243992369936 2994567801992689901239967899029935245745315319931253399436998011992349950 299999934529999938835299999103999999123201247993467328999998264049999941"}, {"text": "Shelter lack license user tune Italian part buy parent."}, {"text": "that is crazy I got one of those savage usbs haha damn never knew they had that potential :D <br />I just swoop over some movies now and then in 40mb/s :D"}, {"text": "what is the game @<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m07s\">3:07</a> please ? =)"}, {"text": "What a wind! <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=4m30s\">4:30</a>"}, {"text": "CS:GO random slowdown can be explained by the game cheat prevention making hash on the game files in order to check it integrity."}, {"text": "wow 128gb is bigger than the hard drive in my laptop"}, {"text": "clickbait"}, {"text": "Please do this video again but with USB Type-C!!!"}, {"text": "Nice trabant 👌"}, {"text": "Don&#39;t worry steam always takes long to install"}, {"text": "Lass dich nicht verarschen !<br /><br /><br />Mehr anzeigen"}, {"text": "What type of router do you have, thanks!"}, {"text": "Can this work if u have a crappy pc"}, {"text": "I think csgo didn&#39;t work so well because it is a multiplayer game ,unlike the others."}, {"text": "hello chris pratt"}, {"text": "To fix partially the problem of freezes in CS:GO just put +cl_forcepreload 1 in the startup options :p It can fix that :)"}, {"text": "when i use to go to highschool &lt;3 1000% gaming off usb in the computer lab since they block you out of alot of things on those computer but now i go to college XD i just bring my laptop"}, {"text": "So, does that mean, that if you have a bad pc, that runs games with lower fps, it makes it faster and gives you more fps?"}, {"text": "Eyy"}, {"text": "I&#39;ve played a bunch of games on a regular flashdrive. i&#39;ve played halo, I Wanna Be The Guy, Platypus, MAME, Cave Story, and more on a school computer."}, {"text": "what keyboard is he using? thank you :)"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m02s\">3:02</a> What&#39;s the name of that shooter?"}, {"text": "i thought they were going to test that thing that is an entire pc on a usb stick."}, {"text": "I installed windows on a 1 TB 3.0 hard disk and boot my mac of off it and played Arkham knight on it."}, {"text": "I use a similar USB with Ubuntu installed with steam and a crap ton of games and it works great. I can even boot into it on a few school computers."}, {"text": "why?"}, {"text": "click-bait"}, {"text": "hyper x savage hhhh"}, {"text": "Oneplus 2 <b>-</b>"}, {"text": "Hello everyone I&#39;m Dimitri with Harwaakekux."}, {"text": "You could try cl_forcepreload 1 on csgo and try the experiment. It forces the map to preload all assets so that it minimizes the disk usage in a match."}, {"text": "When mother boards can handle 128 gb memory at a descent price, I rather game on ram disk.  80 gb is my goal.  It absolutely rocks.  No stutter, no pauses no glitch.  CPU and GPU are the remaining factor to load and game experience"}, {"text": "It&#39;s spelled &#39;HyperX SAVG&#39; not &#39;HyperX Savage&#39;"}, {"text": "Awesome, but costly :("}, {"text": "so what if you downloaded multiple copies of a game on to multiple usb&#39;s and sold them? hehe"}, {"text": "You look a bit like a poor man&#39;s Chris Pratt :P"}, {"text": "What is the difference btw this usb and a normal 128 gb usb ?"}, {"text": "I thought it was a super USB that if i connected it to my pc, it would let me play games in ultra and stuff"}, {"text": "Do you put it in your computer ??"}, {"text": "man your camera so HD"}, {"text": "How about gaming on Ramdisk instead. :P"}, {"text": "56sek is very slow for this"}, {"text": "I&#39;m running my Linux OS off of a USB Stick as I watch this :)"}, {"text": "who uses usb sticks anymore..."}, {"text": "Cs go performance has to do with source engine and the way it handles the files. I bet my ass that left 4 dead or hl2 would also had some stuttering even if they are old. The size of the game folder is normal, but the ammount of little files is gigantic."}, {"text": "I don&#39;t now why  you didn&#39;t  have a 1M subs it&#39;s 3 year  and i&#39;m watching  you you are amazing"}, {"text": "game on minute <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=2m44s\">2:44</a>??? please"}, {"text": "so in other words no don&#39;t do it if u play multiplayer just hell no. The video was awesome.<br />Csgo stands for cheaters supercede game ordinance."}, {"text": "I actually do this pretty regularly, and have only experienced the stuttering you had in CS:GO while playing games running on the Source engine. I have also played some MMOs off my USB, and haven&#39;t run into any stuttering there. Luckily it doesn&#39;t happen often, so it shouldn&#39;t bother you too much."}, {"text": ":c i cant even game on a mac."}, {"text": "Canucks? more like cancucks"}, {"text": "200subscribers"}, {"text": "World of warcraft and diablo 2 works on flash disk really good."}, {"text": "The shot at <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=1m08s\">1:08</a> is not centered all the way... I&#39;m getting really triggered"}, {"text": "that fucking misleading ass title lol"}, {"text": "possible to game on sd card?"}, {"text": "help me out please I just started this channel for gaming vlogs and reviews please sub to my channel ill gladly appreciate it thank you everyone."}, {"text": "Now make a raid array of these and use it as an hdd"}, {"text": "Few years ago i used to bring my steam library usb stick to my friends place because my computer couldn&#39;t handle the games and theirs could."}, {"text": "The moment when a usb is better than your pc"}, {"text": "I was planning on doing something like this once."}, {"text": "Its my birth day can i get 1 sub"}, {"text": "I learn more from the internet than from any of my high school teachers combined"}, {"text": "Song name ????"}, {"text": "does any &quot;ssd-like&quot; usb3 stick support UASP yet?"}, {"text": "i like the way there is a zuguliz on the desk <a href=\"http://www.youtube.com/results?search_query=%23lifeofboris\">#lifeofboris</a>"}, {"text": "u know ur pc is shit when a usb stick plays games better than ur pc"}, {"text": "The usb drive you used is already limited to 350mb/s. Yes that is one of the fastest on the market, but given it isnt anywhere close to the usb 3.0 limit I doubt usb 3.1 type c will make any difference.<br /><br />The limit is the drive storage hardware, not the computer."}, {"text": "does this thing like speed up the laptops?"}, {"text": "you can choose which games get installed where so you can put more demanding games on the HD"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m09s\">3:09</a> game?"}, {"text": "I did actually i bring halo 1 to school and play at school and sometimes some emulators."}, {"text": "420.9 lel"}, {"text": "when I update my system technology might be a bit better and this might be a possible solution for me"}, {"text": "I have been playing dark souls 3 on my 2T hard drive for 2 month and this are no compromises."}, {"text": "I bet it would be wonderful with a USB C/Thunderbolt 3 drive. I imagine they exist?"}, {"text": "What about loading Windows from it?"}, {"text": "I had similar freezes on my laptop, it was becouse the excessive disk usage and i solved disabling some windows services.<br />So i think it is becouse it loads everything directly from the disc."}, {"text": "Accidentally paused at <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=0m14s\">0:14</a> and i died laughing"}, {"text": "I used to play wiggles on an usb stick at school when I was younger lol"}, {"text": "Your not gameng on a usb stick :P"}, {"text": "The amount of people thinking the games run on the stick..."}, {"text": "DIMITRY PETRENKO"}, {"text": "Will this work for Sims 4?"}, {"text": "i use a external ssd.. my issue is how can i save my gameplay to it only some games save so whenever i plug it onto another laptop oe desktop i loose all my gameplay"}, {"text": "very funny intro man. subbing :D"}, {"text": "Hello guys it&#39;s demetri yesssssssssss best Youtuber"}, {"text": "Seize perhaps teenager mmlbsg recipe flag"}, {"text": "see you in maze rasha"}, {"text": "Cool, it works.<br />Do have to test first if the particular game will work."}, {"text": "no real gamer uses steam to game lol!"}, {"text": "tutorial on downloading games from steam on to a flash drive ?"}, {"text": "Just SysLink the textures like i did in bf4..."}, {"text": "Throughout your video  you tell us why not to have this.  And no, USB 3.1 has a 22-pin connector that is type-C connector, not type-A like 3.0 has."}, {"text": "not to mention that sata3 is potentially much faster than USB3, and h2testw provides some means of throughput measurement"}, {"text": "always test drive thoroughly!  millions of fakes coming out of CHINA.  h2testw is possibly the only way to test.  I&#39;ve been fighting fakes for ten years so I know very much about fake flash memory."}, {"text": "3.1 is type-c connector not type-a connector"}, {"text": "Can it run GTA 5? Intel compute stick can"}, {"text": "What a usb tho?!?!?!?!?!?!?"}, {"text": "What a usb tho?!?!?!?!?!?!?"}, {"text": "amazing!!! technology moved a a big way forward, i wonder what the future gonna bring? who of you remembers the diskette also know as floppy disk? haha interesting times, nah&#39; what i mean?"}, {"text": "soy yo o este vato tiene acento mexicano?"}, {"text": "Does better then my pc😂"}, {"text": "Should you try to play it on an exFAT filesystem @HardwareCanucks? If so, what&#39;s the difference?"}, {"text": "Those pauses in CS:GO—did you check power saving mode? I think it went to sleep."}, {"text": "what is the name of the secound tested game again ?"}, {"text": "I wonder how an mSATA or M.2 drive in a USB 3.0 enclosure would compare?<br />Slightly bigger than a USB stick but also smaller than a typical 2.5&quot; SSD in an enclosure."}, {"text": "Can u do gta 5 on that usb?"}, {"text": "That usb is savage."}, {"text": "i used to play games on a usb stick because our school banned all game websites. the teacher once took control of my pc and deleted everything on my usb stick."}, {"text": "Cyka blyat Dimitri"}, {"text": "Can it play tf2?"}, {"text": "You know this USB stick will die in a month or two if you keep using it like that?"}, {"text": "cyka"}, {"text": "i play halo on usb2.0"}, {"text": "nintendo is making the NX a cart system because a dedicated system will make it more consistent. CD based systems had their run and it is over. Memory is cheap and small."}, {"text": "HOW IS THERE ANOTHER RUSSIAN MAKING A TECH CHANNEL IN CANADA? JEZZ PEOPLE"}, {"text": "What about Dota 2 ?"}, {"text": "Highschool with Halo CE, It was being passed around the class room &quot;discretely&quot; and usually when we were done with our work for the day we&#39;d just play off our flashdrives until the bell rang. This was back in the early days of usb 2.0"}, {"text": "Same name"}, {"text": "he looks like chris pratt"}, {"text": "maybe those freezes where due to power management mode on the computer"}, {"text": "i dunno £50.00 for this isnt that bad a cost ,  Its got alot of storage ."}, {"text": "Sandisk FTW"}, {"text": "Squad sucks. Got banned after 100 hours. Perma ban accused of hacking when i wasnt."}, {"text": "Demetri my brrather,,,,,, cyka blyat rush B"}, {"text": "stupid idea, just like gaming on those laptops with 32gb &quot;solid state drives&quot;May as well try a 3.5 floppy, or zip disk."}, {"text": "I played half life classic and team fortress classic on a usb"}, {"text": "sub to me and i will sub back"}, {"text": "i game allthe time at school using a usb that was like $5"}, {"text": "Where are you from? thats a weird accent"}, {"text": "Now, what would happen if you set maybe five of them onto a RAID and use them on a computer? Specifically a MacBook Air because I&#39;ve found this device harder to use than the other computer I have even though they have the same specs."}, {"text": "chri pratt"}, {"text": "how the fuck does a usb run games better than my $500 computer....I know my computer isn&#39;t that great BUT A FUCKING USB RUNS TOMB RAIDER FLAWLESSLY WITH CONSISTANT FPS WHEREAS MINE STRUGGLES TO JUST DOWNLOAD THE DAMED THING"}, {"text": "u should redo this with a 128 gig usb c drive, they have like 150MB/s speeds (so they state)"}, {"text": "its just a usb for games? i thought it was like a portable video card, to run games faster on any computer"}, {"text": "I&#39;m playing my steam library from my nas, even though it has 2 ssd&#39;s for caching I have the stutter like in the video on the witcher 3.<br />90% of the games give no problems what soever."}, {"text": "Useless."}, {"text": "Hey, i got same freezes in normal pc, what could be the problem?(my pc weak)"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=1m40s\">1:40</a> You could just copy over the game you want to play off the USB drive and create a symlink.<br />¯\\<i>(ツ)</i>/¯"}, {"text": "what about a RAID with 2 of these usb???"}, {"text": "Yes , RocketLeague ."}, {"text": "there is no problem with steam just change the scale to 16:9 or anything else then full and it will stop lagg i did it and cs is downloaded on my pc and it froze so i fixed it in that way"}, {"text": "Step 1: Buy an m.2 SSD<br />Step 2: Buy an enclosure<br /><br />Congrats! You now have a drive that is about the same size of a USB-stick but with much more speed, storage and reliability!"}, {"text": "How hot did the USB get during the freezes? Could it have been thermal throttling?"}, {"text": "I actually carry a lot of games on my usb stick just in case. I have the portableapps start menu as well for easy access to them. Simple games like Minecraft, Escapists, and Stardew Valley fit well on it, and run flawlessly."}, {"text": "cause CSGO sucks ass"}, {"text": "I played brutal doom 1 on a usb 2.0 stick on a really old computer , worked fine"}, {"text": "That USB is pretty savage<br /><b>badum tsss</b>"}, {"text": "hey bro for the O.S thats good? or better ssd?"}, {"text": "so you could play good games on crap PCs?"}, {"text": "what about runnig an OS on a usb stick (can be tricky with windows but i alreday did it with ubuntu, so steam os might be ok too)<br />so you can be on the go, get any pc and boot on your usb, have your files, your programs, your games...all your pc.<br />please try it :)"}, {"text": "i would love to get one"}, {"text": "fake accent"}, {"text": "what camera do you use?"}, {"text": "The problem with this though is if you take the usb to play the game(s) on another PC it would have to be one that had a compatible graphics card for the game you wanted to play."}, {"text": "You should play Insurgency man :D"}, {"text": "whats game is on <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m07s\">3:07</a>???"}, {"text": "I downloaded steam on  a WD Mypassport Ultra and i can easely get over 200FPS on robocraft online and get no hiccups"}, {"text": "This is still faster than my HDD though..."}, {"text": "Gaming on aN USB Stick! <br /><br />pls change it. Ty and nice video :)"}, {"text": "i carry ubuntu 16.04 on my usb3 drive it loads in 30 seconds tops"}, {"text": "Gaming on a Thunderbolt 3?"}, {"text": "Rofl digital The vid truly  sounds   strongly way-oztseal   ."}, {"text": "could i just use a 2 tb china usb for external space on my pc?"}, {"text": "&quot;gosh damn it I lost my USB stick I&#39;ll have to redo the whole campaign&quot; is going to be a phrase which is going to be used by a lot in a couple of years XD"}, {"text": "I play casual games on a usb stick with no freezes or any other effects.<br />(Other than lag from my shit computer)"}, {"text": "Nice idea, but I don&#39;t need a USB Stick for gaming, isn&#39;t my 8GB SD card that I found in an old camera and formatted good enough?"}, {"text": "maybe only games lag on this, which have lot of files instead big compressed ones, that instantly load into the memory i guess"}, {"text": "Sweet, this is a great video! Thank you! :D"}, {"text": "Wait what? Are you actually gaming off the USB or are you just using it to store your games?"}, {"text": "SAVAGE"}, {"text": "what camera do you use ?"}, {"text": "wow that usb stick is so savage"}, {"text": "Maybe that lag in CSgo , related to energy specs of the usb , i mean maybe it is set up to &quot;let the computer to make USB port sleep to conserve power &quot;<br /><br />Maybe .,."}, {"text": "I was playing Crysis Warhead on a USB 2.0 without problems and CS GO freezes on 3.0? lol... the quality of the Stick is shit....."}, {"text": "WHERE CAN I GET THAT DESK/TABLE TOP??"}, {"text": "i&#39;ve been doing that for almost 3 years now. i always use may usb thumbdrive for playing LOL :D"}, {"text": "What about setting those high speed usb sticks on RAID?"}, {"text": "CSGO is probably made for crappier computers, therefore instead of loading the map onto the ram, it might play directly off the drive. The higher-end games assume more RAM, therefore loading the game onto RAM. Just my hypothesis."}, {"text": "Maybe CS:GO is its weakness"}, {"text": "where can i get that USB!?"}, {"text": "I am using a Lexar TINY USB.. 3.0 drive.. FASTER then my MacbookPro 2015 Internal PCI-E Hard Drive.. works amazing!"}, {"text": "Try a one tribite usb stick!!!!!!!!"}, {"text": "will it work on a Intel compute stick?"}, {"text": "Got ur tested thermal paste its phenomenal"}, {"text": "I have SSD inside USB 3.0 case, all is working blazing fast, including win10 to go on it."}, {"text": "I have not gamed on a usb stick, but I have gamed on an sd card without issues"}, {"text": "Chris Pratt is doing tech videos?"}, {"text": "HOW THE FUCK WAS IT ABLE TO RUN SQUAD?"}, {"text": "I tried to do it, but i was never able to figure out how to get the games on the stick..."}, {"text": "Does the usb need to have an operating system to game off it? or can the game piggyback off the operating system you are using?"}, {"text": "Hi, can you trying to put a video test of write speed of this pendrive of mpeg photos (of 2 or 3 MB each), please? <br />Thank you."}, {"text": "would this work for ps4 if I wanted to download games so I can get them off my ps4 ?"}, {"text": "i played KSP off of a usb 3.0 stick in a 2.0 port (so 2.0 speed), it worked fine until i tried to edit the ships, for some reason all the parts didn&#39;t load, this even happened on 3.0 ports. when i tried on my external 3.5&quot; HDD (yes it is 3.5, it is just what i had laying around, 250GB HDD and a few buycks for an enclosure) it worked fine, loaded slower than internal but everything worked fine, when using 3.0 it was as fast as the internal. drive was still smaller than an entire computer, an 90% of the games and programs could run on most computing devices, as long as it had a usb port, a wall outlet, and windows 7 or xp (i didn&#39;t trust any other)"}, {"text": "My laptop has about the same computing power. So yeah I&#39;ve gamed on a USB stick."}, {"text": "+HardwareCanucks you should try gaming on the kingston hyper x predator jumpdrive the 1 TB version of it and not the 512GB version"}, {"text": "They&#39;re fantastic if you&#39;re into retro gaming/emulation,   have your entire collection on the drive and play on virtually any machine that accepts USB."}, {"text": "what was the name of the thrird game u was playing in this video?"}, {"text": "can you plug in a USB two get more fps"}, {"text": "Is that a Trabant on your desk?"}, {"text": "but you need to use another computer than the one you installed Steam on because the installation of steam injected DLL files. Try running the usb on another computer for the test. I know cause I do the same thing. For example to run League of LEgends on a USB on a computer it&#39;s never been on before requires you to create a bat file to launch League to avoid administrator with an extra batch line to hunt for DLL files preinstalled on the usb"}, {"text": "next try a usb ssd for gaming"}, {"text": "hai capassati haaaaddraivz!?"}, {"text": "What did you use to measure read and write speed?"}, {"text": "Hello, TheMeatTree!"}, {"text": "Hello, TheMeatTree!"}, {"text": "one might say this USB drive is pretty savage."}, {"text": "OMG WANT WANT WANT!"}, {"text": "Are you Russian?"}, {"text": "I don&#39;t understand do u bot need a graphics card for this?"}, {"text": "Thank you for reminding me of squad I forgot all about it thank you man!"}, {"text": "The Freezes in CSGO could be the server acting up, or the internet. Sometimes it does that to me and i switch the server and it&#39;s fine."}, {"text": "can u run gta v?"}, {"text": "have the same ikea lamp"}, {"text": "I always Play Just Cause 2 and Garry&#39;s Mod on USB-Stick, just because my hard drive is so full and I don&#39;t have the Money for a new one. So, JC2 runs perfectly: 24-34FPS on a 2.6ghz CPU and a 750 Nvidia Geforce. But... on Garry&#39;s Mod... it&#39;s really laggy. Everytime I join a Server, it laggs and... during the play it&#39;s the same thing. Anyway, with the time the lags became less and less. I don&#39;t know why. Anyway, that is my experience on playing on an USB Flash dirve"}, {"text": "u looks like star-lord in guardians of the galaxy"}, {"text": "Freezes on CS:GO? That happens even on the fastest pc in this world. Definitely not a USB issue."}, {"text": "it would be cool if  a company made basicly a flash drive inside of a mouse"}, {"text": "I have to play steam on a usb because my notebook has good graphics but no memory!"}, {"text": "If it was UBS-C then it would be better"}, {"text": "Wait-so could you theoretically make duplicates of some of your games on your computer,put like 10 at once in these, bring em to a friends house, and give them the duplicates? I mean thats free games man."}, {"text": "What keyboard are you using?"}, {"text": "I think its more about optimization of game. There are two types of games, one that use few big compressed files that contain all files, and one that use lots of smaller archives or even uncompressed files in folders.<br />And here is where problem can occur because access speed to one big file and to few smaller ones are different, so when playing, game need to read those files and it can slow down when it need access big(2+ gb) files and load something from it.<br /><br />Not to mention that some games use files in user folder, or other separate folders(eg, setting and save files) so it need to read/write data from different places so it can also slow down game."}, {"text": "this&#39;ll work better with usbc for sure."}, {"text": "Imagine the ability for USB&#39;s to also come with built in Graphics Drivers/CPU/Ram/etc.<br />So you can play any Intensely Powerful Games even on one of the cheapest/old computers known to date without any negative effects! =D"}, {"text": "demtrez my friend"}, {"text": "Run 2 of them in Raid 0"}, {"text": "Can you install and run Windows on those 128GB USB sticks?"}, {"text": "For $70, I&#39;d much rather get a 200 gb ssd"}, {"text": "I like how you got an Model Trabant at your desk :D"}, {"text": "Вы русской?"}, {"text": "awesome review man thanks."}, {"text": "CS:GO is badly optimized game :/"}, {"text": "On pc"}, {"text": "How to get games make a tutorial"}, {"text": "omg! i didnt know that chris pratt had a youtube channel"}, {"text": "I think you are geting glitches with CS:GO because it is an very old game and it is not so good for new Hardware stuff."}, {"text": "did you putthe usb flash drive in high performance mode??"}, {"text": "&quot;This is the 128 gigabyte Hyper X Savage Drive&quot; <b>plugs in</b><br /><br /><br />BOI IF YOU DONT GET YOUR SORRY ASS ON THIS SEAT RIGHT NOW"}, {"text": "i think better idea is use ssd drive like USB to games ;x"}, {"text": "Gamed on a 32GB stick. It was alright considering it was only $12"}, {"text": "That usb stick is so savage!"}, {"text": "probly too slow"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m10s\">3:10</a> - <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m14s\">3:14</a> when your playing Dayz/H1Z1 and you get sniped and it makes a loud noise (look at his reaction)"}, {"text": "how good is the audio when the usb is up your ass"}, {"text": "I think i ll be buying one of these. With 1mbps max internet speed i don&#39;t feel like downloading 60GB worth of GTAV again for whatever reason."}, {"text": "Cool! Now try GTA V."}, {"text": "What&#39;s that Monitor?"}, {"text": "Yes often .. Used to run EverQuest 2 and SWTOR of sticks .. Was very convenient when using someone else&#39;s computer or another computer in the house .. Worked fine on USB2 as well .."}, {"text": "Are u kidding me ??? My PC is has more crashes than USB, cant play Tomb Raider and much other games"}, {"text": "What if you install the entire system on the usb stick?"}, {"text": "i use linux. would i be able to use to play steam games that are not for linux?"}, {"text": "How would league of legends work on it?"}, {"text": "Man, was there a hurricane outside of your window during the shooting of the video?"}, {"text": "The lack of TRIM on USB sticks makes this a short joy."}, {"text": "YO IS THAT A MODEL LADA ON YOUR DESK?"}, {"text": "You remind me of Crainer Commentates."}, {"text": "This is my dream."}, {"text": "rise of the tomb raider which is 20gb installed in 2 minutes.... i wish i could say that"}, {"text": "I have tried to game with a micro sd card on my Asus X205 (atom quad core notebook) and game performance was significantly reduced Definitely noticed that stutter and whatnot, and it just wasn&#39;t a proper experience, even if it is a scrawny little laptop. <br /><br />I was reading somewhere that since the usb is only 2.0, the card may be limited to that speed... And after my experience, I think that may be the case. Only issue is almost nonexistent on-board storage, so a micro sd is kind of a must... :("}, {"text": "2 minutes and 21 seconds for rise of the tomb raider... How fast is your internet bro?"}, {"text": "Coming soon to my channel... USB friendly games!"}, {"text": "This is a rediculous gimmick."}, {"text": "I load games in 20secs on an old [1tb HDD 121gb left] 2-3mb internet speed.. i don&#39;t have much money and call that USB and SSD not needed at all"}, {"text": "you talk weird ;("}, {"text": "When I saw the title I thought you would install windows-to-go on this USB."}, {"text": "Yes I use an old usb stick 2.0, with remix os, and play all games of Google Play on maximum settings and no slowdowns, only whem boot up the system, I was amazed by this, maybe because smartphone games needs low bandwidth."}, {"text": "are you an idiot?"}, {"text": "I subscribed because he&#39;s literally Chris Pratt with a different accent."}, {"text": "&quot;Speed 4000%&quot; Lamo"}, {"text": "This was interesting, thanks. I have ran Linux of an old usb stick on my laptop which temporarily didn&#39;t have storage to check if it was working. It was a bit slow but worked and could still watch video, I thought it was impressive.<br />Another test would be to run games of an SD card. Its a very easy, cheap and mostly discreet way of upgrading laptop storage so would be nice to see how that handles games too."}, {"text": "man that is an awesome usb.  can u tell me how much is the usb??"}, {"text": "Liked for the accent."}, {"text": "I game on my USB Sandisk Cruzer 64GB drive all the time because i have a netbook with 32gb of storage(16 usable out of the box) so games don&#39;t fit."}, {"text": "i have played minecraft on an usb stick with my netbook and booted in linux live over the usb :D works"}, {"text": "Try it with four flash drives and a USB 3.0 Hub in RAID 0  :D"}, {"text": "drivers?"}, {"text": "if only i had some extra money to buy this"}, {"text": "What is the monitor please?"}, {"text": "You runned csgo in fullscreen mod. thats why you got that stuttering"}, {"text": "I dunno dis guy but my first reaction to dis video was dat chriss pratt??"}, {"text": "lol"}, {"text": "not ready :/"}, {"text": "Where did you get this nice Trabant model?"}, {"text": "theres a reason why CS:GO had been glitchy. BECAUSE YOU NEED A BIGGER USB!"}, {"text": "Jebus.. what is this? 2006? I have been doing this for ages. How is it people are just coming around to this almost a decade later?<br /><br />Also, I would say most of the &quot;glitches&quot; come from trying to play competitive multiplayer junk on a stick. Bsically any &quot;game&quot; that the entertainment factor comes from other people and relies sometimes on other peoples servers, will have inconsistent experiences. Read times might be sufficent, but you have to account for write times too, which are always slower. and that might be a factor in it all."}, {"text": "What&#39;s the name of the keyboard you used in the video?"}, {"text": "I run my wow game off a USB and it has worked fine. a little slow on loading screens but very playable."}, {"text": "Sent by TeckTick."}, {"text": "What video editor was that in your video that you showed and is that Mac only editor"}, {"text": "You&#39;re not supposed to install Steam itself on the USB drive/external HDD(it should go to your internal SSD, which is usually C:/), the games don&#39;t have to be on the same drive as Steam, you can choose."}, {"text": "Test it with Fallout 4. See if it helps with load times for you. For me on my USB 3.0 drive, it loaded between scenes significantly faster. Even then, it is still slow. Because LOL Fallout 4."}, {"text": "maybe one day in the future, we will have SSD speed and stability through USB."}, {"text": "savage"}, {"text": "I just bought this stick for 80% off :D pretty awesome"}, {"text": "I like your videos, but I have to say - your camera work is absolutely great."}, {"text": "Personally prefer the Corsair GTX, magnesium finish and also a little bit of performance more"}, {"text": "So, uh my computer has invidia 980 and it can run cs go PERFECTLY but it runs minecraft bad. I honestly dont understand, its so freaking weird. MINECRAFT IS SUPPOSE TO HAVE FUCKING SQUARES FOR GRAPHICS! AND CS GO IS FUCKING BETTER GRAPHIS."}, {"text": "I used to play GTA SA off USB some other games too i cant remember, was handy when I went to mates felt like no lag on it for USB2 but games were way smaller back then"}, {"text": ".... i used to do this long ago .... i still do it i got darksouls 2 , spec ops, battle field 4  on my USB"}, {"text": "Whats ur monitor?"}, {"text": "yes i did in school, cod4 hahahaha"}, {"text": "In terms of freezing, could this be a result of power-management settings? Even on High performance mode, my PC has an option called &quot;USB selective suspend settings&quot; which is enabled."}, {"text": "can you please sell me the usb"}, {"text": "Is this lag okay, in CS:GO? I have intel 320s SSD, and I have randomly isnane lag too. Not ping nor hardware."}, {"text": "What&#39;s that monitor"}, {"text": "I play cs source and don&#39;t starve on my memory card all the time"}, {"text": "and how is it only 69 bucks is it its own pc?"}, {"text": "what do you plug it into"}, {"text": "I actually Have played off a thumb stick.... It was FNaF2 so i can&#39;t really say if the experience was mind-blowing."}, {"text": "You install steam on the drive? Why? There is no need, all on need is<br /><br />a steam library folder on that drive<br />or a NTFS junktion to that drive from your previous (harddisk) install folder and you have nothing to change in steam at all.<br /><br />You are installing games through steam that you seem on have already installed.<br /><br />I think the entire idea makes no sense to me."}, {"text": "You should make a video completely installing Windows on the USB so that you aren&#39;t slowed by the transferring between your SSD and the USB (Not sure if much difference would be there though)"}, {"text": "ofcourse I played :D COD4 in my school and cs 1.6 portable edition :D damn those LANs were so cool :D"}, {"text": "I have been gaming primarily off of a usb flash drive for 4 and a half years. I have had no problems yet."}, {"text": "Whooop 420k subscribers"}, {"text": "I actually believe the cs go bugs may not be due to the usb. I get those bugs where the Audio repeats and the video stops in cs go and it freezes and occasionally crashes. And this always runs off my 7200rpm hdd."}, {"text": "What song is used in the video?"}, {"text": "just for information i have tried many times to run games from usb stick, game crashes after a while because it cant allocate files fast as from hdd. (not recommended)"}, {"text": "At school we bring usb sticks to play starcarf brood war and cs portable lol"}, {"text": "Xanxus&#39;s XFlashDrive"}, {"text": "i am doing this more then 10 years.......... nothing new for me.........."}, {"text": "Could the freezes be caused by overheating or simply a USB 3 quirk in how it reads data?"}, {"text": "but can it play minesweeper? ^^"}, {"text": "its savage."}, {"text": "tfw USB stick has better R/W speeds than internal drive..."}, {"text": "Why did you bother putting Steam on the USB"}, {"text": "What monitor is that?"}, {"text": "yes i hav gamed off a drive"}, {"text": "ohhh its a savage."}, {"text": "what was that fps he showed? squad I think he said?? I&#39;m interested"}, {"text": "Actually I used my external usb 3 2tb drive for playing Firefall (online sci-fi mmo) as I just used a normal hdd. Usb 3 pendrive is imo for playing videos, and some games in some scenarios as you already mentioned."}, {"text": "1.24 LOOK LIKE IT CAN READ THE 360 WAY!"}, {"text": "yes i have played games on a usb stick"}, {"text": "I had Starcraft and a few other older games installed on a USB flash drive back in highschool. Fun stuff, any computer lab became my playground."}, {"text": "can i get steam on this stick and get ark on it then take it to school and play it with a core i5 not over clocked?"}, {"text": "I tried that in the past, although with older games. It worked fine."}, {"text": "If they work I&#39;ll shit bricks"}, {"text": "I am glad you made this video because on CSGO I was experiencing very laggy game-play on a good internet connect with a 2.5&quot; sata 2 5200rpm HDD and I said that in the comments and some faggot said that I was a dumbass and that a slow HDD won&#39;t cause stuttering like he fuckin knew what he was talking about. This makes me happy because now I have proof..."}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=0m24s\">0:24</a> &quot;whueat?!&quot;"}, {"text": "cs go is not a good game to test for this, even with my internal ssd and more than capable hardware, cs go suffers from stutters as many other people do. I can play another other game like bf4 and overwatch beta all fine but not cs go."}, {"text": "You need to review your Steam message box.. :)"}, {"text": "Thx Bro"}, {"text": "yeah what camera did you used its mind blowing"}, {"text": "Hello, it&#39;s dimitri, i was wondering if after all this years i learn this game..."}, {"text": "I could imagine having my games combined with the SteamOS distro onto one of those drives.<br />Got a 64G Toshiba stick myself that&#39;s made for USB3 but since I&#39;m too stupid to put Windows on this thing, your video gave me a similar idea, as mentioned before, simply putting SteamOS on it."}, {"text": "what is the software used for testing read/write speed"}, {"text": "So u can put games on the usb stick and play games with more ram u have on your computer/laptop or not?"}, {"text": "I got the fastest usb 2.0 stick at the time, threw Unreal Tournament 3 on it, could virtually play it on any machine without even installing. Now it&#39;s all on external hard drive, soon to be external ssd. I will say games like Minecraft and Skyrim will crash often if you don&#39;t constantly save due to the amount of cache and real time rendering they need to keep going."}, {"text": "I&#39;ve been doing this for a while with a USB 3.0 Memory Stick with about 100mbps write and read speeds."}, {"text": "The idea of this video is good but I wonder why you chose the Hyper X usb. There are much cheaper and faster 3.0 usb drives. For example the Mushkin MKNUFDIM128GB. It is half the price and in my  experience it is faster.<br /><br /><a href=\"http://www.amazon.com/Mushkin-MKNUFDIM128GB-Impact-128GB-Flash/dp/B01A69W49Y?ie=UTF8&amp;psc=1&amp;redirect=true&amp;ref_=oh_aui_detailpage_o00_s00\">http://www.amazon.com/Mushkin-MKNUFDIM128GB-Impact-128GB-Flash/dp/B01A69W49Y?ie=UTF8&amp;psc=1&amp;redirect=true&amp;ref_=oh_aui_detailpage_o00_s00</a>"}, {"text": "i have for my Wii U, Slightly slower load times  but  overall it beats having to buy a whole external hard drive."}, {"text": "What if I loose it"}, {"text": "So would the game not play as well on the normal hard drive? I thought gaming had more to do with gpu, cpu, &amp; ram, rather than hard drive."}, {"text": "I thought I was a nerd, but damn."}, {"text": "I remeber playing SNES roms on the computers at my college between classes all they way back in 2005."}, {"text": "Try the USB gaming concept with a machine that has USB type-C, with the Apacer AS720 and a dual-ended USB type-C cable."}, {"text": "great channel :)"}, {"text": "Du you need a pc/mac for this or so u plug it straight into your monitor?"}, {"text": "I been doing this lol"}, {"text": "Will you be able to play such games on a low spec PC with this USB stick."}, {"text": "Chris Pratt? Is that you?"}, {"text": "I&#39;d be interested to see a similar review, but booted from the USB stick into SteamOS. Got any plans for a review/test like that? :)  Thanks, your reviews are very good."}, {"text": "Lol i remember playing quake 2 off a USB back in high school :D"}, {"text": "i have been playing super truck on a 5$ usb that was made in china... worked flawless! so sertan titels can run on af really crappy usb 2.0! awesome!! :D"}, {"text": "Test out the VisionTek USB 3.0 Pocket Solid State its write speeds are supposed to be faster"}, {"text": "<b>slav</b>"}, {"text": "Lol I used to save a PSX emulator and Monster Rancher on an 8GB usb. I just go to any random pc I can use and then raise my monster. I did that in 2007-2008 :D"}, {"text": "."}, {"text": "Yea but can it run competitive Angry Birds?"}, {"text": "Put two of these USB Drives in Raid 0. Haha"}, {"text": "what&#39;s the model of the keyboard showing on the video?"}, {"text": "ive done some android x86 off a regular usb from walmart, and i experienced the same thing. perfect in some apps, glitchy in others, but the benchmark scores were identical to when using the internal hdd of my laptop"}, {"text": "For the stuttering on CS:GO, the best way to fix that is to use KeepAliveHD."}, {"text": "I&#39;m pretty sure anyone with an extensive Steam library will have issues with trying to store all their games on one flash drive... I myself would need a 512GB one to fit my library on and even that&#39;s pushing it!"}, {"text": "to remove lag change removal policy from quick removal to better performance<br /><a href=\"http://www.avoiderrors.net/increase-usb-external-drive-performance/\">http://www.avoiderrors.net/increase-usb-external-drive-performance/</a>"}, {"text": "does it improve the basic graphic driver off a lenovo laptop. eg star trek online."}, {"text": "just imagine how cool it would be gaming consoles used this instead of discs( when usb sticks will be fast as an ssd)"}, {"text": "how many inches is your monitor ?"}, {"text": "i was hoping for better performance in CS : GO but as u can saw how its not working properly sometimes i might be sad , im prepar to buy SSD so plz give me right suggestion btwn SSD-HyperX USB whats best for CS GO ?!"}, {"text": "I was listening to Transistor soundtrack before clicking on this video... what are the odds?!"}, {"text": "I think the memory management of the game CS Go is bad.<br />They seem to unload stuff from the RAM and may be resorting to 4K random reads.<br />So I guess the older stick would perform better with that game OR you have to<br />cache the directories in RAM or copy the whole stick to RAM (meaning a bundle of steam and CS Go and try how well that performs.<br />Maybe it is even a memory management bug in Windows who knows.<br /><br />I get constant freezes on my computer with a SSD as system drive and a <br />HDD for storage. On Windows 10 maybe even on all of the other versions <br />and that should not happen ever. So the programers at Microsoft are not <br />good enough or the management sucks."}, {"text": "Well let&#39;s be honest cs:go doesn&#39;t have such a great enegine"}, {"text": "lol im playing 7 days to die on my usb"}, {"text": "Interesting. However, I will stick to using my SSD...."}, {"text": "Nice Trabby u have there mate !!"}, {"text": "I used to have a USB that I took to school because they had deep freeze on the school computers but my friends and I would install emulators and play SNES and NEOGEO games on the school PCs."}, {"text": "I used to have Warcraft 3 installed on my USB so I could play in school at lunch time, ran perfectly on usb 2.0 at the time!"}, {"text": "is it that time where you plug in a usb in a random pc on highschool and play CS:GO while you&#39;re turn off the screen when the come for a control round"}, {"text": "&quot;First we need to format the drive to NTFS&quot;<br />This is one thing you generally never do with USB sticks. Should&#39;ve gone with ExFAT."}, {"text": "Until USB is faster, HDD or SSD are the way to go. Oh and larger because my library is larger that 200GBs."}, {"text": "how about an external SSD via USB?"}, {"text": "great, more shit I can&#39;t afford"}, {"text": "storage and processing are two different things.<br />you can <i>store</i> a game in a USB, provided the game is programmed to <i>load itself on memory</i> when you play.<br />if you have a large enough memory capacity, you should be able to run anything without any issue, USB or HDD."}, {"text": "Man!Great video quality<br />You earned a subscriber!"}, {"text": "128 GB... that would hold about 5% of my gaming library, lol"}, {"text": "are u from greece ?? because your name sounds like that pls tell me"}, {"text": "Been doing this for almost 10 years due to being a student during primary and secondary school, works like a charm"}, {"text": "I face the same hiccups he faced while playing counter strike on my HDD <br />while everything else works well....."}, {"text": "tried minecraft on my old usb2 flash drive, a few hiccups but smooth gameplay"}, {"text": "its the same thing as the gameband but on the ngameband it has minecraft"}, {"text": "this usb is savage."}, {"text": "&quot;Kerbal will run off a usb real well but more popular games will not.&quot;"}, {"text": "U savage"}, {"text": "If the programmers decided to have a game consisting of thousands of files, then the performance might be sluggish. I&#39;d say, the way how the game is programmed - file count wise is the major factor that can have impact on USB gaming."}, {"text": "cant you put games onto a 64gb usb flash driver simply?<br />Use portable apps and then put your games onto it"}, {"text": "Where you got the little &quot;Trabbi&quot; Car on desktop, lol ?"}, {"text": "Use a SanDisk Extreme, I even got Windows to dualboot on it (with Ubuntu) and occasional gaming doesn&#39;t seem to be inpacted."}, {"text": "im still on usb 1.0 plenty fast"}, {"text": "You are better off buying a SSD usb drive thats available as its much faster and there isn&#39;t any lag or loading problem."}, {"text": "What Chris Pratt games on when he&#39;s not acting xD"}, {"text": "what camera do you film with, quality is blowing my mind!"}, {"text": "I don&#39;t think usb last to long for playing games on them. As hard drive or ssd can last longer. How ever I don&#39;t know much about ssd because I don&#39;t have one  yet"}, {"text": "yes I game on a usb and it suck so  bad :(   it is a 32g FNY USB"}, {"text": "Dude i finally fixed my csgo micro freeze issue thanks to this video :D i just installed it on my ssd instead of my hard drive and it fixed it. ive reinstalled multiple times on the hdd but to no avail. apparently the ssd handles it no problem"}, {"text": "Big whoop. Gaming is perfectly possible (with most games) off of a USB 2.0 drive. You just have to wait a lot longer for installation and loading."}, {"text": "Lol, just noticdd it was just a usb"}, {"text": "Really, rise of the tomb rader works with it, no way! It struggles with medium end computers"}, {"text": "Played Assassins creed 2 and brotherhood from an external 5400rpm drive without a problem! <a href=\"http://www.youtube.com/results?search_query=%23backinthedays\">#backinthedays</a>"}, {"text": "I was migrating from a computer so I played Monster Girl Quest on a USB and even a SD card on a tablet. It&#39;s a great game."}, {"text": "What&#39;s the FPS he&#39;s playing?"}, {"text": "Hi , what&#39;s your editing video program and it&#39;s version"}, {"text": "I used to play Diablo 3 like this because of the disastrous lazy load of streamed assets."}, {"text": "Did you ever try to Game on an SD card? <br />I do and there is no lag"}, {"text": "damn 55 sec to load into csgo, thats bad."}, {"text": "I game competitively using the SanDisk Extreme 500 Portable USB 3.0 SSD. Loading times for Dota 2, CS:GO and Rocket Arena are less than 15 seconds. I don&#39;t get any freezes whatsoever with this SSD. For just $20 more than the HyperX :D Here&#39;s the link: <a href=\"http://amzn.com/B00ZTRY5IW\">http://amzn.com/B00ZTRY5IW</a>"}, {"text": "So I can transfer my game?"}, {"text": "I experimented with this a little bit. I used a usb 2.0 and europa universalis 3. The game ran smoothly, only pausing to save. Saving took very long though."}, {"text": "Actually the difference between USB 3.0 and 3.1 is USB 3.1 has about 5Gbps more speed then USB 3.0 in optimum conditions."}, {"text": "Everyone use to do this back when I was in highschool. we would all load up the HALO CE DEMO on our 500mb usb sticks. Then play 16 player lan games over the school network against people not just in the same room, but also other computer rooms"}, {"text": "Cool (￣^￣)ゞ"}, {"text": "could this work for gameboy emulators as well?"}, {"text": "Any game which can be copied and pasted to another computer and played without having to install it can be put run from a USB stick, so far I haven&#39;t seen any difference, but I have only used usb 2.0 sticks. I have a 32gb and a 64gb USB 3.0 sticks, I may try with them."}, {"text": "What point of WRITING TO NAND Memory do people not understand? Writing to NAND memory is what decreases it&#39;s lifespan. Gaming writes data while saving, and some people save constantly. It really depends where your save file is being saved to, but if you play indie games as well as AAA, most indie games save the saves in the install folder. Games made by Bethesda will almost always save in the My Documents folder in Win 7. I just think it&#39;s a bad idea. Plus, speed. You WILL have glitches and slowdown, since the USB drive is small, and doesn&#39;t have a fan or heatsink. Not only that, but USB is really slow, with only 2 transfer lanes inside (besides I/O transfer buses, which sometimes transfers data, but only occasionally)."}, {"text": "THIS VIDEO is clickbait for IT people like me. Fucking USB sticks. There are 2 reasons you don&#39;t do that; 1) everytime you write to NAND memory, you reduce it&#39;s lifespan. 2) It&#39;s almost always faster to load games from the internal drives."}, {"text": "it&#39;s possible to play csgo on this shit without freezes using &#39;cl_forcepreload 1&#39; command"}, {"text": "I&#39;d lose it lol."}, {"text": "AYYYY TRANSISTOR"}, {"text": "I played Minecraft off of a USB 2.0 stick. The downloading world and building terrain world dominated my play time."}, {"text": "The problem with USB sticks is that their 4K sucks. Which is how they get away with the exaggerated speeds on their store pages because they have high sequential reading and writing speeds and those are the specs they use for selling their sticks. They also have considerably more delay than SATA3 or eSATA though that won&#39;t be much of an issue, it&#39;s not a huge amount of delay. You were better off getting a USB 3.0 thumb drive that had great 4K speeds since that&#39;s essentially the most common kind of file access."}, {"text": "I picked up a $30 128GB USB 3 flash drive (not the one showcased in the video) and immediately gained 30-40 fps. It is actually faster than my SSD so it is absolutely an amazing buy."}, {"text": "savage"}, {"text": "I used to game on a 32gb sub 2.0 drive not fun"}, {"text": "what was the 72 player map game he was playing?"}, {"text": "Normally a 128GB SSD costs less than a 128GB USB, at least in my country.<br />In fact I can probably get a decent-ish 256GB SSD for that price.<br />And SSD have possibly faster speeds depending on which brand you get.<br />So why should I game on a USB and not an SSD, I don&#39;t get it?<br />Most modern PC cabinets allow plug-and-play slots for 2.5&quot; form factor HDDs/SSDs, so you can swap-in and swap-out anytime. So that takes care of the easy &quot;portability&quot; factor."}, {"text": "I like the Trabant on your desk :P<br />That was my dad&#39;s first car when he was my age lol"}, {"text": "what game was the sqwan"}, {"text": "Im sorry but I find these test vids rather boring - you talk a lot about performance and user experience, but only show actual stats once - never going into any in depth analysis or theory as to why CS:GO is behaving badly (read-latency, optimization, bottlenecks, filesystem etc.) Please consider having other tech-savy people (friends) review the product before you make the final cut"}, {"text": "Almost a minute to load Dust2... ON THE SSD?<br />Something is wrong with your drive then."}, {"text": "mother Russia mothafuckas"}, {"text": "About CS:GO, it&#39;s because of their HORRID UI. Their UI is terribly unoptimized and you may even get those freezes on an SSD. It&#39;s not the fault of the USB Stick. I get freezes as well when open the menu. My PC is pretty good too."}, {"text": "The hiccups and slow downs  do not even happen on my sandisk miroSD 128gb"}, {"text": "kingstun is shit <br />the Samsung SSD&#39;s completely smash Hyper X SDD&#39;s in benchmarks <br />why pay more for something which is worse?"}, {"text": "I play gta 5 on my 16 Gb pendrive"}, {"text": "Glitches on CSGO is probably due to the old engine."}, {"text": "Next try putting windows and the game on the USB."}, {"text": "Is it possible to do the same on an ADATA external HDD If formatted correctly?"}, {"text": "your not gaming on a USB stick,you&#39;re gaming of of it witch is a completely different thing,see what would be impressive would be the fact that you can literally game on a USB without having the need to buy an expensive PC lol. not saying click bait.....but its click bait xd"}, {"text": "disappointment"}, {"text": "I have played tombe raider reboot on a usb which i got for free and loading was long but game was perfect"}, {"text": "I totally misunderstood the title. I thought the USB Stick was running the game. Lol, silly me."}, {"text": "Weather 😍 looks good outside"}, {"text": "you are cool. I like you. smooth editing. here is a sub sir"}, {"text": "This is new? I have been gaming on USB sticks since at least 2004. I guess some newer games do not work I would imagine. I dunno I just drag drop install folders and it works just fine for me, The newest game I have done it with is Skyrim, and it did have issues, but the game has always had issues anyway"}, {"text": "Nice Trabant!"}, {"text": "the device is garbage until the tech in it becomes better. figures...."}, {"text": "I install games on my USB drive and play them on school computers when there&#39;s nothing to do ;D"}, {"text": "cs go is made with potatoes from 2004"}, {"text": "USB C<br /><br /><br /><br /><br /><br />Enough said."}, {"text": "Ruski?"}, {"text": "I have used a USB stick to run a copy of minecraft before.  It runs just like it does off the hard drive.  Actually looking at the read speed for most normal drives, (IDE drives).  You will find that most USB sticks should be capable of beating their read / write speeds.<br />The CS:GO glitches could have been USB bus problems on your machine.  Aka the coding of CS:GO requiring high input bnadwidth from your keyboard / mouse, overloading the USB input when handling the game data transfers at the same time.<br /><br />I use a few USB sticks to backup my steam games anyway. Its a nice quick way to save your download times. *Though now I have fast internet speeds it&#39;s actually faster to download them than detecting the re-copied games actually takes.  (hard drive is limited to 5mb/s write speed on my current steam drive. with my newer games being installed to a sata 3 drive that is much faster.)  NB: internet speed here is so fast that my hard drives limit my downloads speed. But I am on a network of computers."}, {"text": "could it be anti hacker software on the csgo  game :}"}, {"text": "hey would it be worth buying one of these to game on, when ur like me and just have a 7200rpm drive, no ssd, or should i just get a ssd thats close to the same price"}, {"text": "nice little experiment.. I think an SD card would also give similar if not better performance like a USB... :D"}, {"text": "did u make a mistake when u said readily available or is that your accent? because i understood what you meant, before seeing the little caption.."}, {"text": "Why don&#39;t upload these beautiful videos in mkv like most of the professional music videos. Its quality at 4k high bitrate 60fps mkv will be the best on youtube!"}, {"text": "funny to see my monitor in a video it first didnt realized it ps cool Trabi i have that model in green pps <a href=\"http://www.youtube.com/results?search_query=%23German\">#German</a> XD"}, {"text": "This would be good for my psp, ps2 and classic arcade mame. Thanks"}, {"text": "Will It Work On Portable HDD as well using this method?"}, {"text": "ur specs please"}, {"text": "USB is faster than HDD right?"}, {"text": "Gaming from usb"}, {"text": "using usb 1.0"}, {"text": "im waiting for a 1tb usb stick"}, {"text": "I usually get freezes in cs when my cpu gets hot"}, {"text": "dota 2?"}, {"text": "If youbenjoy playing Squad, try out Insurgency, or the new soon to be released, Insurgency Sandstorm"}, {"text": "Can it run csgo on a potato?"}, {"text": "And I still have a big ass laptop get get so hot it almost melt my fingers on the keyboard that can&#39;t even run CSS playable"}, {"text": "He looks like Chriss Patt lol"}, {"text": "But can it run minecraft?"}, {"text": "Better than my fricken laptop"}, {"text": "What accent is that? French Canadian?"}, {"text": "I hacked my channel so you can&#39;t subscribe. Don&#39;t even bother trying"}, {"text": "The thing is, the USB will NOT always be portable, due to it could miss some data files needed to run the game properly,some games tend to use library&#39;s which is not always included if you copy, but it will be installed on your C:\\ during installation."}, {"text": "how about put the world of skyrim into the little bastard <br />test it with the damn mod and graphic,audio change ect"}, {"text": "man u look like Chris Pratt"}, {"text": "ssd affect fps deal with it."}, {"text": "i have freezes with my hdd :("}, {"text": "165000 views"}, {"text": "&quot;Savage USB drive&quot; You&#39;re right."}, {"text": "WHY YOU AMERICANS HAVE VERY BEAUTIFUL HOUSE? WHY WE FILIPINOS HAS THIS VERY DISGUSTING HOUSES?"}, {"text": "I have used a 500gb external hdd as my gaming and video drive for quite a while, the thing is faster than my internal hdd anyways xD"}, {"text": "Will not be possible for years."}, {"text": "I have os much games installed on an external HDD. No problem what so ever."}, {"text": "the game at <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m07s\">3:07</a> ... it&#39;s called squad?"}, {"text": "Wait so, you downloaded steam onto the USB? which was also on your pc too? Which didn&#39;t conflict at all with each other?"}, {"text": "How many times did it take to balance both flash drives like that?"}, {"text": "k"}, {"text": "Never knew Chris Pratt was into gaming."}, {"text": "what if the studders are coming from the USB sharing the same Controller as the other USB interfaces...Fighting for bandwidth???"}, {"text": "What keyboard is that?"}, {"text": "maybe on a type c connection to avoid the leg"}, {"text": "Tuning the drive&#39;s allocation file size can help, but that write speed is brutally slow...might want to wait a while for an updated version."}, {"text": "usb c"}, {"text": "cyka blyat"}, {"text": "Hi buddy... could you please do a gameplay of league of legends on it??? and if posible at 1080p with differentes quality settings. I´m curious what if lol is playable on the stick and how money fps u can get. Nice video!!! u got a new subscriber. :D"}, {"text": "Well, I have used a hdd for gaming. <br />a usb3 1tb external HDD which I booted to. <br />Why? my computer was crap and the only other computer I had nearby was a PC with a encrypted hdd and I didn&#39;t know the password. <br />so I used to HDD and booted it into Windows and played and played and played....."}, {"text": "What&#39;s the track name that is playing in conclusion part of the video?"}, {"text": "U wouldve done urself a favor by not wasting ur time gaming on a usb stick and using an external USB drive instead... Done it on a USB 2.0 drive w/o any hang ups"}, {"text": "How about installing linux on the USB as a live system and install steam on it? That would work on any computer even if it doesn&#39;t have steam installed. And 128 GB is enough, that&#39;s the capacity of my SSD and it&#39;s more than enough for a full OS + games."}, {"text": "Run*"}, {"text": "In order for csgo to roon smoothly of the stick and smoother in general you need to activate full map loading,it will give you a dat slower loading times but it will not freeze anymore :)"}, {"text": "What&#39;s the Monitor he using?"}, {"text": "Hey there ...   can you bye 2 of those USB sticks???  To get more speed you will need 2 of them, install them in 2 ports USB 3.0  in the same time and set them to be see as 1. f can do dat like in LINUX OS, you will have the same space but doble the speeds or reed and writes.  :)  In Linux distros and MAC PCs this works."}, {"text": "What would u put it into a pc?"}, {"text": "ive been doing this with a generic usb 3.0 flash drive i bought from microcenter for a while now my game seems to load faster than the people with actual SSD&#39;s"}, {"text": "Why not just use an external samsung ssd or something?"}, {"text": "What is the 3rd game (FPS) that you played? Didn&#39;t quite get the name."}, {"text": "I skipped the beginning of the video and I was like: WTF? this little thing can run Rise of the TR smooth?<br />Buuut then I relalized it&#39;s just a normal USB stick"}, {"text": "have not gamed on a USB stick . yet. maybe I&#39;ll try it out"}, {"text": "So if I plug this into my computer would I be able to play a game like War Thunder on medium graphics instead of ultra low??"}, {"text": "Why would anyone game on a usb stick"}, {"text": "Install <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=4m39s\">4:39</a>"}, {"text": "What I&#39;m doing right now since my HDD died is one USB 3.0 32 gig stick running Linux Mint and a 128gb SanDisk wityh my games/programs; running fine. CS:GO works fine, same for Rocket league, no freezes and only 1 fps smaller average than an SSD. Slightly longer loading times tho, but I don&#39;t really care."}, {"text": "waht game is he playing at 2 48"}, {"text": "I thought this decreases the life of the USB significantly."}, {"text": "Ran all of my programs/games on a 500 gb passport."}, {"text": "Lame, game off a micro SD card"}, {"text": "I thought it was  a PC Stick, dammit :c"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=4m56s\">4:56</a> , this is disturbing, the USB port is not straight."}, {"text": "I have a couple of small games as well as the Dolphin emulator and a few games on my old 32GB HP USB. It works fine for playing games on school computers"}, {"text": "Pauls Hardware, he used a USB SSD at LAN Syndicate I believe. Is that the same because it was in thumb drive form factor."}, {"text": "I have gamed on an USB stick... SSD before, however it&#39;s noticeably slower than my RAID 0(x4 256 Gb) SSD for some games and for other games it&#39;s the same (loading time wise)"}, {"text": "hmm wondering if exFAT might help any instead of using NTFS that is"}, {"text": "I run STALKER COP on my Sandisk extreme. It was just like form HDD, but it wasn&#39;t a steam installation"}, {"text": "ah so thats why my games lag and glitch..."}, {"text": "Yes I did game off a usb and it played fine."}, {"text": "Every time i play GTA 5 then its on a usb stick the loading time is huge but there is no lag in the game<br /><br />But tomorrow i&#39;m gonna get me a new pc so thats great! ^^"}, {"text": "yes, a flash game Dave :)"}, {"text": "Chris Pratt? Lol."}, {"text": "Next vid gaming on a m2 stick 2500Mo/s 😏"}, {"text": "I used to play my games on a shitty generic 16gb sd card, i did NOT have any money."}, {"text": "Chris Pratt ?"}, {"text": "No I haven&#39;t tried gaming on a USB stick before. For most gamers, I think the old but gold traditional hard drives will be the best storage option for their games. For me, I just have a 128GB SSD for my OS and some programs and all games (Dota 2, Battlefield 3/4, CS:GO, etc.) are stored on my internal hard drive."}, {"text": "could literally go from like 40mBs to 120 in split seconds"}, {"text": "What about one pf those crappy usb 2.0 lexar way-less-than-a-dollar-per-gig sticks, where you can pay like 6 bucks for an 8 gig stick? I wanna see that play some games."}, {"text": "should try and optimize for performance vs safe removal."}, {"text": "I played MSPacMan of a 27mb kingston usb stick as a kid... IT WAS WORTH FUCKING 80$!!!!"}, {"text": "how do u put games in the usb cause when i did it i cant play the games that is in there"}, {"text": "Hey when you were playing CS GO were your video settings set to high ?"}, {"text": "I used to play bf4 on an external usb3.0 ssd drive. the gameplay was as smooth as silk. I think the problem mainly comes from the usb thumb drive&#39;s 4k write speed, which wasnt a problem on my usb ssd. you better get a ssd thumb drive rather than a normal thumb drive w/ sequential speed comparable to ssd."}, {"text": "where are they? Canada"}, {"text": "I experimented with installing games on usb about a year ago. I installed some older games, because of file size and speed just to see if they&#39;d run, specifically Return to Castle Wolfenstein and Jedi Knight 2. They ran flawlessly, not only that, they ran on other machines too.<br />I sent the stick to my friend, and they ran on his pc also.<br />So there you go."}, {"text": "i&#39;m gaming on a 64 gb usb 2.0 stick on my selfbuild media center ..... gaming things like.point and clicks on it without any issues...how ever insalling was a real pain in the ass xD"}, {"text": "Well the problem with the HyperX USB drive is that the random-writes are suuuuuuuuuuuuuper slow on it. (even 6€ usb2.0 drives are at least 10 times faster ! like wtf)<br />This is the reason for the super bad 4k package results and probably also causes the long space allocation times.<br /><br />I would rather get an SanDisk Extreme Pro 128 gb. It&#39;s write and readspeed are also top notch, it looks great and its random writes are around 80 times faster. And it almost costs the same.<br /><br /><a href=\"http://www.amazon.de/SanDisk-Extreme-USB-Flash-Laufwerk-128GB-260%C2%A0MB/dp/B00HR7FWUC/ref=sr_1_5?ie=UTF8&amp;qid=1461973780&amp;sr=8-5&amp;keywords=usb+3.0+sandisk+128gb\">http://www.amazon.de/SanDisk-Extreme-USB-Flash-Laufwerk-128GB-260%C2%A0MB/dp/B00HR7FWUC/ref=sr_1_5?ie=UTF8&amp;qid=1461973780&amp;sr=8-5&amp;keywords=usb+3.0+sandisk+128gb</a>"}, {"text": "cl_forcepreload 1 on csgo"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=2m28s\">2:28</a> LOL I&#39;m watching the on my OnePlus two"}, {"text": "I have 500gb of games"}, {"text": "Man, the speakers look so awesome with your setup! 👍 Perfection. Great video, as always, Dmitry! (Though, I&#39;ll stick to gaming on a internal SSD :P )"}, {"text": "Dmitri that goes in the trash because it is savage."}, {"text": "Should have tried formatting to exFat, NTFS is not optimized for flash drives"}, {"text": "Nice OnePlus Two!"}, {"text": "I think it would be dope if a gpu company could make a usb gpu"}, {"text": "Hey! Really like the car on the speaker, what model is it? :)"}, {"text": "I use cheap USB 3.0 (2.0 works fine too) budget sticks for gaming.  No issue whatsoever.<br /><br />No need to pay for a special USB stick."}, {"text": "Yes! For example Open TTD, Age of Empires 2, factorio, lokSIM all worked very well from an normal USB 2.0"}, {"text": "I&#39;d been playing freelancer for more than 2 years from a USB stick flawlessly. To give you an idea of how old the USB stick is, it&#39;s a 2 GB lexar one with USB 2.0 interface."}, {"text": "Gaming on a USB 3.0 should be the title."}, {"text": "Source games are known for freezing and sound looping when loading from a separate hard drive to your OS."}, {"text": "I have not gamed of a USB Stick, but from a USB HDD and a MicroSD in a USB Card Reader. The HDD was fine for older games like CS:GO or Skyrim.<br />The MicroSD. Yea. Even Class 10 UHS-1 is not fast enough. I have my PSP ISOs on it. You need to load them into RAM before doing anything serious. And a MicroSD is still faster than UMD."}, {"text": "Not gonna lie, title is a bit misleading.. Judging by the title, one would assume there is actually like a gpu or cpu within the USB. Instead, you&#39;re just loading the games from the flash drive and not running on them, which is actually done by the computer"}, {"text": "i think the reason of having random freezing was probably because of the overheat?"}, {"text": "Ooops, I dropped my USB Stick and can&#39;t find it anymore!"}, {"text": "I have actually played Spec Ops the line directly via USB2.0 connecting a SATA hard drive and it ran just fine, no problem what so ever!"}, {"text": "I used to play GTA San Andreas from 8GB USB 2.0 :)"}, {"text": "Yes! another canadian youtuber!"}, {"text": "useless!!!"}, {"text": "Not a fan of how that plug-in is not centered."}, {"text": "Run Skyrim with mods, and come back to me with the results XD"}, {"text": "as weird as this is your eyes look so cool xD"}, {"text": "Can you use this without upgrading your graphics card? If so, this is gold for those who don&#39;t want to constantly keep upgrading their cards, PSU, etc."}, {"text": "you can use samsung t3 eexternal ssd,very portable and fast"}, {"text": "those trees intensely  waving near the end doe."}, {"text": "gaming on micro sd"}, {"text": "i need help, im looking for some decent headphones nothing to expensive, i want them for listening to music on the bus to work, youtube videos and films on my phone and some pc gaming if needed. any suggestions?"}, {"text": "Is that a Trabant, that legendary German car that never corrodes, on your desk? xD"}, {"text": "we use to do this all the time. whenever we had the pc class in school wed transfer the game we wanted to play onto the usb and played it in class off the usb, never had any problems"}, {"text": "Nice phone choice!"}, {"text": "I remember when I was younger, I used to have a shitty laptop with a 20gb HD, so I had to do most of my gaming using some old pen drives that were laying around xD<br />I have fond memories of playing Gta sa using this method xD"}, {"text": "Watching this video, and right next to me is a PC running linux of a 3.0 USB flash drive"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=0m22s\">0:22</a> hahaha u r sooo funny!"}, {"text": "what&#39;s the keyboard?"}, {"text": "raid 0 that bitch....."}, {"text": "So tell me now pls if you have a cheap laptop/pc will it make it it batter"}, {"text": "why is it that you look like the son from John wick"}, {"text": "But will it run Rocket League?"}, {"text": "omg its better than my laptop"}, {"text": "Back in highschool(circa 2008) I&#39;d bring in Duke3D with highres mods. It was playable if you could deal with semi-frequent crashes. USB 2.0 speeds on school machines. That school was locked down hard, only game I got through."}, {"text": "I play most of my game from a external ssd :D ok its not an USB stick, but it plugs into an usb 3.0 so could be same."}, {"text": "I have tried to do this with a usb2 and was disappointed. But i got a usb3 64gb and it works pretty good. Like what you found out, I can load and run most games without a problem and compared to a older mechanical drive its way better. I have ran WOT and WOWs World of tanks and world of warships, I use a phenomII x4 955 on a older asus board that doesnt have usb3. My good rig is a i7 4790k with m.2 ssd. The usb drive is wasted there. Am going to try it on my laptop."}, {"text": "I used to play minecraft classic all day from a usb stick. It was hotter than amd cpu after that."}, {"text": "i thinks the problem with csgo might be the transfer from the ssd to the usb"}, {"text": "I play cs go from my hard drive with no glitches. The whole game is probably loaded into ram when you play it. I wonder why it was lagging on that USB stick. ( I doubt it is the read speed)"}, {"text": "Hmm when I got me new HDDs for a while they also gave me random stutters in CS:GO.. I guess SSDs are good for CS:GO.."}, {"text": "The issues when testing CS GO are easily explained....Source Engine."}, {"text": "The editing gave me an anuerism"}, {"text": "My girlfriend plays Diablo 3 off her USB 3.0 flash drive on her laptop since it&#39;s A LOT faster than her built-in 5400 rpm HDD"}, {"text": "r u Russian broo ??"}, {"text": "Damn that USB is a straight SAVAGE.<br /><br /><br /><br />I&#39;ll go kms now."}, {"text": "In 2009 or 2010 I got an 8gb USB.<br />I install some of my favorite Games on it and play them :)<br />Tropico 2, Anno, Morrowind etc..."}, {"text": "What about running a distro of Linux on the drive?"}, {"text": "played Unreal Tournament &#39;99 on a 1gb usb stick at school many years ago..."}, {"text": "I dont get it.if I plugit in my computer it can make it run better?someone pls help"}, {"text": "A friend of mine used to play DOTA 2 from a cheapo USB 2.0 drive, loading was slow, but it ran just fine once loaded."}, {"text": "lol get a good flash drive that&#39;s not shit. Kingston makes crap.<br />Sandisk Extreme Pro 128GB (SDCZ88-128G-G46) is way faster and would work:<br /><br />Seq Read (Q32) 221.4 MB/s<br />Seq Write (Q32) 214.8 MB/s<br />4K Read (Q32): 10.30 MB/s<br />4k Write (Q32): 11.61 MB/s<br />Seq Read: 249.8 MB/s<br />Seq Write: 232.4 MB/s<br />4K Read: 10.05 MB/s<br />4k Write: 11.40 MB/s"}, {"text": "But how come Rise of the Tomb Raider, which is obviously more demanding than CS:GO itself, has no problem unlike CS:GO? Is it because of the Source Engine?"}, {"text": "We played CS 1.6 on USB sticks during breaks in high school"}, {"text": "i do that with minecraft with usb 2 lel :D"}, {"text": "can you DO raid 0, USB 3.1 ? pleasee..."}, {"text": "Does Formatting with NTFS file system improve the performance?"}, {"text": "not as smooth as u expected i didnt expect much tho .."}, {"text": "Remember there&#39;s a huge difference between the first time launching a game on the source engine and the 2nd time. I&#39;m assuming you ran the game on both systems prior to your test."}, {"text": "gaming....on a stick <br />if you get my reference"}, {"text": "Double your RAM and use something like OSFMount for faster caching"}, {"text": "Savage"}, {"text": "when i was in highschool (2005 ish) I installed C&amp;C Tiberium Sun on a usb stick so I could play at the library. hah"}, {"text": "I have  the same flash drive and game on it all the time. I don&#39;t have any stuttering when I play csgo or any other game so I think it could just be your usb. You make great vids! KEEP IT UP!"}, {"text": "When will be created the gaming houses<br />(doors,windows,floor,roof,bathroom,etc.)<br />(?"}, {"text": "I need to know what camera and lens you are using!!!"}, {"text": "Original guild-wars worked good on usb stick nine-ten years ago. I prefer it when it is possible."}, {"text": "Man you know how to make amazing shots!"}, {"text": "There is no system or a way...Cs:go lags and glitches allways."}, {"text": "Gaming on a floppy disk?"}, {"text": "I played warcraft 3 from a usb 1.1 stick. gaming on a usb stick is nothing new."}, {"text": "This decreases the USB lifespan significantly right?"}, {"text": "This product is very Savage"}, {"text": "This product is very Savage"}, {"text": "We used to play games from USB at high school."}, {"text": "I love you Dimitri"}, {"text": "I tested out several linux disto&#39;s by installing them on usb sticks before switching. It works but can stutter like CSGO did."}, {"text": "i gamed from a portable usb3 hard drive before for a long time, and it eventually killed it. not sure why. the only problem with it was loading times were slower than normal, nothing else."}, {"text": "Why all russians are dimitries"}, {"text": "songs used anyone know them .?"}, {"text": "I have Steam installed on a 64 GB SDXC class 10. It&#39;s pretty sluggish to install games, but it gets the job done."}, {"text": "truput hahahahaha"}, {"text": "I&#39;m running CSGO from a USB 2.0 Stick when i&#39;m at my parents house and i got no lags..<br />And that PC got a badass core duo, 4gb ram, old ati card"}, {"text": "what monitor he used?27&quot; or 24&quot;?"}, {"text": "Can someone please tell me the background music?"}, {"text": "How about reliability? USBs aren&#39;t build to read/write constantly to"}, {"text": "Nice test, but maybe its a Windows problem, what wil happen if you test the same on a Linux pc with Steam ?"}, {"text": "thanks to Linus&#39; recent video I knew what Dmitri by &quot;4k speeds&quot;."}, {"text": "you play squad? i do too!"}, {"text": "Kingston HyperX Savage sound like Adam Savage for Mythbusters"}, {"text": "When I still had my MBPr, about one year ago, I installed Windows on a USB 3 HDD, to play without partitioning the internal smaller ssd. it was obviously slower but didn&#39;t expect any hiccups even playing BF3 online (with the integrated Intel GPU), so I think you experienced those problems for some other reason than the usb3 being too slow"}, {"text": "would&#39;ve liked to see a test on a cheaper usb"}, {"text": "Um what? I played Halo CE and need for speed off a 2.0 USB stick back in high school. I always assumed people did it."}, {"text": "My steam library is on an external hdd so..."}, {"text": "Уже больше года смотрю вас , сегодня только въехал , что вы Русский XD"}, {"text": "ThunderBolt stick"}, {"text": "Next time I spot a pretty lady I&#39;ll show her my usb stick. Then I shall know my my game experience on a usb stick. Pathetic is my bet."}, {"text": "What keyboard do you use? :)"}, {"text": "Can you imagine expanding your PC&#39;s storage by sticking a USB stick into your motherboard like a stick of RAM? It may be possible one day."}, {"text": "Love the intro"}, {"text": "college kids do this all the time. at my college, at least"}, {"text": "I recommend getting a ssd and a sata to usb adapter"}, {"text": "The freezing happened in CSGO because youre online and the game is having to sync your player location and all the other players at 120 hz tick rate. Not to mention bullet paths, respawning, grenade physics, etc. Thats why in alot of games the singleplayer section of the game tends to look alot better graphically since it doesnt have to prioritize player location 24/7."}, {"text": "Geeeeee... thats &quot;savage&quot;"}, {"text": "hey can you do a Logitech g900 vs steelseries rival 700"}, {"text": "Source engine, especially for CS:GO and TF2, tries not to load too much into vram as the games may be played on very low end gpu&#39;s. The low 4k reads may have gave you trouble as CS:GO was searching for textures and such far more often than even more graphically demanding games."}, {"text": "that was SAVAGE"}, {"text": "meh this is not a good idea to add and to install the games by a usb stick .<br />btw i have transcend esd400 which is an ssd with 256gb and it is really small in size (like a size of a visa card)"}, {"text": "What computer did you use to test it? Sure didnt look like the overpowered editing rig."}, {"text": "could it be a firmware problem with the drive? could you test this with other drives?"}, {"text": "Might want to blank out your steam username. Don&#39;t want to get flooded with random people adding you."}, {"text": "Such a savage"}, {"text": "The intro though <br />😂"}, {"text": "The moving trees in the background look awesome."}, {"text": "I&#39;ve used the original iPod classic to game with before as an external drive. It worked at least but it wasn&#39;t optimal"}, {"text": "Nothing new really, gamed with a usb 2.0 flash drive 16 years ago lol. But the game was everquest"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m58s\">3:58</a> Claims 128 GB is enough for their Steam library.<br /><br />Lulz, go back to your console, peasant."}, {"text": "I Battlefield on my external drive no problem. Only downside is loading time, a 2-3 minute long loading time on a map for an hour long game, worth it."}, {"text": "Only game I ever played off a flash drive is starcraft. Still no hiccups though, even if the game is over 10 years old XD"}, {"text": "Great idea, a good experiment would be play videogames on a ssd through  usb 3.0 enclosure"}, {"text": "I&#39;m pretty sure Linus has been doing this for a while"}, {"text": "Savage!"}, {"text": "The corsair flash voyager GTX is far better than this crappy USB drive. The voyager actually uses an SSD controller to give ssd-like speeds but with USB connectivity."}, {"text": "I cant mountain bike without a cell signal as well :("}, {"text": "Do you stream?"}, {"text": "low 4k speeds. .. one reason usb drives aren&#39;t it yet"}, {"text": "No surprise, the linux guys have been running different &quot;distros&quot; of USB sticks for a while. Good to see how great strides the USB standard has been making. <br /><br />And, great advert guys ;)"}, {"text": "valve games check in every 3mins thats why freez"}, {"text": "always use to do this in school with CS 1.6 or cod4 lol"}, {"text": "plz check out<br /> the sharkoon shark zone mk80 rgb"}, {"text": "weird. i have 2TB external 3.0 HDD. it runs terra, BO3, and Far Cry 4 just fine. really weird"}, {"text": "I am loving my 500GB 850 evo that cost $139.<br />Hopefully prices go down even more the next time I need more storage."}, {"text": "umm Hyper X USB RAID 0? <br /><br />I use a MediaSonic 2.5inch enclosure USB 3.0 (Recommend it is awesome) with a SanDisk Ultra II 480GB SSD I use it for editing and Gaming <br /><br />400 Read and 400 Write Stable for all the tests some how..."}, {"text": "I used to game over lan when my laptop didn&#39;t have that much storage."}, {"text": "What camera do you use"}, {"text": "Or you could buy a VisonTek USB SSD"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=3m30s\">3:30</a> lol at the wind in the backround"}, {"text": "I have been running both WoW and Diablo 3 off my Sandisk 64gig stick for some time.  I have a very limited space in my case and this allowed me to offload some data without taking up any additional room, especially since I was able to use ultra small sticks"}, {"text": "I like the idea. But perhaps the method with sticks are more sutible for console, the one i have in mind are the Nvidia shield tv (16GB). Perhaps something to look in to in a followup?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=4m35s\">4:35</a> damn that wind storm!!!"}, {"text": "wat?!"}, {"text": "great video"}, {"text": "Considering there was a 128gb SSD only the other day for less then £25 this is not worth it"}, {"text": "can i play a round with you? cs go?"}, {"text": "Instead of CDs gamers can buy the USB stick with the game on it and play specific games :)<br />I mean it&#39;s not a good idea but it&#39;s fun to think about it :)"}, {"text": "As for CS, the stuttering may be the game attempting to load more of the map from USB. Did you use cl_forcepreload 1 in testing? That command loads the whole of the current map to RAM, so it doesn&#39;t need to go and access storage again."}, {"text": "Savage..."}, {"text": "back when i own a 64gb surface pro 2 to replace my pc, I used 3 64gb thumb drive to store my games. Those were dark times. I mean it worked well but i was so ignorant back then..."}, {"text": "I&#39;m playing Call of Duty off USB 2.0 on work and it&#39;s fine."}, {"text": "You should try gaming on a USB with Windows installed on it, you can use software called WintoUSB to do it."}, {"text": "The USB being slightly crooked is killing me"}, {"text": "Could you tell me your hardware specs, Dimitri? Mainly gpu+cpu. I&#39;m buying a 4790k next paycheck, I&#39;m really excited for it. Currently using an FX-8320, so it&#39;s going to be a big step up."}, {"text": "<a href=\"http://www.amazon.com/SanDisk-Ultra-128GB-SDCZ43-128G-G46-Version/dp/B00YFI1EBC\">http://www.amazon.com/SanDisk-Ultra-128GB-SDCZ43-128G-G46-Version/dp/B00YFI1EBC</a> way more compact"}, {"text": "Used to have a WoW private server on my stick, was very playable at school^^"}, {"text": "I just order a M.2 Samsung 950 pro SSD and cant wait to try it out! I&#39;ve heared alot of good things about them for gaming"}, {"text": "I dont think its a CS:GO problem, just a source engine problem, dont know why, but I&#39;m pretty sure similar problems could be seen on L4D2 or Portal 2"}, {"text": "what rank are you in csgo?"}, {"text": "How Much dos would this run mine raft"}, {"text": "what is that bueatiful monitor?!?!"}, {"text": "dude the way you film the way you keep your stuff and how much time you put into these makes this my favorite channel, I hope to have a place like that someday. keep the great work up man!"}, {"text": "Well Basicly CSGO Gets those freezes on almost any drive that is not the main drive. its not the usb"}, {"text": "well everything with the name Hyperx. are designed for gamers"}, {"text": "its written AN usb stick"}, {"text": "And? LOL, I am gaming from an external USB HDD :P"}, {"text": "I remember doing this with a 2.0 USB stick. Ran into some hiccups, and loading screens were longer. Still, Trackmania and older counter strikes ran smoothly"}, {"text": "Savage."}, {"text": "I use my 8gb Philips USB 2.0 stick for gaming on the school computers. I play light games like Factorio and such."}, {"text": "imagine USB 6.0 drive wow that would be good"}, {"text": "I used to game on a 1tb external heard drive because my laptop was out of storage... xD"}, {"text": "its because csgo in crammed with spaghetti coding...."}, {"text": "what keyboard does he use in the video?"}, {"text": "So... What&#39;s the point?"}, {"text": "i used to play  back in middle school counter strike 1.6 in school computers"}, {"text": "HyperX is a savage"}, {"text": "Will it run Crysis 3?"}, {"text": "In fact this usb , considering it&#39;s almost an ssd in terms of performance isn&#39;t really expensive !"}, {"text": "Played Minecraft on a flash drive. Lol."}, {"text": "Not gamed on a USB stick before... but I have run a full Linux distro off one!"}, {"text": "eh... and I thought it was a mini-PC in the size of a flash drive with good amounts of storage.... :/<br />Guess I was wrong."}, {"text": "Yup Secondary school used to play GTA3 on school PCs when I got bored during IT/Computer studies classes. Had to run it directly off my 1GB USB stick since we couldn&#39;t actually install anything xD. Ran surprisingly well for its time."}, {"text": "If the USB drive had a larger cache and better data controller it probably wouldn&#39;t have had any issues with stuttering.<br /><br />I used to run an entire OS off of a USB 2.0 flash drive. It was a Linux SDK that ran perfectly. Granted it wasn&#39;t bottlenecked with heavy data reading but for simple things it&#39;s no biggie. I really hope they make a flash drive that can handle games though. You can have your entire game library on a few thumb drives and take them anywhere without worry of using up valuable space on your primary drive."}, {"text": "waoo did you see the trabant 601? :D"}, {"text": "valve pls fix"}, {"text": "I play games on 2 externally connected (via USB 3.0) HHDs. As compared to connecting via SATA port, what&#39;s the downside?"}, {"text": "Yay for Squad!"}, {"text": "with linux, i can run my whole OS of that lol"}, {"text": "Never gamed on a USB Stick but probably will do a video about gaming League of Legends on it =]"}, {"text": "Pretty sweet, try loading up Windows 10 or Ubuntu on it :)  There&#39;s always something special bout carrying your os around with you and boot off of it :)."}, {"text": "The allocation time is probably more of an issue with NTFS. You would probably have better luck with a different file system. But of course windows doesn&#39;t support other FS."}, {"text": "what keyboard, mouse and mousepad you have?"}, {"text": "Overpriced"}, {"text": "Throughpoot."}, {"text": "My 64gb SanDisk Extreme has 15MB/s 4K read and 13MB/s write 4K<br /><br />Edit: I posted this comment just to tell that there&#39;s better options out there than this HyperX Savage for portable gaming."}, {"text": "Great video with a VERY misleading title."}, {"text": "IMO, using it as a cache drive is a terrible idea.  Your cache drive should be as fast as possible.  You  might try a USB3 sata adapter with an SSD and see if you get better perf."}, {"text": "I have used a Sandisk Cruzer Extreme USB 3.0 for this, and it was way better. If you want good random read/write, Sandisk is your best bet without going for an actual SSD. 12MB/s random read AND write. 250MB/s sequential read and 140MB/s sequential write. The only glaring issue is that it lacks garbage collection, so you have to zero out the drive from time to time to keep up write performance.<br /><br />As for the future, I don&#39;t think Gen 2 will really improve things. USB 3.0 can already transfer at around 450MB/s no problem, yet we rarely see USB flash drives actually going that fast. It&#39;s a matter of having a good storage controller, not a limit of the USB connection. There are drives from Corsair that are pretty much just regular SSD&#39;s on a stick, and those are the only ones that will actually benefit from a Gen 2 upgrade. Your best bet is to get something like the Samsung USB SSD or a regular SSD in an enclosure, as that will ensure a good experience no matter what you do with it.<br /><br />EDIT: I also just figured out that the Sandisk Cruzer Extreme 3.0 is actually a Sandisk U100 SSD stuck in a flashdrive with a SATA to USB3 adapter built in."}, {"text": "Why put Steam on the USB? Why not just use Steam to Create another Installation Directory and install the games. Then you&#39;re using Steam on your SSD, and loading the games from your USB."}, {"text": "hey dimitri i was wondering if you were gonna review the new corsair spec alpha cuz it looks promising for the price point and could possibly outdo the s340"}, {"text": "i think why you got the freeze in cs:go but this is just a guess, you transfered it derecly onto the drive and not innstalling it the proper way. but remember, just a guesss, you should try downloading cs:go and innstalling it the proper see if that makes a difference"}, {"text": "On an USB Stick ... Learn englisch"}, {"text": "that&#39;s cus csgo is a bag of shit"}, {"text": "SSD much better external SSD likely better"}, {"text": "Dimitry, what happened to your old desktop speakers ? They were awesome sounding and looking. <br /><br />I suspect that with advancements in technology, portable high speed sticks with large amounts of storage and cache running on usb connections with greater speeds will be the norm."}, {"text": "Just play games that don&#39;t use streaming, Cs:Go does. There&#39;s your issue. USB 3.0 won&#39;t help fix this, USB 2.0 will give you the same result, just longer load times.<br />Also old video format was better."}, {"text": "Used to game off USBs all the time when I was younger, before any of my friends had external hard drives to copy games off of for LANs. Was a terrible experience in terms of gameplay, but good memories regardless"}, {"text": "what smartphone do you use in the video? is that a OnePlus 2? :)"}, {"text": "woo :D"}, {"text": "It may be dumb of me to ask but I used to play GTA: San Andreas off of a USB stick at school almost 8 years ago. I&#39;d bring it from home with the full installation folder and saves and play it on the school&#39;s computers...<br />How&#39;s that different from this? Might be i&#39;m overlooking something but it doesn&#39;t look/sound that impressive..."}, {"text": "i use to play cs:go on a 2.0 usb stick no problem☺"}, {"text": "what war game was that?"}, {"text": "You know you&#39;re addicted to building computers when you have 46 HOURS of 3DMark used on Steam. <a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=2m06s\">2:06</a>"}, {"text": "playing games from an USB stick since school :D counter strike in computer class was the best.<br />the problem with cs:go is the crappy programming. the windows version is buggy as hell and OS X/linux clients are constantly stuttering and issue bad performance. <br />i hope valve will get their asses up for this"}, {"text": "I&#39;ve run Fallout 4 on my Savage with no problems!"}, {"text": "So the conclusion is that CSGO is poorly optimized storage wise to run lightly?! Source engine 2 uses storage poorly? Must be something along those lines, because otherwise there should be issues with the other games as well. Would have been nice if you tested other source2 based games."}, {"text": "The reason you saw all those glitches in CS:GO and not in other games would be due to the way the Source engine loads data off storage and its reliance on proper cache at the drive level, not engine level.<br />As for the games with increased load times, well - access is a bit slower.<br />And as for games like Tomb Raider, assets are usually streamed in and cached by the engine itself (put in memory more than likely) so your drive is really only being used for the initial load minus a few things here and there."}, {"text": "what monitor are u using ?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=1m27s\">1:27</a> Savage Seq read: blaze it"}, {"text": "Bc Cs:Go is trash"}, {"text": "I remember when we played Wolfestein Enemy Territory when I was in school. You couldn&#39;t install anything in those pc&#39;s, but someone realise you can run programs from USB drive. So half class played Wolfestein from USBs. :D"}, {"text": "*gaming of a USB stick"}, {"text": "Try playing csgo again, this time with cl_forcepreload 1 written in console. Might actually help."}, {"text": "been doing this already with a usb 3.0 128gb stick on my surface pro 3. Can&#39;t play recent releases but it handles mass effect 2 like a boss!"}, {"text": "Dammit! I knew it that the shitty 5000RPM laptop HDD that I have in my PC was causing all the stuttering , this is the first thing that is getting kicked out of my system ."}, {"text": "this would make benchmarking machines on gaming workloads so much easier."}, {"text": "We used to do this with CS 1.6 and Halo 1 back in high school over their network :P Wasn&#39;t a problem then with USB 2.0"}, {"text": "While a very slow experience, I managed to game off of a samba share on a NAS while away from home over a VPN. (extremely slow experience but once the game fully loaded (black mesa), it ran fairly smoothly. Though I have dab better luck with using the steam in-home streaming over a VPN.<br /><br />I have also tried gaming from a USB stick, though it has been hot or miss. for games which load assets on an individual basis where you can get hundreds or thousands of requests for tiny assets, then a USB flash drive will choke and slow down. On the other hand, it is just as cheap to get a cheap USB 3.0/ eSATA enclosure, and then install a cheap SSD. this avoids the other performance issues, works more quickly,  (basically $50-60 for a 240GB SSD, and $15-20 for a USB/eSATA enclosure (with eSATA performing about the same as an internal drive)."}, {"text": "I&#39;ve thought for a while pc games bought in a store should come on a usb stick.<br />if you&#39;re paying full price they can atleast give me a flash drive instead of a useless disk. I&#39;d consider physical purchases if they did that"}, {"text": "Isn&#39;t there like a usb ssd you could use?"}, {"text": "that was a real teste to see!!"}, {"text": "I&#39;m pretty sure I can grab a 128GB SSD for the same price I paid for my very first USB stick."}, {"text": "I&#39;ve run Half Life 2 from a flash drive before because I didn&#39;t feel like installing it on my old laptop (only USB 2.0, by the way, though the drive is 3.0). Ran just fine, but with a few hiccups like you experienced in CS:GO, but I put those off to the old hardware, which is a 1.3 GHz Pentium M, 1 GB of RAM and a Mobility Radeon 9000."}, {"text": "How to donwload game do one video ."}, {"text": "is there going to be a s340 vs p400 video  and will it be soon?"}, {"text": "Now, Steam Portable would be pretty handy, wouldn&#39;t it?"}, {"text": "@HardwareCanucks what about a M.2 drive on a usb 3.0 enclosure? can you compare that against the USB Stick?"}, {"text": "100 years later we will be able to game on a toaster..."}, {"text": "Nice idea, to put some funny scenes!"}, {"text": "This makes as much sense as storing all your data on a RAID 0 array......"}, {"text": "what acer monitor is that?"}, {"text": "3.1 Gen1 is the worst bullshit ever!"}, {"text": "I have one of these, gonna try that cache drive thingy"}, {"text": "I want a PC........😭😭😭😭"}, {"text": "I wonder if the freezing in csgo is actually USB related, wonder if Valve is scanning USB devices as an anti-cheat measure and it&#39;s disconnecting them briefly or at least pausing their operation. You should try with other USB devices."}, {"text": "What keyboard is he using in this?"}, {"text": "These videos are so crispy."}, {"text": "loading into csgo offline map took 55 seconds on a ssd?<br />there has to be something REALLY wrong in how you set it up, thats multiple times longer than it usually takes on a normal hdd"}, {"text": "savaaaaaage!"}, {"text": "try SFV"}, {"text": "I actually used a USB 3.0 32GB to game a lot last year, I had a lot of empty spaces in my lesson table at school, so I took it to the library and had a blast using my time in a non productive way."}, {"text": "&quot;Kingston designed this Savage for gamers in mind&quot;<br />More like Kingston designed this for five year old &quot;jazzy&quot; kids."}, {"text": "I&#39;m here for the B-Roll ;)"}, {"text": "Thumbs up for plant at :27"}, {"text": "what about the latency compared to a m.2 drive using pci channels i say you need to test that out next."}, {"text": "Seems like a viable, portable cache for steam games. Neat."}, {"text": "sounds like games that need to access the drive during game play will slow down, i kinda would like to see how something like GTA5 would work, I would think more hiccups. Either way, pretty cool. I&#39;m pretty interested as I go between two houses a lot, and have a computer in each. Would be nice to have a game on something external and continue on with the game with basically no cloud saves and installing onto two computers."}, {"text": "Nice video, what speakers are those ? they look good."}, {"text": "I use a 128gb Samsung micro usb as a storage for my VM on my macbook - works fine."}, {"text": "thats cool but...a bit useless..."}, {"text": "I game over iSCSI on a 1 gig link to my freenas based storage box, and there are no noticable speed decreases in anything other than GTA5, and for small games, they tend to even load faster than local drives."}, {"text": "This is actually extremely good to know"}, {"text": "The source engine has always been pretty crappy with loading assets, so that may be what&#39;s going on with CS:GO."}, {"text": "What about USB, wireless, Internet connectors? Ubs sticks, which allow you Internet connection when you plug them in the pc, so you can have connection everywhere! Are they good?"}, {"text": "Pretty sure that a portable (usb) SSD would be much better like the one that sumsung makes (T3 ?)"}, {"text": "Nah more speed will probably not fix CS go. It is probably an issue with how the game accesses storage in general. I suspect that it some how floods the storage interface with small requests and since sheduling usb storage  is a mess in general you end up with this stuttering. If it was a speed issue you would finde the same problem with other data intensive games"}, {"text": "Of course TLC NAND memory :D"}, {"text": "I&#39;m surprised Squad didn&#39;t have any hiccups despite being in Alpha."}, {"text": "Why not compare it to the SAmsung T1 or whatever that USB SSD is."}, {"text": "Dimitri, was is that monitor that you are using called?"}, {"text": "sv_forcepreload 1 in cs:go should help"}, {"text": "I use to play Portal 1 on a portable HDD back in the day. No stuttering at all."}, {"text": "More like a portable Linux distro"}, {"text": "I think because of the cache difference between internal SSD and USB drive ? Notice the graph when you copy your file, peaking then going down very quick, unlike internal SSD that have more stable graphs"}, {"text": "I wonder if there were any heat issues during significant transfers to/from the USB stick.  (?)"}, {"text": "This video could&#39;ve been a simple &quot;No, you idiot&quot;."}, {"text": "I will wait for USB3.1 10Gbps to do this, alternatively you can put remixOS on the 128GB USB3 drive and have BOSS Android desktop OS on the go!"}, {"text": "What about external 3.0 HDD?"}, {"text": "Awesome concept and generally a great idea, but it could also be a PC hackers paradise making some hacks harder to be found by Steam VAC.Also, the hiccups are most likely from read and write times being sent through USB 3.0. 3.0 is fast but nothing compared to SATA or PCI Express speeds. Add that to different PC setups more/less ram, cpu etc. and it may work better with really high end PC builds."}, {"text": "Would be good to see this test with it as a USB boot drive as well"}, {"text": "just get a portable ssd it would be a much better idea in the long run if you have that kinda lifestyle"}, {"text": "i though it was an USB sized gaming platform"}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=0m21s\">0:21</a><br />MY FACE REALISING I GOT HOMEWORK TOMORROW"}, {"text": "It seems a usb SSD would be a lot better than this."}, {"text": "55sec to load a cs:go map from an ssd? holy moly! my sandisk ssd needs<br />less than 20 secs!"}, {"text": "11th"}, {"text": "In two weeks I will change this comment to NOTIFICATION SQUAD."}, {"text": "<a href=\"http://www.youtube.com/watch?v=maYuTnci4ys&amp;t=0m23s\">0:23</a> Someone needs to make a gif out of this lol"}, {"text": "Hi i like turtles"}, {"text": "Nice video!"}, {"text": "Second"}, {"text": "Pretty cool"}, {"text": "Yea, it is fun watching your videos but everytime I see that face I always wonder when we will see your six pack. Do it for the kids."}, {"text": "Last time I was this early I...<br /><br /><br /><br /><br /><br /><br /><br /><br />Fuck this overused comment"}, {"text": "FIRST!"}, {"text": "first"}, {"text": "Interesting"}]