[{"text": "I currently use a atx build but i&#39;m heading out to college so this will be the case I use to convert my pc to itx:). Awesome way to transport my pc instead of freaking hauling up a damn 30 pound pc."}, {"text": "<a href=\"https://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=6m35s\">6:35</a> The way he presses down on the gpu is what gives me anxiety"}, {"text": "Just so you guys are aware, the Node 202 riser does not support PCIe <br />4.0! So if you intend to install an RX 5700 GPU on an X570 board, you <br />have to downgrade your Mobo to PCIe 3.0"}, {"text": "can you put amd stock cpu cooler in the node 202?"}, {"text": "4 years later, where wireless connectivity is master, i want to make my desktop as sleek as possible. No cables. No pc case. Just the essentials and monitor (kinda hate the fact monitors still need cables ;)).<br /><br />But now, i want to make a final upgrade for a long time. Newest ryzen cpu, newest vega gpu, currently vega 7, and watercooled.<br /><br />Most beefiest sleeper computer ever.<br />But will it fit??? I don&#39;t mind having to go custom, ofcourse, i might build my own case if i can&#39;t find one."}, {"text": "is the riser card included and also minus the 3.5&quot; drive bay i probably would choose this case myself too many cons sorry"}, {"text": "which is smaller ? this or the silverstone Raven and Milo series ?"}, {"text": "Good."}, {"text": "would a MSI GTX 1050TI fit?"}, {"text": "the volcan!!"}, {"text": "You are a good channel to trust"}, {"text": "Here’s a tip put the zip ties in the hole before you start building"}, {"text": "I rather build this than buy a gay Xbox or Ps4"}, {"text": "Added it all up and it costs exactly 420.69. Well played."}, {"text": "Complains about power supply cables not being black although they&#39;re out of view. Continues to install a white and blue CPU cooler clearly visible through the ventilation grill messing up the complete black look."}, {"text": "i really like the look but....it really bother me that you said console killer not because i am a console gamer but a gamer who atleast know that ITX pc are pretty difficult to work wiht of you don&#39;t have hte right parts"}, {"text": "This in white and I take it any day of the week..."}, {"text": "This video is more convincing to get this case for my main system so I can fit my full size gpu in , I do question the power supply option though as I need it to support an 195w rx 570 along with a 2600."}, {"text": "Would this fit into a  SLR/DSLR camera bag? I will be travelling soon and I am looking for a travel friendly pc case."}, {"text": "Is there a PCIe extension included?"}, {"text": "<b>C H A M B E R</b>"}, {"text": "what cooler is this????... i just bought a gabriel that does not fit :("}, {"text": "with PSU 450 can be fine on GTX 980?"}, {"text": "This logo hella annoying me. Would put a sticker on it :D"}, {"text": "If they made a white version, it would look more modern and not such much like a VCR 😅"}, {"text": "Brother can the integra psu support gtx 1080?"}, {"text": "I&#39;d recommend in a case of this type, turning your cpu fan upside down so it doubles as an exhaust fan."}, {"text": "Would run horizontal underneath monitor like old school IBM PCs."}, {"text": "<b>The most retarded concept fail is the extra power supply conector with the extra long cable through the entire case too the powersupplies normal conector!</b>"}, {"text": "Does it come with the pci e riser"}, {"text": "I would take skyreach 4 mini over any itx case ... shout out to nfc"}, {"text": "i like this aesthetic. it would be cool if they released a smaller version that was basically the same thing minus the space for the gpu for non gaming builds"}, {"text": "Cool! I have been looking for a case this small!However I plan on using a Z370 ITX board and a GTX 1080(Mini, if feasible). I would like to ask something. Wha would be the size limits for a GPU?Thanks!"}, {"text": "600k views and not much discussion about the pink elephant in the room: calling a fanless case a console killer gaming case. minesweeper doesn&#39;t count as a game, temperature information please.."}, {"text": "I want to spray white coating on this case and wonder if it makes temperature cooler inside"}, {"text": "I assume I need to buy a PCIE extension cable?"}, {"text": "Node 202 vs sentry which is smaller?"}, {"text": "It looks like  VCR when lying down... not really, maybe as in size comparison. By that logic I can stand my VCR up on end and it&#39;ll look like a Fractal Node 202....freakin sweet. Maybe someone should just build a htpc in an old VCR case..... as a visual anti-theft measure...lol."}, {"text": "There will never be a console killer,coming from me a pc player"}, {"text": "@HardwareCanucks So did you use the Silverstone AR06? Looks like it. If yes, does it cool properly and how about noise? <br />(I know it&#39;s an old video but am currently looking into this case - just worry about getting an i7 8700k cooled)"}, {"text": "What riser used?"}, {"text": "I love this case."}, {"text": "you think this case will fit with MSI GeForce GTX 980 4GB Gaming X"}, {"text": "Does it come with the riser itself? Or do I need to buy one?"}, {"text": "The &quot;wasted&quot; space next to that power supply is probably for a bigger power supply something that even this build would probably want. A 450W power supply is certainly not very large and leaves plenty to be desired."}, {"text": "ryzen raven APU would be perfect for this kinda build!"}, {"text": "what cpu cooler is that"}, {"text": "does this come with the riser and a single fan?"}, {"text": "would that fit in a backpack?"}, {"text": "I wonder why everyone stands it so the fractal design logo is on top? I get way better gpu temps when I stand it with the usb ports on top and logo on bottom"}, {"text": "Is asus strix gtx 1070 will be fit in it?"}, {"text": "Is it feasible to build a 8700k and 1080 ti with a case like this?"}, {"text": "This vs RVZ02?"}, {"text": "you talked about the possibility of fans under the GPU.  Have you tried to see what thickness fans could be used, 25mm thick or less?"}, {"text": "does it come with the riser card"}, {"text": "Just built one with a 7700 and a an MSI Aero ITX 1070.<br /><br />This is not a console killer. It’s like 3 times bigger than an Xbox One S and is a pain in the ass to put together (the GPU risers are crazy, the screw holes have weird tolerances, and cable management is a nightmare). It’s pretty and interesting, but definitely not a console killer."}, {"text": "I wonder would scythe big shuriken2 fit inside this? Its also 58mm tall and is more powerfull than this silverstone AR06"}, {"text": "It looks like a shitty school computer case"}, {"text": "wow"}, {"text": "CHASSY"}, {"text": "Is there ANY case like this for micro ATX?!"}, {"text": "this looks so awsome. ME WANT"}, {"text": "thus , i can buy one like this with a psu inside??????i mean with more money than the normal one!"}, {"text": "All that extra space in front of the PSU could of been used for expanding that double sided 2.5 inch hard drive bay to allow 2.5&quot; 15mm drives. This would of allowed a 5TB seagate 2.5&quot; hdd to be placed."}, {"text": "Im a little bit afraid of buying this case and see my components melting away. Normal tower pc´s are huge, but offer the best cooling wich is possible. This has no fans at all, and I don´t think this is working in envery scenario. Technology is getting smaller, but cooling and noise will always be a Problem."}, {"text": "Would a normal 2.5 inch HDD fit in the drive caddy if the dimensions are around 70 x 9.5 x 100 (WxHxD mm)?"}, {"text": "That gpu has more room to breathe than my full tower define series, tho i have other pci.. <br />Amazing how ventilated that is :D"}, {"text": "Which one is smaller - this one or the Raven Z RVZ02? I really need a case which will fit in the backpack and more over, will be able to hold something much more powerful than standard laptop, so I&#39;m talking about like GTX960 itx + i5-4690k - without OC."}, {"text": "Will an R9 Fury NITRO fit inside this case?"}, {"text": "how about a place for hardisk/SSD ? i don&#39;t see it"}, {"text": "I am actually thinking of building my rig into that cause right now i am using the Cooler Master K350 case and i just find i don&#39;t have too much room on my desk which i am thinking about making a smaller system which i was originally thinking of getting something like the Fractal Design Core 500 but then realized that it would still be too big for my desk.<br /><br />Also i would like to know how cool the system runs with a 120mm fan included in the system because i don&#39;t want to rely on only the CPU cooler and GPU cooler only and thanks if you are able to answer this for me because i plan on getting the motherboard and case sometime in June/July."}, {"text": "And to this day we are still waiting for the link to the official page..."}, {"text": "Would an Asus gtx 970 strix fit in to this case"}, {"text": "do you think that putting msi gtx 980 and i7 6700 in there would be fine ? Iam thinking about selling my ATX and buying mini-ITX motherboard and put it in Node 202 ... maybe if I modify the case it could get better airflow for better cooling ?"}, {"text": "Does the pci extender follow with the case?<br /><br />Thanks in advance"}, {"text": "You&#39;re the best reviewing cases guys!!"}, {"text": "i have 9 titan rx480s"}, {"text": "So, that PCI-e angle-connector, is that something included in the case or does it have to be bought by itself?"}, {"text": "does it include the pci adapter for the GPU ?"}, {"text": "where is the hdd"}, {"text": "what&#39;s better Fractal Design NODE 202 or Silverstone RVZ02?"}, {"text": "Wait, this small case is ITX? So it should have NO problem with my micro ATX mobo right? Wow."}, {"text": "looks good except for the vent on top"}, {"text": "While the dust filters being included is nice the fact that you have to basically disassemble the case to get to them makes them moot. Dust filters should be external for easy cleaning."}, {"text": "I&#39;m glad the case doesn&#39;t have 3.5&quot; drive support. Those need to go away. If you&#39;re building a powerful and compact case you&#39;re not going to want those in there anyways. SSDs are well worth the price"}, {"text": "dimensions?"}, {"text": "Will an ASUS GTX970 TURBO fit in this?"}, {"text": "PC gamers stay trying to kill consoles while trying to be more like them with cases like this..."}, {"text": "i can&#39;t find any HTPC case better than raven rvz01"}, {"text": "I made the mistake of buying an EVGA SC GTX 1060 for my node 202 which isn&#39;t a blow style fan. To improve cooling I was thinking about installing 2 case fans but I have no idea about whether I should have 2 intake fans like in this video or 1 intake and 1 exhaust. Also, should i go for airflow or SF fans?? Someone please help!!!"}, {"text": "which one is smaller. the Node 202 or the Silverstone RVZ02??"}, {"text": "I completed my node 202 build. I modded the case and used 15mm fans. <br /><br />I used a gtx 1060 and was  able to fit the corsair h55 with some further modding. <br /><br />here is my build <a href=\"http://ca.pcpartpicker.com/b/Wc6XsY\">http://ca.pcpartpicker.com/b/Wc6XsY</a>"}, {"text": "COUGH!"}, {"text": "Stupid question, but how do you load games if you have no Optical drive?  Do you download them all from the manufacturer?"}, {"text": "Really Great review. Thanks a lot!"}, {"text": "What is with the no ODD, a slim could fit..."}, {"text": "Well, I do not know what is wrong with my 202 case, but I cannot start a lesser configuration, B150N Phoenix + i5-6500 and a 1060 Windforce 6gb. pc partpicker show max power usage should be ~ 246 W , so the PSU should be enough. Current sympthoms are, it starts , the motherboard lights up, the cpu cooler is spinning, all ok for 10 seconds then it shuts down  all this time there&#39;s no signal via video card port or motherboard hdmi to the monitor at all.The case does not have speaker so I cannot debug it via the beep messages"}, {"text": "Will this fit? <a href=\"https://www.amazon.com/MSI-Radeon-RX-480-8G/dp/B01GX5Z4EM/ref=sr_1_1?s=pc&amp;ie=UTF8&amp;qid=1479838264&amp;sr=1-1&amp;keywords=rx+480+8G&amp;refinements=p_n_shipping_option-bin%3A3242350011%2Cp_n_feature_four_browse-bin%3A6066318011\">https://www.amazon.com/MSI-Radeon-RX-480-8G/dp/B01GX5Z4EM/ref=sr_1_1?s=pc&amp;ie=UTF8&amp;qid=1479838264&amp;sr=1-1&amp;keywords=rx+480+8G&amp;refinements=p_n_shipping_option-bin%3A3242350011%2Cp_n_feature_four_browse-bin%3A6066318011</a>"}, {"text": "is it a Metall case?"}, {"text": "is this really a console killer? it costs more but plays better while the console is cheaper but doesnt play too bad"}, {"text": "Really not smart for fractal to not include a spot for at least one 3.5 drive, as one 2.5 and one 3.5 is a standard combo for mini itx builders. With all of that space behind the graphics card, I would mount one there, close to the front of the case."}, {"text": "I have a question how much room is there between the gpu and the 120mm fan want to know if 37mm thick fan will fit with a ASus 1060"}, {"text": "so because i have a normal 600w cit psu it wont fit in right?"}, {"text": "Bought this case for my daughter, awesome case. Put in a Gigabyte 170N G5 MB, I5 6500 with stock fan, 16gb of DDR 3000, 540gb M2 drive from Crucial - Installed Windows 10 using the integrated GPU in the cpu and everything is working great, cool and quiet. Looking on YouTube for temperature results of different gpu&#39;s and cannot find them for this case, every build review seems to lack what you get for temperatures. Thinking about a GTX 1060 while a blower cooler version would definitely work but how about the fan type ones? That is what I am looking for. Will be adding to slim 120mm fans in the gpu section."}, {"text": "Great Video, I will buy this case for my daughter!"}, {"text": "just stupid as hell that they didn&#39;t allow for at least a single 3.5&quot; drive.  nice review."}, {"text": "Hey Dmitry- Awesome reviews you do, one of my favorite channels. I&#39;m trying to go ITX for my next build, and want either the Evolv itx or the Node 202. I think the 202 might have better airflow for my GPU (EVGA 1070SC) since you can place fans next to it. If this is true that&#39;s enough reason for me to buy it. Thoughts on the two cases?"}, {"text": "The &quot;TM&quot; on the Dam Good Award! XD"}, {"text": "Yes but is it quiet?"}, {"text": "Will the GTX 1070 AMP! Extreme fit in this case?"}, {"text": "Gorgeous case."}, {"text": "One thing to consider with this case is that if you&#39;re using a normal 2 slot GPU you can&#39;t add any other PCI-E things in like a wireless card so no wifi unless you get a USB dongle which is a bit crap."}, {"text": "What if you use a third-party PSU (eg. Corsair SF600), would you need that PSU cable running inside the case?"}, {"text": "Dust filters for idiots. They kill airflow drastically."}, {"text": "can that 450wats handle gtx 970?"}, {"text": "Can I put an HDD inside ?"}, {"text": "Your using gtx 980 can the 450w psu handle it?"}, {"text": "Would you think spray painting it white would be possible?"}, {"text": "That moment when he pushes down on the GPU..... My anus is still reeling"}, {"text": "would this set up fit?<br />corsair h55 57.0 liquid cpu cooler <br />gtx 1080<br />asus z170i pro gaming mini itx lga1151 motherboard<br />evga 750w 80+ gold certified fully modular atx power supply?"}, {"text": "will this fit sapphire rx 460 4gigs?"}, {"text": "i would love the logo to be a rotatable piece of plastic like the playstation logos on the old ps2 for being right-side-up in either orietnation"}, {"text": "it&#39;s all the same.   keep drinking that coolaid boys.  Push that credit card til it dies."}, {"text": "Does this case come with the pcie extension?"}, {"text": "this video is extra nasaly lol"}, {"text": "so no case fans?"}, {"text": "is this the Silverstone AR6 CPU cooler ?<br />it´s 58mm in height...recomendet height for the node 202 is 56mm."}, {"text": "Desktop vertical<br />HTPC horizontal"}, {"text": "is there any chance i could cramp in a 3.5 inch drive if i used a smaller gpu (gtx 1060)"}, {"text": "Does it fit in a backpack?"}, {"text": "What CPU cooler is that ?"}, {"text": "What fan did you use please???"}, {"text": "My Name is Dimitri petrenko"}, {"text": "Does anyone know of any case of some sort that could protect this while mobile? Like one of those hard plastic ones you can carry-on on a plane"}, {"text": "c&#39;mon... Spots without dust filters? what is this 2010? Why is this even being reviewed? Such a stupid decision."}, {"text": "only 1 fan?<br /><br />nope! that&#39;s against my rules yoh"}, {"text": "what cpu fan did you use"}, {"text": "Get it with a portable monitor and you have yourself a portable gaming rig"}, {"text": "Vents are ugly. They should have some louver or something so you can&#39;t see directly into the vents like that. Perhaps a fine metal mesh would work providing it&#39;s got some stylish design, not just some square piece."}, {"text": "has anyone tried to fit an SFX-L PSU in there with all that &quot;extra room&quot; ?"}, {"text": "Hello, thanks for the review. Can I mount a 3.5&quot; hard drive in the area of the GPU? If so, what kind of tray/bracket accessory do I need? I really like this case, but I don&#39;t need a graphics card. I was also looking at the Silverstone RVZ01, to see if I could do the same. Thanks."}, {"text": "The reason the top vent has no dust filter is simply because it is ment to be an Exhaust. When standing upright  ( Hot air Rises )  the 2 bottom fans are ment for intakes , hence dust filters over intake vents, do a Positive presure configuration and with the amount of air belowing out the top of the case no dust will go in. When PC is turned off, just cover it :)"}, {"text": "Will it fit the GTX 970 G1 Gaming? I know the max supported gpu listed is 2mm less than the 970 but maybe it fits anyways, anyone tried?"}, {"text": "THat case is amazing but parts are way out of my range.... i just hope that new gtx 1060 will outperform gtx 970 and have price under 300$."}, {"text": "I don&#39;t like the fact, that no 3,5&quot; HDDs fit in. In this point the Silverstone Raven RZ01 is  better. You can&#39;t insert a Slot In DVD Drive, which ia possible in the Raven case."}, {"text": "Ha, I wished I had that much space behind my PSU!! I bought a silverstone 500w PSU the amount of forceful bending I had to do to the PSU&#39;s cables (smh), I thought I was going to tear them up. The case isn&#39;t the greatest for new PC builders, like myself, as you mentioned the space is just to constrictive."}, {"text": "Will this fit the new gtx 1070?"}, {"text": "thumb up for the attention to detail, best instruction on the build so far (best video among all node202 video i watch on youtube),<br />e.g. you&#39;re the only person showing how to install the riser card properly <a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=5m25s\">5:25</a>.<br />CINEMATICS is top notch(appreciate the 4k quality), and presentation is very profesional. <br />For me, this node 202 with r9 nano is my dream build, but as student i&#39;m still saving my money, in the meantime i had been just watching this video again and again (many times) to motivate myself. Thx for the awesome video. <br />Hopefully can build mine is 6months time."}, {"text": "Hey Dimitri, could you post a size comparison pic for the RVZ01, RVZ02, and Node 202. I&#39;ve been on the NCIX page for these 3 cases for days."}, {"text": "i just build one of these"}, {"text": "dust filter for exhaust fan, why? do want to keep dust inside?"}, {"text": "what riser card is that?"}, {"text": "So do you have to take the whole thing apart just to get at the dust filter?"}, {"text": "Is the included power supply by fractal design strong enough to keep up with an i5 4690k and gtx 970 during gaming?"}, {"text": "At first it looked promising but into more detail it looks lazy and outdated. Also calling anything PC related a console killer is pathetic, especially this build."}, {"text": "NODE 202 or Define S?"}, {"text": "am I the only one that hates book shaped cases? keep them on servers not gaming rooms."}, {"text": "Damn was really looking forward to getting this case until I saw it couldn&#39;t support 3.5 Hard Drives!!!"}, {"text": "Looks better than the Xbox One"}, {"text": "Why are you whining about no filter in top? If you have 3 fans installed the air pressure gonna be positive inside the case and the air is gonna come out on top = no dust getting in.<br />I like this case alot, think im gonna build something with it, not 100% sure about the SFX PSU, sure Fractal make silent components but maby i rather go with a Mini-itx case with a ATX supply and a fanless one."}, {"text": "do you know if any of the noctua coolers would fit in this case ?"}, {"text": "i like it. i agree with the review too. maybe try realan E-2008 its got laptops cd drive port on it and similar size. can fit everything in it."}, {"text": "говорить без акцента слабо?"}, {"text": "is it a good idea if i get this case with an external 1tb hard drive?"}, {"text": "Can i put a 3.5 hdd inside?"}, {"text": "I wish the dust filters could be removed without taking apart the case. Makes the Silverstone ML08 a little tempting. <br />I think the top vent doesn&#39;t have a filter because it&#39;s exhaust. Still would be nice to have a filter though."}, {"text": "rvz 01 or node 202?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=6m36s\">6:36</a> he put too much force on the graphics card :D"}, {"text": "would a 500W or &gt;500W power supply fit?"}, {"text": "H guys!!!, this is the new ps5... thx so much sony!!!! XD"}, {"text": "Would be nice if you had a part picker list"}, {"text": "I am looking for a mini ITX case like this, i think i have found the ideal one. My question is if it can fit in some hand luggage or carry-on so that i can finally bring my desktop pc on an airplane ? It would be the BIGGEST benefit ever in the category"}, {"text": "You don&#39;t need to dissemble to get to the filters, use a vacuum cleaner, dust will be on the outside and come off easily from the filters."}, {"text": "I like this case, it looks sleek and comes with a power supply, very nice. However I still believe that optical drives are relevant especially for a living room TV build. I&#39;m using an RVZ01 which supports a slim slot-load blu-ray drive (although it&#39;s ridiculously expensive at $129). The RVZ01 also has an additional spot for an internal 3.5&quot; hard drive. This Node 202 is very similar in layout, but is actually short on some features in comparison.<br /><br />I&#39;m considering doing a build with an RVZ02 next."}, {"text": "Can anyone tell me if i can place a corsair h100i cpu cooler and a gtx 980ti hybrid in this case?"}, {"text": "Do you guys think it is possible to put 120m AIO cooler for the cpu if the graphics card is something like fury nano or mitx gtx 970."}, {"text": "could I get a link to the parts used in this video please"}, {"text": "Thanks for a nice video.<br />How ever I don&#39;t quite understand the recommendation &quot;against&quot; using 2 fans under the Gfx cards ? <br />I can understand that You don&#39;t want Your GgxCard &quot;hanging&quot; on its extended bridge and and back end, but wouldn&#39;t it be a rather simple &quot;operation&quot; to make a &quot;support&quot; for the graphic card if You want to use both the fan mounts under it?  I mean You only have to make a piece that fits between the fan frame and the graphic card shroud, that could (if You so choose) support it in the same exact spot as the original &quot;support piece&quot; or am I missing something ??<br />Brdgds"}, {"text": "would gtx 980 to reference fit"}, {"text": "Probably unlikely to get a response but with GPUs like the fury nano are you able to use a 120mm aio for the cpu?"}, {"text": "So can you add any psu or does it have to be a custom build one?"}, {"text": "I love it but i live on brazil crying"}, {"text": "Nice video, great review, I have one question though.<br />Does the riser card come with the case, or do I have to buy it separately? Any good recommendations (if i take it separately)?<br />Thanks"}, {"text": "can it hold hyper 212 Evo"}, {"text": "Can the Sapphire 390 Nitro fit in there? According to Sapphire, its 308 X 127 X 42.3mm. I am really worried that it wont fit..even the MSI one cant fit in there :/"}, {"text": "you are a don"}, {"text": "hi @HardwareCanucks , nice review here, just wondering if you tried any CPU liquid cooling on this case? also how is the heat issue with the GTX 980? is it possible to include additional case fan behind/next to the gtx980? thanks"}, {"text": "cpu cooler name?"}, {"text": "Is this first time builder friendly?"}, {"text": "Am I insane if I will install an amd r9 280x gigabyte windforce 3x in this case? I have this question because I am concerned about gpu temperatures. I want to build a gaming mini pc and I like this case very much."}, {"text": "Will this fit a ASUS GTX 750 TI or MSI GTX 950?"}, {"text": "can this fit micro atx?"}, {"text": "Is the included Integra 450W enough for a 6700K and a EVGA 980 Ti FTW?"}, {"text": "i want to know the teamperatures of the gpu, internal vs rear exhaust, with and without extra fans."}, {"text": "Would that extra space between the PSU and SSD brackets allow the housing of a Sliverstone SFX-L PSU?"}, {"text": "Good videos comrade!"}, {"text": "Perfect for my multimedia PC build."}, {"text": "LinusTechTips sent me here lol"}, {"text": "Do you think a 58mm cpu cooler with a 120mm fan would fit? I have a scythe scbsk 2100 on one of my other builds and I like it alot.."}, {"text": "it comes with the pci extenders right?"}, {"text": "came to see it levitating"}, {"text": "56mm CPU height clearance...uses 58mm AR06. Well played sir, well played."}, {"text": "What is the CPU cooler ?"}, {"text": "can h100i fit??"}, {"text": "wow a gtx 980 fit inside that case. console killer indeed!"}, {"text": "I wonder if you could remove that logo by rubbing a sugar cube over it."}, {"text": "what cpu cooler did you use? the only one i&#39;m finding that may work besides a stock cooler seems to be the noctua NH-L9i"}, {"text": "The sideways logo doesn&#39;t bother me at all :O"}, {"text": "Can it acomodate R9 fury X, with AIO cooler? It seems to be potentionally able to do so. Is there any chance you could try it?"}, {"text": "I would be using it horizontally for my HT PC in my HT rig."}, {"text": "I feel like this case is designed for people who want to build a &quot;steam machine&quot; or &quot;console&quot; styled PC. I could see myself getting a bunch of these to build somewhat decent, midrange systems as steam machines (but with windows that immediately boots into bpm) and selling them at a $250-300 premium/profit. <br /><br />I&#39;m thinking an i5 6400 (w/ stock intel cooler), <br />GTX 960 (reference or aftermarket blower cooling), <br />240GB 2.5&quot; SSD, <br />1TB HDD (2.5&quot;, so @ 5400rpm unfortunately), <br />Windows 7, 8.1, 10 (dependent on the desire of who is buying the system), <br />2 x 4GB DDR4 @ 2133Mz, <br />H170 ITX motherboard. (with mini PCIe),<br />mini PCIe intel WiFi card,<br />Xbox One controller w/ wireless adapter<br />Cooler Master Storm Devastator keyboard/mouse combo<br /><br />This would be a killer Windows &quot;steam machine&quot; for someone who is used to consoles, not wanting to upgrade."}, {"text": "is it sturdy enough to set a monitor on top of it while horizontal?"}, {"text": "You didn&#39;t say how hot it runs or noisy."}, {"text": "I managed to pick up this case with the PSU and I have built a system using the following parts. Pentium G3220, 8GB Ram, 240GB SSD, MSI Z87 motherboard with AC wifi and a MSI R9 380. It is working very well on a 1080p projector and is running games far better than I expected. My only concern is how hot it all gets, I might try to squeeze some 120 mm fans in there for additional cooling."}, {"text": "WHY CANT I FIND THIS CASE ANYWHERE?"}, {"text": "Does this exist??"}, {"text": "damn still not available for retail? is this thing never coming out? i really wanted one"}, {"text": "Do you need another cooler for cpu with passive cooling case? Or is the stock cooler good enough if i dont overclock?"}, {"text": "Dimitri? How is niko bellic doing. Haha"}, {"text": "Would 980 TI work?"}, {"text": "So is a reference blower fan the only way to go in this case? I&#39;ve currently got an MSI 970 gtx with Frozr fans so I&#39;m not sure this will a) fit and b) work with the ventilation of the case. Any recommendations? Thanks!"}, {"text": "So this means that the gigabyte 970 g1 would fit? ;("}, {"text": "does it have USB extension also?"}, {"text": "anyone here know if the 202 fits an sfx-l psu?"}, {"text": "Looks better then any &quot;steam machine&quot;  in my opinion"}, {"text": "AMD APU will be very good for this case. Hope that AMD Zen next year will have a new APU with Radeon. Perfect for Living Room PCs."}, {"text": "Where can I buy this c ase in the US?"}, {"text": "Great review!<br />Think I&#39;ve made my decision 👌"}, {"text": "would make a great console killer"}, {"text": "What cpu cooler did you use in that build?"}, {"text": "А где на родном Русском то языке обзор?"}, {"text": "Console killer? sounds fucking lame dude. It is a lame ass system by the way."}, {"text": "Wanted to get this case for my new ITX rig but unfortunately these are not yet on sale and no word on when they will be available.<br /><br />I went with the Silverstone RVZ02"}, {"text": "Instead of a 3.5&quot; HDD, you could also find a Laptop sized HDD to fit with the SSD tray!  :)"}, {"text": "Which cpu cooler did he use?"}, {"text": "can you fit in a regular size psu?"}, {"text": "Is it not possible to fit a bigger (longer?) PSU inside the Node 202, seeing that there is alot of space infront of the PSU."}, {"text": "I can&#39;t find this case for sale anywhere."}, {"text": "anyone know where I can buy this case with the PSU. I cant seem to find it anywhere. I live in the US by the way. I website would be helpful."}, {"text": "It&#39;s not a fucking tower what the hell"}, {"text": "You guys think a SilverStone Tundra TD02-Slim or a TD03-Slim would fit in this?"}, {"text": "Question: If you remove the 2.5&quot; drive bracket, how much room is there between the top of the psu and the middle separator (where you would screw in the 2.5&quot; bracket)? I feel like you could fit a 3.5&quot; drive when the bracket is removed. As to how to keep it in place: velcro? diy L bracket mount? idk I am new to pc building."}, {"text": "I could see using no video card and make a bracket  for a fake video card to mount drives onto."}, {"text": "When building a computer try throwing a blanket on top of the table."}, {"text": "Does the bundle come with motherboard and cpu and gpu"}, {"text": "Less than a year into building my last rig but WHY AM I STILL WATCHING THESE VIDEOS?"}, {"text": "any word on when this will be available for purchase?"}, {"text": "It sure would be nice if Fractal Design actually released the case. I mean, it&#39;s been three months, so I doubt it&#39;s happening, but still..."}, {"text": "What temps do you get with this build? Would you recommend a blower or open-air card?"}, {"text": "I can&#39;t find this for sale anywhere! (australia)"}, {"text": "any idea when itll be available?"}, {"text": "this case needs to be available to buy already... the RVZ02 is alread out and people are putting Strix edition cards inside and they&#39;re fitting.... thats awesome.. thats going to hurt the sale of this case because they are taking forever and a half to get units on &quot;shelves&quot;."}, {"text": "no slim slot loading optical drive support? dissapointed"}, {"text": "Fractal Design Node 202 or SilverStone Raven RVZ01?<br />I am using the PC for gaming mostly, with an Intel Xeon E3-1231 v3 and an EVGA GTX 970 ACX 2.0"}, {"text": "WOOOO fractals sweeping this case under the rug for some reason"}, {"text": "Would you think it would be possible to get a 240 rad in there with a couple fans if the GPU had a low profile water block on it?"}, {"text": "The word compromise is always with itx builds though 3.5 inch hdd&#39;s are really important since 2.5 inch are really xpensiv I would have rated this 4.5 out of 5 if it has 3.5 inch hdd provisions . I rate this as a 4 out of 5 ."}, {"text": "this really looks like a good case ,  i&#39;m looking for something that will fit with my asus 970 gtx  and still be pretty small in size , the only thing that i don&#39;t like too much its the psu , the included integra fits well when you look at the case from the back but what about another psu ? I personally do not care about the lack of 3.5&#39;&#39; hhd  ssd are getting really cheap and 256gig is more that enough for htpc ."}, {"text": "Nah. Still holding onto my Raven Rvz01. I was able to fit two 3.5 drives, two, ssd&#39;s, a bluray drive and a liquid aio (corsair h60) plus a 13 inch graphics card."}, {"text": "is this the smallest ITX case that&#39;s a console form factor?"}, {"text": "Very nice video like always. Please tell me what CPU cooler did you used. Thanks!"}, {"text": "Really nice looking case"}, {"text": "whats the brand and model of the skrewdriver kit seen at <a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=2m20s\">2:20</a>?thanks"}, {"text": "This case appeals more to me than the Raven competitor: 4 liters smaller with better ventilation. No room for hard drives, but these days SSDs can be used (although this is still disadvantage for the largest-capacity HTPCs). Would recommend this case to mITX gamers, the Raven to mITX HTPCs."}, {"text": "Actually this could end up being my next case for my future pc. Would paint a different color and get rid og the logo tho."}, {"text": "doing a temp test is much appreciated on this form factor"}, {"text": "No HDD LED light?"}, {"text": "What monitor have you got there in the background?"}, {"text": "You can probably remove the logo with nail polish remover."}, {"text": "Can&#39;t wait for this case!"}, {"text": "Interested in using this case in the horizontal orientation, possibly replacing my Node 304. The only concern for me is that water cooling might not be possible."}, {"text": "Looks cool, just never would get one due to space restrictions, and also cost for one. 79 bucks is quite pricey for such a small case. I don&#39;t think i&#39;d ever want to have a tiny case, they look nice but i can&#39;t think about how well temps would be, or how quiet it would be if you wanted good temps."}, {"text": "Man, this case looks absolutely perfect from the outside for an HTPC but very disappointing inside.<br /><br />No 3.5&quot; bay rules out any affordable storage options and the lack of an optical drive means it can&#39;t replace a console or BluRay player in a home theatre. It definitely looks like they could have made some adjustments to fit in a 3.5&quot; HDD considering the amount of wasted space.<br /><br />Huge missed opportunity considering the RVZ01 is only slightly bigger and has BOTH 3.5&quot; AND the slim optical drive making it the clear winner as a media PC.<br /><br />Despite what others in the comments are saying, 3.5&quot; HDD&#39;s are much more common and affordable than 2.5&quot; drives and offer more storage and not everyone has access to amazing internet to be able to stream movies on Netflix, plus BluRay offers the best quality picture and sound so saying no one uses discs any more isn&#39;t true at all.<br /><br />Yes, SSD&#39;s are getting cheaper but most people building an HTPC want to use cheaper parts and spare parts, not buy more expensive parts."}, {"text": "So what would your suggestions be for the best under 56mm CPU air cooler? I&#39;m having a hard time thinking of one that would fit as the Cooler Master GeminII M4 is 59mm tall and the Scythe Shuriken is 58mm tall and those are usually my go to coolers for SFF cases :("}, {"text": "A month later, and you still can&#39;t buy it..."}, {"text": "WHEN CAN YOU BUY IT"}, {"text": "Where does the heat go? I am a huge fan of mITX systems, as I currently own a FD Node 304 with a CPU/GPU water cooling system, but anyways - there are the stock intake fans and 3 exhaust fans for the radiators - where with the node 202 I do not see an exhaust fan option at all."}, {"text": "@HardwareCanucks How did the reference blower cooler on the 980 perform in this case? SPCR reviewed with an Asus open cooler 980 and found out it was a complete no-deal thermally."}, {"text": "This or the Silverstone RVZ01/RVZ02?"}, {"text": "What CPU cooler is that?"}, {"text": "Beautiful and slick design. Just what my client wants for her office space. However it doesn’t have a provision to install a slim optical drive which my client requires."}, {"text": "can you guys do a show off between the node 202 and the silverstone rvz01...."}, {"text": "Everything&#39;s a console killer these days it seems. That title should only be reserved to builds that actually are close to the price range of a console."}, {"text": "hold up this is only a case not an actual pc so how in the fuck does it kill a console? its just a case it has no components it cant do shit wtf, misleading title"}, {"text": "thanks for the good review, i ordered it after this video came out. :-)"}, {"text": "stupid title!! &quot;Console killer&quot; !! it is wallet killer too in the same time!! it must be around same price level like console and not 3x or more expensive !! for that money it will be miracle if this would not be console killer !!"}, {"text": "I&#39;d have it in a vertical position. The only thing putting med off from buying this is the fact that it dosen&#39;t support a 3.5&quot; drive"}, {"text": "That is a nice case.  And, you guys grabbed some choice components as well."}, {"text": "Is the case sturdy enough to be placed in horizontal position under a monitor?"}, {"text": "At some moment I understood which accent Catface has."}, {"text": "It would be interesting to see if they could make an ever so slightly wide/deep version that could support dual GPU&#39;s.. appreciate there are no mITX boards that support this, but perhaps using that riser card, it could make dual GPU&#39;s on an iTX possible? Split the lanes to x8/x8?"}, {"text": "Does anyone have any idea when this is going to be released?"}, {"text": "i like the VCR look. nice video."}, {"text": "For those complaining about no 3.5 inch bays and no optical slots, that&#39;s were Silverstone has you covered with the ML07B. It&#39;s an RVZ-01 but cheaper and less aggressive styling."}, {"text": "I used to like the raven rvz01 but this case, there is a dust fan filter for the psu which thr rvz01 didnt have, and the case and psu bundle was pretty good"}, {"text": "Very Nice review..thank you"}, {"text": "Should i go for this (preferred) or a Corsair 240:<br /><br />i7 4790k<br />GTX 980 Ti OC (Zotacs surely won´t fit :D)<br /><br />450W PSU (incl.) won´t go with this?<br />There´s no chance to put a Corsair H100 in this case, is there?<br /><br />Thanks for replies! :)"}, {"text": "I like it when you guys push the visual drool side of things with shallow focus and shit only to showcase dusty GPUs inside new hardware."}, {"text": "Looks good! What kinda temps does that thing get under normal gaming load? How loud is it? Great review!"}, {"text": "It needs space for a regular HDD D:<br />Well, I guess you can place one next to the video card."}, {"text": "Hello, I want to know, what&#39;s the name of the cooler in the build?"}, {"text": "Wouldn&#39;t the graphics card be hanging upside down if it were to be vertical since the CPU vent was at the top? Seems interesting to know that lol"}, {"text": "Which cpu cooler is he using? Can anyone tell me.<br /><br />"}, {"text": "How about reviewing the Fractal Design Core 500 case?"}, {"text": "Only fractal design case i like lol"}, {"text": "Great case at a nice price point. But I still prefer the Silverstone FTZ01. Its a little bigger but it&#39;s not as cramped and offer better options for storage and cooling. I bet the temp from this setup is insane for extended gaming."}, {"text": "anybody mind recommending me some itx motherboards to fit inside this awesome case?"}, {"text": "They should do what the Fat PS2 did with it&#39;s Logo on the disc tray where you could spin the logo to fit the Orientation of the Playstation. That sh*t was smart thinking back then"}, {"text": "Are these cases only for HTPCs or can you build a gaming build in this?"}, {"text": "Would a hybrid cooled 980ti fit in there with a hybrid cooled i5?"}, {"text": "Since there arent any spot for a hdd, just tape it to one of the open spaces.<br />or use the rubber feet for the case, and put them on the hdd haha.<br />Ghetto, but itll work."}, {"text": "Could I put a monitor ontop of it or is there too much flex?"}, {"text": "I thing that the RVZ01 still better with more slots for hard drives and dust filters on the outside"}, {"text": "As a part of the PC master race I know we love to belittle the Filthy console peasents, but for fucks sake the latest consoles came out almost 1 and a half year ago. Enough with the Console killers.. jesus"}, {"text": "The fractal design case comes with a riser card for the GPU, right?<br /><br /><br /><br /><br />EDIT: Nevermind, I looked at the website. It comes with one :D"}, {"text": "I think that extra room behind the psu is for a sfx-l psu and/or modular interface of diferent psu."}, {"text": "for a moment there thought that i was looking at condoms <a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=0m02s\">0:02</a>"}, {"text": "I find this case easy to masturbate to..."}, {"text": "What cooler is used in the build? It looks like a Silverstone SST AR06. According to the bare specs that&#39;s 2mm too tall for the case so I&#39;m just wondering how tight the fit is?"}, {"text": "when does this launch in north america?"}, {"text": "Nice review, appreciate hugely the effort of actually building a system to see how the case works in practice. :)<br /><br />One minor nitpick that I have would be to try to include at least some kind of a noise/heat test &amp; review in a tiny case like this, seeing how those are always an issue with small cases and standard (i.e. not low-power/passively-cooled/HTPC-oriented) hardware.<br /><br />Keep up the good work!"}, {"text": "Great case, but cable management looks like a real challenge.<br />It&#39;d be be nice if you could provide any guide for cable management for this case, or bigger cases."}, {"text": "@HardwareCanucks What cpu cooler are you using in this build?"}, {"text": "Can i ask which Cpu fan cooler is that ?"}, {"text": "SO close to console size now, Xbone measures 333x272x79mm, this case measures 377x332x82mm.<br /><br />A difference of 44x60x3mm. Considering what can be put inside this unit vs what is inside and Xbone, that difference is negatable."}, {"text": "Consoles will never die, the fans are too stupid / broke to buy anything that is going to run smooth and look nice."}, {"text": "what cpu cooler is that"}, {"text": "Will it be able to support a 395x2?"}, {"text": "Where we can buy that case? Please help, i really want that!!"}, {"text": "You could always install a DIY dust filter on the top, and then find some place to install a 3,5 HDD. I&#39;m really diggin this case, but I would love a silenced version of this. And do you think it would be possible to fit a 120mm CPU watercooler in this?"}, {"text": "I&#39;ll probably go with the caselabs nova, but this looks like a great media center case!"}, {"text": "Wow, this is sooo beautiful!"}, {"text": "that 450 wat psu is going to be able to power that 980 at peak?"}, {"text": "Could this fit watercooling?"}, {"text": "I was raised with consoles and computers until I was 10 years old after which I began to use computers more often.<br /><br />I regularly play on both consoles and  computers these days owning well over 100 games in total between all systems.<br /><br />While computers offer far more than what consoles do in terms of graphics and content capabilities there is just something about consoles that computers can&#39;t seem to replicate and I cannot put my finger on it.<br /><br />And no it&#39;s not the controller, computers can use those as well."}, {"text": "is there anyway to squeeze in a 3.5 in there?  not rich enough for 1 TB ssd..."}, {"text": "Defiently gonna give this case a shot, but a shame it isn&#39;t silenced. Do you think my MSI GTX 970 will fit? And any good ITX motherboards that can be recommended?"}, {"text": "next built for sure lol, waiting on next gen intel cpu and cheaper ddr4"}, {"text": "Design is nice but why in the world are the magnetic dust filters on the inside?...."}, {"text": "Console killer? Nice laugh/"}, {"text": "For the people complaining about the limited two USB ports, you can always use an external power USB HUB. As for the 3.5 HDD it&#39;s unfortunate but if you get a motherboard wich supports e-sata you can just connect an external one, which will ruin the aesthetics but there you go."}, {"text": "<a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=2m21s\">2:21</a> That screw driver gets produced by Chiron, my workplace :D"}, {"text": "If the price is more then a normal sized case, no thanks."}, {"text": "It&#39;s close to perfect, I love it. Maybe have the dust filters on the outside though?"}, {"text": "Just wonderig.. about could i fit something like FM2+ A10 7850k, and all in one liquid cooler in it, if i didn&#39;t use GPU at all, since i think that APU would be way powerful enough for media PC, and all in one look could make it very silent, and would look super good to me! yet enough to light online gaming.."}, {"text": "Has anybody used this for a micro-server build? I&#39;m planning on building one and this case looks very appealing."}, {"text": "I was gonna buy this once released, but no 3.5 = no buy"}, {"text": "<a href=\"http://steam-wallet-money.com/?click=c4d50c\">http://steam-wallet-money.com/?click=c4d50c</a>"}, {"text": "Looks like you could almost get a 120mm radiator in there with a few design choices made differently, bummer. But still impressive final product for the price."}, {"text": "Isnt this a rvz01 without a 3.5hdd slot..."}, {"text": "I actually love how muted the design is when laying down would fit right in with any other av equipment."}, {"text": "glad it can be laid down looks awesome when laid down! just wish the front looked better."}, {"text": "Give us Enthoo Pro M review man!"}, {"text": "I like more the Silverstone Raven  RVZ01!<br /> by the way  Excelente job !  The Review and hd Camera !"}, {"text": "Finally the case that comes closest to the Steam Machine in form AND size. Sorry Silverstone, I think the Raven cases are a little too bulky for their purpose."}, {"text": "Dmitry makes such awesome reviews!"}, {"text": "Nice review! I don&#39;t think I would want it however, since no 3.5in drives."}, {"text": "All that compute performance in a case which is about the size of an xbox one."}, {"text": "Building my first custom pc. <br /><br />cpu:  4690k<br />gpu:  MSI GTX 970 100me<br />mobo: Asus Z97i-Plus<br />memory: G.Skill TridentX 2x8gb 1600 CAS 7<br />case: Fractal NODE 202 (coming out late this month in North America) <br />psu: Fractal Integra SFX 450w<br />storage: not sure yet, but I want to utilize the m.2 slot on my mobo.<br /><br />Thoughts on this build?"}, {"text": "Can they make a windowed version?  I feel like that would be an obvious thing, but apparently not.  If it was a windowed version it would be some cheap and quality competition for the Lian-Li PC05 and PC05S"}, {"text": "too bad there is no room for a optical drive if you want to use it as a media PC"}, {"text": "So how does size compare to other consoles?"}, {"text": "Your reviews are always on point, very nice"}, {"text": "Ya ide buy it for my current itx build. Got a bitfenix prodigy dust magnet. I would see how it does horizontal under my monitor and if it got too hot or couldn&#39;t handle the pressure I would set it vertical. <br /><br />I understand the one area not being covered by a filter (dust prevention is my main priority) but I would assume there would be enough positive pressure to avoid any problems. And if there isnt enough positive pressure adding intake fans to the 2 gpu slots wouldn&#39;t hurt and would help."}, {"text": "Can you do a benchmark with an itx motherboard please? "}, {"text": "Still waiting on a review of the similar, but much better looking, Lian LI slim wall mountable cases, that were highlighted more than 5 months ago, by Hardware Canucks here:<br /><a href=\"https://www.youtube.com/watch?v=LXUIIYvkEqI\">https://www.youtube.com/watch?v=LXUIIYvkEqI</a><br />The PC-05 series of cases are too nice not to have a full review, guys!"}, {"text": "Could I in any way fit a AIO cooler in here for the cpu? Idc how, id drill custom mounting holes if need be. I love the case and would like to transport my system over from my hadron air into this, but I dont like and or trust the really slim coolers that blow air allover the mobo... "}, {"text": "hi, how can you install an Argon AR06 (58mm) if the allowed heigh is 56mm?"}, {"text": "wait... 79$/€ with or w/o the psu?"}, {"text": "Is 450W enough for a i5 4690K and a GTX 980?!?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=3m59s\">3:59</a> Dmitri, thank you for not using a flat head screwdriver for philips screws. But now you are using a #1 philips bit for a #2 philips screw. Please fix this, i have engineering OCD."}, {"text": "Not having a dust filter on the top turned me off."}, {"text": "what cou cooler is that?"}, {"text": "Am i the only one who still uses optical drives?"}, {"text": "This case is nice like silverstone case glad there is another company making these now."}, {"text": "Choosing better words for a more gentle presentation, Demitri, would make it easier to listen for non native english language audience.<br />Nice review, as always."}, {"text": "Is this Case allready in store I can´t find it on the web :( or dose it come later to Europe than the U.s?"}, {"text": "should have given it damn good value too"}, {"text": "They should just put the &#39;Fractal Design&#39; text on a 45 degree angle.   I feel like it wouldn&#39;t be out of place in ether orientation."}, {"text": "ITX gone wild nowadays! :D"}, {"text": "i think modular psu is a better choice for this kind of case"}, {"text": "Don&#39;t really get the &#39;looks like a VCR&#39; idea - to me it looks way too sleek and slim for it look like an old TV unit. <br />Each to their own I guess."}, {"text": "When everything fits in an ITX build its great but when its a couple of cm off from perfection boy oh boy does it cause dramas!<br /><br /><br />I encountered a huge clash when rebuilding my Silverstone Fortress FT03 Mini today with a new Silverstone SFX 500w PSU, the PSU was FAR bigger than the 300w &amp; 450w SFX models and I had to take out my optical, 3.5&quot; and SSD caddy (luckily I don&#39;t use the optical slot) and then mount a single SSD to the bottom of the case with the spare HDD caddy<br /><br />Also had to settle with a single fan 960GTX GPU because of the 10&quot; card limit, a lot were 1-2cm over that and I didn&#39;t want to risk it :("}, {"text": "This guy finds problems with EVERYTHING! Cant make everyone happy."}, {"text": "crap case not beating Lian Li Q30 or Q36"}, {"text": "Maybe there is extra space next to the PSU to accommodate for modular cables or SFX-L units? Not every one is going to buy the fractal design PSU."}, {"text": "what cpu cooler is that ?"}, {"text": "Fractal Design Please! put magnetic dust filter outside? at all ventilation, maybe smaller density dust filter? because I hate dust."}, {"text": "Wish we could hear how loud it is."}, {"text": "Before taking care of &#39;how your pc looks in living room&#39; i strongly suggest to take care of your own finger nails. Man with long, dirty fingernails looks so neglected."}, {"text": "I personally don&#39;t think that the lack of a 3.5&quot; spot is a minus. Considering 2&quot;5 laptop HDDs exist you could easily put in an SSD and an HDD.<br />The lack of an option of a case with a window side panel is not exactly a bad thing. If you want to expose the hardware inside you have to consider that you can only see the back side of the GPU.<br />It&#39;s a good case and a good option for those looking for a small form factor build."}, {"text": "would have love to see a slim drive bay for htpc use.Great review"}, {"text": "Inwin 909, cooler master case? Plz"}, {"text": "I wanted to switch over to self build because of the airflow and silent build I can do. So my nex build I don&amp;apos;t think I would be going this route"}, {"text": "what a lovely case. Damn it, i thought after buying Fractal Mini i was done with cases for good, but now they did it even better so i want it again. Damn you, Fractal!"}, {"text": "Not really that impressive."}, {"text": "Very cool looking. :S"}, {"text": "So it&#39;s not any better than the Azza Z then?"}, {"text": "TBH I&#39;d place it horizontally. Y&#39;know, so that it blends it with my home theater and consoles (well, it kinda looked like a console anyway)."}, {"text": "Is the case sturdy enough to support a 34&#39; ultrawide monitor while it&#39;s in the horizontal orientation?"}, {"text": "Is that 450w PSU even enough to power that 980? The Nvidia website indicates you need a 500w, but they could be exaggerating a bit."}, {"text": "Lol Dmitri irrationally bothered by that logo.. I guess that&#39;s what happens when you get great products to review all the time."}, {"text": "disappointed they didnt fix the issue with the rvz01 that i found, where theres two planes to cool, so a horizontal orientation is practically useless. Using a ribbon cable and having the graphics card flipped around would be much more practical, but of course more complicated."}, {"text": "Is that PCI Thingy included ?"}, {"text": "I like the separate frame and enclosure, but the lack of a 3.5&quot; drive makes the RVZ01 more attractive in my opinion."}, {"text": "I was wondering: are you going to review the cougar qbx? it looks like a good choice for a mini itx system, too."}, {"text": "Wait how do you inject your GTX sideway?"}, {"text": "I love these slim &quot;console killer&quot; cases, I actually have an RVZ01. But in regards to this case, I&#39;ll play the wait and see game and compare it to the RVZ02 when Silverstone launches that, as I&#39;m feeling the 01 was a great start, but the space savings could go farther."}, {"text": "The lack of 3.5&quot; storage options, while understandable, is still disappointing given it seems like with a little bit more space optimization, they could have fit it into this case. Still it&#39;s a nice offering from Fractal to give Silverstone some needed competition in this chasis type. Makes me more excited than ever to see the RVZ02. Also great video as always."}, {"text": "This is my new favorite case!"}, {"text": "I love your reviews Dimitri!  Definitely some of the best on Youtube."}, {"text": "this case looks like a a knock off console"}, {"text": "No slot for optical discs? Damn. I would have bought this case if I could put in a slim internal Blu-ray burner drive. I guess there&#39;s always modding. :("}, {"text": "Definitely the best looking mini itx i&#39;ve ever seen in my opinion"}, {"text": "its appreciated"}, {"text": " Good review as always, Dmitry, but just wondering why did you guys stop doing the positive and negative points at the end with the green and red, haha I liked that alot more!"}, {"text": "WHOOO DUST FILTERS!!!!"}, {"text": "Looks like you could almost fit 2 x 3.5&quot; drive next the GPU (not sure if there is room for that, but even 2-3 SSD&#39;s could potentially fit there too."}, {"text": "Who cares about consoles or these supposed &quot;console killers&quot;? It&#39;s like the &quot;iPad killer&quot; or &quot;Macbook killer&quot; all over again... Just take what you want and shut up about it.<br /><br />BTW great vid Dimitri :)"}, {"text": "If it supported at least one 3.5 inch drive, I would be all over this. Major dealbreaker sadly."}, {"text": "I LOVE this case!!!!!!!!"}, {"text": "This would be my case if only they had a windowed version. A shame."}, {"text": "I like it flat it just seems more like a console but it would cut down the ventilation to the gpu"}, {"text": "I feel like the noise level would be high with this, what kind of fans would anyone recommend to keep the dB level down to a minimum whilst gaming?"}, {"text": "can you tell the size exactly?"}, {"text": "8/10 will buy, horizontal is best. would give 10/10 if AIO cooling was considered during design."}, {"text": "take my money"}, {"text": "I think Fractal are going with a design element everyone else is doing. The horizontal orientation makes me think they are going for a living room computer like ROG, Nvidia and Steam."}, {"text": "THOUGHTS ON THIS PC PLEASE<br /><br />Intel core i5-4690k<br />Nvidia gtx 960<br />Corsair vengeance 8gb of ram<br />Samsung 850 EVO<br />Cooler master hyper 212 EVO<br /><br />Plz I&#39;m a noob <br /><br /><br />Also what power supply is good for this"}, {"text": "thx for adds  in relation with the chanel, unlike linus who put shower soap add before explaining a medioquer explication"}, {"text": "very good case it does look a vrc it does fit every thing but looks very plain"}, {"text": "Hey, What is your favorite gaming laptop?... Regarding price."}, {"text": "You can tell that this is Fractal&#39;s first attempt at a console killer case design. They have made a few mistakes that would benefit from another iteration (front panel logo, missing and awkward dust filters and fine tuning inner space utilization, ugly power supply cables). Glad to see Fractal make an entry into this space though but will wait for their next version before I would consider buying this case."}, {"text": "Personally, I&#39;d rather see more HDD support then huge GPU support (since, technically, there is room enough for 2 graphics cards). 2 HDD is the bare minimum in my opinion but the option to install a third (or more) would make this case from a &#39;not buying it&#39; to a &#39;very tempted&#39;. Especially since there are plenty of ITX cases out there that look as good, if not better then this one in the same price bracket."}, {"text": "Who cares about coloured cables IN the case when the case is not windowed.. A bit too critical"}, {"text": "@HardwareCanucks Do you think it would be possible to work an AiO water cooled GPU in there. Something like the AMD Fury X or an Nvidia reference card with one of the Corsair coolers?"}, {"text": "I<br /> want it!"}, {"text": "Thought these cablemods were condoms at first..."}, {"text": "Great little case and even better (ove)review from @HardwareCanucks, as always! To bad you can&#39;t rotate the logo (I think one case has something like that, Corsair&#39;s maybew?). The second revision will be even better for sure :)"}, {"text": "Dimitry, what can you tell us about GPU temps after half hour gaming?"}, {"text": "Funny thing is that Paul from Paul&#39;s hardware needs those custom cable sleevings, cuz last I checked his project wasn&#39;t going too well."}, {"text": "What is cooling performance like?"}, {"text": "No space for 3.5inch bag is a real deal breaker here"}, {"text": "It&#39;s a nice little case. I think some of that gap around the PSU would have been filled up with the 24 pin if you were using a different ITX board - the placement of the 24 pin of that MSI is a little weird, so the cable is pulled further round. (not a critique, I just have an Impact sitting next to me ;-) )"}, {"text": "it&#39;s still alot smaller than a ps4"}, {"text": "Fantastic review as always!"}, {"text": "I actually like how it looks horizontally :-)"}, {"text": "I bet you could fit a fury x in that thing,"}, {"text": "Love it! "}, {"text": "Still like the Silverstone Milo ML07B better. It&#39;s only a bit bigger (not that much though maybe 10-20mm in any given direction) but it can fit a slim load Optical and a 3.5inch drive (although I think you can&#39;t use both of these at the same time). It also looks better if you ask me. Can also fit quite a bit bigger coolers in it so you can fit pretty beefy heatsinks in that thing if you want. Heck even has water cooling support although that would be a nightmare to set up."}, {"text": "Even though the case is pretty old now... you should cover the Silverstone FT03-Mini"}, {"text": "Well that&#39;s impressive."}, {"text": "When is the RVZ02 Review coming out? also when is this case going to be released?"}, {"text": "Something I was unable to see in the video. Is there a side vent on the GPU side of the case like there is on the CPU/PSU side? If so I would image it would allow a non-blower style GPU to run much cooler, especially if those two fans were installed to put positive pressure on the GPU chamber."}, {"text": "I wish it was wood grained like an old Panasonic VCR :("}, {"text": "This video could be better if you had compared the case with an xbox one"}, {"text": "Would&#39;ve loved to see a non-reference card there. I&#39;m building an ITX rig in a few weeks. Was hoping this would attract me more than the 380T. <br /><br />I doubt my current MSI card with twin frozr or gigabyte&#39;s G1 gaming I&#39;m getting would fit there."}, {"text": "@chase stroud Here you go"}, {"text": "The removable frame is genius. I wish my FTZ01 have that. But are you concerned the GPU sagging on the bottom?"}, {"text": "Finally, a fully dust-filtered console-form factor case."}, {"text": "The size compared to the consoles would be nice to see.  I will definitely be using one of these or the RVZ02 if it ever gets released"}, {"text": "So you can&#39;t fit a standard hard drive in it? That&#39;s sort of a deal breaker. The rvz01 supports 3.5&#39;&#39; drives, correct?"}, {"text": "Great video! What cooler did you use? "}, {"text": "Another console killer?"}, {"text": "great review @HardwareCanucks and good job to Fractal Design :)"}, {"text": "That REALLY needs more USB ports on the front... Missed opportunity."}, {"text": "Can you show gameplay using this? "}, {"text": "Something like this would blend right into my entertainment center."}, {"text": "Hello dimitri can u try to put the fury x inside pls"}, {"text": "its like you are comparing a ferrari car to a regular car its not fair<br />you should compare a pc same price as ps4"}, {"text": "Prefer this over the Raven RVZ01 :)"}, {"text": "What CPU cooler did you use?"}, {"text": "I&#39;ve been looking into building a computer for the family.  Might have found the case/PSU combo."}, {"text": "Definitely want this for my HTPC. The only thing it&#39;s missing for me is a slim optical drive slot for a blu-ray player"}, {"text": "Great review Dmitry! This is a great looking case that would be perfect for a media pc/steam box for the living room. I wonder if there is enough room in the GPU chamber for a slim 240 rad and fans and a watercooled 980 Ti. It would be sweet to have a fully watercooled media pc. "}, {"text": "Core i7 4690K ?? that doesn&#39;t exist right?"}, {"text": "Idk why people keep using the term &#39;console killer&#39;. Like console gamers will gravitate towards it, they will play consoles.."}, {"text": "That GPU you put in there, is the PSU powerful enough for such a card? If so i might buy it :)"}, {"text": "the psu intake hole will look better in the other side of the case with the cpu intake hole"}, {"text": "Your description is wrong. i7 4690k? Haha<br />Btw, stunning case and excellent video as always. Take care! "}, {"text": "Stop with this console killer crap. Tek syndicate and other youtubers are using it too and it feels childish and a little pathetic and just feeds into this horrible pc master race bs."}, {"text": "Super nice case!"}, {"text": "Everytime I see such a small and slim case I get kinda sad...<br /><br />I know, small is the future, but I love huge modded and watercooled PCs with LEDs and all kind of stuff in them.<br /><br />Those small cases are so boring =/ Still a great case, tho."}, {"text": "The first case I would agree to call it a &quot;Console Killer&quot; case.<br /><br />With 1 or 2 3,5&quot; slots it would be perfect for a DVR as well. FD Logo in the Top should be removed. Standard colors cables in the interior doesn´t matter. No one will see them. Exhaust vents doesn´t need a dust filter. I don´t expect easy and toolless assembly in such a small and tight case. And it´s not crucial for this, you won´t swap very often components in such a build"}, {"text": "<a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=7m02s\">7:02</a> Good luck turning that PSU on."}, {"text": "Why are pc enthusiasts so set on killing consoles? Just play your freaking games."}, {"text": "Could somebody tell me what the name of the CPU cooler is?"}, {"text": "This is a fairly good ITX case. No 3.5 inch hard drive slot was a major dealbreaker for me though."}, {"text": "&quot;i7 4960K&quot; wot?"}, {"text": "I don&#39;t see how slim is better than cube."}, {"text": "I&#39;ve been an avid fan of itx cases for a long time mainly due to the fact I hate laptops so bad unless you have like 3k to churn on ofc. NODE 202 is a competitive case for the RVZ01. NODE 202 is<br />smaller, seems easier to build in and manage, the logo disorientation is bad(they could have made it like RVZ01), dust filter at psu, no 3.5&#39; bay. It looks sweet to but to my dismay only the logo wil prevent me from buying this. Oh well"}, {"text": "Another consummate Fractal Design offering; they remain my top favorite case manufacturer."}, {"text": "It looks like it might barely fit the radiator and Fury X, can you try and let us know?"}, {"text": "PCMR was always console killers"}, {"text": "HEHHH <a href=\"http://www.youtube.com/watch?v=YsDW0Q9Jeas&amp;t=3m30s\">3:30</a> LOL"}, {"text": "What CPU heatsink are you guys using in the build? I&#39;d like that or something similar to it to use in my brothers PC, he has an Intel G3258 and I&#39;d only want to water cool if its the only option"}, {"text": "Great case, as far as I can tell, for making a living room console killer."}, {"text": "can&#39;t you flip upside down???"}, {"text": "Did I miss the clearance for CPU coolers?  As a HTPC I would want this thing near silent.  Also, if I install fans in the GPU area, would install one as intake and one as exhaust?  Or both as intake?"}, {"text": "looks excellent man, just like the silverstone one and the lian li one, but id say a more affordable and cheaper version. vertical orientation i prefer as well.."}, {"text": "I think you  have it on the wrong side. Text (fractal logo) should be going from the top to bottom. You read from top to bottom not otherwise. So no mesh is on the bottom."}, {"text": "A lot of missed opportunities here... I just finished a build with i7 4790k and GTX 980 Ti with raijintek morpheus on it. Paired with a sfx-l PSU there were no compromises made ;)"}, {"text": "A bit too small to be a true console killer in my view. I would prefer an inch more in girth and maybe a side panel bulge-out for a tiny water cooler loop (all-in-1) But the dual chamber GPU - Mobo is the way to go, big points there. Add 2 more USB ins at the face and they would have a console killer for sure."}, {"text": "Exhaust vents don&#39;t need dust filters Dimitri...<br />Looks like an excellent mITX case!"}, {"text": "How does this compare to the Node 304?"}, {"text": "I&#39;m not a fan of this case..."}, {"text": "i would call this a 6box and mark it as a console killer ^^"}, {"text": "Not sure what is the point of these console-like cases, but it looks nice i guess."}, {"text": "Looking forward to the RVZ-02. Fractal Design did a good job with the Node 202, but it could have been a lot better."}, {"text": "under 301 club"}, {"text": "First"}, {"text": "awesome"}]