[{"text": "total useless video, you are comparing different machines with different softwares. Why don&#39;t you use the same premiere for all and then post results? I already know how much Apple would loose"}, {"text": "Hello everyone, I am new to the Apple community. Well not yet. I am considering getting the new 2019 CTO Apple MacBook Pro 13,3&quot; Touch Bar / 1,4GHz / 16GB / 256GB. I am creating videos and i would like to know your opinion, wether this particular set is good enough. Thank you so much for your feed back. Best, Krystof."}, {"text": "jump to <a href=\"https://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=03m30s\">03:30</a> for results"}, {"text": "a tight deadline schedule are the reason which one you should pick !...... for me personaly ill go for AP (pc) since im not only do working on my working station .S"}, {"text": "Wth...You are comparing video editing softwares in this video not the PCs!"}, {"text": "Alguém do BR aí que pode me dizer qual seria melhor para edição de vídeo ? <br />MacBook ou pc tradicional ?<br />A legenda tá em inglês tbm não entendi foi nada. <br />Grato🙏🏻"}, {"text": "The reason why we even are here is is the macs price"}, {"text": "Why pc look just so uglyyyyyy"}, {"text": "Can anyone tell me what year model is his macbook pro?"}, {"text": "Always mac"}, {"text": "The conclusion is that if you think macs are bad, you just don’t need one. I thought macs were shit coming into this video, but basically<br /><br /><br />PCs are better in every way except video editing... For now"}, {"text": "MAC BOOK PRO OR I MAC! I NEED HELO"}, {"text": "Windows forever ❤️"}, {"text": "So at the end <br />Which one is better <br />Apple Or Pc"}, {"text": "Yes bc your 970 card sucks and does not have enough cuda cores.  My older 780 gtx has more cuda core than the 970"}, {"text": "And what is the name software is in this video"}, {"text": "Is all software is included on macbook pro or we can download full version free"}, {"text": "What are a good company to buy a pre-build system for video editing that also looks good? I was looking online and most of them looks really bad I want to make the switch from Mac to PC but I would like a good a good performance and looking machine to have in our offices."}, {"text": "300 dollars for final cut add am I missing something"}, {"text": "im gonna use finalcut in he future..."}, {"text": "You look like Chris Pratt. 😮😮"}, {"text": "the problem is i never use final cut for editing.i only use ae and pr,final cut is only for mac."}, {"text": "My Macbook Pro Retina 15 mid 2015 lives in hhell when multitasking or rendering... fans go 6200rpm and it&#39;s brand new"}, {"text": "Premiere needs to take note from fcpx. I love premiere and prefer it over fcpx (even though I’m an “isheep”) but fcpx is just so much smoother and easier to edit in."}, {"text": "Hey, what&#39;s the video recorder you use? Thanks!;)"}, {"text": "OSX is a superior operating system, though, and the firmware-level utilities associated with Macs make troubleshooting and other tasks FAR simpler to deal with. If I were given a powerful Windows PC for video-editing, I&#39;d use it only for that. I&#39;d do everything else on a Mac."}, {"text": "Linus is an idiot<br />Final cut burn those guys easy, fuck stop hating Apple if you don&#39;t have money lend some."}, {"text": "Shit... I was sold on Abobe and Mac... now I got some rethinking to do. Thanks for great informative video."}, {"text": "i know this video is like 2 years old but i love my macbook and i love my msi pc so i cant really argue which one i like more but i have to say the macbook pro is much more optimized when it comes to all around performance and my msi just cant compete with it when it comes to just doing normal tasks however when it comes to pure performance my msi will smoke my mbp ."}, {"text": "Mac book kick the Ass"}, {"text": "It is not a fair comparison at all. The mac is much newer and much more expensive. I own both 2017 Macbook Pro and that same laptop from late 2013 and despite 4 years difference and a pricetag which is about 60-70% of the mac, the PC renders faster in most cases, because of the 970M CUDA."}, {"text": "I use both Windows and Mac, both are great imo, ROG Zephyrus for gaming, Macbook Pro for study sessions and editing.<br /><br />Love them both so damn much, Windows and Mac can coexist, and they do compliment each other well."}, {"text": "My only gripe is; Can you do everything you can with the suite of Premiere Pro + After Effects, in Final Cut Pro X alone. I have a MacBook Pro (2017) and I agree the render times and playback are quicker in Final Cut, but I just feel much more limited than in the Adobe suites.  Any feedback?"}, {"text": "bruh"}, {"text": "can you do mac vs windows in a macbook ?"}, {"text": "Now... what i have to do is...that work so much hard for getting Mac pro 17..."}, {"text": "Is this a martenitza on your hand?"}, {"text": "Defenition of PC is a personal computer. Then shouldn&#39;t a mac bought for personal usage make it a PC?"}, {"text": "Even if I decided to go Mac I wouldn&#39;t edit on Final Cut X because it isn&#39;t a professional grade editing software, so this comparison is meaningless.<br /><br />This big difference is probably about something like CPU vs GPU rendering, which depends on things like codec. Resolve is faster than Premiere in rendering too but I use Resolve only for grading and ingest because, just like Final Cut X, it&#39;s not a professional grade editing software (Unlike FCP7)."}, {"text": "Hmm"}, {"text": "So essentially what you&#39;re saying is that, regardless of platform, Adobe Premiere Pro is a massive resource hog compared to Final Cut Pro? Imagine if Apple made Final Cut Pro available on Windows! Or is this a case for a Hackintosh?"}, {"text": "I am also a mac user and very happy with the timing for video editing with this mac. Its a very nice and detailed video. Thanks a lot man."}, {"text": "I don&#39;t disagree with anything you said; however, there are some issues that you have not touched upon. The file management on the Mac running FCX can be problematic, if like me, you have long, large projects. Rendering samples that you sited are very short. MacBook Pros, iMacs and the new iMac Pro thermal throttle and slow down on longer renders. I have been a Mac guy for the last 15 years but this weekend I picked up a new PC for video editing. It is a 8700K, 1080ti build. The Mac is great, especially with FCX but I prefer to use PP and Resolve to edit and colour grade. My projects typically involve three or four cameras and between 1.5 and 4 hours of performance. I can do this on my MBP, which I have been doing for the past 5 years but I think the new windows machine will make it faster and easier."}, {"text": "Could you make a video on converting your workstation into a hackintosh and see if it has better results using FCP ?"}, {"text": "No doubt FC is optimized to work the best.  SMH, I still prefer to work with pc Premier and Vegas pro"}, {"text": "Depends on a pc because there are weak pc and strong pc but macs are always strong"}, {"text": "Mac is an amazing company...<br />When it comes to marketing at least."}, {"text": "MAC is PC"}, {"text": "PC is best"}, {"text": "ant man guy"}, {"text": "This is where I&#39;m at, comfortable with premiere but it&#39;s slow completed to final cut"}, {"text": "Many YouTubers make this video that was inspired by Linus"}, {"text": "Have a Mac Mini render time is crap-----solution----Get a PC apple fanboys"}, {"text": "What&#39;s the cabinet brand actually ? I often see this on AMD&#39;S Threadripper setup videos?"}, {"text": "I love my hackintosh for video editing and music but also love the windows side for gaming"}, {"text": "Final Cut Pro: 300$ + no additional charges + crap load of optimization<br /><br />Premire Pro: 30$/Month + almost no optimization<br /><br />Apple does what WinDon&#39;t"}, {"text": "Adobe responsible that."}, {"text": "Xeon faster.  ."}, {"text": "man , u are like guardian of galaxy actor"}, {"text": "how does final cut run on a hacintosh with the same specs as your laptop or workstation?"}, {"text": "A mac is a PC"}, {"text": "awesome video, are you still using the Mac about a year later? I cant come to terms with using premier pro and paying that much over the years for a few extra features over premier elements"}, {"text": "FCP is fast no doubt but premiere is still industry Hollywood standard. Why? Because speed isn&#39;t everything. The creative cloud suite has a lot more cohesion with each other and after effects and premiere pro may be slower but they have far more options than FCP."}, {"text": "Good Video, but if I wanted to Use Premiere and Avid Media Composer in Mac?<br />Would it be slower? Should I use Windows if I wanna use Premiere and Avid?"}, {"text": "its just such a ballache switching over to final cut now i have got used to premiere pro. Recently got a macbook pro, and even though it is fantastic, I am dreading learning final cut. It&#39;s gonna have to be done though because premiere pro is so buggy and prone to crashing."}, {"text": "Just bought a MacBook Pro. Switched from a $5000 PC workstation. MacBook blows the PC out of the water. Optimization. Hardware and software interplay, baby."}, {"text": "what have you use to edit this video? what type of camera, program and computer? .... excuse but I&#39;m a begginer :)"}, {"text": "Seems like Adobe needs to add rendering in the background right now."}, {"text": "So clean looking! Are you adding screens in post?"}, {"text": "Videos like this are what make Youtube an amazing gift to humans."}, {"text": "Unfair video. PC is using standard SSD whereas the Mac is using PCIe SSD. In case you were unaware; they have up to 6x the read and 4x the write speeds."}, {"text": "I could see the argument for more basic editing and cutting. But as a person who does vfx work for fun I don&#39;t see the benefits of final cut pro compared to after effects simply because it does not offer as many advanced effects/plugins like VideoCopilot. Especially when you pair things like Cinema4D and Houdini along side your workflow a mac would not be able to compare as well as a PC just price per performance. Yes a mac with final cut would be great for editing a wide variety of videos but when it comes to advanced visual effect work the clear option for me is a PC."}, {"text": "Do people not realize personal preferences<br /><br /><br /><br /><br />Just by both of you can&#39;t figure it out"}, {"text": "New sub to you channel, how I Would like to have that PC aaaaaaaaaah chocl"}, {"text": "Good video. Their tool, it’s personal preference whether you choose a Mac or PC."}, {"text": "Hi Everyone. I&#39;m going to buy a laptop for Davinci Resolve. I&#39;am confused. Is 1980×1080 screen resolution enough for this software? I have some option; macbook pro 13&quot; non touchbar, Dell xps 15 full hd. I&#39;m in torn beetwen these. Macbook pro has higher display resolution but Dell is 15&quot;. Because i saw that some people write 13&quot; is not fix for Davinci. Is it true? Because if is not true i am going to Dell xps 13. Please help me:) Or Is IMac 21&quot; 4K better solution?"}, {"text": "Great video man. Very neat. What are the specs of your workstation. I think i missed that part"}, {"text": "I cannot stand editing videos on my PC laptop (Davinci, Hit Film Express).  NvidiaGE card, I7 gen7 quad 2.9Ghz processor, 16GB RAM and can&#39;t scrub without sounding like a broken record.  I tried FinalCut Pro on an older iMac and it&#39;s so intuitive and smooth.  I&#39;m buying an iMac in the near future.... I&#39;m done."}, {"text": "Final Cut vs. Adobe Premier    fixed the title"}, {"text": "Mac and apple r the best"}, {"text": "WTF are the hands doing in camera....youtubie anyone?"}, {"text": "Put the MacBook os and software on your workstation pc for a true test."}, {"text": "just wondering, why didn&#39;t you start some of your graphs off at 0 seconds?"}, {"text": "A laptop for video editing? Really?"}, {"text": "I had almost lost the desire to put me into windows again and was glad for the mac system as it is reasonably simple and work for most of the time. But since I&#39;m probably going to try games also like xplane 11 I went on windows again again, I think I&#39;ll try the ramdisk vs ssd for rendering, maybe faster or not ,one must of course also copy the file to the ssd in the end."}, {"text": "Note: He used .mov files (apples codec)"}, {"text": "Perfect vid im looking for a work station right now and looking more at Apple"}, {"text": "What do you think about a maxed out Hackintosh. Wouldnt be that the perfect solution. Powerful hardware with good software like final cut pro and a lower price than regular Apple products"}, {"text": "So the bottom line is Adobe sucks?"}, {"text": "pc!!"}, {"text": "Whats the apps name?"}, {"text": "can anybody give me some tips on buying a used macbook? i would love to get a new one but theyre too expensive, im looking for something 2013+ because i want retina display, any problems to look for in used macbooks? thanks guys!"}, {"text": "Just imagine what the 5k iMac Pro can do with render times"}, {"text": "What codec and format was the footage in?"}, {"text": "Very impressive, though Apple&#39;s software is pretty damn optimized since they control both the software and hardware. I wonder how these programs would perform on a &#39;hackintosh&#39;. Anyway great video!"}, {"text": "The result = final cut pro is faster then adobe premiere for simply editing, not mac vs pc, title wrong...<br /><br />mac vs pc is adobe premiere only, mac lost so much."}, {"text": "so a mac is just a pc with different OS. funny shit."}, {"text": "Zoom to <a href=\"https://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=3m06s\">3:06</a> to skip introduction and get to the point;)"}, {"text": "It says <a href=\"http://www.youtube.com/results?search_query=%23HATERSGONNAHATE\">#HATERSGONNAHATE</a> your welcome."}, {"text": "you should have tested the 4k quality of each video considering that rendering speed may affect its quality.."}, {"text": "What about &quot;Sony Vegas&quot; for pc? How long is the render time on that?"}, {"text": "this is really just premiere vs final cut. this sets a false narrative against pc since final cut has faster rendering times. (i didnt watch the whole vid yet just the first 30, but still)"}, {"text": "Мак ос мак ос я подписался на канал и поставил лайк подпишитесь на мой канал Кирилл топчий"}, {"text": "Lol, you can just press on sequence and press render in to out :P"}, {"text": "- HACKINTOSH"}, {"text": "so all that super duper upgrades performance power and parts on Windows still can&#39;t beat just an ordinary MacBook PRO haha<br />more powerful don&#39;t always mean faster.<br />Windows for Gaming fair enough<br />Mac for WorkFlow like photo and Video editing"}, {"text": "1000 DOLLARS?!?!?!?!?"}, {"text": "You just bought a MacBook Pro Retina 15 cuz you where wondering how final cut Pro would perform. And I spent 2 years saving up money for an used MacBook 13 Retina ... 😑 WHY tho"}, {"text": "Adobe is slow as dirt... its not the hardware..."}, {"text": "Would rather use Premiere with a longer render time for a better output.<br /><br />I&#39;ve used Resolve, Premiere, final cut, and a lot of the cheap programs (Movie maker, Camtasia, iMovie) and premiere easily, hands down, is the best."}, {"text": "Windows absolutely sucks for doing any kind of work. You get your shit done with a Mac, you play your games with a PC....That is all."}, {"text": "What video editor did you use for this video?"}, {"text": "Buy Powerdirector It will transform the preview while editing in lower resolution so you can edit 4k without any lag. It also renders quite fast. I edited some 4k footage in Powerdirector on laptop with Intel integrated graphics, sure it wasn&#39;t as pleasent than on high end workstation but it was possible and not tiring. <br /><br />Thanks to try this program out, it is really good :)"}, {"text": "same false shit , you dumb ..... i thought russian were smart , maybe living in the US dropped the IQ , what matter is the SSD , that is all , a mac will have a PCIe nvme ssd which is 5x faster than a shitty TLC ssd you got on your windows PC."}, {"text": "but there is one thing , nvme ssd on the fucking mac is 10x faster than the shitty sata 3 ssd on your &#39;&#39; maxed out pc &#39;&#39; , and that is the most thing that matter , not only the cpu or gpu or optimization , the SSD is all that matter.<br /><br />two type of ssd , MLC and TLC , MLC is much better , and there is againg two type sata 3 and NVMe SSD , and the NVME SSD is way to fast than the sata 3 , so why the hell are you comparing : <br />MLC NVMe SSD with polaris in the mac with the shitty TLC sata 3 SSD in your shitty machine , that is the huge difference you are seeing. <br /> <br /> i challenge anyone to put a mac against the same price pc , with a normal graphics card but with samsung NVMe SSD 961 MLC with polaris driver , the mac will be eated and you will end up with a really good gaming laptop in the windows side."}, {"text": "did you have the i7 in the MBP?"}, {"text": "if my computer got 20 minutes for rendering i wouldn&#39;t be complaining"}, {"text": "insightful video, thank you. I hope adobe will watch it and get us out of our miseries."}, {"text": "This is why Paper specs are not very important in Apple computers."}, {"text": "What&#39;s wrong with your workstation"}, {"text": "Nice little summary. I completely agree. While I&#39;ve always been a Windows user (many years ago I actually almost despised Apple products) I gotta say intergration and seamless cohesion is were Apple wins hands down. After all, the end product (ie - the usability of a system) is what&#39;s paramount, not necessarily in how it gets that done (what&#39;s &quot;under the hood&quot;)<br />My desktop if completely &quot;underwater&quot; with everything being stabily liquid cooled &quot;1560&quot; worth of 140mm fans/rad), extreme series processor, x99 (EI5 mono - can&#39;t wait for EI6/x299), GTX1080, Raid 0 SSDs, yet this setup is still somehow trounced by my MacBook Pro in many senarios (as you mentioned). Apple, it&#39;s hardware, software (Unix) just work. Windows sometimes just seems to fall apart on it&#39;s own even with never changing a single setting. <br />I&#39;ll always be a Windows user for it&#39;s modularity and customizabibilty (hardware and software), (maybe that&#39;s part of the problem, too many variables for hardware/software vendors, some of which may never of been meant for each other), but will always admire Apple for it&#39;s polished &quot;fit and finish&quot;."}, {"text": "which one is best for after effects"}, {"text": "Those are more consumer gamer parts than workstation. A video editing workstation would more likely have a Xeon and a Quadro Card than a 6700k and 980ti. But thanks for the comparison nonetheless."}, {"text": "What camera do they use"}, {"text": "ALAAAAA ME NO WATCH FULL VIDEO! ME WANT TO FIGHT!"}, {"text": "adobe is shit really..."}, {"text": "come on, grow up people both are good for their intended purposes."}, {"text": "Final Cut is awesome!!! I use it"}, {"text": "omg, fcx uses quick sink, premiere does not, you should try out edius 6.5 and later on a pc and see the results, FCX just uses quick sink of intel cpus, search for how to enable quick sink for edius and do another battle between pc and mac lol<br />now if you really wana see you macs performance use the same software, adobe in mac lol"}, {"text": "Imagine what apple could do with a optimized Photo editing software like &quot;Adobe Lightroom&quot; in terms of performance.<br />Lightroom is so slow."}, {"text": "mizepro  usb c hub for mac and win"}, {"text": "Mate, can you do a video on audio editing comparison with logic pro and nuendo or pro tools or another pc daw? thanks great video"}, {"text": "oh snap its starlord lol I mean chris Pratt =) awesome video man , do you know what&#39;s the best towers from Mac that can work with 6k footage ?"}, {"text": "I get the point but this review would have made more sense if you only reviewed adobe products for both laptops and like you said final cut is optimized soley for mac so of course it will outperform even a powerful workstation because windows doesn&#39;t have optimized video editing software on that level, well if we ignore the ever buttery smooth WINDOWS MOVIE MAKER."}, {"text": "Macs will last u way longer than pc&#39;s .❕me i have both"}, {"text": "Everyone comment if you are on the Mac side🏴"}, {"text": "isn&#39;t this obvious"}, {"text": "I&#39;m really decided to have an Air =O"}, {"text": "Does it mater if it renders for 5 min or 2 min. Overall Use what you enjoy using."}, {"text": "Hello, thanks for sharing. What camera are you using?"}, {"text": "in adobe premiere i use ingest on 4k raw - using proxies gives you the scrub performance you&#39;re talking about in FCP - rendering is still slower - it&#39;s like the holy grail of editing - finding the right processor/gpu combo as well as pcie ssds - thinking about FCP on my 2012 mbp in the field and rebuilding my pc workstation to work with adobe cc - it&#39;s enough to give you a migraine - then i have some coffee and i&#39;m fine again 😉"}, {"text": "insightful please"}, {"text": "jeez if i could buy that macbook for the $1000 its worth this would be a very interesting"}, {"text": "Why are you so white?!!"}, {"text": "Don&#39;t you know where are 60 seconds in a minute, not a hundred? <a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=4m42s\">4:42</a>"}, {"text": "As a video creator, this video is what I&#39;ve been wanting to know for so long! Do I spend my money on a new £900 PC build or do I spend £1,000 to £1,400 on a used 2015 MacBook Pro? :("}, {"text": "Man !! So a good work !! One OF the best video about editing video"}, {"text": "Imagine how fast it would be, if you put MAC OS on your work station PC? Use final cut on that, it would be interesting to see actually how quick it would be..."}, {"text": "I just sold My MacBook Pro a few month ago...this sucks really!! But great comparison Video by the way!! Now I have to buy a new one But which should I buy? I really want to have Windows as My OS But I want to be able to edit nice Videos in Future. Can you please help me?Thanks and Greetings from Austria."}, {"text": "For lazy people:<br /><b>Adobe Premier Pro</b> on MAC and PC performs the same<br />However,  due to <i>Apple optimizations</i> , <b>Final Cut Pro</b> on MAC is faster than <b>Adobe Premier Pro</b> on Mac and PC"}, {"text": "It&#39;s no accident that most of the professional videomakers and little videoproduction businesses only use Macs as editing stations. And i have to admit that i&#39;ve been a PC guy most of my life but now I can clearly see the benefits of FCPX, it&#39;s OP and it&#39;s fast !"}, {"text": "what kinda trash workstation u using. litterally no comparison between my pc workstation and a macbook pro lmao. start getting into after effects or cinema 4D and watch ur laptop die"}, {"text": "I&#39;m pretty shocked with the optimization on the Mac. That being said, I guess I don&#39;t care that much.<br /><br />And with all the Ryzen 5 reviews today, I have to admit I&#39;m just sick of people using &quot;renders&quot; as the only way to tell us if a processor (or whatever else) is good for editing. Thanks for dealing with the issue of scrubbing and playing back through your footy. That&#39;s what matters most. As I&#39;ve said about 6 times today already, render doesn&#39;t matter, because I can easily leave a room for 20 minutes if I need to and find something new to occupy my time."}, {"text": "Can u guys sub to me to day is my bday and it would really make my day thx and 👋🏽 byeeeee 🤗😘"}, {"text": "When you&#39;re working like 15 hours on a video, why do you want 8 minute rendering time?"}, {"text": "£4000 gets you a six core cpu, 16gb ram and 6gb video card as a Mac. While you could get an eight or ten core Xeon/i7 setup with 64gb ram and dual Titans for the same price in PC form. The latter would have the former for breakfast no matter what program you run..."}, {"text": "So what you seem to being saying, without actually saying it, is that Final cut Pro is faster than Adobe Premiere?"}, {"text": "Mac is better than live movie maker"}, {"text": "Hackintosh (troll song playing)"}, {"text": "And there you are.   Mac wins.    Again."}, {"text": "Can you do a comparison using just after effects?"}, {"text": "You like Danny Rand from Netflix&#39;s Iron Fist"}, {"text": "You look like Iron Fist from the Netflix series"}, {"text": "My craptop gets 6 seconds per frame on microsoft word"}, {"text": "I wanna buy a laoptop for making music but i dont which laptop is good for music. im gonna buy a used one from online nd  my budget is arround $200-300<br />i dont know wht to buy, so could u suggest me some reasonable for a beginner?"}, {"text": "is the windows workstation using Intel Quick sync? probably you should enable using both the discrete and integrated graphics processors in the bios, and check again your results using premiere with quick sync (if that&#39;s even possible)"}, {"text": "I think at this point people feel it&#39;s PC for gaming and Mac for everything else."}, {"text": "hey I want to ask your opinion, what do you prefer for mobile workstation if you have to choose between 15-inch macbook pro with AMD Radeon R9 M370X graphic or asus rog gl502vs with nvidia 1070. I usually used it for video editing (documentary project etc)"}, {"text": "IMPRESSIVE results..<br />I have a average to top end pc and use powerdiretor 14 for editting... the worst thing i can see in this setup is the real time scrolling of the timeline... sometimes i fell some &quot;gagging&quot; and droped frames during the scrolling, no matter what i do, i can&#39;t fix it... in your video i see that you used a much less powerfull MAC than PC, and it showed very good results...<br />Considering to buy a Mac...<br />Thanks for the video!"}, {"text": "you do not have a &quot;Workstation&quot;"}, {"text": "Wait pewdiepie has a fucking brother"}, {"text": "what is benefit of the final cut over the premier or vegas ? some body explain for me ? thanks :)"}, {"text": "when you import to final cut most of the time it will automatically create proxy for you you media, this part takes time. You can do this in premiere as well and get much better play back. If you choose to export using proxies you will get faster render times, but you will suffer a lose in quality. If you&#39;ve got the time, export using the full res media, especially if you&#39;re adding effects and color correction."}, {"text": "I would like a mac but even the cheapest are not hardware per dollar worth it"}, {"text": "Sony Vegas vs iMovie"}, {"text": "suck my 2 crutons"}, {"text": "WHEN APPLE DISCONTINUED THE REAL MAC PRO WORKSTATION THEY HANDED THE PRO AV MARKET LIKE MOVIE AND PRO AUDIO PRODUCTION TO WINDOWS AND THAT SUX"}, {"text": "PROBLEM IS A REAL WORKSTATION LIKE THE HP Z 840 WOULD KILL THEM BOTH"}, {"text": "If you don&#39;t use final cut go for a custom windows pc. Final cut is the only reason to go mac."}, {"text": "Very cool and interesting times. Optimization is everything for video... especially when Apple puts out 3 Macs a year, vs 1 Million PC variations per year. Hard for Adobe to optimize for such a wide variance of cpus, gpus, and builds."}, {"text": "He kinda looks like Chris Pratt."}, {"text": "can someone help me out i still dont know which one to get"}, {"text": "Really? I saw various tests of &quot;mac&quot; vs PC in wich PCs swipe out &quot;macs&quot; in Premiere in every test and even in photography.<br /><br />Macs only won with FCP wich is a &quot;mac&quot; only progeramme, i would like to see how a hackintosh can swipe out &quot;macs&quot; with FCP installed on it.<br /><br />crApple just makes nonsense toys for retarded kids."}, {"text": "I&#39;m considering investing on a mac book pro, not really ready to dump a crap load of money into one though lol"}, {"text": "I would be interested to see what benefits a Mac would have using Magic Bullet suite over using PC. I am on a PC (2 years old now) and using Colorista slows things down alot."}, {"text": "The question is do you have a pcie ssd installed on either of your pcs because that is one of the main factors that make Macs faster."}, {"text": "Why does this guy have a plant on top of his expensive PC, thats kind of retarded."}, {"text": "Looks like you&#39;re wearing a hair system haha"}, {"text": "so should i sell my custom pc. i7 4790k , gtx 1070, 32gb ram for a Macbook Pro  13 (Not the one which touchbar, cost too much)?"}, {"text": "You stick a workstation grade GPU into any computer (assuming it&#39;s compatible) Video editing will always be fun."}, {"text": "I&#39;m so bored with this BS. Apple phone, computer, watch, bla, bla, bla. Yes, sometimes are better, but for some it doesn&#39;t justify the difference in price. But Apple whores still buy them. Shut up and take my money !"}, {"text": "Is it supporting h265 codec?"}, {"text": "But the optimization isnt worth the price increase in price just hackintosh"}, {"text": "thats why i changed  to mac   <br />i have a macbook pro and i also run final cut pro x and i love it <br />don&#39;t think i will ever go back to pc <br /> GO Mac"}, {"text": "You didnt mention if windows laptop is using an SSD or not"}, {"text": "It&#39;s for people who do productive stuffs in big company. For me i prefer custom pc and do everything with better cooling. not only, i have macbook pro 15 2012 which is mid 2012 non retina until now no issue"}, {"text": "Nice hair mate 👍🏼"}, {"text": "Which camera do you use to record tutorial? Great video quality"}, {"text": "Hi HardwareCanucks!<br />If you want to learn FCPX please watch this from Thomas Grove Carter:<br /><a href=\"https://vimeo.com/194855528\">https://vimeo.com/194855528</a><br /><a href=\"https://vimeo.com/158641571\">https://vimeo.com/158641571</a>"}, {"text": "I need to buy a new laptop for video editing, there is so much comments about &quot;pc rulz&quot; or &quot;mac is better&quot;. What do you recommend to me?, I&#39;ll do a lot of video editing and rendering this year. Thanks for the help! :D"}, {"text": "I prefer windows since I like to game too...but wow this surprised me a lot. There&#39;s some serious code optimizations going on with Apple nice job"}, {"text": "like bruce lee sais. &quot;i do not fear the man who knows a 1000 kicks. but the man who has practiced 1 kick 1000 times&quot;. pc may have many configurable properties and able to upgrade everything.  but apple is one system that has been optimized many times 🙏🙏"}, {"text": "Also do a graphic designing/Photoshop+AI+Corel comparison"}, {"text": "Where did you buy the cover for you MBP ? I really like it !"}, {"text": "I&#39;ve edited 4k on a phone with power director on the Samsung Galaxy s7 and works amazing"}, {"text": "You make me change the way to edit videos.  The Mac is really amazing to do that!"}, {"text": "So really this is not PC vs Mac but Final Cut vs Premeire?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=5m34s\">5:34</a> - couldn&#39;t have been said any better. Best unbiased words that could be said between mac and pc in the content creation environment."}, {"text": "if i&#39;m thinking about starting youtube and editing off my gaming pc what is the best editing software..."}, {"text": "Imagine if Premiere was even more optimized with Macs for exporting 4k footage! Macs would become &quot;Pro&quot; machines again, and not just iSheep bait. I wanna get a Mac for music production but it&#39;s so damn expensive and the new MBP is rather gimmicky."}, {"text": "So what you&#39;re actually saying is that Adobe Premiere just sucks?<br />Time to find another editing program."}, {"text": "Very accurate comparison without a bias. FCPX has improved so much over the years and Adobe is struggling with new bugs everyday. But I&#39;&#39;m still comfortable with Adobe..bad habit."}, {"text": "mac shit pro its a ridicolous  underrated laptop only good for dummies rich boys that want to be cool....maco book pro is everything but pro"}, {"text": "too bad you didnt test with avid"}, {"text": "Mac is better.... admit it. You get what you pay for."}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23HatersGonnaHate\">#HatersGonnaHate</a>"}, {"text": "what is &quot;Final cut&quot; is that the computer brand, that I never heard before..!????!"}, {"text": "is a laptop with 8 gb of ram and Intel core i5 bad for video editing?"}, {"text": "Woot. You are wearing a martenitsa ?"}, {"text": "How is ur macbook pro so smooth😢 I got a 13&quot; 2016Macbook pro base model but it lags a tonne when ever i try to play it and/or just look at the video by sliding through the story line... my iMovie just keeps crashing so i got the free trial final cut pro and it still lags but it does decent when i leave it out for a while.... Th movie i inported is 30min long btw. So idk am i underestimating the length of the video or am i overestimating the strength of my macbook?"}, {"text": "Clear and unbiased. Thanks."}, {"text": "Next: After Effects"}, {"text": "what version of the final cut did he use"}, {"text": "your video is soooooooo good"}, {"text": "@HardwareCanucks   Was the Eurocom M5 Pro running a SATA SSD OR pci-e M.2 SSD  Because M.2 PCI-E is  about 4 times faster than regular SATA SSD.  Thank you."}, {"text": "I bet you sold so many desktops/graphic cards for that 😂"}, {"text": "I like my MacBook Pro. Optimisations are amazing."}, {"text": "What camera do you use???"}, {"text": "Mac for Productivity and then Windows for Gaming enthusiast.. CASE CLOSED."}, {"text": "Oh god the warp stabilizer, that thing even crushes my 6-core desktop editing/gaming tower. I only weep thinking what it did to that poor MacBook Pro."}, {"text": "I notice, there are no link in description for the PC. soo..."}, {"text": "Adobe products use brute force with hardly no optimization.  My xeon x3 workstation in conjunction with adobe video apps is pathetic to say the least, not only does it fail to utilize all the cores, the performance overall is crippled over that of traditional single packaged cores.. Its no wonder why abode retreated to &#39;cloud subscriptions&#39; ."}, {"text": "excellent video clip!Excuse me for the intrusion , I would appreciate your opinion."}, {"text": "Congrats on your Pro! You will loaf it! LOL loaf XD"}, {"text": "Love my Final Cut Pro X :3"}, {"text": "you think if i buy the 13inch you put a link for i can still edit 4k videos without a problem . i do music video usually 3 minutes or so . ?"}, {"text": "Great video. I just got my Mac Pro 2008, i come from pc and use Premiere, but the renders on Final Cut seems like a good think."}, {"text": "I really want to see it using the same program. sure final cut pro is optimized but I want to see it on a level playing field."}, {"text": "format from and too is very important please help on what you used"}, {"text": "I have the same exact processor but it&#39;s only 3.4 ghz, how is yours more powerful?"}, {"text": "Can you make a new version with a laptop with a 1070 or 1080 vs the new MacBook pro PLEASE"}, {"text": "+Somethingafw <br />FCP will only go away if Apple abandons the personal computer world all together. Adobe is gaining only due to the sheer volume of users that are switching to video from the photography world. When the DSLRs started capturing motion picture the volume of users that already used Photoshop added Premier to the list of applications. Anyone making big money with video is using AVID Media Composer or Final Cut Pro, and I am not talking about Youtube&#39;s junk change they give to creators on here. <br /><br />I have the Adobe suite, FCPX and AVID MC and overall my everyday workflow is Blackmagic Resolve for color grading and mask edits and then AVID MC for the NLE creating and rendering of the final project for DVD and Blu-Ray production. I use AVID because it is the most accurate video editor out there, frame by frame you know what you are getting. AVID does requires Multi-Xeon CPUs and ECC memory if you want a smooth workflow without headaches from glitches. It is a higher price to play but wow is it accurate.  I use Final Cut in a mobile environment because the other options are not as good for mobility and it does work well, it is just not my preferred workflow."}, {"text": "You should try the same test on the same machine. Maybe You can install hackintosh on Your workstation in dual boot configuration and then do the testing between Premiere and Final cut?"}, {"text": "Adobe needs to optimize their software and Apple needs to lower the prices of its overpriced hardware and they also need to be more feature rich. If you depend on dynamic link workflows with Adobe Audition, After Effects and Premiere working together, you are not gaining much since you still need to use Adobe products. And off course if you are serious about color grading, DaVinci is added to  the mix with its own pros and cons. Also if you need to use After Effects for things that you can&#39;t do in Final Cut you still have the same problem. Than off course is the way all these programs handle various footage from various codecs and various bitrates with various effects. Doing a test with a generic &quot;4K video&quot; shows that tests like these can only impress youtube vlogers who don&#39;t do much. If you are shooting Indy film or doing collaboration with other users on various platforms with various cameras and settings for each, this test falls apart in a hurry. Because it really is not a real world test, its a lab experiment that brings in views. Regardless of what you think of the platforms , design of the test does not reveal anything useful for real world production, except maybe light vlog editing for youtube. If you want to test what the title suggests, much of the test needs to be redesigned. Which was the same problem with previous &quot;tests&quot; from other youtubers. You were right about one thing, its a keyboard warrior dream match, but not really useful for serious production of video content. There are way too many variables missing, too much is assumed and not enough tested for serious conclusions."}, {"text": "which final cut edition?"}, {"text": "Wow....interesting results..."}, {"text": "Hmmm, I wonder how this would go with audio enthusiasts/music producers. Would an ableton, studio one, FL studio or other DAW project render faster in Mac or PC? I think I may test this myself one day."}, {"text": "editing : mac <br />gaming : pc"}, {"text": "Pc wins for sure there are so many editing softwares that are better than the one on MacBooks"}, {"text": "Nah I&#39;ll stick with PC because of the upgrade availability.. I don&#39;t mind waiting a little longer on rendering, also the fact I can play PC Games on it, and it looks way more bad ass is another reason, so yeah sticking with PC.. don&#39;t get me wrong Mac is a great OS and is awesome for noobs and grandparents,  but its not for me."}, {"text": "did you use  preview files for render in premier?  becasue that is the reason FCP finishes so quickly."}, {"text": "I really can&#39;t get behind calling final cut more optimised. It isn&#39;t, it&#39;s simply lightweight."}, {"text": "Thanks for your video !! :D"}, {"text": "Now I want to buy Macbook."}, {"text": "What is the best editer???"}, {"text": "Please make a video comparison i7 6950x pc vs late macbook pro 2016. which is better and faster for video rendering?"}, {"text": "Great vid. Thanks."}, {"text": "in my experience mac and pc are both viable options for overall computers, but in certain niches, one outshines the other. this video being a good example of mac being strong when it comes to fast and efficient rendering and editing of video, but at the same time, pc completely shits on mac when it comes to gaming bc the amount of power you can get out of pc&#39;s due to customizations is virtually limitless"}, {"text": "Your comparing chalk and cheese though. Where is the proof that the Apple is giving you the same quality fo render as Premiere Pro. Perhaps Apple is cutting corners on footage quality. The only pure test would be final cut running on Windows but you cant test that. So the other test you should have done is premiere running on the PC and Mac with the same clips. Stabilisation may be shit in Final Cut - you don&#39;t show us the proof. Warp Stabiliser has been compared LIKE 100 times as being CRAP on the MAC... and also how bad is Final cuts stabiliser - well pretty bad according to reviews out there. So this is not a very objective comparison IMHO. Plus the universal opinion of editors is that Final Cut pro has serious flaws which have excluded it from being used FULL PRO. The BBC got rid of their Macs for this reason. So its a bit like the Volkswagen exhaust situation. Apple are most likely cutting corners to get false results which look good. We need pixel peeping tests and footage robsustness quality comparison after the renders... its the only way. Theres even issues like out of the box ProCC comes with certain super high quality functions which are forced ON which do slow down timeline scrubbing drastically like GPU Accelerated Linear Colour in previews. If you try turning that off see how much better your scrubbing gets ;-)  Also did you know Apple have knobbled Quicktime on PCs to cause problems. Older quicktime versions run smoother than newer ones.... so what fooatage were you trying to give premiere and what wrappers because if quicktime gets involved on a PC and apple are knobbling it slower then theres your problem also! You need to tell us what you were using mp4 mov raws??? It matters dude. Apple are queering the pitch - because they are wankers. Its always the same games they play."}, {"text": "well it better be fast if it lacks tons of features."}, {"text": "Hackintosh is the way to go. In terms of stability, Mac OS has the upper hand."}, {"text": "I know this video is a little older, but what if you&#39;ve made a dual boot on your workstation en installed OSX. Most nvidia gfx cards are supported. <br /><br />Would make a challenge of that ^^"}, {"text": "Well, +HardwareCanucks looks like it&#39;s time to make a Hackintosh Project and compare Final Cut and Premiere. It would be awesome to check all the stats. Nice video, keep it up!"}, {"text": "LETS GO MAC!"}, {"text": "ummm guys mac for the win"}, {"text": "Great image / video ! Congrats ! Is a pleasure to look at....."}, {"text": "Thanks for taking your time to create this informative video. Definitely thinking about getting a MacBook pro for editing on the go. Final Cut is extremely optimized for macs. Its amazing."}, {"text": "too bad final cut is garbage."}, {"text": "Optimization has become nothing but a marketing term nowadays. Software by Apple on hardware by Apple, except that it&#39;s not. It&#39;s running on Intel chips. They&#39;re both running on Intel chips. They&#39;re using GPUs made by other companies. You don&#39;t create an OS specifically for a single set of hardware. It&#39;s madness. Why do people believe this?"}, {"text": "i&#39;m looking for video editing laptop (adobe premiere pro + a7s ii). <br />- my last one: mbp retina 15&quot; i7 16gb ram + ssd (mid 2014). <br />- what are your recommendations?"}, {"text": "¿What if you run Hackintosh on your workstation and using Final Cut,? <br /><br />It would be awesome to see the results."}, {"text": "so the mac use amd graphic card, may i know its temperature?"}, {"text": "Wtf is 2016 no one gives a shit anymore if you&#39;re a mac or pc use."}, {"text": "MAC FOREVER !!!!"}, {"text": "So I literally dont understand anything about video editing. What is a good option for me? Budget is around 2k. I sort of want a desktop. Should I go with MAC or custom Build.. Could you send me some good videos to watch so I could do research? I am just a beginner like i said. And will be doing beginner things..  ANY ADVICE??"}, {"text": "Props for choosing Vintage &amp; Morelli for the sound track"}, {"text": "Mac is the best I have one"}, {"text": "+HardwareCanucks<br />would you test your desktop machine with hackintosh?<br />i think that render times would be much different"}, {"text": "Would a high end Hackintosh perform the same with Final Cut Pro? Or is the Quicksync specific to the new Mac hardware?"}, {"text": "Out of the subject ... But ...What camera do you use in the video ? :)"}, {"text": "I think it&#39;s the storage that is bottlenecking the windows PC&#39;s. Mac has one of the fastest ssd&#39;s"}, {"text": "the key word is the background working in Apple but it the PC there isn&#39;t that&#39;s why it takes to long to finish the job"}, {"text": "What about hackintosh? :3"}, {"text": "everyone under this comment has good essay  ,A+"}, {"text": "After a long time I came across a tech video that is really helpful in general."}, {"text": "thanks for the info"}, {"text": "No Need for video. Macbook is better (For Editing)"}, {"text": "God I love Final Cut... I&#39;m so sad that my film school uses Premiere..."}, {"text": "Thanks for the video. Much more comfortable to watch than Jonathan&#39;s videos."}, {"text": "Linus and Jonathan were talking about the latest Macbook pro... •.•"}, {"text": "Now you need to use the all new 2016 MacBook Pro and Final Cut Pro 10.3"}, {"text": "I support mac and PC because i have both"}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=4m56s\">4:56</a> this shows that adobe makes crap software..."}, {"text": "I love PC. But our PCs are not perfect. <br />I agree with that."}, {"text": "Chriss prattt is that you?"}, {"text": "Turn that pc into a hackintosh and it will eat the macbook alive....<br /><br />So, in all seriousness, its not the mac hardware, its the software that makes it work... the MacPro in all iterations is DOA... If apple was smart(which they aren&#39;t) they would let MacOS &quot;into the wild&quot; and they would not only make money hand over fist, but they would probably defeat Microsoft and it&#39;s win8/10 BS...<br /><br />Posted from my Hackintosh. =/"}, {"text": "Why can&#39;t Adobe just fix Premier so that it will be competitive with Final Cut Pro?"}, {"text": "mac"}, {"text": "Is video editing good on a macbook pro 13&quot; mid 2015 with a core i7 at 3.1ghz, Intel Iris 6100, 16gb ram and 512gb flash ssd?"}, {"text": "I just found myself watching a video in which a guy is showing me himself editing a video of him editing a video. I might as well film this."}, {"text": "&lt;WoW my pc would render that file in fucking 5 hours😂😂&gt;"}, {"text": "Pls help, but can you run a smooth video editing on the base model of 2015 15&quot; macbook pro?? Help pls"}, {"text": "Did you turn on all cores in AP? How much RAM did you set for each core?"}, {"text": "I&#39;m looking for a laptop for editing and trabelling. I like macbooks batery and lightness but I don&#39;t like final cut, I&#39;m an adobe user and love the last update of premiere. so I know that macbooks are very powerfull but with adobe software they are not to much.. I&#39;m looking for other brand with similar desings in terms of weight and also powerfull but I don&#39;t find any option with nice battery.. :/"}, {"text": "Awesome video I did give this video a like!"}, {"text": "Who else herd macspectations when he said my expectations? Or was it just me lol"}, {"text": "1. Hellos<br />2. Do faster render times make yous a better editor?<br />3. Does editing on a laptop screen realy the best way to edit 4k videos foing to be watching on a 60 inch tv??<br />4. Why do not you compare a mac and a compatible pc  laptops using OSX on both and see if the hardware is optimized or the software is what is optimized? Is two very different things.....,<br />5. As usual it is easy to get people focus on the wrong things.....,<br />5. Why"}, {"text": "i learned that you can use background rendering for premiere with Media Encoder <a href=\"http://tv.adobe.com/watch/cs6-creative-cloud-feature-tour-for-video/save-time-with-powerful-background-rendering-using-media-encoder/\">http://tv.adobe.com/watch/cs6-creative-cloud-feature-tour-for-video/save-time-with-powerful-background-rendering-using-media-encoder/</a>"}, {"text": "One crucial thing is forgot to mention<br />A NVME SSD vs a SATA SSD. Both and very different write and read speeds meaning the data writing can be one of the bottlenecks. a MacBook has a NVME SSD, where as laptops have a SATA port for the same."}, {"text": "Can Mac beat PC  gaming"}, {"text": "and then you come to everything else, xD<br /><br />mac can edit on 1 software, but can&#39;t rly do anything else, sad but tru"}, {"text": "Have you compared the compressed video result? Better and higher compression requires more time and processing power. What are the file sizes of end result, bitrates, codecs, container format, passes, b-frames, deblock etc. Depending on compression a clip can take 10 minute or 2 hour to render."}, {"text": "I&#39;ve heard that in Final Cut, when u import files, it transcodes the files to prores in the background and replaces the original files in the timeline with that prores file automatically, i think there is also an option to make proxys and replace them the same way, I think thats where the speed comes from, but u sacrifice hardisk space, since prores 422 files are obviously bigger, I once read a guy comment on youtube about importing to final cut his 10 gb videos from his iphone, then later realized that his Final cut app became 78 GB! I think thats due to the transcoded prores files.<br /><br />So since premiere 2015, they adobe has introduced this proxy workflow, and I think now when u implement these features, i think then it would be on edge with Final Cut. I myself have been doing the proxy workflow of the new premiere and loving it ever since!"}, {"text": "Fantastic Video and really insightful indeed.<br />I was also in the exact same dilema and i have finalized on the 15 inch 2016 MacBook Pro with touch bar.<br />I have a MacMini and started getting myself acquainted with FCPX and absolutely loving it.<br />Also wanted a editing machine on the go so to MacBook it is.<br />This video helped me solidify my theory. Thank you."}, {"text": "MacOS"}, {"text": "I just got a MacBook Pro from Apple a year ago, brand new, from the Apple store, for $1300. It&#39;s the biggest piece of shit I&#39;ve ever bought..."}, {"text": "Hey he&#39;s wearing a мартеница lol"}, {"text": "The media was probably optimized to prores when imported. There&#39;s no way for the performance to be that drastically different otherwise, even if FCPX is better coded to the hardware. If you set up PP CC to auto trans-code media to a more optimized file format, like MXF, you&#39;ll see the same performance. Avid MC does the same thing, that&#39;s why it&#39;s super fast."}, {"text": "I want to buy a decent laptop, predominately for video editing and photo editing. Since the surface book came out, I have been waiting to see what Apple would do with their MacBook Pro update. Like a lot of others, I am disappointed by the choice of ports, lack of SD slot and the price hike. But I can buy FCP for a one off cost of around £220. If I go with the mac, as opposed to renting premier pro,for around £45 per month if go for the surface book or dell xps. So in the long run the MacBook option will work out cheaper. Anybody got any better suggestions because I really don&#39;t want to give Apple my money."}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=3m34s\">3:34</a> Macbook is a real pro.....i love all the macbook out their coz of their design &amp; power"}, {"text": "Great Video mate! The results are interesting to say the least!"}, {"text": "It has everything to do with compatible source and output. if it needs to do a full transcoding of the source to the output media or not. Also, quicktime has never been very well supported on windows. You can hit the same issue on the mac, but it is a little more &quot;idiot proof&quot;, and usually desides to just default the read a write to be the same encoding. Its all about settings, and choosing an optimized pipeline. And no, your macbook does not beat your workstation, at all.. you just compared your workstation doing a full 4k video transcode, with a mac doing a copy paste to container."}, {"text": "Where did you get your macbook skin"}, {"text": "Finally a video I was waiting for. Thanks!!"}, {"text": "Thanks for this. My maxed out mid-2012 MacBook Pro (16G RAM, 2.6GHz i7 quad core, 1TB SSD) can&#39;t handle 4K Multicam timelines, so I&#39;ve been thinking about upgrading to either a new Touch Force MB Pro with upgraded GPU or perhaps iMac 27 Retina 5K. While the iMac will be faster (I think), the TF MBP has Thunderbolt 3, which I expect will allow eGPUs soon like in the PC world. Was even thinking of going back to Premiere Pro so I could potentially move to Windows and something like the Razer and Razer Core, but I don&#39;t like Windows. Thought about Resolve, too, but they are both much slower than FCP on optimized Apple hardware. Might wait for updated iMac, or at least 32G FT MBP. And with all of this written, it is far from clear how much faster any of this would be than my current set-up. Sigh."}, {"text": "No professional users use Final Cut Pro but clearly Adobe needs to get their heads out of their asses, it&#39;s clearly poorly optimized and since movie studios, professional and amateurs use it I don&#39;t understand why they haven&#39;t. Some of the custom PC build I have seen here on youtube for CC work is nuts, imagine if the program would be half decent build to utilize the hardware?"}, {"text": "Are there any tech channels left that haven&#39;t sold out to D-brand?"}, {"text": "Your videos are too crispy !"}, {"text": "so, i haven&#39;t watched the Video yet. I bet Mac wins...."}, {"text": "Did you notice an actual difference in the quality of the final exports? People have complained about issues when using Quicksync in FCP. Things like colours and gamma being off."}, {"text": "What camera do you use ?"}, {"text": "is he still using a 6700K in his pc ?"}, {"text": "what is the computer whit windows?"}, {"text": "One thing I would like to see is more results with a dual-booted install of Windows on the Macbook Pro with Premiere."}, {"text": "you never compare the hardware, so it&#39;s pure bullshit"}, {"text": "<b>Before clicking the title</b>- Dude! where is my white flag bruh...."}, {"text": "Frankly speaking, i really don&#39;t know what he talking about..."}, {"text": "This is more of a Premier vs Final Cut rather than PC vs Mac review. If Final Cut was available for PC it would make a better comparison"}, {"text": "try it on the new Microsoft Surface Studio. <br />premiere is much more stable than  fcp on that and runs faster"}, {"text": "There is one program for editing, it&#39;s called AVID MEDIA COMPOSER.<br />FinalCutX is a Toy with all the things out of place. <br />Premire is a Toy that loves to crash.<br /><br />Learn the joy of proper editing guys, you will be amazed!"}, {"text": "Does MBP have r9 m370x?"}, {"text": "I&#39;m on my i7 970M Hackintosh laptop, and benchmark goes 1.2X better than latest MBP laptops.Do not waste your money"}, {"text": "I know that Final Cut Pro runs much better on a Mac than Adobe Premiere Pro does, but after using both, I have come to dislike editing with Final Cut Pro quite a bit. I stopped using Premiere back in the 90s and used different iterations of Final Cut, but after getting so annoyed with Final Cut, and then trying Premiere, I was amazed how how much better it was.<br /><br />I just wish it was faster."}, {"text": "it&#39;s an ads <br />You can see him selling mac computers Under the video"}, {"text": "This is kind of a &quot;Unfair&quot; comparison of the two types of devices.  As we all know the Final Cut Pro  renders the video as you go on MAC.  But PC lets you do it at the end.  However You cannot edit your video faster on Mac than on PC.  So to be fair you should edit the same video with 2 skilled people following the same editing format from a piece of paper, and see who does it faster and more accurate. If you only do 1 video, Mac is king. But if you need to incorporate other types of editing information and Video over Video then PC has not challenger.  Agree?"}, {"text": "Chris Pratt + Avicii = This guy&#39;s face"}, {"text": "I believe is not only the speed but the approach: a double edged sword. If you are about to start a Solo project final cut with the magnetic timeline and extensive metadata use could be the difference between unpaid overtime and a nice dinner with your significant other. On the other hand , if you are planing to move to a big house or you already know other NLE premier could be a better option ."}, {"text": "Hello, What type the video camera do you use for shooting this type the video?"}, {"text": "what is RMBP and M5 ?"}, {"text": "your face is like pewdiepie lol"}, {"text": "This is just what I experienced after 20+ years on PC when I&#39;m tried iMac with FCP. Now i&#39;m totally switched to the Mac machines. It&#39;s amazing fast and enjoyable platform for photo and video editing."}, {"text": "maybe you should try hackintosh project ."}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23Hatersgonnahate\">#Hatersgonnahate</a>"}, {"text": "Can you put the timeline comparison charts for download in the links below section? Thank you."}, {"text": "Damn. Im debating getting a mac for FCP but they are SOOOO damn expensive. So i think i might get just a ultrabook."}, {"text": "It is actually adobe premiere vs final cut not mac vs pc but nevermind, i&#39;m just passing by."}, {"text": "Really nicely done, subscribed."}, {"text": "What&#39;s your opinion of the New Mac book pro?"}, {"text": "An interesting experiment now would be to hackintosh the high end pc and run final cut and run premiere on windows on the mac.  I want to see those results"}, {"text": "hahahah ! i can see u are beginning to edit."}, {"text": "mac is so much better"}, {"text": "Pls I need help!!!! What is better to edit 4 k videos , laptop or desktop ? And which one ? I&#39;m thinking to edit with Sony Vegas till now, I need a recommendation!!"}, {"text": "yes final cut is really good with editing quick projects.I DID ALL MY MUSIC VIDEOS on my channel with it. I also used premiere for one day and deleted it from my hard drive because of the very slow workflow. people just down talk final cut x because of its simple look. js because thing are simple, does means its not for pro use."}, {"text": "Ouch.. that is a very sad result for Windows editors. A lot of Windows friends of mine, workig with professional video, are using Vegas. Perhaps it&#39;s a good option for speed?"}, {"text": "What your casing in 0.34?"}, {"text": "i was going to build a gaming pc that i can also do video editing, but now i am going to buy a 27in iMac. the choice is no simple, thank you for the test. I use to hate mac, but after seeing the times, mac is really the only choice to go."}, {"text": "As you comparing different software why didn&#39;t you call this video &quot;premiere vs final cut&quot; instead of pc vs mac?"}, {"text": "It kind of looks like you&#39;re comparing a laptop to a desktop, and comparing Final Cut to Premiere. This doesn&#39;t sound like much of a Mac vs. Windows argument in particular....?"}, {"text": "what is your gear? camera, lens and audio recording mic? suggest me also your lighting"}, {"text": "I always use powerdirector for video editing because it&#39;s way quicker than Adobe and much easier to use."}, {"text": "tridatu bracelet"}, {"text": "27th October NEW Apple event with NEW MacBook Pros!!!"}, {"text": "Thanks for an honest comparison. Apple always has the advantage with hardware and software vertical optimization but I&#39;m pretty sure Adobe will fix the issues with Premier soon to at least bring the numbers closer. A new line up of MacBooks are yet to come this year according to rumors so wonder how they&#39;d perform"}, {"text": "if you use cyberlink power director on Windows of every other program which support intel quicksync, you can have better performance on the more powerful Windows machine"}, {"text": "I&#39;m kind of person who watch these videos just to see who wins so please announce the winner and Finish the video rest add in Discrecption"}, {"text": "what camera did you use to record yourself?"}, {"text": "Mac is better! No, PC is better!"}, {"text": "Wow..."}, {"text": "Why PC, You know PC just means &quot;Politically Correct&quot; or &quot;Personal Computer&quot;. So the mac could be called a pc"}, {"text": "taek"}, {"text": "Pcs have better stuff and are great for 3d rendering and being able to download software that mac does not have. I have both a pc and a macbook pro but I prefer mac os over windows 10 everything is so much more simple on mac"}, {"text": "I moved from Premier to FCPx and it was for the best.  So much easier to use."}, {"text": "gaming with Pc and Mac. When?"}, {"text": "Thank you for this video, one question: what is speakers in this video?"}, {"text": "In the next video, we compare a Ferrari to a lox bagel!"}, {"text": "I have solution of all:<br /><br />-It&#39;s better work whit final cut pro for small or medium/large work, because rendering it&#39;s most fast.<br /><br />-It&#39;s better work whit premiere pro for large or big work or group work because premiere pro integrated direct link for work whit other program whitout spend time to save and render file, and this it&#39;s fantastic beacuse your save time and space of your hard disk/SSD, and whitout time save thanks direct link you save more time than only fast render of final cut pro, and you have more control thanks dedicated software for colour, special effect, photo, draw, animation and other. first i have say premiere pro it&#39;s better for group works, because thanks a creative cloud you have file on adobe cloud and you can share project to your companion for modify or only watching, and thanks creative cloud you can modify file in all device, in all place. It&#39;s beautifull, but there isn&#39;t essential for small/medium work.<br /><br />-It&#39;s bettere Da Vinci Resolve if you are a Gamer (LOL) because this software use more gpu than cpu, and for gaming it&#39;s more important the Gpu than cpu.<br /><br />so, if you choice a software there is a question: what computer i buy? Mac, hackintosh, or &quot;normal&quot; pc?<br /><br />-If you choice final cut pro, i council buy a apple computer, because final cut pro it&#39;s more faster to render than premiere pro or media endercoder, and in youtube there are videos show the hackintosh workstation in final cut pro it&#39;s more slower than macbook pro<br /><br />-If you choice premiere pro, i council buy/assembly a computer/workstation for editing there isn&#39;t story premiere dont&#39; do a difference of operative system but do a different in hardware, and how why now mac there isn&#39;t beatiful ratio of permance/price<br /><br />-If you choice davinci resolve it&#39;s logicaly you are a gamer or you like Da vinci resolve and GPU. Most mac computer have only integrated gpu, and not have dedicated gpu, only the most expensive mac have a dedicated gpu and and in all they sucks, then it will be obvius you choice a computer/workstation for gaming (lol)<br /><br />Yes Massimiliano, but you don&#39;t forgot one type of pc? Hackintosh you don&#39;t say never?<br /><br />Yes, in fact i raccomended hackintosh for premiere pro or Da Vinci resolve if you like macos Sierra but i don&#39;t know how it&#39;s legal of professional company install macos sierra on pc, and it depend for state (in italy, for exemple, it&#39;s legal, because apple eula for italian laws it&#39;s illegal) and install a hackintosh it&#39;s more difficult than instal windows and there is the possible it&#39;s not stable.<br /><br />Thanks for reading."}, {"text": "How a macbook can edit video is not just because of Final Cut Pro, its surely because the files handled were ProRes 422 codec, which files are far bigger but much more manageable for editing at the same time."}, {"text": "Would be fun to see say premiere on mac Vs premiere on a pc"}, {"text": "Great review! Now do a simultaneous benchmark for Netflix 4K delivery and Blu-ray 1080p delivery to see how hardware really matters: 1.Get SCRATCH trial license for both Mac and your Windows tower 2.Find online and load some 4K RAW shots (required for Netflix 4K delivery) edit them, grade them if desired all on 4K RAW. Try to add some Sony XVAC 4K in the mix to make it multiformat workflow 3.Output in 4K HEVC 10bit for Netflix and 1080p MPEG-4 AVC for BD, scaled of course. And to add some flavor output selected one or two shots into DPX as well.My advice is not do this very often on MBP cause it will melt GPU BGA within a year."}, {"text": "I&#39;m completely mixed up. I run Windows 10 on my MacBook Pro 15, and use Adobe Premiere Pro to edit videos. Using Final Cut is way faster when using my computer with OSX, but I got comfortable using Adobe Premiere Pro on Windows."}, {"text": "Since QuickSync is a hardware encoder with very particular quality output, did you guys think about doing a PSNR value comparison with a raw export? It&#39;s good to be fast, but I never see any quality comparisons, as if we&#39;re all assuming it&#39;s obviously the same. I would think that at very high bitrates it&#39;s probably the same, but there was no bitrate info. (Extremely unlikely plot twist: it ends up being better than MainConcept.)<br /><br />Also, it would be valuable to know about different source codecs. If Apple relies on QuickSync to decode the video as well, certain video formats which actually improve editing performance in most software (like DNxHD, for instance) might instantly make Final Cut very slow. And this would also help explain why Avid and Adobe don&#39;t care for QuickSync, other than it not being available in Intel&#39;s high-end i7s and Xeons."}, {"text": "mac"}, {"text": "There is something wrong with your PC mate, If you only have one SSD there, it is likely the bottleneck.<br />You see, MAC is already optimized to work with FCP, but you need to optimize your PC to AP.<br />I have a PC with a much weaker GPU, and rendering time with Warp stabilization took around 30sec for a 22 sec clip.<br />The only difference is that I have a Raid0 for my footage"}, {"text": "Anybody knows about similarly priced i Mac vs a workstation pc in architecture rendering with V ray?"}, {"text": "But were you using Mercury Playback (CUDA) for Premiere on either system?"}, {"text": "change to Vegas on pc"}, {"text": "so mac&#39;s are no good with there fansy FCP software for rendering."}, {"text": "This video is an example on how to do a review honestly. You are dong a great job."}, {"text": "What do you think of the Macpro 13 inch with 16GB RAM. i travel alot so the 15in macpro is too big to carry around. I&#39;m not a pro, i do video editing as a hobby."}, {"text": "The optimization Apple puts into their products is the reason I use it."}, {"text": "Mac vs PC. So I guess the Mac is not a Personal Computer ^^"}, {"text": "The only good thing în this video is the music..."}, {"text": "Can i play 2016 games în full details on Apple? No? Hm... That s bad... In this case, Apple is no good for me... So get lost Apple..."}, {"text": "I like both"}, {"text": "He sounds like Chris O&#39;Dowd"}, {"text": "Thanks for posting this video. I didn&#39;t realize FCP was that well optimized. It&#39;s been a long time since I&#39;ve used FCP, what is the workflow like these days? The thing that always bugged me about FCP7 was the workflow. Transcoding everything to ProRes seemed like such a waste of time when Premiere could work natively with many formats. I was working with Sony XDCAM footage at the time, and the process seemed much easier in Premiere."}, {"text": "na me pcs are highly overclock able you cAN get crazy gpu configurations and lots of ram hdds and ssds and processors with insane amounts of cores and threads<br />pcs ftw<br />its obveas they are alot more powerful<br />they are a little bit more vulnerable to viruses but a bit of responsibility and anti virus software and your good to go"}, {"text": "Yes please more content on this"}, {"text": "That was extremely helpful and thorough!  Cheers"}, {"text": "MacBook completely destroyed pc infact every other machine out there"}, {"text": "It is a comparison of 2 different software. Fair would be to have Final Cut on your dekstop rig. MBP would not stand a chance."}, {"text": "Whait your comparing a laptop to a pc. and the pc still cost more then the laptop...."}, {"text": "MacBook Pro 15 2.8 512 PCIE or iMac 5K 4.0 16GB  2TB Fusion"}, {"text": "that is because final cut pro creates proxies of video files."}, {"text": "Could you try benchmark on free software? Like filmora or hitfilm, most of us dont have final cut or even adobe one."}, {"text": "Why don&#39;t you try running FinalCut on a Hackintosh by converting your desktop? Your desktop PC specs is very similar to my Hackintosh build (same case too) and I have no problems running El Capitan and all Mac software. I don&#39;t have the latest version of FinalCut so I can&#39;t quote you performance specs. You may want to upgrade your desktop to 64GB, run a 32G ram disk and run FinalCut. I know it will perform much faster."}, {"text": "Does anybody know what speakers he is using?"}, {"text": "I have a Dual boot Win10 / OS X machine and now only use the hack for all my wedding video edits.  Speed ease of use of FCP X is much better than Win10 Adobe premeire."}, {"text": "It&#39;s a real shame that a workstation with significantly more power can&#39;t put up better numbers. Adobe needs a kick in their ass, it&#39;s outrageous! Are there other options besides Adobe, like maybe Vegas, that can take better advantage of a high end rig? I&#39;m completely at a loss here, I can&#39;t believe how awful the software is. There&#39;s absolutely no reason why Adobe can&#39;t have the same implementation of quicksync and/or whatever else Apple is using in order to speed up the render. Just... wow."}, {"text": "Final Cut&#39;s way more optimized and faster than Premiere Pro (on a mac), hands down. But as a video editor as well as a vfx artist, I use Premiere to make sweet love with After Effects with dynamic link - a feature only present in Adobe products. So, PC for me."}, {"text": "Best way dual boot a hackintosh great video export times, and you get windows for games and stuff."}, {"text": "so pc wins again,not surprised"}, {"text": "Renders are the least of your worries. And play back, I play back 4K raw on 1/2 res on my 3.5 year old i7 with dual GTX680s and 64GB. If you can process Raw-DNG than you are a player.<br /><br />Also I HATE FCP for very large projects. The whole idea of nested sequences is something I miss, you need to make different projects. It really overthrows the whole technical jargon of filmmakers. We talk about shots, scenes and sequences.<br /><br />Did FCP X mature? Yes it did but I miss so much. Like dual screens for checking your footage and your edit. Sure this by now can be configured but this is something I can&#39;t live without.<br />Also dual screens/viewers for finessing your cuts is a breeze in Premiere Pro. Not to mention the perfect seamless integration with AE, Photoshop and the whole Adobe suite really.<br /><br />Can Adobe be optimized? Sure. Is it as easy as on Mac where they also make the hardware? NOt as much, bare in mind that Adobe caters for Windows and Mac and rumours go that they also want to support Linux (can&#39;t wait!) This layer of portability will Always cause overhead. But at least you are not trapped by a hardwarae vendor notorious for selling overpriced/under performing hardware."}, {"text": "linux for life"}, {"text": "Oh god you&#39;re adorable<br />I need to stop"}, {"text": "so it&#39;s the software (video editing) not the platform/HW."}, {"text": "and record myself having sex"}, {"text": "Actually both Premiere and Sony Vegas has a feature that lets you get completely smooth playback on low end PCs. It&#39;s called Smart Proxy or just Proxy files. I would also like to know if you enabled hardware acceleration in Premiere Pro, and set the allowed ram usage to about 90% cause they may have huge results, same if you are exporting to an SSD on the pc aswell as the Mac. <br />In general I find Final Cut X very limiting, it&#39;s more like IMovie since it doesn&#39;t have some of the pro fuctionality that Premiere have."}, {"text": "after i waited yeasterday 4 hours for a render of my project on premiere...time to sell everythimg ang buy mac."}, {"text": "I have Premier with Adobe CC and I keep meaning to sit down and get some practice with it, because it seems so many people use it, most of them on Macs. But, I love FCPX, it&#39;s so great to use it&#39;s a pleasure. This vid just makes me wonder if I should bother learning Premier. Rather spend my energy encouraging more people to try FCPX. In the end I guess use whatever you like as long as you get a great result."}, {"text": "Thanks for the comparison. I&#39;m not a mac user, but every time I see a video like this I get the urge to build a hackintosh or pick up a macbook pro. It&#39;s baffling how fast the export times are...even compared to a top of the line Windows PC."}, {"text": "Jesus Christ, first you have the same H&amp;M hoodie and now the same desktop wallpaper my god!!!"}, {"text": "I still use an atari st. Amigas are crap!"}, {"text": "Can Final Cut Pro produce that same Motion Camera Text you do on After Effects?"}, {"text": "Damn so it&#39;s final. Mac is overpriced but better for video editing, photo manipulation, and graphics work. PC  Is better for gaming and networking. too bad I&#39;m poor and can&#39;t afford a Mac or software"}, {"text": "Can we settle this once and for all. MacBooks, IMacs and MacBookPros. made for music production, video editing photographer stuff and those type of things. Custom made PCs and just good PCs. Good for Gaming, Screen Recording, Streaming and game Production.<br />Do keep in mind that they are two different pieces of machinery and are better suited for different things. So for best results get both. And just to top it off Consoles. Best bang for your buck easy to use plug and play. So can we all just sit here and laugh at those people who don&#39;t appreciate them all for their different things. Also i think this is a great war ending speech."}, {"text": "how about this. get a pc tower and a mac laptop. best of both worlds."}, {"text": "die in a fire"}, {"text": "Would Final Cut runSame  on a Hackintosh as it Runs  on The Mac"}, {"text": "Final cut was made for mac and that&#39;s why its fast but if you can make a hackintosh with final cut the results wouldn&#39;t be the same or close."}, {"text": "great explication i like it, thank you so much"}, {"text": "This was extremely enlightening. Had no idea FCPX had that background rendering feature! So all this time the people who own Mac&#39;s telling me that they are soooo much better for video editing, even though they don&#39;t video edit themselves, were actually right!"}, {"text": "Awesome video what i needed :D"}, {"text": "Mac pussies"}, {"text": "I still hate that anything that isn&#39;t an apple computer is labeled a PC when essentially a Mac is a Personal Computer (PC) too. What you are really doing is comparing the operating systems (apple vs Windows vs Linux, etc) and then the computer (Mac, HP, Dell, Asus etc.) which you really cant do because each computer has different hardware."}, {"text": "pc is better at everything"}, {"text": "Mac is better <br /><br />No lag , Have a program in side to record no download just in it ,You can download Imovie to edit in the app store!"}, {"text": "awesome video bro!!"}, {"text": "Rocking that i7-6700K :) Me too!"}, {"text": "PC - gaming<br />Mac - editing<br /><a href=\"http://www.youtube.com/results?search_query=%23nohate\">#nohate</a> <a href=\"http://www.youtube.com/results?search_query=%23hatersgoingtohatehatehate\">#hatersgoingtohatehatehate</a>"}, {"text": "The adobe suite as a package is so much more powerful, but god damn Adobe needs to get their head out of their assess and start fixing bugs and optimize the software. I have been using Premiere CC for a month now at work, and while I prefer the workflow much better than FCP, and premiere is definately better than FCP7, I constantly come across minor bugs like the folder windows and title edit windows just dissappearing for no apparent reason when opening them, which is easily, but annoyingly fixed by a workspace reset.<br /><br />Also, something that Dimitri should have checked, is that I noticed the CPU was only used at 40 % when trying to export, making rendering times much longer than needed, something I fear was the case in Dimitris case, because FCP should not be THAT much faster. This is a CPU utilization bug that I have found forum posts about from back in 2014 (!), and why this bug still occurs in CC 2016, is anyones guess. And adobe does not seem to respond to these complaints."}, {"text": "The problem is NOT the Hardware itself, but for the Main Problem is and always be the OPERATING SYSTEM. Windows always brings You TONS of Problems, such as: Viruses, Annoying Updates Session, Incompability Hardware, Instability, etc. Meanwhile, OSX Mac always STABLE and brings ONLY what You deserved.  <a href=\"http://www.youtube.com/results?search_query=%23TrueStory\">#TrueStory</a>"}, {"text": "wow. that results surprised me! i had never expected a macbook pro winning in render times."}, {"text": "good video but wrong title , more like PC software vs Mac software"}, {"text": "awesome review.. but what about temperatures? i have an early 2011 macbook pro 15 and the temperatures are extremely high over 90c and the fans at 6200rpm even when i preview transitions on final cut.. is it worth the investment to get the new one? will it last on a long length project or a 4k short film or the temperatures will reduce cpu performance and burn the gpu chipset?"}, {"text": "So nice to see a rational, fair comparison of the two platforms for video editing. I&#39;ve always been an FCP guy, and while FCP X was rough at first, I feel Apple has busted ass since then and it&#39;s grown leaps and bounds since. Glad to see that a Premiere user sees what I&#39;ve been seeing."}, {"text": "It would be awesome if you could install MAC OS in your workstation and show us your results with Final Cut there!"}, {"text": "Hey everyone, the best results that i&#39;ve had was with the Mels Speed Method (just google it) definately the best remedy i&#39;ve followed."}, {"text": "wow optimization for final cut pro is amazing in the mac, thanks for the vid."}, {"text": "Nice.  Been using premiere for years on mac and the render times are shite."}, {"text": "A personal computer (PC) is a small, relatively inexpensive computer designed for an individual user. In price, personal computers range anywhere from a few hundred dollars to thousands of dollars. All are based on the microprocessor technology that enables manufacturers to put an entire CPU on one chip."}, {"text": "Mac vs Windows. PC = both Mac &amp; Windows."}, {"text": "dude, you have too much money...."}, {"text": "lol a tiny little mac is much faster than your huge pc! and the pc is not too much faster than your laptop... :/"}, {"text": "Very nice video! Super Quality! Final Cut seems to be the choice to make at the first view. But - you mentioned, that you are more comfortable with Premiere. Let´s consider - You have your material imported on both systems. You work a few hours to cut the video. Adobe Premiere for you personal is more productive, because you can work better with it. Maybe you are even  a little faster working on it. So you spend this few hours of contendend working. Hmm. Is it now really a point to consider, if the video is rendered in one minute or in (let´s say) 20 Minutes? Compared to the hours you spend on cuting it? It is the same thing as with SSD´s compared to normal HDD´s. SSD: Computer starts in just a few seconds. HDD: Computer starts within a Minute. After the start you are surfing in the Internet for an hour and write a long email. That 30 Seconds at the beginning is the big difference in that example? Hey, I am no geek or want to make your day bad but...hey. I use SSD´s as well. But I know why. It is just more comfortable. It don´t really change your productivity."}, {"text": "OKAY! enough. i blame adobe. HAHAHAHHA~!!"}, {"text": "I wanna use final cut pro but I dont have a mac and I only have a pc.. :("}, {"text": "Mac = Winner <br />PC = Winner<br /><br />I like both my machines..... I know how is this possible?"}, {"text": "Loved the video,  thanks for the insight!"}, {"text": "What camera You use in this video?"}, {"text": "Greate song :D"}, {"text": "Did u take in to consideration how much each program compromised the clip?"}, {"text": "Wait, so you show PC is better and ignore it anyway? If you only pay attention to the blue bars, not green. Then this is a fairish test. All using the same software Premiere. You can not compare a PC running premiere to a PC running final cut. I should not have to tell you this.<br /><br />You can not compare different CPU architectures or even machines fairly when using different software. Macs used to be better than PC hardware for rendering when they used PowerPC. Things evolved, the 8086 design overtook PowerPC. Most the rendering is done using the GPU today.<br /><br />If you compare two programs, and one is doing more instructions then to other. This does not make one better or worse. One is faster, the other does more things. They are both better in their own way. As a equal, its like coming a compute car vs your track car... Being fast and the first to past the finish line is irreverent when it comes to producing actual work. Features and such is so much more important to let you be as creatively free as possible."}, {"text": "What did you use to render this video?"}, {"text": "can you stream from the Mac?"}, {"text": "sweeet!!"}, {"text": "Adobe: You just made me want to buy a Mac and Final Cut Pro - render times and scrubbing!"}, {"text": "Pretty interesting video, and it&#39;s quite an acknowledged fact that Adobe may be the market leader but they&#39;re quite a dinosaur of a company that really needs to push for more.  A good example is &quot;Quick&quot; a video editor on the phone i recently started using. <br />I have a Sony Z5, which does have an Octocore processor; barely any extra good over a quad-core in daily scenario&#39;s but might&#39;ve helped with Quick .. and instead of getting using to the new version of premiere (haven&#39;t used it in 3 years) i copied the footage i shot withi my DSLR ( D810) to my phone and edited it using quick, it took only 2 minutes to export the whole thing and scrubbing through the timeline was instant. Like .. on my phone what the hell. The process was smoother and easier than on premiere, just by the fact the tooling was more intuative. Adobe really needs to step things up, but sadly they&#39;re industry standard so they got a ton of leeway in the market being already so established.<br /><br />Having said that an observation: That stablizer tool on FCP , when you enabled it it just seemed to crop the hell out of the video&#39;s edges - i.e that&#39;s typically how digital stabilization works on say, smartphone video shooting. You just crop the outer edges. <br />So if FCP just does that, then i can understand why it takes virtually no time to render compared to Adobe premiere&#39;s warp stabilizer which processes all the differences in the video frame by frame."}, {"text": "is it just me or does this guy look kinda like Chris Pratt?????"}, {"text": "PC is best!!!!!"}, {"text": "Tld this is how you address linus&#39;s video. Not be all &quot;i challenge your whole crew bull shit&quot;ever since you insulted linus to the face, I&#39;ve unsubbed, disliked every video I&#39;ve come across and promoted hate amongst everybody i know. I respect how hardware kanucks does it. Without any insult. I hope you die"}, {"text": "Please help! Is this laptop good enough for editing photographs &amp; video? <a href=\"https://www.amazon.co.uk/Apple-MMGF2B-MacBook-13-Inch-Graphics/dp/B01ELG6B38/\">https://www.amazon.co.uk/Apple-MMGF2B-MacBook-13-Inch-Graphics/dp/B01ELG6B38/</a>"}, {"text": "hey buddy!! I was askin on the price of mac book pro 15&quot; retina display and how can I buy it"}, {"text": "Thanks very much this was informative because I had thought about running adobe for video and photo but now I will just use them for photography editing on my new macbook pro."}, {"text": "how do you get all this things on the menu bar ??"}, {"text": "I thought the Mac series have a H264 chip in there graphics card to increase export time with final cut. I may be wrong though."}, {"text": "Should do a new video comparing these times using Adobe&#39;s new built-in proxy edits."}, {"text": "Love your work. Just to add some info...<br />It&#39;s also to do with gpu optimisation. <br />Adobe suite favours nVidia &quot;CUDA&quot;<br />FCPX favours AMD/OpenCL. (and Intel Quick Sync, which is on cpu&#39;s tweeny, weeny, gpu)<br />nVidia CAN, also, do OpenCL, but either nVidia&#39;s OpenCL driver code (or gpu architecture) doesn&#39;t get the same performance as AMD OpenCL.<br />Put simply, to get same Open CL performance on nVidia to AMD, you have to spend 3 to 4 times as much. <br />So, a Titan (maxwell, and obviously Pascal) will do as well as a 290x in OpenCL. That&#39;s a $1000+ card compared to a $250 card.<br />I&#39;m not a &quot;green <b>or</b> red&quot; team guy, not trying to start a flame war.<br />Take the above and this is why Apple FCPX &quot;shoot outs&quot; beat Premiere - most macs made post 2013 have AMD gpu&#39;s, which give the impression that Premiere is &quot;hobbled&quot; by comparison.<br />It&#39;s, sort of, true. But its not because Premiere is poorly written or &quot;old&quot; code, its because of the hardware Apple have chosen to put in their macs.<br />Even the 2011-2014 macs that DO have the (teeny, weeny) &quot;mobile&quot; version of a discrete nVidia gpu, they don&#39;t have CUDA enabled &quot;OOB&quot; (out of the box) - you have to jump through some hoops to get it recognised by the gpu sniffer app built in to Adobe CC.<br />p.s Premiere CAN also use &quot;Quick Sync&quot;, but not nearly as strongly as FCPX."}, {"text": "I use a MacBook Pro with a quad core i7, 16 GB of ram, 512 SSD, and a Nvidia GPU. I use a 4 TB Thunderbolt raid for editing. I tried Final Cut X but my bread and butter is long Multicam shoots. With FCX at the 45 min mark the preview monitor was no longer showing me the selected camera. I had the same problem when using a new Mac Pro. In Premiere Pro I have no issues like this. Usually I have three cameras and the clips can be up to 2 hours in length. FCX looks interesting, but I need the rest of the CC anyways. I shoot everything in ProRes LT. Gerry in Calgary"}, {"text": "What camera was this shot with ? Stunning!"}, {"text": "I don&#39;t think it&#39;s relevant to title this PC vs Mac for video editing (use an editing software that can be used on both Mac and Windows) but Nvidia vs AMD. most content creation applications will favor one over the other. Most of the 3D applications I use favor Cuda in Nvidia cards over OpenCL in AMD cards. Your desktop and laptop use an Nvidia card and your Mac has an AMD card.<br /><br />I find this VS video to be irrelevant until all 3 contenders are using the same brand video card and try this VS match again. Sorry but I have to give this video a thumbs down."}, {"text": "Convert your workstation of to a hackintosh.  You get benefits of Final Cut and the modularity of a PC"}, {"text": "How about iMovie?"}, {"text": "Obviously a macbook would have less trouble since the software for final cut is optimized and only available for macs and macbooks lol."}, {"text": "Try Final Cut Pro on a Hackingtosh. PLS!!!"}, {"text": "Mac mac mac"}, {"text": "APPLE WAS KINDA BETTERY SISTER THINKS APPLE SUCKS"}, {"text": "You mean mac products are better"}, {"text": "Thank you! A Great comparison! )"}, {"text": "That&#39;s unfair mate, using a high end beast PC against a useless MacBook is just unfair. At least use an upgraded Mac Pro because Mac Pro is very similar in performance to a gaming PC"}, {"text": "problem is that final cut is weak on actual video editing features that are used all the time by video editors - which means that heavy duty projects are not often done in final cut"}, {"text": "Damn...I&#39;m triggered now...What is the prices of thsoe PCs and Macs?"}, {"text": "Great video,  though I think the results can be a bit misleading. The MBP with Final Cut is extremely fast due largely to the background rendering feature. Granted, it&#39;s a feature that definitely needs to be accounted for,  because obviously one should use it if they have it,  but is there a way to test FCP without using the background render feature,  so you can compare full,  no-background work render times between Final Cut and Adobe Premier?"}, {"text": "mac is slightly better cuz I have no game in it so no distraction :D"}, {"text": "Mac vs. PC ::  These days it really doesn&#39;t matter. <br /><br />It&#39;s all about personal preference and what individuals can afford.  PERSONALLY; I feel that for creative professionals, (especially video editors) I think the MacOS environment is way more stable than Windows 10. In the last month I have had more issues with my Windows 10 machine than if I use the iMac&#39;s at my college for editing, and these Macs are open to all students.  Here&#39;s how I choose to look at things:  Mac OS = For Creative Pros (If you can afford it)  &amp;  Windows = the cheaper route for sure, but mainly for pros who want to play games when they need some down time."}, {"text": "Wut kind of camera are you using for recording your video?"}, {"text": "I&#39;ve been editing professionaly for a few years and used FCPX, PP and Avid. for editing video, you face a lot of issues with FCPX because how limited the software is. this video doesn&#39;t really talk about actual editing. video stabilising isn&#39;t &quot;editing&quot; it&#39;s an effect. <br /><br />try to do a 5.1 mix in fcpx, it will confuse you. try adding titles in FCPX. it will lag."}, {"text": "I wonder how would Premier perform on an Apple? Also, how would Final Cut Pro perform on a PC? Would there be a significant change or not?"}, {"text": "Bought a macbook pro just for video editing when I graduated high school. This purchase was probably the best I&#39;ve ever made. I love the workflow and the OS on these laptops. I used to edit on a PC my whole life up until then and I could not stand windows any longer. It really is your personal preference."}, {"text": "I think it all boils down to - preference.  I will say once you go Mac, you rarely go back- to PCs.  For video and something not spoken of much - reliability. I run 3 Apple Machines. But my videos make me money so I am not as price sensitive as say an hobbyist would be, nice video my my dude!"}, {"text": "Windows Movie Maker is crap."}, {"text": "has anybody said that you look like Chris Pratt? lol"}, {"text": "final cut ftw!"}, {"text": "Oh my god this is completely unrelated to the topic of the video but i absolutely love your hair!!! What products do you use?"}, {"text": "Nice review, any possible review on Razer blade 2016 vs mbp in video editing and multimedia content?"}, {"text": "Dude, you look like Peter Quil"}, {"text": "Sadly it&#39;s all turning out to be pathetic for the pc. Especially linux aspirants.<br />Fucking optimisation... You can use a 1080 but you won&#39;t get the performance you should with hackintosh ie if supported.. Because apple still stuck on old amd hardware..<br />Same with consoles. Old pathetic hardware and yet fewer crashes thanks to closed environment and optimisation ...<br />We need a hardware manufacturer who can in one fell swoop destroy the competition in optimisation with linux.. WHo is actualy commited to Open source. And the linux community needs to get out of there bubble and enable two modes of operation.. One where noobs can&#39;t break shit and another where it&#39;s as crazy as arch&#39;s customisability..<br /><br />How can such pathetic hardware beat our master machines.....<br />Have to give it up to Apple..<br />iphones cameras auto mode yet has no competition.. (AUTO!)<br />and this... ffs"}, {"text": "MAC=trash n toss imo"}, {"text": "Adobe&#39;s optimisations are about as good as smoking is for your lungs. Unstable as hell, too.<br />I think it&#39;s hard to be surprised when software created by apple runs smoother on an apple pc than 3rd party software... Basically, if you want to work in final cut pro, (which is only available on a mac anyway), you&#39;d need a mac, but for anything else the PC wins, yeah?<br />I also think that using final cut pro in the comparison with then only adobe premier on pc is odd. In this case, why not use AVID or something similar on PC then? After all, AVID and FCP are the gods of editing. Premiere does not compare to these guys."}, {"text": "Final cut pro suck, why don&#39;t u make tests with Avid or Davinci resolve? oh I forgot, Ur not an actual professional and probably grading is in a far horizon for u, what matters is posting little cute takes using a slider of yout macbook pro or your led lighted working station for the publicity. Getting tired of amateurs like you posting rubbish on YouTube misleading people."}, {"text": "Great video! I personally built a PC dedicated to video editing and saved tons of money. People may complain about Windows 10 but it runs quite smoothly and reminiscent to Win7 especially with a decent SSD and 32GB of RAM!"}, {"text": "My render time for a 4 minute video I made last night was 4 hours, holy fuck I need to invest in a new computer"}, {"text": "Thank you! Great video!"}, {"text": "Mac Wins In editing. Windows Wins In Gaming."}, {"text": "so which is the winner?"}, {"text": "May I ask what camera did you use for shooting this video,it just look fantastic!"}, {"text": "Please make a video comparing the Eurocom  and the Macbook pro... Many thanks!!!"}, {"text": "PC lover freaks out"}, {"text": "MAC FTW!"}, {"text": "worst file handling by fcp, premier pro works with 6k without chocking. n I don&#39;t want to waste money on apple instead I upgraded with more powerful graphics card."}, {"text": "god i hate people that try to warn us about the comments section dude just stfup and get on with what your going to show us noone gives a fuck we all know people talk shit on here"}, {"text": "Nice video. Subscribed."}, {"text": "Awesome, I had no idea.  Premiere Elements runs horrible on my macbook pro.  I have to edit mostly by sound because the video is so frozen and choppy after using it for a couple of minutes."}, {"text": "pc ftw"}, {"text": "Now show us Fallout4 on that MacBook Pro ;)"}, {"text": "What u think, what is the best laptop under 1000$ for non professional video editing? Also I started my campaign on june 19 but as i see noone wants video editing... i thought there were people who needed my help and i would get something from that. It got swallowed by other thousands of posts that people make every day on indiegogo...<br />&quot;Video editing Tool&quot; on Indiegogo <br /><a href=\"http://igg.me/at/jU78qD7qGek/shre/14415441\">http://igg.me/at/jU78qD7qGek/shre/14415441</a>"}, {"text": "I heard the Final Cut Pro is expensive. How much is it though?"}, {"text": "Nah mate, that shitty Macbook doesn&#39;t have anything on my GE72 Apache Pro. I can run movie maker and youtube editor like a boss"}, {"text": "I belive that if you are working for tight deadlines like Tv daily shows you should use a mac - final cut, on the other side of the spectrum I think if your doing something more cinematic like with alot more time like a short-film or feature film, premiere has some efects that are more into that type of edit. just my opinion."}, {"text": "I&#39;ve been looking for a video like this . Lets see if you can answer my questions"}, {"text": "just one minor complaint. Your PC ist not a Worktation! It is an i7 6700K on a consumer socket. i dont know why but anyone these days seems to call a PC they use for other things than entertaining a Workstation.<br />A &quot;real&quot; Workstaition wold tipicaly be based on some kind of a Server platform often make use of SMP (more than one physical Processor on the Board) have enourmous amounts of memory. Deliver at least 4 times the performance of youur consumer system and cost a lot of money. <br />So why do you call it Workstation call it PC.<br />Today a &quot;realy powerfull workstration &quot; Wold tipycaly be using 2  12 core Processors for a total of 24 Processing Cores and 128 GB of Memory... And dont get me wrong i am not saying that you need this for Viedeo edting because you dont!<br />But it sounds realy odd to me when somone anounces i am going to drive my &quot;SUPER HIGH PERFORMANCE&quot; Sportscar and then opens tthe door of a VW Beatle."}, {"text": "Sony Vegas pro..."}, {"text": "how can i afford a macbook without selling a kidney?"}, {"text": "Excellent review!"}, {"text": "How efficient did the Mac handle 4K video? Was the playback in the timeline choppy or smooth?"}, {"text": "nice"}, {"text": "Where did you get the skin on the MacBook?"}, {"text": "so mac is better"}, {"text": "This Guy writes Mac vs PC in a video editing. But MacBook is a laptop and PC is a laptop. or are i&#39;m having wrong???"}, {"text": "Is there a way I can get one pc to run both windows and Yosemite cause I wanna game on Windows but edit with FCP"}, {"text": "One question that I am interested in is, what about the mac vs hackintosh  in final cut and premier pro and after effects ? what would be the results. <br />If you can please test it with a high end hackintosh for final cut vs premier pro vs after effects . I think that would be interesting to see.<br />btw i think optimization is king. great video :)"}, {"text": "Micosoft, get Vulkan APIs baked into Windows. Adobe; optimize to these changes in Windows. BAM, just like that adobe would be getting better results. Its still a surprise to me that Windows does not  have a low overhead GL like METAL on OSX"}, {"text": "It would be nice I Adobe would optimize their software better. This makes me wish I could get final cut on my Surface book"}, {"text": "is gpu an important factor for video editing performance? I&#39;ve heard that the gpu doesn&#39;t matter that much, and that the cpu is actually the main determinant of render times and other video editing performance metrics...."}, {"text": "This is a lovely idea, mate. Love your production. Super clean and razor sharp.<br />Please try your best to compare Apples to apples here, Dimitri. Would appreciate it if you could compare FCPX on Mac and FCPX on a Hackintosh PC so that we know for sure whether it&#39;s the hardware optimization within the Mac environment or FCPX that results in the victory for Apple."}, {"text": "Great test.I&#39;ve open my e yes/mind ;) ...Wondering What a MacBook Pro and FCPX can do with a egpu such sa gtx 1080"}, {"text": "Hi, can anyone help me...<br /><br />For Final Cut Pro X, the keyboard shortcut &quot;cmd-9&quot; is to bring up the background tasks window. <br />What about Premiere Pro? Is there any such window for viewing what&#39;s happening in the background? <br /><br />Thanks, pls reply me here."}, {"text": "Would like to have seen comparison with the background rendering turned of...<br />Then we are talking apples to apples..  Otherwise it is not a proper comparison.  <br />For example, a lot of people turn it of as it EATS disk space.  And many don&#39;t care about render times, they render over night anyway."}, {"text": "When will prerendering will be available in Adobe premiere?"}, {"text": "Hey Dimitri, could you do a hackintosh vs the mac? really curious about the results with each of them using Final Cut Pro"}, {"text": "Nice video. Can you do something like this with Photoshop too?"}, {"text": "Macs will always rein supreme in photo, video, music editing and everything non gaming, and battery life, resale value, support, better screens, OS (OSX) way more productive and efficient, lightweight and slim body and have superior programs like Final Cut Pro and others"}, {"text": "Dope Video"}, {"text": "Nice gaming laptop now where&#39;s the workstation..."}, {"text": "Wow man! This really helped me decide which to get! I will most probably get a MacBook pro 13&quot; because of the time frame i have to get it is rather small but this has really ended my debate on what laptop to get! Thank you :)"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23hatersgonnahate\">#hatersgonnahate</a>"}, {"text": "what about working on a 15&#39;&#39;?"}, {"text": "But what about FinalCut on a PC? Or even an Ultrabook?"}, {"text": "ok. pc win. everybody can go home now"}, {"text": "I&#39;ve found the optimal solution to give the best of both worlds is to build your own machine and then install MAC-OSX on it. For much less than the cost of a genuine Apple device I have a 6 core XEON Processor, whopping great 64GB RAM, a RAID Stripe video editing area consisting of 6 500GB SSD drives giving a sustained nearly 2000MB/s read and write throughput and two 6TB traditional hard disks in a mirror which the STRIPE is copied over to a couple of times a day as the chances of the stripe array failing is a lot higher than a single disk failing. It has two NVidia GTX980 video cards in SLI and the machine absolutely flies. It is really reliable and the only thing which I cannot use is iMessage as the device is not genuine apple hardware. Out of interest I briefly installed Windows on the same box before putting OS-X on there and the couple of tests I did with Premiere pro indicated that OS-X was more efficient as they completed more quickly on OS-X than windows."}, {"text": "this is a brilliant video and I really appreciate your balanced approach to topic"}, {"text": "okay it has come to this I agree PC is best for everything but video editing MAC is good just for editing"}, {"text": "whats up with sony vegas??"}, {"text": "Great Quality  ."}, {"text": "Premiere is trash"}, {"text": "So i am actually glad that the macbook pro did come out well in this test.<br /><br />What i noticed a lot is that people always look at the spec sheet. When i see your Workstation vs the Macbook pro. I had the exact same setup (in 2009 i bought a Macbook Pro), i was in the same situation as you. It&#39;s just a matter of time that you will go full mac side if you decide that you like OS X and the eco-system and everything around it. If not, well, then you just go back to your workstation. But really i am so happy to see this.<br /><br />So you just need to know, it&#39;s not always the highest cpu or ram that makes it go faster, it&#39;s also the software. And it&#39;s the exact same thing with iOS on an iPhone. Yes, samsung phones have octa cores and 4gb ram etc... But it doesn&#39;t necessary means that it&#39;s better (faster).<br /><br />Your video proves that, and i just hope people look a bit more to that too :-)"}, {"text": "Dows anyone know if archicad or autocad are also this optmized for macbooks?"}, {"text": "Can you comment on disk read speeds across the 3 machines ? I am curious how much is driven by the crazy fast disks on Mbp 15 512?"}, {"text": "so...it&#39;s a proprietary software issue, not a hardware issue."}, {"text": "I love his hair omg"}, {"text": "Some quick google searching has found me the answer as to why this is the case. It&#39;s because Final Cut Pro X is extremely good at using quicksync for rendering. If you look up PP on Windows vs PP on OS X vs FCP X on a hackintosh, PP on windows is first and FCP X on OS X is last. However, on a machine with an iGPU, FCP X is number one, followed by PP on Windows. Premiere Pro is in the end more optimised for Windows."}, {"text": "Personally I like Final Cut Pro better. It&#39;s expensive, but it has the simplicity of Apple, while still being really advanced.<br />Apple has made a lot of great apps so far (for the Mac) that work great on their own devices.<br />Pages (Apple version of Word) is just easier and makes way more beautiful documents. It&#39;s also way cheaper.<br />Keynote (Apple version of PowerPoint) makes SUPER beautiful slideshows. The sad thing is, you really need to use it on another Mac, because if you open it in PowerPoint, everything that made it so nice disappears.<br />And Numbers (Excel) don&#39;t know cause I&#39;ve never used it as I only learned the Excel functions, so I use Excel.<br /><br />But just the basic iMovie, FCP, ... so many apps really get the job done for a low price (except FCP) or even free (the entire iLife and iWork package come for free on Macs bought since 2012 I guess).<br /><br />But Windows is also a great OS!<br /><br />We need more broadminded people like this Youtuber."}, {"text": "Great video. Thanks. By and large, the great picture boils down to this: reviewers out there (I call them &quot;garrulous, arrogant pricks&quot;; some are free lancers [you mentioned one... the one with the annoyingly, a squeaky voice... you know...] and some are associates to known media) miss the point and surprisingly enough they won&#39;t make the proper rationale among devices and tasks. Ultimately, I guess that it has to do with their lack of awareness or their intentional bias and their need to be blabber-mouths."}, {"text": "Thanks for the comparison!  I really liked this.  I was using Cyberlink Power Director until I started using 4K video and it choked no matter how fast the PC was.  I switched to  Premier mostly because I have a PC, but also because the reviews I read said that Final Cut was not that hot.  I am pretty impressed with your results from Final Cut.  I really don&#39;t care that much about final rendering times. What is important is that the editing PROCESS is smooth!  I have an 8 core processor on my PC and Premier still has a little trouble sometimes with 4K, but not enough to be a big problem.  At least not yet!"}, {"text": "+HardwareCanucks May I know where you bought your case for your Macbook pro?"}, {"text": "I&#39;m a Mac user with a 2012 MacBook Pro and I&#39;m thinking which will be my next computer and also if it will be a pc. But seeing this I&#39;m pretty sure that a Mac worth it&#39;s money. Thanks for digging more in LTT and TLDs comparison !"}, {"text": "Probably the main reason the MacBook Pro is so much faster is because it uses a proprietary NVMe SSD."}, {"text": "Need help choosing a mac, I know I want a 15inch macbook pro, but I don&#39;t know if I want to get the mac book that provides a dedicated gpu or just a macbook pro 15 inch with just a maxed out cpu? Any thoughts?"}, {"text": "hey! nice video:) could you give me a symbol of your PC case which is showed in 35 sec. ?"}, {"text": "Dat Soviet propaganda in the background :)"}, {"text": "Sony Vegas Anyone?"}, {"text": "This is not eye to eye comparison, you mentioned that your macbook has a PCIE SSD (m.2 probably) which is way way faster that the other SSDs in your other computers, I would pretty much say that the bottleneck here is your SSDs, and that the more powerful computers can&#39;t really use their power fully"}, {"text": "That is amazingly fast. I haven&#39;t used FCPX in some time, because I&#39;ve adopted Adobe Premiere Pro CC.  Editing in Premiere makes more sense to me, but that render time make FCPX worth another look."}, {"text": "if only fcpx was a decent program to use....."}, {"text": "When the question is which machine and program will get things done, it&#39;s clear: Apple and Final cut pro. Hooray for optimization."}, {"text": "pc"}, {"text": "Now i wander how much faster A New iMac is vs this MacBook pro ."}, {"text": "and if you try premiere pro on the mac?"}, {"text": "only fcp is good at mac... rest are bad"}, {"text": "only fcp is good at mac... rest are bad"}, {"text": "so basically the bottleneck is the software optimization and not the hardware limitation? am i right ?"}, {"text": "Try PowerDirector 14 which is so fast rendering and quite good video editing software for the price its offer."}, {"text": "HEYY, compare same price things"}, {"text": "Hi I have a 13in retina MacBook Pro and in a video editor and photographer but every now n again my drive gets full and I know bout daisy disk and omni sweep disk cleaner but in the ms book pro u used what size of drive is it pls ? As mine is only 121gig flash drive and maybe 8gig of ram wu has sounds stupid as if away somewhere for example I take a loads of photos and it will soon take up the storage etc n I do use externals too then I have a iMac too with a 2tb drive in which does me me good which really I wish my MacBook Pro 2014 model would have a bigger drive in to make me feel good cheers"}, {"text": "He bought a Macbook Pro… out of curiosity. Hurts the wallet."}, {"text": "with lightworks being on Windows Linux and OSX I would like to see a showdown between the three using lightworks as a neutral ground for testing"}, {"text": "Did he say maxed out to the teeth?"}, {"text": "yeah, but what about if you dual-booted you main pc has a hackintosh? because that is also an option, you get the price of a pc, get windows which is great for everything else you want to do, and when you want to edit switch or to OSX final cut for editing."}, {"text": "keyboard warrior"}, {"text": "I don&#39;t use video editing software, so I&#39;m not super familiar, but from what I&#39;ve researched, Adobe After Effects supports the Background Rendering feature seen in FCP. Would you do a comparison using AE with the background render feature?"}, {"text": "Everyone needs to own one good Mac and one good PC in their life to understand their value in different aspects :) Neither is ideal but both are amazing."}, {"text": "I use to really hate apple, but ever since I was a child I have had a draw to video production<br />in my sophomore year of high school I joined the video production class, all of the computers were macs running FCPX.<br />At first I mostly would just edit at home on my PC, but after a while I started to use FCP more and more, and loving it. I hackintoshed a laptop after a while so I could continue to edit at home but using Final Cut. I am now on my way out of high school and I am probably going to buy a mac before college, all thanks to the beauty of Final Cut Pro."}, {"text": "I wouldn&#39;t say your laptop was max out. The top laptops have GTX 980M&#39;s in them"}, {"text": "Premiere Pro is the only video editor that works on my single core 2.47ghz celeron!!! For some reason I can preview 1080p video in real time WTF!!! And yea I have ATI 4550HD!!!"}, {"text": "You know the reason why LOGIC and FINAL CUT is MacOSX only , because FUCKING APPLE BOUGHT THOSE COMPANIES TO LOCK PEOPLE INTO iOS/Apple/MacOSX"}, {"text": "So really this video is:-<br /><br />Final Cut Software (MacOSX ONLY) on an craptop vs Standard Windows PC with Windows.."}, {"text": "what&#39;s final cut?????"}, {"text": "....kdnlive linux"}, {"text": "You did it wrong, right way to use OSX is to get a hackintosh :)"}, {"text": "that macbook is a BEAST !"}, {"text": "I prefer Unix based system. Currently, I&#39;m on Linux. Pros: Unix based systems are absolutely fantastic for development in comparison with Windows. Cons: Linux is horrible when it comes to frontend web development (luckly, I mostly do backend), bad program support, inconsistent and unstable desktop environments. When Mac comes on my &quot;buylist&quot;, I&#39;ll definitely buy it. Unix based system, works out of box, stable and consistent."}, {"text": "Different tools, for different jobs. Use the best tool, for your needs."}, {"text": "So if you would choose one system which would you choose for video editing?"}, {"text": "With the Mac you are paying for the superior industrial design and material quality.<br />PC&#39;s are usually always more powerful for the buck."}, {"text": "So funny to see that pc case of the year is just a clone of the old Mac tower from 5 years back ."}, {"text": "If you just want a simple and usable computer, and you don&#39;t want to do a lot of research, get a Mac.<br />However, if you do your research, and pinpoint a specific model (or range of models) of PC that you want, and know exactly what downsides and advantages it has, a PC can be much better in <i>some</i> cases."}, {"text": "FCPX use H.264 &amp; QSV<br />Premiere Pro:<br />not use NVENC (nVidia plug-ins) and QSV (plug-ins)<br />Warp Stabilizer - optimazation for background rendering not speed<br /><br />Mac Pro (not QSV) vs MacBook Pro (QSV)  .... ^)"}, {"text": "Would fcp work as well on a hackintosh?"}, {"text": "sequence 3 minutes, 2 seconds exported?<br />Impossible. Final Cut must have a large temporary files, but it is impossible to export in so little time. Or you have pre rendering anything before export.<br />Moreover you have not taught as exported have, I would like to see the settings you put into each one, I do not think the difference is so great."}, {"text": "Very cool, i would love to see a part 2, with a hackingtosh, and a video quality comparison."}, {"text": "I was about to sell my MBP to build a Workstation until I saw this video. I&#39;ve never tried FCP, only iMovie but it didn&#39;t occur to me that FCP is just as efficient in utilizing mac hardware as iMovie. My main reason for switching back to Windows is the very limited storage space of 256GB on my MBP but I could always upgrade to a 1TB SSD for $600. Still quite a steep price in addition to $299 for FCP but if it means being able to keep OS X, I think I will reassess my options. <br /><br />I was looking at a $1500 workstation build (I was planning to sell my MBP for $1400) with most of the budget allocated to CPU and SSD storage solutions. But judging from the benchmark results which you carried out so BEAUTIFULLY... I think i&#39;m willing to dish out the extra $900 to just upgrade my mac (or if not then just buy FCP and rely on my 256GB SSD as a cache and USB storage for archive. GROSS)<br /><br />Decisions desicions desicions... could I ask for your opinion on this?"}, {"text": "this test is unfair. you have to test apples final cut against windows movie maker to have an apples to apples comparison. <br /><br /><br /><br /><br /><br />I&#39;m joking by the way."}, {"text": "You can edit faster but can game on a mac?"}, {"text": "im more of a pc guy but if i ever start doing youtube ill probabaly use a mac for video editing with final cut"}, {"text": "Super helpful I think I&#39;m even going to go with the 8 gig of ram version!"}, {"text": "The reason the MBP is beating out your PC laptop in Premier in some cases is because your laptop has a Maxwell GPU. Nvidia gimped the Maxwell line of cards when it comes to compute power to allow it to handle games better. Your MBP has an AMD card, so it does not run into this issue."}, {"text": "+HardwareCanucks Also I bought a Macbook Pro 13&quot; i5 2435, 16GB DDR3 1600MHz, 750GB <br />For $150 So the price is not that terrible."}, {"text": "You bought an Apple.  You are dead to me."}, {"text": "so basically what it comes down to is adobe has dropped the ball in comparison to final cut when it comes to rendering n all that because final cut can do that in the background while you are working. that&#39;s it plain and simple yes pc is much better overall but final cut kicks major ass. is it worth spending all that extra money for an apple. well that depends on what you are doing or if you can build a hackintosh. i would say for the video editing side of things have a partition  for osx and use final cut for most things until adobe catches up and everything else run it on your preferred os dont waste your money on apple"}, {"text": "two words intel quicksync"}, {"text": "I only bought a macbook pro for logic pro and final cut pro. absolutely everything else is done on my custom pc or my xps 13"}, {"text": "Very interesting <br />I&#39;m glad I went for the MacBook <br />Rendering is a breeze on fcpx <br />Adobe ahhhhh long render"}, {"text": "Linux mint, Mac Skin.. You can look like a douchebag for cheap"}, {"text": "the fact that final cut pro is much faster can&#39;t really be denied, but i don&#39;t think it is 100% fair since the devs knows exactly what hardware the users are gunna be using, and on the pc side adobe premiere can&#39;t really predict if i&#39;m gunna be using an AMD gpu or an Nividias."}, {"text": "Apple wins hands down free garageband and Imovie And windows oh hell no!!!"}, {"text": "Unfortunately the most essential question hasn&#39;t been answered: WHY is Final Cut Pro so much faster than Adobe Premiere? Shouldn&#39;t there be any drawbacks?<br />Maybe someone can elaborate on this ..."}, {"text": "I think adobe need to better optimize Premiere. Even with a high end pc, 4k footage still struggles to run smoothly, and it just hogs up all your ram."}, {"text": "cud you do a review between your mac and Hackintosh (on your workstation pc) about Premiere and FinalCPX?"}, {"text": "Should I give up editing 4K videos with my 5930K and continue with my MacBook Pro (mid 2012 w/ i7)? Sounds really strange to me... but I&#39;ll try that."}, {"text": "what does the &quot;r&quot; stand 4 in &quot;rmbp&quot; <a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=3m56s\">3:56</a>"}, {"text": "Another Awesomee Video By Demitri Kudos Bro"}, {"text": "adobe isnt the only editing software in existence"}, {"text": "adobe isnt the only editing software in existence"}, {"text": "What if you dual booted OSX on the workstation? How would final cut perform on the better hardware?"}, {"text": "Adobe Premier and Maxwell GPU, disaster."}, {"text": "Very helpful! I have a Macbook pro and a PC and was wanting to start using Premier or Final Cut. This looks like a no brainer!"}, {"text": "That is okk!!!<br />But there is still big debate in Mac Pro users and iMac/Macbook users for Video editing!<br />People really think that Xeon is the best processor for such tasks. Is it really true? Plz debunk this myth too. Xeon Mac Pro vs i7 iMac. And post results for both FCPX &amp; Première and also add your PC line up in stats for the ultimate comparison. <br /><br />There are myths that iMac processes video editing much better than Mac Pro which is almost 2x expensive and i think there is something to do with Processor.<br /><br />Plz debunk this myth too!<br /><br />Overall awesome job and super awesome content..."}, {"text": "This is also the best argument for consoles over pc: standardization of hardware allows for considerable optimization of software. I like both my Xbox and my 980ti. However in some aspects, the pc is just so excellent. I mean, look at Skyrim modding communities for just one example"}, {"text": "What about using a Hackintosh and see whether the better hardware running OSX with Final Cut and Premiere Pro is better than the Macbook and the Windows systems?"}, {"text": "Can you do a similar video for a Hackintosh, to see if the hardware/software optimization your talking about is still there."}, {"text": "And why not compare finalcut and premiere both on the mac????<br />Dah!!"}, {"text": "Which facebook messenger app you´re using? it seems that i´m using the same, but the icon color is differente..."}, {"text": "the way u said &quot;i bought a macbook pro &quot; made me laugh af lol"}, {"text": "What PC did you used to edit this video?"}, {"text": "I prefer Macs for editing and btw use Offline files for Editing so you can use low quality for editing then when you export it with the high quality video"}, {"text": "Subscribed!!"}, {"text": "I just love using Final Cut. It is both fast and easy to learn so you can spend more time being creative and less time learning to use some other software."}, {"text": "Nice video. How does Adobe Premiere compare to Sony Vegas Pro?"}, {"text": "Final Cut sucks ass."}, {"text": "ik everyone here will say pc and i will too because mac is shit and will stay shit like wtf apple you havnt updated your most powerful pc (most expensive, theyre all shit) in 3 YEARS."}, {"text": "The hardware is essentially the same. This just tells us what graphics professionals have known for the past decade: Adobe sucks. 22 years using Photoshop, scratching my head wondering where the competition is..."}, {"text": "good job apple ...<br />We will need some more time to do a deeper &quot;research&quot; for bashing you. Btw, great video Dmitri!"}, {"text": "Really it&#39;s software differences that come into play here. Final Cut is pretty damn good at rendering but, premiere has more features. I prefer windows to Mac OS, but final cut is a great program."}, {"text": "Did you configure Premier pro to use your graphics card as the processor??????"}, {"text": "So what your saying is pay triple the price for a computer that will edit video faster but will do much less in the real world LOL<br /><br />Apple will love taking your money from you"}, {"text": "Very very very good job, but please, can you tell us which camera did you use ? Photography is fan-tas-tic"}, {"text": "It&#39;s all in the software. I wonder if stuff like this will convince Windows or Linux program developers to do better at optimization. I mean it&#39;s embarrassing."}, {"text": "Eurocom :D I want review of this"}, {"text": "Great poster on the wall! &quot;Kak rabotal tak i zarabotal&quot; -)"}, {"text": "Hi, my question is what camera are you using? Is it a DSLR? What about the lens?"}, {"text": "I like both"}, {"text": "With Final Cut X I don&#39;t have to think what I&#39;m doing, I can focus on the content and it keeps me in the flow."}, {"text": "It seems that something&#39;s gonna change in Premiere soon:<br /><a href=\"http://blogs.adobe.com/creativecloud/whats-coming-next-in-adobe-premiere-pro-cc-and-media-encoder-cc/\">http://blogs.adobe.com/creativecloud/whats-coming-next-in-adobe-premiere-pro-cc-and-media-encoder-cc/</a><br /><br />Hope so... ;-)"}, {"text": "its a $2000 macbook for petes sake! it had better make me breakfast in bed"}, {"text": "where on earth are humans running to?<br />is 8 minutes TOO MUCH TIME  to render a 4k video?<br />i mean you could take a piss, check your mailbox &amp; you&#39;re done! the variation in milliseconds and minutes by a fair margin is hurting many peoples perception of what a good machine is.<br />Yes, the Macbook is better optimized for its software. but until the margin is up to 20minutes, this is nitpicking"}, {"text": "What skin is that on your macbook pro? I like it!!"}, {"text": "This is Final Cut vs Adobe Premiere"}, {"text": "How is this possible? What does FCP X use in terms of hardware? Did you use GPU acceleration for the PC?<br /><br />Very interesting video. I&#39;d love to see more in depth analysis of the video quality, codec availability and hardware usage during all of these scenarios."}, {"text": "HACKINTOSH"}, {"text": "fuck"}, {"text": "another proof that adobe is sh*t, final cut is impressive"}, {"text": "no sense fight 2 different software. te true fight would be premiere on pc vs premiere on mac"}, {"text": "That Macbook seems a really nice little machine but damnnnn it&#39;s expensive."}, {"text": "I&#39;m going with mac"}, {"text": "What FCPX is doing in the background is transcoding your footage to ProRes, which will work MUCH more smoothly in an NLE than camera raw (most likely h264). For a more accurate test transcode all your camera media on the PC side to DNxHD and then post results."}, {"text": "so bottom line, mac and windows are as fast in premiere, just final cut is faster"}, {"text": "Okay FCP does have its advantages but how does it compare with the vast amount of tools/functionality Adobe have on Premiere, seriously intrigued by what FCP is capable of, I was always under the impression that Premiere was far more superior"}, {"text": "ez"}, {"text": "The only thing i don&#39;t like in FCP X that when I edit a video putting some text on it , no enhancement , NOTHING .  Just a text !!! and the original video size is 120 MB , the new video becomes 1 GB !! any suggestions ?"}, {"text": "why didnt you test imovie? :o"}, {"text": "Well, Isn&#39;t MAC a Personal Computer?  Just name it for example: Windows machine vs Mac OS, isn&#39;t that more correct?"}, {"text": "kudos to you, spending your own money for the enlightenment of others."}, {"text": "COUGH COUGH Optimized?!?!<br /> *Uses two gigabytes of ram at start*"}, {"text": "This video is about OS and software optimization, and has a deceptive title. A hackintosh laptop is a better value than the mac and will run at the same levels as tested in this video so you have paid more for the same productivity when buying a mac...., <br /><br />IMAGE IS EVERYTHING is so having  a macbook is just like owning a lambo or bmw. We are allarriving at the same destination but there are speed limits (you have to think while editing=creative) and you are getting to the same final destination. <br /><br />If spending more money on hardware you could get for less money makes you feel more creative than its worth the $$."}, {"text": "only premiere on pc side! what about other editor like sony vegas pro or avid? video editing comparison on mac vs pc would be incomplete without that"}, {"text": "Welllll lets face it, hackintosh will definitely give even better performance for a cheaper price than the mac version, but i believe the tradeoffs with compatibility being restricted to certain mobos and GPUs"}, {"text": "How does your Hackintosh handle it?:)"}, {"text": "PC guy here, of course. When it comes to editing video or even photos (no actual problem with photo editing in my PC, just rather keep all my work stuff in one place) I use my Macbook pro. final cut pro really is that good."}, {"text": "What OS are you using... that is quite important information"}, {"text": "if you have balls, get hackintosh on same powerful PC and compare same powerful pc but against osx and windwos"}, {"text": "how I&#39;m curious how performance would be for finalcut pro on a hackintosh. perhaps best of both worlds? or only good on paper?"}, {"text": "Apple is a thief, make a hackintosh."}, {"text": "Wouldn&#39;t the fact that your MBP is brand new compared to your seasoned Windows machine affect your test results?"}, {"text": "The value for the dollar IS better on a pc, especially a custom built one, optimization can only do so much. if adobe used the same software features on premiere as apple did in final cut the times would probably be better.<br /><br /> That said, premiere and final cut are both good use what works best for you and dont let people talk shite! But do feel free to experiment with the other side if you can afford it."}, {"text": "I use a 13 inch Retina Macbook Pro 2.7 GHz (32 inch monitor at my desk so I can actually work) and have worked with both Premiere and FCP X. I can honestly say from my standpoint if you&#39;re wanting to make very quick projects and want a user friendly interface, FC is for you (also helps only having to pay $300 once for it). Taking it to the next level with After Effects and Premiere is the difference maker for me and I use Adobe for more intense high quality work, but it hurts the bank having to pay a monthly subscription for Creative Cloud. This is nothing more than my own opinion for someone deciding between the two."}, {"text": "What would be AMAZING is if Apple actually let Final Cut Pro X run on Windows, then it would be super fast.  There is MS Office on Mac, Why is there not Apple Pro Suite on PC?"}, {"text": "let&#39;s face it, biggest reason people buy apple is because status. Same reason someone buys a expensive car. That being said, it&#39;s nice to know that there are some justifications to owning a mac."}, {"text": "I run FCP X on PC hardware and it is really fast: core i7 980TI 32 gigs of RAM with SSDs."}, {"text": "I built my gaming pc, Macs were nothing to me I didn&#39;t care for them. But then my parents got me a MacBook Pro, and holy shit its so good, I don&#39;t have a side anymore. Yes its expensive but it is fairly powerful but its solid aluminium everywhere, built like a tank. I use my pc for gaming and when im at my desk, and the Mac at college or chilling elsewhere. Don&#39;t dis before you try because damn I was so wrong about Macs"}, {"text": "DaVinci Resolve for mac is also incredible fast in editing (I don&#39;t know how D.R. performs on the PC side, but it might be pretty good too).  I freakin love it!!"}, {"text": "You got one thing right. Adobe needs to improve(period). And it has, it part because of FCPX.  Times call for a rewrite, just like apple did in its day.  Premier has heritage of a bunch of features from the past that are no longer relative.  Time is so much precious these days, there is soooo much more media to go through and such huge data files, for example."}, {"text": "This vídeo only proves that FCP is better than Adobe Premiere!"}, {"text": "Dmirty, could you say &quot;SUKA BLYAT&quot; in your future videos?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=6m33s\">6:33</a> SOCKS"}, {"text": "We went from FCPX to Premiere and never looked back. All the Pro plugins for broadcasting TV are available for Premiere. Most importantly 4K HDR and H265 is available on Premiere. Lastly Dolby Digital Plus and EX is also included. Optical Flow is another plugin that can replace twixtor. Hardware wise a workstation PC trumps our Mac Pro in editing rendering and exporting times."}, {"text": "But PC is still faster ;)"}, {"text": "what software did he use to edit the video?"}, {"text": "technobuffallo had a very different opinion"}, {"text": "I love my MacBook Air. I want to love others but I haven&#39;t found a good hardware competitor yet that fits my needs sadly. Until then, MacBooks and custom built desktops for life"}, {"text": "As a professional Graphics Designer i&#39;l tell you this. PC are great to have as Render Farms.<br />However MAC OS is a far better environment to work on your stuff before rendering. I use both and my PC is my Render machine."}, {"text": "Why not Windows vs mac, PC mean Personnel computer which mac also are ( some of the first pc where mac after all). I always think this is misleading. smartPhones are also PC by definition."}, {"text": "The one problem that I had with FCPX, even after re-installs and hours of troubleshooting, is that the UI was slow and sluggish. It would take a few SECONDS to be able to alter my overlaying text. Everything was just slow after a few minutes after opening a project. I&#39;m editing on the same model that he tested and premiere works fine. Render time really isn&#39;t that big of a deal if you have good time management or aren&#39;t working professionally."}, {"text": "i like editing on macbook  15ich retina pro    just  cos its a computer"}, {"text": "Well I had a PC and never made videos. I barely viewed photos either because it was so slow. Switching of a MacBook Pro did not limit me. I personally find Apple better. Its simple and has the right amount of stuff I need. Go SUBSCRIBE to my channel if you want to watch photography tutorials. Btw I do not have final cut but I really want it!"}, {"text": "Are you using CUDA with Premiere?"}, {"text": "Does the PCI SSD in the Macbook Pro has anything to do with the results?"}, {"text": "Sony Vegas Pro and Movie Studio are much faster than Adobe&#39;s craptastic software for Windows, that is if you don&#39;t want to sell your soul and freedoms just to edit some video."}, {"text": "Oh my god really? Damn awesome.."}, {"text": "macbook pro is the greatest and most optimize computer ever created in the history of mankind ! PC .. I&#39;m sorry you&#39;re done ! I&#39;m .. well was Pc guy by the way"}, {"text": "Are you by any chance bulgarian?"}, {"text": "I have a 27&quot; iMac and I do get stutter on occasion.  I&#39;m willing to accept that it&#39;s still better than Premiere Pro&#39;s results, but there other factors to consider.  For longer projects there are many features that FCP apparently USED to have that were &#39;simplified&#39; out of it.  Personally I find the &#39;tag&#39; system is frustrating.  Many editors turned to Premiere out of frustration, and if there&#39;s something I can&#39;t do on FCP, Prmiere can usually handle it without any hassle.  Ironically, FCP started on PC, but Apple bought the company after they ported it to Mac.  Now there&#39;s no mention of there every being a PC version."}, {"text": "are people dum sorry butt its a program comparison adobe to just to big on adding new stuff and not performance thats dum on there part apple adds little each couple of  years and performance its not hard ware its how best that program not hardware adobe is just lazy just like Western Digital i love and hate them they are soo good at hard drives and yet so lazy at wdtv is could be the best all they need to speed it up and add more fixes ans add a cloud app on it and 4k ,usb 3.1 A AND C, AC wireless but that dont that just leave people in the dust that wdtv is 10x better the any other tv player out there but WD gave up shame on them. Just like Nzxt doko could be the best better then the nvidia sheld but they only went half way and let every one down."}, {"text": "pc destroyed mac long time ago,this is osx vs windows,they use same hardware"}, {"text": "Hackintosh. Just sayin&#39;"}, {"text": "i dis agree with the results because yo did one desk to p and one laptop"}, {"text": "any one know what type of speakers he use at <a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=6m54s\">6:54</a> pls"}, {"text": "Macs are PCs as well, you use the term wrongly, it should have been Mac Vs Windows not PC... Remember there is linux out there as well, you should test all of them"}, {"text": "What about programmes like Nuke and Autodesk Maya? Are these faster on Mac or PC?"}, {"text": "can you do macbook vs chromebook  ? ;)"}, {"text": "I&#39;m curious for the result if you will use compressor :) apple claims it&#39;s faster than the built in export feature of Final Cut Pro X :)"}, {"text": "Where can I order the wooden skin u have on the Macbook?"}, {"text": "Maybe if you install pci hard drive insted ssd. We can possible have more speed rendering"}, {"text": "The 4k Shots of yourself are from the GH4 ?"}, {"text": "why not install osx on your workstation?"}, {"text": "Adobe has really messed up in the last years, even the PDF reader has problems."}, {"text": "Try FCP on PC. or Windows Live Movie Maker on MBP."}, {"text": "Final Cut is for 1 person and Adobe for team..."}, {"text": "The problem is that workstation CPUs (High-End Desktop i7 and Workstation Xeons) actually have NO graphics card built in because it would take too much die space and fewer cores could be fitted inside."}, {"text": "You know, I actually own a Macbook Pro and I already got to the point where I found out that Final Cut is fast, but your numbers are actually shocking and hard to believe xD"}, {"text": "nice martinica :) that thing on your wrist"}, {"text": "Don&#39;t copy a sequence into another program... It took 7 hours for me to render a 3 second clip with some 3D when I saved an after effects comp and imported it to premiere and rendered it there. Not a bad pc tho. 3.6 i7 and 12 GG ram"}, {"text": "There is very good reason why there is distinct difference between Mac Book&#39;s rendering times vs. others.<br />First check this two pages:<br />Adobe Premiere Pro: <a href=\"https://helpx.adobe.com/premiere-pro/system-requirements.html\">https://helpx.adobe.com/premiere-pro/system-requirements.html</a><br />Final Cut Pro: <a href=\"https://support.apple.com/en-us/HT202239\">https://support.apple.com/en-us/HT202239</a><br />As you can see your graphics cards 980ti and 970M are not on supported list for GPU acceleration, but on the other side R9 M370X is on supported list for GPU acceleration on Final Cut Pro side.<br />I also need to mention one very important thing. Hardware acceleration speeds up the processing of certain effects, scaling, blending modes, and frame rate difference. If your project doesn&#39;t contain those certain elements than rendering times, with or without GPU acceleration, would make no difference. <br />So can you please make another video where you address those variables.<br /><br />P.S. computer with GTX 980 ti and Core i7 is not a workstation computer."}, {"text": "i use a Mac mini (Early 2009) for video Editing:P"}, {"text": "That&#39;s why I prefer Mac!"}, {"text": "Okay, you proved your point that Final Cut Pro  is faster. But what about the universal compatibility of Premiere Pro and the amount of plugins available for Premiere. Premiere works seamlessly with adobe video editing products such as After Effects, which many video editors need for advanced colour correcting, motion tracking, etc."}, {"text": "Very good review."}, {"text": "I use a 2006 Mac pro to edit 1080 and 4k video works great of me"}, {"text": "A mac isnt for gaming, It is for Working and Video Editting, If your getting something for Gaming get a PC If you want something for photo/video editing get a Mac They are both great OS&#39;s some people dont seem to get that every thing has advantages and somethings have Cons. Im not attacking anyone here but all the Keyboard warriors are gona come eat me......."}, {"text": "yep that looks fair"}, {"text": "The pc master race"}, {"text": "man you can&#39;t even admit that final cut wrecks every windows program, just admit it man...."}, {"text": "Yes but can it play Crysis"}, {"text": "problem with final cut pro x is that it is just iMovie on steroids."}, {"text": "that was bad you should compare it with a laptop instead of a desktop"}, {"text": "Anyone else having the video stutter?"}, {"text": "I wish you would have done a apples to apples and but Windows on that Mac pro."}, {"text": "One big issue is if you tested on Adobe CC 2015 there is huge setback as adobe fucked up multy core usage  and it never actually use all cores for export so look into that part as well :)<br />On my 5960x and 64gb ram I see CPU usage around 30-40% and RAM only like half or less used"}, {"text": "Honestly i love Final Cut Pro, Apple is great at optimising their products."}, {"text": "Im a solid mac user, and did not expect that result. i know what software I&#39;m buying now!"}, {"text": "So this video is about software? The argument to buy a PC still remains. Better performance for the dollar, better customization. If you want better performance for your PC optimize your PC or think better before you buy one what your main task will be. Nice video though."}, {"text": "If only they also made Final Cut Pro for Windows :/"}, {"text": "I really think Microsoft and Adobe should partner and optimize Premiere Pro for windows"}, {"text": "I wouldn&#39;t call it pc vs mac but adobe premiere vs final cut. As to me from having seen the results I can conclude that premiere isn&#39;t optimized for any platform and is the main bottleneck of the system, which makes the mac shine using final cut. Once Premiere becomes decent performing wise, apple will need to step up their game. Their survival is the horrible unoptimized editing software delivered by adobe by which they can sell their low performing hardware for an expensive price, yet outshine the higher end pc. If you want the best out of both worlds I would go for a high end desktop PC with a decent bang for the buck and dual boot it with mac os."}, {"text": "Everyone serious uses OS X for editing. That was a done deal fucking ages ago, the software is far superior and it was on OS X first."}, {"text": "Just out of curiosity. Would you achieve better render times if you had a custom built PC with high-end hardware and loaded Mac OS on it via hackintosh?"}, {"text": "PC is pure junk plain and simple."}, {"text": "Adobe needs to optimize their softwares a lot more :/"}, {"text": "I like how the scale is <a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=16m10s\">16:10</a> rather than 16:9 so you can have a full 16:9 window open and the dock and the bar at the top occupies the rest of the screen."}, {"text": "Great video. Thanks."}, {"text": "You could try the iMac 5K, it allows you to view your 4K video in its native resolution with plenty of room for bars and toolboxes."}, {"text": "+HardwareCanucks Can you do MacOS vs Ubuntu Linux???"}, {"text": "Do either one of your machines have a PCIe ssd? The MacBook does and can take advantage of it very well, as you saw. Also, not to take this to a PC vs Mac debate but did you find any other features nicer than your Windows laptop i.e. the glass touchpad, battery life, portability or screen quality?"}, {"text": "It is obvious, you have one company that designs hardware and develop drivers for the same hardware. The communication at low level will be optimized. We can&#39;t comprate Mac with other PC&#39;s in same way, no other company does the same, windows have to be compatible with tons of hardware, and the drivers written for windows dont have the same effort. Just for each processor have uniques particularities to have better performance, eg: In a foor loop to sum 100 position vector,  an i7 have better performance sum 6~9 positions for each iteration. Examples can be given all day long."}, {"text": "coral bro"}, {"text": "Great video, it does illustrate that Adobe are getting more and more behind on a lot of things lately, however what would make this video or possibly another video in future more complete is the addition of other Editing software, not everyone uses Adobe or use Apple hardware to utilise FCP. What would be more interesting is if you used the exact same codec to render for example like xvid assuming both support it and see how each software handles it.<br /><br />Some hardware configurations can&#39;t even use quicksync i.e X99 platform even if Adobe supported it, really interested in seeing how each software utilise the exact same codec just using the CPU and no gpu which includes the intel IGPU quicksync tech from FCP, this will give a close condition comparison to see how things pan out."}, {"text": "Clearly Mac is best. Don&#39;t need a video to tell you that."}, {"text": "I&#39;m a die hard Windows and Linux guy but I&#39;ve been thinking about buying a Mac for a while to try out Final Cut and because I like messing around in Garage Band. Even if I love my new Mac I&#39;ll never be able to switch over completely because I&#39;m a gamer and I love to tinker, I love building PCs but I think I might check out a Mac."}, {"text": "Interesting results yet I&#39;d love to see how does Premiere render on that mac compared to Final Cut, as well as a premiere/Final Cut comparison on a hackingtosh.<br /><br />Nice video!"}, {"text": "21/9 ???"}, {"text": "Dimitri you should have waited for the new macbook line this year.."}, {"text": "With that title, you could have used Premiere for both machines otherwise, it should have just been plainly called Final Cut Pro vs Adobe Premiere. It is kind of misleading"}, {"text": "Many people never mention or over look :<br /><br /> Premier  Pro works with Nvidia CUDA .<br /><br />And <br /><br />FinalCutProX works with AMD OpenCL. <br /><br />that is why the RMBP works so well with FCPX."}, {"text": "How would it work on the lower model without the dedicated graphics card?"}, {"text": "So you bought a MacBook Pro just for the sake of a test. A slap in the face to &quot;normal&quot; people."}, {"text": "how does final cut fair against adobe premiere in terms of encoding quality? That&#39;s also important. Is that the same? <br />And how much is final cut limited in possibilities? And is there an alternative to After Effects?<br />And last, how does the Macbook perform on adobe premiere? (or did I miss that comparison?)"}, {"text": "you didn&#39;t enable CUDA processing, did you? These times are suggesting so much that"}, {"text": "Final Cut <b>surely</b> doesn&#39;t give you such smooth scrubbing with the source or export quality in 4K. It most likely renders it in a much smaller resolution into a quickly readable format, much like how Cineform works in Premiere. And let&#39;s talk output file sizes for those export times..."}, {"text": "I think, this video is more about Premiere VS FCP than Mac VS PC. I&#39;d really like to see, how Mac OS is performing the given task on your Workstation PC (VMs are &quot;allowed&quot; by Apples terms). If you pre-render footage, that&#39;s like cheating. Of course it enhances your &quot;performance&quot; but in a testing envirionment this isn&#39;t render time, if you want to compare Apple VS Mac."}, {"text": "I really like how objective your videos are with actual facts."}, {"text": "Blimey, I would easily go for a self built computer as you could customise it as much as you like, without paying Apple shit loads of money for nothing"}, {"text": "Having a pc with a GNU/Linux machine + a kernel compiled to match your needs, that is the speed that you don&#39;t even get with a mac. For obvious reason Adobe premier and Final Cut are not available on this plataform but In my experience Cinelerra and Lightworks have been working perfect for me."}, {"text": "so for video editing get a mac but for everything else get a pc."}, {"text": "llo"}, {"text": "Sooo the thing that makes a Mac better in editing is not the product itself. It&#39;s the software that makes it&#39;s good. Interesting."}, {"text": "Mac and PC both have their strengths and weaknesses. Photo/ video editing is one of those things where Apple decided decades ago that they would be dominating this field at all costs, so I&#39;d be shocked if the Mac with FCPX wouldn&#39;t win this in a breeze. In turn PCs have been optimized for gaming in that same time. So the old rule of thumb remains: You&#39;re doing creative work? Get a Mac. You want a gaming machine? Get a PC. You want to do office work? Who gives a shit, office work can pretty much be done on any device these days. I do most of my mail/browsing/word on an iPad."}, {"text": "Hacintosh+final cut = good idea?"}, {"text": "PC vs MAC, is such a bad tittle, PC = MAC, PC= a computer with WINDOWS, PC= a computer with LINUX, etc etc.<br /><br />Soooooo your argument is invalid."}, {"text": "Mac vs PC, Brute force vs refinement, Day vs night."}, {"text": "What speakers are those?"}, {"text": "honestly, what&#39;s with the lipstick? I don&#39;t get it."}, {"text": "Personally, render times matter very little to me. it&#39;s everything else that does and one thing is the Adobe integration with Photoshop, audition and after effects which is a very very big deal if you&#39;re working in a team or with multiple assests and want a non destructive workflow.<br /><br />Ultimately if you&#39;re on your own, final cut is awesome, speedy and had all the essentials built in and working well. To get the same feature set, you&#39;re definitely need third party add ons.<br /><br />Premiere seems better built for teams and workflow. I prefer working in premiere and I suppose if it had the optimisation then no one would be complaining. :)"}, {"text": "I have been using Macs for all my workflow for the last 4+ years. Sound and video editing on Final Cut Pro, and Logic Pro X. Rendering huge video while also doing lots of other work at the same time. Always runs amazing."}, {"text": "i love these typse of bideos"}, {"text": "Personally to be &quot;fair&quot; I would have gone &quot;Premiere (MAC) VS Premiere (PC)&quot; or &quot;Final Cut Pro X (MAC) VS Vegas (PC)&quot;. But thanks for the video."}, {"text": "your accent is fucking annoying. thanks for the vid."}, {"text": "So basically Premiere sucks at using the power of your components. What else can we use?"}, {"text": "MORE COMPARSIONS"}, {"text": "Hit them PC boys with <a href=\"http://www.youtube.com/results?search_query=%23facts\">#facts</a>"}, {"text": "+HardwareCanucks <a href=\"https://vimeo.com/142198470?scid=social58125696&amp;adbid=698235168247717888&amp;adbpl=tw&amp;adbpr=115584650\">https://vimeo.com/142198470?scid=social58125696&amp;adbid=698235168247717888&amp;adbpl=tw&amp;adbpr=115584650</a>"}, {"text": "I almost forgot MAC existed."}, {"text": "You created optimized media first on the Mac?"}, {"text": "Don&#39;t spend a godzillion dollars on just the machine. You need: external monitors, audio equipment, Hdd, 3rd party plug ins ecc ecc"}, {"text": "Great video and What a cute guy &lt;3 :D"}, {"text": "what is this???? he is just talking bull***, no sorry what he is saying is good but damn... this should be a PC vs Mac editing fight... he just show the rendering time... and talking good about final cut! i thought this video was about how smooth the process was under the editing and rendering not just talking and rendering time, this was waste of time with that name on video! thx for me ;)"}, {"text": "Great video! but i dont have the money for a mac :("}, {"text": "now test with a hackintosh on your workstation..."}, {"text": "Mac and PC are the same exact hardware now, so the only difference is software and the codecs involved. It&#39;s kind of sad because Apple used to make some powerhouse graphics design and workstation devices with better hardware then most PCs (i.e. SCSI vs very slow PATA or PowerPC (simple yet much more efficient at graphics design, gaming development, and gaming where overhead doesn&#39;t matter like consoles) vs x86/x64 CPUs)"}, {"text": "lainus or linus?"}, {"text": "Obvious mac choice; the screen on the mbpr destroys that fat fucking pc"}, {"text": "+HardwareCanucks Actually you can use a plug in named TrackX as motion tracker in Final Cut Pro X.. It&#39;s perfect, and i think better than AE cause it&#39;s really simple.. Try it"}, {"text": "WOW! Im inpressed, never thought final cut would be that much better :D thanks for that vid, man!"}, {"text": "What about surface book. That thing is the closest in windows side for optimization."}, {"text": "Why compare Final Cut Pro to Premier? FCP yes renders faster but is more like a consumer editing system. <br /><br />In saying that I respect Mac users and their lifestyle choice just like Tim Cook."}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=2m59s\">2:59</a> macbrook"}, {"text": "What is video rendering? I never encountered it before"}, {"text": "This is something I keep trying to explain to people, a computer is not all about specs! The purpose of the hardware is solely for the software&#39;s use. Much like an engine for a car. For example; a semi truck engine is much larger and way more powerful than a motorbike, but in its application the truck doesn&#39;t go nearly as fast. Apple has gone through great lengths to remove any bloatcode in their OS, this enables them to use older hardware more efficiently, because that hardware has been tested so extensively. Like a finely tuned motorcycle. Now if you were doing something with lots of CPU based calculations (3D animation for example) then it would lack behind because that task is much more raw calculation. So a workstation with 18 cores would be a 4 core. Pretty simple stuff really. It all comes down to this: what do you need a computer for? If it is mostly editing a video, then Macs are pretty damn good, if it is for CGI work or animation, a higher core PC is better suited."}, {"text": "It&#39;s probably that Final Cut is using the full capabilities of it&#39;s GPU to aid in the export. On several Windows editors, including Premiere, there seems to be relatively little difference in export speed between a GTX 960 and anything above."}, {"text": "Many functions in Premiere aren&#39;t well optimized for multi-core cpus and OpenCL. Warp stabilizer for instance only uses ONE core, which is a joke given that it&#39;s one of the most demanding tasks in the program. However it does have some benefits, one of them being that you have more control over your file structure, you don&#39;t fill up disks with background renders, you don&#39;t have to wait around for the background render to end, and most importantly for me, you can utilize as many monitors as you want. <br /><br />Final Cut X is a sexy piece of software. Sure, it doesn&#39;t play super well with some addons, the background render is both a gift and a curse, it crashes more than Premiere in my experience, especially with plugins, the round-trip to After Effects sucks and the native color grading is much inferior to Premiere&#39;s Lumetri effets. But as mentionned in this video, when it doesn&#39;t crash because of some random plugin, it is smooth as butter. I edited a <a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=1m30s\">1:30</a> minute promo clip shot on RED 5&amp;6k on a borrowed 2011 15&quot; Macbook Pro and while it wasn&#39;t perfect, I&#39;m almost positive I wouldn&#39;t have done it as fast in Premiere. To me, Final Cut X is THE BEST video assembly software. The interface is smooth and intuitive and resource management is second to none.<br /><br />However, if you want the most flexible and taylor-fitted NLE, Premiere is the winner. It all comes down to preference.<br /><br />I&#39;ve recently switched from Final Cut X (Hackintosh OS X) to Premiere (Windows) on a 12-core 1366 rig and I&#39;m still preferring Final Cut X. That being said I&#39;ve only been on Premiere for a couple weeks, and as I improve my skills and workflow on this new platform, my opinion may change.<br /><br />Both NLEs are fantastic pieces of code. You can love either or both. There is no right or wrong here."}, {"text": "dude, FIrst. RMBP use PCIe Flash Storage. it&#39;s waaay more speed then conventional SSD or even spinning disk and it obviously improves any interactions inside application. <br /><br />and secondly, you can not compare 2 different applications if you&#39;re talking about hardwares comparison.  it should be PPro Mac vs PPro PC only. Not with FCP"}, {"text": "but what format where you using. I find proress works great with final cut but h.264 is very slow, On the flip side h.264 and dnxhd work great on windows, but proress is slow in premier"}, {"text": "@HardwareCanucks Thanks for doing a fair review on this topic! Every time I see any review on YouTube on anything to do with Mac vs. PC anything It&#39;s always overly bias so that the PC could never fail a single test ( Looking at you Linus Tech Tips ). Also the comparisons hardware is always one-sided ( i.e Skylake  Quad Core Xeon PC vs Sandybridge Dual-Core Macbook Pro ). Seriously! Thank you! Now when someone starts spouting B.S. about video editing on the Mac not being a serious option, I can show them your video and say &quot; This is from a mostly PC based review channel &quot; so go suck an egg. <a href=\"http://www.youtube.com/results?search_query=%23DopeVideo\">#DopeVideo</a>"}, {"text": "I was just watching Bourne Identity and i realized how annoying it is when a movie ends.. you know what i mean?"}, {"text": "You&#39;re comparing apples to oranges (pun intended.) Use Premiere on the Mac and it will have the same exact PATHETIC rendering times as a PC with similar hardware. The &quot;optimization&quot; is nothing more than Apple propaganda. Yes, FCPX renders faster than Premiere, but there are video editors for PC that also render just as fast as FCPX. Power Director is an example of that. PD has rendering times almost identical to FCPX, which once again confirms that the &quot;optimization&quot; on Apple&#39;s side is nothing more than their usual marketing BS. And BTW, faster rendering isn&#39;t everything, as FCPX lacks so many professional features, pros haven&#39;t been using it in years. Do you want to know what&#39;s really state-of-the-art? That would be DaVinci RESOLVE. A fantastic editor/color correction suite that, unlike FCPX and Premiere, can harness the power of multiple GPU&#39;s (something impossible in the Apple world. Except for the MacPro, which comes with obsolete GPU&#39;s, making it a moot point.) Try and put 2 or 3 Gtx980ti&#39;s in your PC workstation (NOT in SLI!) and then render in Resolve (the &quot;pro&quot; version, the free version can&#39;t do that.) Then do another video."}, {"text": "macbook pro cover is so nice, where I can buy."}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23hatersgonnahate\">#hatersgonnahate</a> :D"}, {"text": "screw Mac and Pc users, Ps4 video editing for life XD XD"}, {"text": "Anyone have any opinions on Apple Motion vs. Adobe After Effects?"}, {"text": "Hold on...I just realised you can run Premire pro on a Mac....shit"}, {"text": "Now do the PC benchmarks with antivirus off!"}, {"text": "Which Encoder? What encoding settings were used? Which version of Premiere? Codec of source material? Did you compare the quality of the exported files? Did you use AME or not? Was CUDA/OpenCL in use? Yes, no, what? There are other factors that matter..."}, {"text": "oh god, mac peasants, mac peasants everywhere"}, {"text": "either one works great.  prefer PC&#39;s because you can configure it how you like, which as much excess as you please."}, {"text": "the title should be &quot;Adobe premier (on windows) vs Final cut (MacOS)&quot;"}, {"text": "Perhaps in the future you can compare with a hackintosh at the same price point as the MBP."}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23hatersgonnahate\">#hatersgonnahate</a>"}, {"text": "&quot;Mac vs PC, this is not what the video is about&quot; Might wanna change the title then ya fuckhead"}, {"text": "Adobe really need to add the background timeline rendering feature."}, {"text": "Great video ! Optimisation is key ! <br />&quot; Can you revisit this topic with a hackintosh? &quot; ( dual boot OSX &amp; Windows X)"}, {"text": "IF YOU LIKE MAC YOU ARE A BAD PERSON"}, {"text": "I don&#39;t get the love for premier.  Most tests on youtube are done with it.  <br />Why not use Lightworks? I just don&#39;t get it."}, {"text": "Even as a Mac user, I honestly expected the results to have more to do with hardware capability than which software was used. I would have assumed that both Adobe and Apple would be fairly close in their software&#39;s performance and ability to handle things quickly. I was not expecting such a difference, but it does show that how much power a computer has means less than how well the software its running has been optimized to the task as well as the hardware. This also opens my eyes to a whole different set of reasons why so many YouTube people use Macs. I didn&#39;t start making youtube videos regularly, or even ream of editing them first, until after making the switch from Windows, so I never really got to make the comparison myself."}, {"text": "Adobe should make an optimized workstation grade PC for their CC suite. I know it&#39;ll end up being expensive, but I do this for a living."}, {"text": "I use a Mac, but the learning curve for FT is to much (lazzzy) AP is easier. I&#39;m a switch hitter on OS platform (other then the command key I&#39;m ok.<br />I… I love Mac&#39;s, but I see the writing on the wall for Apple&#39;s commitment to the &quot;professionals&quot;. All they want is money and you can only get that from Joe and Jane consumer."}, {"text": "im using power director"}, {"text": "sony vegas?"}, {"text": "I use an air for logic x. Amazing. I guess its a bit like what people are saying about VR. You think its a bit of a gimmick until you try it."}, {"text": "That&#39;s why I bought a mb, it is expensive? YES. But all the time and anger it saves turns it very cheap.<br />There are ppl editing 4k even in the 12&#39;&#39;so surely apple knows what is doing."}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23HATERSGONNAHATE\">#HATERSGONNAHATE</a>"}, {"text": "This appears to be your watershed moment, Dmitri...and ditto on the comment about testing FCP on a Hackintosh"}, {"text": "What a great video. Well done."}, {"text": "nice comparison!"}, {"text": "It&#39;s not just about os platform hardware whatever. I was testing Blender on windows and linux and I experienced up to 30% difference just because of OS difference. But here it&#39;s not 30%. IT&#39;S A LOT. Like... RLY A LOT. And the real question is - Adobe, please remind me how company having almost monopoly, creating 2d editing software for like 2 decades now can FUCK UP SO BADLY and get so horribly beaten by we-do-everything company? It&#39;s not that Final cut is awesome. It&#39;s that there&#39;s something wrong with Premiere. Terribly wrong."}, {"text": "HFS and NTFS are literally the shittest filesystems ever. If you really want performance, you&#39;ll do it on a Unix machine, that doesn&#39;t restrict the FS to one file at a time."}, {"text": "That case O_o ... I LOVE IT<br />What is it name?"}, {"text": "pc is better."}, {"text": "oh damn, I truly have the same background on my desktop as you have on your laptop."}, {"text": "Always thumbs for awesome background score !"}, {"text": "Mac OS X is better."}, {"text": "Damn I feel the pain of Premiere lagging/stuttering.. + the render times. It slows my editing down. Hm I might try out Final Cut."}, {"text": "What about Hackintosh and FinalCut?"}, {"text": "funny think happening in the Apple world right now Apple are optimising the software to render faster on ATI cards. I own a Mac Pro 4.1. it has two 2.27Ghz quad core Intel Xeon E5520 (8 core&#39;s 16 threads) 40GB DDR3 RAM and EVGA GTX 980 SC with CUDA support and FCPX runs like shit on my Mac Pro because it runs off open CL which is only optimised for ATI cards at the moment. but Adobe Premier Pro takes full advantage of the CUDA on my Nvidia card and runs with similar speeds or faster than todays Mac&#39;s when dealing with 4K content. really right now it depends on if Apple stick with ATI as there GPU suppliers that tips the balance of preformance on peoples Mac&#39;s running house developed products. but nice to see a change of pace where someone actually uses a Mac for what its made for rather than saying &quot;Mac&#39;s are shit because it can&#39;t play Crysis 3 at 1080p 60FPS on it&quot; that argument has been thrown at me a few times. anyways great video. and liked"}, {"text": "Apple didn&#39;t optimise shit. They are just using Intel Quick Sync. Which P Pro doesn&#39;t support.<br />Use Quick Sync enabled software on an equally powered PC and then see the result."}, {"text": "i have a 13&#39;&#39; macbook pro, and when i use FC pro man that&#39;s super fast &amp;  smooth even though my laptop is not fully specced out!!! dual core i5 8gb ram 256 ssd!! HOWEVER ;i got some lag when i opened FC pro with a project of a 25 min full HD video with multiple effects and 25 tabs of google chrome with an animation software running in the background!! really amazing stuff!"}, {"text": "Hey mate, awesome video! I saw you have a Martenitsa on your wrist. 👍 You must have some close friends who are Bulgarian (Or you are yourself)?"}, {"text": "The problem is if you are used to using say Premiere Pro or Sony Vegas you don&#39;t really won&#39;t to be switching to Final Cut every time you want to edit on the go since things like shortcuts and effects will be different."}, {"text": "How about Hackintosh your WS PC and run Final Cut and compare it with windows on the same WS PC also the MBP"}, {"text": "How is it with my msi gt72s 6qe, it takes 5 minutes to render out a 10min 4k video."}, {"text": "This is Adobe After Effect VS FinalCut, Right?!"}, {"text": "Well, this has been my experience for various productive and creative activities on macs and OSX for years. Audio, graphics, coding, writing... it all just is a lot less cumbersome on a BSD platform with a solid GUI."}, {"text": "Without the background rendering you would have a fairer comparison. As was shown with the After Effects example, Final Cut X also can&#39;t easily communicate between even Apple&#39;s VFX and DVD authoring tools or even share the project in a multi-user post-production environment. Final Cut is also a weaker tool then Premiere Pro, or even FCP 7, with Apple stripping it of high-end professional features. PC is far more flexible and cost effective and Adobe is continuing to improve performance and optimization every year."}, {"text": "Hello! love your vids, keep it up :) please do a review on the Riotoro CR1080 it&#39;s claiming to be the SMALLEST case that can support full ATX parts!! thank you!"}, {"text": "Notepad + ASCII ART &gt;&gt;&gt; everything"}, {"text": "Yeah, the macbook isn&#39;t as powerful, still powerful enough tho. But god damn that  euro thing is big, bulky, and ugly as hell. Looks like those damn indestructible computers from 2007."}, {"text": "Is that martenica?"}, {"text": "I&#39;ll proboably get lots of hate for saying this, but 4k is getting really annoying. The 4k footage looks cool in somekind of a cinematic experience, but in a video like this it looks really choppy and wierd. Of course, it makes a very sharp 1080p when downscaled, but in a small youtube video it becomes too sharp. Text fonts become crazy and seeing all the single hairs on the face of the guy makes me feel uncomfortable."}, {"text": "I also edit in fcpx (final cut pro x) and indeed the render times are really good, but i prefer a pc with premiere because it just feels better lol"}, {"text": "Specs are not the same. This is not accurate."}, {"text": "I Which to Compare PC vs MAC on Gaming"}, {"text": "Now imagine a dual gpu hackintosh."}, {"text": "Popcorns, get your popcorns here"}, {"text": "you should make a hackintosh with your workstation and see the results compared to the macbook :D"}, {"text": "i like pc more than mac"}, {"text": "i was thinking adobe was un-optimised and ineficient cos my 970 via shadow play can record games with a minimal frame hit  on the fly and fucking adobe is 95hrs at a 2 minute clip"}, {"text": "Please do more mac and pc videos, it was nice for once to see a very open minded comparison of performance between the two systems, without having a typical biased opinion that PC is the master race and better in every way."}, {"text": "I&#39;ve never used either FCP or Premiere.  But I do recall some former FCP users complaining bitterly that Apple dumbed down FCP recently by taking away important features, to the point that they didn&#39;t use it anymore."}, {"text": "Macs use NVME ssd which might be the cause"}, {"text": "Hate for APPLE and macbook"}, {"text": "I don&#39;t think macs was faster because &quot;the software is optimized for the hardware&quot; I hear that a lot because apple claims that but I think there trying to simply explain that Mac&#39;s OS X is just a lighter weight OS leaving more left over hardware power to be harvested by applications. That&#39;s the same reason why linux os is fast and linux is not &quot;optimized for the hardware&quot; because you can install linux on anything..."}, {"text": "linustechtips = fred (from Nick) + technology"}, {"text": "let s be honest mac is a joke<br />and for those who are stupide enought to buy this crap try a pc with the same price and thank me later<br />apple products are a waste of money"}, {"text": "What are those beautiful speakers at <a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=6m22s\">6:22</a>?"}, {"text": "Well done reviews!  Sorry to ask.  What speakers are used with you Macbook Pro in this video?  Do you have a review?  I ask because you review a lot of Sennheiser, so I assume we have similar preference in audio reproduction.  Thanks in advance."}, {"text": "I&#39;m an all Windows User but i used Mac&#39;s like crazy back in the day... i really miss Final Cut Pro.. Since i use Premiere and Magix Video Pro X7 i have a lot of problems i run into... As i say Macs are a whole lot better for Video Editing than Windows Machines... But Windows Machines have a lot more ways to be used... I love both Systems!"}, {"text": "I would love to see more videos about workstation software and hardware. All the tech channels focus on games and I understand that but I do stuff like Blender and I would really enjoy if you guys would also note on how for example a graphics card does in a workstation environment ect. Or if gaming graphics cards are as good as workstation graphics cards considering the price."}, {"text": "Simply put, if your life isn&#39;t dependent on music/video making, then a Mac isn&#39;t for you."}, {"text": "Pc master rase !!!"}, {"text": "totally unrelated... I want your hairdresser"}, {"text": "So wat codec / workflow where you using? What was the source footage? Did you transcode anything?"}, {"text": "so what he meant to call this was MAC OS vs Windows editing software?!"}, {"text": "Let me unsheathe my keyboard: <br />PC vs MAC is a pointless argument guys... Always research what is the best machine for the job / activity you intend on using it (most) for and can afford. <br /><br />Glorious! :D"}, {"text": "Should have waited till June when the new Macs come out. derp."}, {"text": "What&#39;s that shell for the mac!? I need it desperately!"}, {"text": "Thanks for this video! I used FCPX for a month and was super impressed by how smooth everything is, but went back to premiere afterwards. I really want to give FCPX another try though. What do you think about the things I listed below? Are there workarounds like them in FCPX? <br /><br />Things i missed from premiere: <br />-the coloring workspace<br />-being able  to set audio effects on full tracks in the audio track mixer<br />-adjustment layers"}, {"text": "I use a Mac Pro for video editing and render times are not a factor unless I&#39;m using Neat Video&#39;s reduce noise or if the video is hours long (very rare). <br /><br />The downside is that After Effects doesn&#39;t give me real time playback and is a pain to use for anything. Slowly moving to working with Blackmagic Design&#39;s fusion which is super quick on the system. <br /><br />Occasionally used a maxed out MacBook Pro for editing but I feel it&#39;s still a little underpowered. <br /><br />I love After Effects so I&#39;m going to miss it, but being able to complete several projects a day means I&#39;m going to continue buying into the Apple ecosystem. <br /><br />Now if only they&#39;d bring out a new Mac Pro. <br /><br />And cheaper RAM please. It&#39;s $1500 dollars for 32 GB or $700 for the non apple memory."}, {"text": "Thanks for this video, I really enjoyed watching it!"}, {"text": "camera name please?"}, {"text": "I have a MBP 13&#39; Retina Late 2013 and just flys through 1080p and 4K is laggy but still its integrated graphics. FCP is the best !"}, {"text": "MAC vs WINDOWS nooob. PC just means personal computer you fucktards"}, {"text": "I&#39;m surprised to see that a Mac is that much better. But after seeing the price, I can get a TitanX and an i7 for that much. But if you want portability, Mac seems to be the best for editing. Good job Mac! But I still love my Windows + Linux machine more."}, {"text": "This is not a PC vs MAC, this is Final Cut vs Premiere..."}, {"text": "And how long did it Take To render this video?"}, {"text": "That&#39;s why I built a Hackintosh for FCP X. It is so much faster"}, {"text": "isnt this more final cut vs adobe premeir<br />instead of mac vs pc video editing"}, {"text": "Make a high power hackintosh with windows in bootcamp. Best of both"}, {"text": "Are you Bulgarian? I saw martenitsa on your arm :3"}, {"text": "Impressive rendertimes with the mac. You should try with a hackintosh and use final cut pro on that as well."}, {"text": "It would be interesting to see if you had a hackintosh alternative boot on your workstation PC with final cut installed and compare the results of final cut PC to final cut vs MBP to see a PC vs MAC comparison with the software/hardware."}, {"text": "i didnt have the money to buy a new expensive mac or pc for editing, so i got one for second hand for £500 (macbook pro 2012 non retina base line) speced it out with 16gb ram and ssd. OMG it might look weak and pointless but is bloody quick on final cut for editing and well worth the money!!!!"}, {"text": "final cut pro a lot better imo but im a gaming guy and that weak ass macbook aint gonna cut it for my taste"}, {"text": "Omg, people have really misunderstood the definition of PC... It doesnt mean windows, it means personal computer ffs even a mac is a PC."}, {"text": "No i have THE perfect video to show people why Apple laptops are not expensive at all and that they are not underpowered :)"}, {"text": "does FCP do all the stuff the adobe suite does??? ie AE stuff?"}, {"text": "Great video, Sir. Thanks for your opinion.<br />I never thought that I would say that someday...but I want a Mac now for my video editing. ;D"}, {"text": "Oh ok so Mac isn&#39;t better at video editing it&#39;s just that Final Cut is better than other windows products?"}, {"text": "Its more on Pr then not the PC, as its slower than FCP regardless of which side its run on.<br /><br />Do please improve on this Adobe. Please."}, {"text": "Apple controls the hardware and software to ensure the best performance. Kind of like how Nexus devices may not have the best hardware, but the software is optimised to cut butter smoothly."}, {"text": "differnece is that the gpu in the mac is pretty hefty and that adobe only uses the CPU if you would change pc to gpu rendering it should be about the same times..."}, {"text": "Once you go to mac, you&#39;ll never go back.<br />Most PC-OS X switchers would agree, the main argument of the angry, raging, so-called &quot;PC MASTER RACE&quot; is just its gaming capabilities and the cost-power ratio. Just accept that its made for another market than hardcore gamers and stop comparing apples with pears (no pun intended)."}, {"text": "PC = Good for gaming<br />Mac = Good for anything expect gaming<br /><br />Believe it or not Macs are way much better than PC in anything except gaming!"}, {"text": "Someone get back to me please! What camera and lighting and microphone does he use? it is amazing sound and look and quality!"}, {"text": "Unexpected but true, mac was cheaper in terms of video money. For a huge video editing company mac should be a obvious choice, and better yet what about hackintosh ?"}, {"text": "Image quality is <b>OVER 9000!</b>"}, {"text": "Why do you associate PC with Windows ? PC means Personal Computer and it&#39;s a category. Mac computers are PC&#39;s and all computers fall in this category. Even a computer with Linux is a PC. WTF stop mistaking PC for Windows."}, {"text": "Can someone tell me why he is wears a martenitsa?"}, {"text": "Final Cut Pro is made by Apple and its optimised to run perfectly with Macs. The operating system is optimised to work perfectly with the hardware also not stupid Windows pc can do that."}, {"text": "Very cool video, you got your self a new subscriber :)"}, {"text": "This test isn&#39;t fair a Mac with not very high end components vs a maxed out PC"}, {"text": "This is fake cause he didnt show the rendering settings and compared the output quality. Also did you enable open cl on macbook when using premier and cuda on those nvidia machines ? And how can you be sure that final cut wont render video in backround  ? did you check cpu and ram usage ?"}, {"text": "Can anyone help my channel grow"}, {"text": "that&#39;s what I&#39;m talking about ! whenever I see another apple hater I&#39;ll just show him this video"}, {"text": "suck that <a href=\"http://www.youtube.com/results?search_query=%23PcMasterRace\">#PcMasterRace</a>"}, {"text": "Are we really talking about choosing a platform based on render times?"}, {"text": "the comparison would have brought a better view, if you could buy a maxed out macbook pro, but i do understand its expensive.... Besides thats what the pros use.. the maxed out version most of the time."}, {"text": "would you be willing to install OSX on your workstation? I think FCX with your workstation PC would be really interesting"}, {"text": "I&#39;m working with Mac, PC (Windows and linux) and Avid, FCP, Premiere and Foundry&#39;s softwares and don&#39;t see that much of difference (not like what you said). you miss a lot of factors like codec of import and export footages."}, {"text": "Wow, this is a great comparison. It seems like FCP is leagues ahead of Premiere. I think the most ideal build would be a high end hackintosh so you get the best of both worlds."}, {"text": "Fuck Yeah!"}, {"text": "Or you could build a hackintosh LOL"}, {"text": "I&#39;d really enjoy it if you entertained the idea of testing a hackintosh. You get the best of both worlds; high end PC hardware without breaking bank, and you are able to use OSX!"}, {"text": "Please, comparing premiere vs. final cut with osx...how &#39;bout trying davinci resolve instead...davinci resolve 12 shines in 4K production."}, {"text": "I&#39;m the jackass that bought an iMac 5k and running PP  on it. My sub is up in 3 months and I&#39;m moving to FCP right away. Subscribed!!!!"}, {"text": "Build a Hackintosh!!!"}, {"text": "I was actually testing out different, cheaper video editors because of my extreme render times in Sony Movie Studio. I tried Adobe Premiere Elements and while it was somewhat fast at (what I believe to be) scrubbing and rendering, it&#39;s usability compared to what I was used to was quite bizarre and made my editing time take forever for a small intro. I tried CyberLink PowerDirector Ultra and it was very fast for render times and had great effects while also being easy to use. However, it was the most unstable at times and scrubbing through footage was VERY slow. Not to mention using the shadow file to help with editing actually downgraded my output quality, so something about CyberLink did not like my PC. I decided on sticking with Sony Movie Studio instead of investing in either CyberLink or Adobe. Granted, the render times were horrible (though, improved through a lot of testing and a little bit of tweaking to about half the time), and the effects are a little underwhelming in some areas. But the ability to scrub through footage is quite good and it&#39;s layout and usability is at just the right area I like for working with. It&#39;s not one of the more raved about editors out there, but it&#39;s one of those things that leads me to believe that not every piece of hardware or software is going to fit each person the same. And this video seems to help explain that. Everybody wants a black &amp; white answer but most things are pretty gray. I would say more on the Mac side of things but I don&#39;t really know so I&#39;ll leave it at, &quot;I ain&#39;t gonna judge!&quot;<br /><br />TL;DR = Good video. Shows there&#39;s a lot of variance in what people need and want. You do you internet and don&#39;t worry about doing each other. Too much. Maybe a little bit. Till it tickles I guess why not."}, {"text": "I just realized how small  his facial features are relative to the size of his entire face."}, {"text": "loved this one dmitry....testing a hackintosh would be great<br />I reaaaalllly would love to know more about these type of things"}, {"text": "More review on other Apples products please!!!"}, {"text": "3 2 1. FIGHT yeah"}, {"text": "Today i visited apple&#39;s website,<br />It was worth it!<br /> i had such a good laugh."}, {"text": "Avid Media Composer"}, {"text": "Please review one of System76&#39;s laptops, I&#39;m really curious about what you might think about them."}, {"text": "This is convincing I will probably buy a Macbok air"}, {"text": "Please lets try Premier Pro vs. FinalCut. Thank you"}, {"text": "HAckinTosh What say ??"}, {"text": "wow, im a pc person, but apple&#39;s &quot;final cut&quot; whwooo, could teach pc a thing or 2 about software optimization"}, {"text": "Great video - i love to watch your videos. They are one of the best on YT and very substantive. <br />I&#39;m surprised, that you considering switch from Adobe to FC - i see that lot of people is doping switch to Adobe from FC :)"}, {"text": "my hand me down macbook pro from 2009 broke last year :&#39;( I really miss it"}, {"text": "which version of FCP are you using ?<br />Nice Work Man !!"}, {"text": "For a new user, Final Cut Pro X is much easier to learn and navigate. Skills aren&#39;t particularly transferable though, and most corporations and companies use the Adobe suit . One time payment vs subscription based though."}, {"text": "Those are some fucking crazy results"}, {"text": "Oh man. Try using a non standard format that requires a re-encode instead of just  framecopy. All of the current popular youtube &quot;tech&quot; guys have gotten their heads so far up their asses, it pisses me off i see this sort of shit. That being said. All adobe products are shit anymore, and literally any other video editor will be as good or better."}, {"text": "Why don&#39;t you try Davinci Resolve, the free edition? It is about as powerful as Adobe Premiere Pro yet it is FREE! This is very important to people who don&#39;t want to hand Adobe $50/mth to RENT their software. Let&#39;s see how fast Resolve works on your PCs and laptops and then people can make a REALLY informed decision.<br /><br />I think the majority of your viewers are not nearly as concerned about saving 10 minutes of render time when they can get such incredibly POWERFUL software as Resolve for literally nothing! And its colour correction funtion is apparently second to none, as well.<br /><br />Let&#39;s face it: 99% of your viewers are not running a business based on saving a few minutes here and there on rendering. They want superb software that does just as good a job as anything Apple or Adobe can produce but which costs them NOTHING!"}, {"text": "can you test in hackintosh?"}, {"text": "Anyone else running linux?<br /><br /><br /><br /><br /><br /><br />Sorry. GNU/linux."}, {"text": "That that stupid <a href=\"http://www.youtube.com/results?search_query=%23PC\">#PC</a> user. Mac FTW!"}, {"text": "You should try Motion5 you would love it! Also only $49!!"}, {"text": "To everyone in the comments, this is not a video comparing PC to Mac, as Jon from TLD might have made it seem. It is just showing how much more performance you can get out of a seemingly lower powered machine because of top notch optimization."}, {"text": "Without watching the video, i can say that Macs are way better for editing. I have a PC and will always have a PC. I will never buy a Mac. But that is not reason to say that PCs edit better. Macs do. Maybe if PC has final cut pro my opinion would change."}, {"text": "Revisit this topic using a Hackintosh running FCPX vs the Macbook Pro running FCPX. This really doesn&#39;t seem like an issue of Mac vs PC (because plenty of Mac users that use Premier as well), but rather the question is FCPX vs Premier."}, {"text": "the winner is dominic vavivil"}, {"text": "Some people aren&#39;t really understanding the point of this video, it is hardly a Mac vs Pc, its really more  of a FC vs Adobe Premier video"}, {"text": "whatever the macbook can do, it can do it well. But the things it cannot do are also worth to take note."}, {"text": "Anyone try this using Mac OS on a virtual machine?"}, {"text": "I prefer chromeos"}, {"text": "Maybe the video should be titled &quot;Adobe Premiere vs. Apple Final Cut Pro&quot;.  I believe that the results in the video show that when running the same software, the PC hardware wins (as expected)."}, {"text": "Okay, taking hardware completely out of the equation, which SW suite would you find easier to use as a complete novice getting into video editing? Once I have a backlog of footage I&#39;d like to start my own channel, and the whole &quot;this vs. that&quot; argument is moot since our house uses both windows and mac equipment. I plan on getting a Lynda or similar subscription to dive in learning &quot;baptism by fire&quot; technique, but if one is inherently more user-friendly, is it still worth it to learn both?"}, {"text": "I love my pc but this mac integration... WOW!"}, {"text": "Final Cut pro x takes advantage of all cores and opencl.  Thats why even on a shitty macbook it can still put it to good use.  Hence why they favor AMD gpus than nvidia."}, {"text": "would you please make an after effect test on the same MBP ? some claims that after effect is using the CPU more than the GPU, i think the difference between your workstation&#39;s GTX and the MBP&#39;s AMD GPU will settle this out"}, {"text": "There&#39;s no denying Apple superiority when it comes to software/hardware optimization!<br /><br />No matter how spec&#39;d out a PC is, it doesn&#39;t stand up to FCPX on a Macbook Pro"}, {"text": "This is why i like HardwareCanucks   he is no rabbit fan boy he  just tells the truth"}, {"text": "damn that macbook is epic"}, {"text": "Nice video!"}, {"text": "I don&#39;t like Apple for various reasons but what&#39;s the point of a 3000$+ PC when you get the same results in a quarter of time on a MacBook?<br /><br />On top Adobe Premiere is only available as a part of CC which cost over 600$ per year while FinalCut costs about 300$. <br /><br />So disappointing"}, {"text": "I just started using final cut pro x , I absolutely love it on my hackintosh like you said render times are quick and honestly it provides a nice work flow pretty simple. For any haters I say try it out first"}, {"text": "You should try to do some of the stabilization and tracking in FCPX with some of the third party plugins that are available from CoreMelt and MotionVFX."}, {"text": "yeah, sure, and just beneath this &quot;comparison&quot; are the links to macs on amazon. People, come on....."}, {"text": "Great video Dmitry! I watched to make sure the term &quot;Quick Sync&quot; was used -- I completely give Apple credit for all their optimization with FCP and taking advantage of Quick Sync, but much of the discussion has left Intel&#39;s built-in H.264 encoder (Quick Sync) out of it. It&#39;s a beautiful combination of hardware and software with FCP, and I truly hope Adobe gets their act together and provides similar support in Premiere. These recent comparisons have had me considering a Hackintosh build more and more."}, {"text": "I just hate how Apple doesn&#39;t list the # of the i7 on their spec sheet, they only tell you the GHZ which makes it difficult to match up and compare with other portable workstations. I have a Macbook pro, with everything loaded up except for the SSD at 500ish gb. Its amazing, and suits all my needs so far. But I also have a Gigabyte p35x and the thing with the p35x is that it was a way better GPU for gaming. Nothing wrong with apple products, they are a premium device, but if you compare to other premium devices then you choose what you like and I like both my laptops."}, {"text": "who in the world caresit might be faster with final cut pro x  Macs are so expensive and the keyboards suck seriously so I would rather have slower render times etc than use an apple device because I really hate the keyboards also final cut pro x is so restricting and makes you do stuff the way apple want you to do but in premier you can Change almost about everything"}, {"text": "who in the world caresit might be faster with final cut pro x  Macs are so expensive and the keyboards suck seriously so I would rather have slower render times etc than use an apple device because I really hate the keyboards also final cut pro x is so restricting and makes you do stuff the way apple want you to do but in premier you can Change almost about everything"}, {"text": "this is not mac vs pc. it is premier vs FCP try running FCP on your workstations and compare the speed again that should be give a better comparison"}, {"text": "Why Don&#39;t You Just Use Use VM Workstation"}, {"text": "What about other editing software for the PC?"}, {"text": "This is a great video!  Good job!"}, {"text": "Awesome video, thanks man"}, {"text": "+HardwareCankus I have that same wallpaper lol"}, {"text": "Final Cut is perfect when you&#39;re at a show away from you Rig and you need to publish an Episode a day like with CES."}, {"text": "One of these youtubers will try a quadro which is &quot;optimised&quot; for premiere. Adobe needs to step it games up though"}, {"text": "Anyone know the name of the case <a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=0m36s\">0:36</a> ??"}, {"text": "title is click bait and misleading.  It should have been titled final cut pro vs adobe premier."}, {"text": "Lol, your macbook was at 27% battery. Just like everyone else with an apple product ever."}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=3m06s\">3:06</a>. You&#39;re welcome. ughhh"}, {"text": "This turned more into a FCP Vs. Adobe Premier rather than Mac Vs. PC because of the obvious fact of not being able to run FCP in Windows natively.<br />Speaking of that, I&#39;d like to see a Hackintosh running FCP and see how that compares, I would imagine that FCP on the editing rig would be even faster than the MBP.<br /><br />Having said all that, if you can figure out FCP and fit it into your workflow and are able to afford a Mac, then holy cow it is fast. It demolishes Premier so hard it&#39;s not even funny, and Adobe really need to get their act together and unlock the enormous potential of PC&#39;s, we already have things like CUDA, Quicksync and OpenCL, so why is it they can&#39;t utilise any of them properly?<br /><br />Oh right, because it&#39;s Adobe, they couldn&#39;t code a calculator without having at least a trillion vulnerabilities in it and having it slower than continental drift.<br /><br />I do think that Dimitri has just found his ideal Mobile Workstation for when he&#39;s at Computex and the like, and I don&#39;t blame him."}, {"text": "That&#39;s why I switched from Premiere to Final Cut Pro on my MID 2012 &amp; Late 2013 MacBook Pro.."}, {"text": "FCP X is a dream to work with. I&#39;ve never properly used anything else but I completely agree with the whole optimization thing. I have a gaming PC as well that I&#39;ve tried to edit on and I&#39;ll be honest, even considering the power of my machine, Premiere really wasn&#39;t that smooth..."}, {"text": "So, what I could get away from the video is that it&#39;s not a matter of Mac vs PC but that Final Cut is better than Premiere. If Final cut was available for Windows, it would probably perform better than the Mac Book Pro on the more powerful PCs simply because the hardware is better. So, basically, Adobe has to step up their game."}, {"text": "So it&#39;s really Final Cut vs Premiere,  not pc vs Mac...... And the problem with that is...... Final cut has the worst ui and flow of any program I&#39;ve ever used! (imo of course) Adobe is so much better for literally every effect and cut possible.  The &quot;helpful presets&quot; in fcp just get in the way and make every project I&#39;ve ever tried slow down.  Manual everything is better because it gives you the chance to make it the way you want,  right away.  Now if only it could render......"}, {"text": "thats why apple stuff is so expensive"}, {"text": "Linux. :D"}, {"text": "I use Adobe Premiere Pro CC 2015 with an overclocked I5 3570k and an Asus GTX 970. I&#39;ve never tried to process 4K but my setup gulps up 1080 like Trump gulps arrogance! And I have just about as much experience with Apple products as Trump does with foreign policy so i can&#39;t compare but in those rare occasions I&#39;ve worked with an Apple product I can say most Apple products are way overpriced and for such an iconic American company they build all their stuff in sweatshops overseas so why it&#39;s so overpriced I&#39;m not sure. Snazzy Labs did a great video on comparing a $2200 Windows build to Apple&#39;s top of the line, $4000 Mac Pro (which is a 2013 model lol) and it got a shellackin&#39; from the windows build so..."}, {"text": "hackintosh anyone?<br />higer end hardware that is cheaper, with osx that smashes though rendering.."}, {"text": "So they have fixed Final Cut, have a look at the previous versions which was really terrible, Adobe should have gotten their game together when Mac users was forced to move over to Premier now they are on the &quot;Back Foot&quot; regarding mobile editing again. 4k on a ultra-book! that is just dope. As usual this was a great video."}, {"text": "...so, let me get this straight, did you just compare hardware with different.....software?<br />oh wait, you name it pc vs mac for the links while the video was about 2 different programs.<br /><br />also lets take note how much this pc called Mac pro cost, 2,500$ <br /><br />i just make myself a hackintosh for that price."}, {"text": "It&#39;s Windows vs MAC. Both are PC for god sake."}, {"text": "try to install mac os in your custom pc and use final cut pro there.<br />then tell us rendertime"}, {"text": "Macs are slow pieces of shit, meant for hipsters."}, {"text": "Really made me think twice about decisions for my workflow.... now I think the obvious followup video would be... a hackintosh running on your pc hardware and testing FCP for comparison..."}, {"text": "Is the final product identical?  <br /><br />My spider sense says the Apple has lower bit rate and/or colors, etc."}, {"text": "So this shows Premiere is slow?😉😛"}, {"text": "I hate to be one of those guys but can somebody please tell me if this will be a good PC for gaming. What will I get out of most games (be honest) I am also going to try and overclock it <br /> <br />CPU: AMD FX-8350 4.0GHz 8-Core Processor  ($215.15 @ Vuugo) <br /><br />CPU Cooler: Phanteks PH-TC12DX_RD 68.5 CFM CPU Cooler <br /><br />Motherboard: MSI 970 GAMING ATX AM3+ Motherboard  ($134.98 @ NCIX) <br /><br />Memory: G.Skill Ripjaws Series 8GB (2 x 4GB) DDR3-1600 Memory  ($49.99 @ Canada Computers) <br /><br />Storage: Samsung 850 EVO-Series 250GB 2.5&quot; Solid State Drive  ($109.98 @ DirectCanada) <br /><br />Video Card: MSI Radeon R9 390 8GB Video Card  ($439.98 @ NCIX) <br /><br />Case: Phanteks Enthoo Luxe ATX Full Tower Case  ($189.98 @ NCIX) <br /><br />Power Supply: Corsair 860W 80+ Platinum Certified Fully-Modular ATX Power Supply  ($219.98 @ NCIX) <br />Optical Drive: Asus DRW-24B1ST/BLK/B/AS DVD/CD Writer  ($25.15 @ Vuugo) <br /><br />Operating System: Microsoft Windows 10 Home OEM (64-bit)  ($124.00 @ shopRBC) <br /><br />Total: $1554.33"}, {"text": "So, glad to see people doing videos like this. FCPX has been very good after 10.1.  Plus, it&#39;s only 300 bucks.  What a deal? Anyway, thank you again Demetre."}, {"text": "This isn&#39;t Mac vs PC, this is Adobe vs FinalCut. Obviously FinalCut wins. Adobe is terribly slow (I&#39;m a PC guy)."}, {"text": "Final cut on a mac pro would be godly :o"}, {"text": "You should try making a hackintosh and benchmark it with fcp"}, {"text": "Hackintosh results?"}, {"text": "Would DX12 help with something like editing?"}, {"text": "Lipstick?"}, {"text": "This was an interesting test. I think it would add to the discussion to see how it dose on a desktop hackintosh. With both the Adobe suite and Final Cut."}, {"text": "I&#39;d imagine that PCs would be better for video editing than Media Access Control addresses."}, {"text": "I knew that apple were better at this then anyone else, but holy shit... they completely fucking destroy the comp hahaha!!!"}, {"text": "Haha I win! :) I video edit for work, and I bought athe exact same mac used in the vid. Everyone says I should build a pc, but I&#39;m still going for my Mac :)"}, {"text": "YES please help encourage Adobe to make better freaking applications. There are so many really stupid problems I have with premier especially I can&#39;t take it man!"}, {"text": "Actually really enjoyed this little video! Coming from someone who has a MacBook Pro &amp; PC that I built my self"}, {"text": "God dammit, Adobe needs to fix premiere"}, {"text": "TLDR: Adobe sucks"}, {"text": "Linus should respond"}, {"text": "Heyyo, interesting... notice he mentioned pci-e SSD on the Macbook Pro yet his workstation PC uses SATA 6Gbit for his projects and only uses his PCI-e SSD for OS and the adobe program and I think same with the Eurocom M5 Pro uses purely SATA 6Gbit but I could be wrong... maybe crystal disk mark or OSX alternative benchmarks to determine if that was the main factor? To me that makes sense if the PCI-E SSD containing the projects, OS and Final Cut can do everything a lot more responsively instead of the stutter he gets on his workstation PC... maybe upgrade the Workstation PC to purely pci-e SSD? :P"}, {"text": "For desktop I have a PC with windows and Linux on it but for laptop although i have a PC right now i am surely gonna get a MacBook"}, {"text": "So this is really more like Premier vs Final Cut. Final cut looks impressive. <br />Now, run it on a Hackintosh."}, {"text": "Dimitri you should make some Premiere tips and tricks videos, they would really help me and probably some other people. Keep up the good work though."}, {"text": "there&#39;s only so much software can achieve to make things faster. raw processing power can go so much further."}, {"text": "It is obvious that more efficient equipment will do much better/faster. Software from Apple FCPX in many tasks, the GPU can use it and it is quicker but the question remains whether the output image is as good as with Adobe?<br />A complete amateur is compared the image stabilizing of crapy Apple to stabilization of Adobe Warp. You saw at least effect?<br />At the end.<br />Nearly all major producers have gone from Apple. I wonder why? :)"}, {"text": "yep FCP is a better editing software, this is why I have a hackintosh"}, {"text": ":/ I&#39;ve had some pretty bad experiences with final cut.<br />lots of broken links, failed renders, and projects that won&#39;t open.<br /><br />I try to stay in After Effects for everything unless it&#39;s very audio heavy or using uncommon codecs."}, {"text": "say what you want about apple but the MacBook Pro makes that eurocom look like a plastic turd"}, {"text": "So basically you&#39;re saying...<br />Final Cut is faster (than Adobe Premiere)<br />Macs are more optimized for video editing"}, {"text": "Nice video! Could you do a review of the Steelseries Sensei [Raw] edition?"}, {"text": "y&#39;all didn&#39;t put mac on a powerful workstation and test final cut pro.... oh well<br />would&#39;ve actually made the results more accurate"}, {"text": "Adobe sucks"}, {"text": "Dmitry has bought a Mac, very tempted to unsubscribe straight away!"}, {"text": "I am glad a tech YouTube has actually released an unbiased video on this topic. I was just commenting earlier on an NCIX video how unfounded and completly biased their bashing of all apple computers is.. and that mainly falls down to the fact that they are trying to sell PC components, thus macbooks are bad for their business."}, {"text": "Simple. If you are a travel type person, want a laptop for editing then the Macbook is hands down the best option."}, {"text": "Thanks for the video. I first saw FCP X performance on Max Yuryev&#39;s channel and since then been researching Heterogeneous computing for the last month and wanted to see more benchmarks from FCP X as it is a paid NLE and expensive upfront payment to access a decently spec&#39;d Mac.  I am not surprised by your benchmarks, but only furthers my interest in the capabilities of FCP X and possibly optimizing Open Source NLE&#39;s with OpenCL to reach similar performance gains that FCP X has."}, {"text": "PC is way better. Dimitri, please check the rendering time in power director with intel quick sync enabled. Then, we can compare pc vs mac.I hope you would evaluate it."}, {"text": "very interesting results i didn&#39;t expect that at all"}, {"text": "Well...So he&#39;s not dead."}, {"text": "Woah, You could have borrowed a Mac from someone instead of buying it. Anyway Nice Video."}, {"text": "You should try to get your hands on a asus 980ti matrix platinum, they are amazing cards and no other &quot;noteable&quot; youtuber has done a review of them yet, and I think that your cinematography would make the card look a lot better than it already does."}, {"text": "Fantastic video mate!  Beautiful camera work and insightful data."}, {"text": "Great experiment for video editting. On the flip side - how about for Photoshop, Illustrator, and InDesign? Mac or PC (for the money). I am highly considering ditching my expensive 2012 MBP and building a Skylake home workstation."}, {"text": "I find that Adobe&#39;s suite of software isn&#39;t optimized to a level that it should be. The reason why Final Cut is so fast and efficient is because Apple has designed it to perform on their computers. I hope Adobe does something for us content creators stuck on the Windows platform."}, {"text": "I didn&#39;t even know premiere could do all that text stuff, I should switch to it from Movie Maker for windows 10."}, {"text": "you titled your video wrong, you said several times in the video that this was more of a comparison between adobe and final cut. not pc vs Mac.  so you might want to say that in the comments"}, {"text": "turn your pc to hackintosh .this is where the magic will start to happen"}, {"text": "Our entire school ditched Final Cut Pro for Adobe Premiere Pro and we have never even considered going back... We had so many issues with Final Cut Pro and have been clean on CC for 6 months now, PCMR lives on! Also the Premiere Pro rendering looked noticeably nicer than the Final Cut footage."}, {"text": "I bet your wallet was as light as the macbook after you bought it"}, {"text": "Ok, so this is why many people build a Hackintosh."}, {"text": "I WONDER HOW THIS WOULD THIS TEST WORK OUT IN A HACKINTOSH."}, {"text": "I&#39;d love to see a similar comparison, but with your workstation pc running Final Cut Pro ( on a Hackintosh). That would be really interesting!"}, {"text": "Just don&#39;t try this with a 2010 iMac. Optimization or no, FCP X sucks with an underpowered machine."}, {"text": "If just wanting to use final cut software would a mac mini be a more affordable solution? Is an iMac a more powerful solution than a MBP?"}, {"text": "question you are using the main consumer chipset z-170 in your workstation whereas most but not all video editing workstations use xeons or the x99 platform which has considerable time speeds, did you consider this as a possible test and exclude it or did it not occur to you? I would very much like a battle royale between the two then if you do not mind."}, {"text": "Anybody for Hackintosh?"}, {"text": "always been an apple fan, I know it&#39;s more expensive but there truly great computers but you are paying for there name"}, {"text": "Wow! Didn&#39;t expect that much of a difference! Great video, Dmitry, as usual!"}, {"text": "Should have been called &quot;Premiere VS Final Cut Pro&quot;. By the way, I&#39;d love to see these results on a hackintosh!"}, {"text": "I&#39;m very curious if you made a Hackintosh beast pc and use Final Cut Pro what the results would be."}, {"text": "hackintosh your work station best if both worlds?"}, {"text": "This is interesting, d&#39;yah think you could do this on a hackintosh? Or maybe even something like what Wendell did on TekSyndicate in his Mac Rehab video, that sort of hardware, so it&#39;s not reaaally a Hackintosh? <br /><br />Also, could you go more in-depth on Final Cut? Does it have anywhere where it&#39;s struggling vs. Premier or Vegas? Is it just all around better?"}, {"text": "So, are you replacing your workstation with a Mac Pro then? ;)"}, {"text": "Speakers?"}, {"text": "Workstation PC? The comparison isn&#39;t valid, there are thousands of PCs out there."}, {"text": "More Reviews"}, {"text": "FCP X used to be the laughing stock of NLEs but my has it come a long way."}, {"text": "pro tip kids. if you want to work in video, do not learn FCP. it doesn&#39;t fit in any current workflow that people are hiring for. learn C4D, after effects, premiere, davinci resolve. you will always get work. [they all fit in a &quot;live&quot; workflow together]"}, {"text": "Dimitry is God!"}, {"text": "Gosh darn, while a MacBook might lack a bit in the hardware department, Apple certainly made up in the software department. Those numbers really blew my mind, man. In Adobe&#39;s defense, though, they have a lot more hardware to concern themselves with as far as compatibility, Apple knows exactly what hardware they&#39;re throwing in, there&#39;s no guessing. Either way, I&#39;m still keeping my G751JM, I like gaming a bit too much to give it up for a MacBook... yet."}, {"text": "Wow, I wasn&#39;t expecting that much of a difference in performance between FCPX and Premiere..."}, {"text": "Why people still use gtx 980 for video editing instead of a 780? Even adobe says 780 it&#39;s better..."}, {"text": "FCPX FTW. Welcome to the dark side"}, {"text": "I guess having an opinion on the internet makes you a &quot;keyboard warrior&quot;."}, {"text": "Great and informative video! I&#39;m an editor for a living and turned my back on Mac for the price for performance as a freelancer. It makes me sad that FCPX dos so well considering I&#39;m fully on the Adobe train but thanks for presenting all the facts!"}, {"text": "But which one did you use to render this video?"}, {"text": "Very interesting video. I&#39;m surprised, but it&#39;s understandable for all of the work that Apple puts into picking their hardware and optimizing within their own environment. It would be cool to see that happen on the PC side of things but that would take so many different parties working together."}, {"text": "What about a Hackintosh on a different boot drive with a dedicated project hard drive accessible from Windows and OS X. If it&#39;s possible that would be interesting."}, {"text": "It&#39;s codec as well, like Apple ProRes which supports multiple cores, where h264 doesn&#39;t."}, {"text": "What about thermal toggling? Once mac overheats, the performance will drop."}, {"text": "Adobe needs to get their game together"}, {"text": "ALSO what if you did a hackintosh video with a powerful pc and used final cut ? would it make a difference ? could you just have virtual box on your pc and edit your videos in there maybe ?? PLEASE do a video or something like this !!!"}, {"text": "I dont like mac and kinda hated it but dang. optimization with final cut is insane no one can hate on that. This was a super interesting video :)"}, {"text": "So strictly speaking Adobe, it seems like a PC is a better option. But FC is really good if you want to use it over Adobe. Problem is then you have a hard time sharing project files and getting things to work with other people and other team members because you cant transfer as easily."}, {"text": "Im loving this, this is a good test, you where doing it on a high end macbook pro, not everyone can buy that..but still was good to know that mac users can use this for content creation and be faster a it...for more money!! i use both mac and windows computers."}, {"text": "Hope you used a 5820K and overclock it. 4 cores for video editing? Is it really maxed out with 4 cores?"}, {"text": "The macbook is just an overall more pleasant experience. I would have bought used because the cash you save for features that are the same is huge. But the 15&quot; has it&#39;s own GPU which is rare and special. I got my 13&quot; 2014 retina for 800 bucks online, I haven&#39;t looked back since."}, {"text": "that 2000$ mac book pro costs almost 2grand. i picked up a dell windows 10 laptop with an i7 for 700$. don&#39;t care what optimizations there are. almost 3x price difference is bit hard to justify that mac. It does have dedicated gtx 960m. <br /><br />Reason final cut probably did it so fast was gpu based encoding which from my testing is a waste of time cause quality tends to suck."}, {"text": "I have new respect for Macs then :D"}, {"text": "so wait was this a video about finalcut being better? or what..."}, {"text": "The problem is not windows... It&#39;s adobe..."}, {"text": "The PC is probably better for video editing but I use a Macbook Pro because I already had final cut pro from when I was a Msc pleb."}, {"text": "I&#39;m legitimately surprised by the after effects performance. I was expecting the Eurocom to beat the Macbook. Still don&#39;t think I&#39;d switch though."}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=1m18s\">1:18</a> the face of shame"}, {"text": "I am just curious, why don&#39;t you just ask to apple for the review unit?"}, {"text": "i use iMovie hehe"}, {"text": "Can you build a hackintosh, in your workstation.. <br />THAT WOULD BE GREAT.."}, {"text": "A comparison between Final Cut und Premiere Pro on a MacBook would be intressting."}, {"text": "Why not try making a hackintosh"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23HatersGonnaHate\">#HatersGonnaHate</a> - mic drops... <b>walks away</b>"}, {"text": "Vegas VS Premier on Your &quot;workstation&quot; ?"}, {"text": "I know it&#39;s not the same but I&#39;m a fan of my $20 video editing computer running Windows Movie Maker! Just for those beginners out there."}, {"text": "something is very rotten in the state of Denmark here. What setting is FCP exporting at? how can it be rendering in the background if you haven&#39;t told it what settings you want to render it too? As a ten year FCP 7 user FCP X was a horror story and continues to be one. If FCP X is rendering out in the timeline when it&#39;s inactive then the final render out time is not accurate since it&#39;s eating CPU and GPU when you&#39;re working. Premiere needs some optimising work for sure but this video has got sod all to do with &quot;editing&quot; and a lot to do with almost meaningless render times. On a side note, Davinci Resolve tears through rendering on an Nvidia GTX card like a hot knife through butter using editing codecs. Adobe should probably hire those guys to do their optimising."}, {"text": "Ok, From a person that edits on both programs AND both platforms, if you like final cut, Deffo get a mac, call it a day. If your insistant on premiere, Your probably better off with a windows pc"}, {"text": "So, what you&#39;re really saying is that Adobe Premiere is just horribly optimized. I&#39;ve used Final Cut. I like it, but no way am I going to pay three times as much for the same hardware regardless of how pretty the package is."}, {"text": "I was thinking about switching to Final Cut Pro just so I wouldn&#39;t have to pay subscription fees"}, {"text": "Oh you opened the box of Pandora lol. I would love to see this video with lightroom instead. I&#39;m seriously considering on switching to Mac"}, {"text": "Ha loved the intro!"}, {"text": "thanks man! you probably sealed the deal for me, im probably going to buy a fully speced out 13 inch, or a lower spec 15 inch, i still havent made up my mind, and weather it would be worth to just get the i5 or the i7"}, {"text": "I have an awesome PC (i7-4790k, GTX 970 SLI, 144hz G-Sync monitor) and a Macbook Pro 15&quot; Mid-2015 and i love both machines to death. Macs are phenomenal for audio because it has a very, very good onboard DAC. Macs are also really nice when you have an iPhone because you can iMessage and make phone calls straight off your Mac. In all honesty,  OS X and Windows succeed where the other fails. OS X is fantastic for integrating your social life with your iPhone, listening to music, and having an OS &quot;that just works&quot;. Windows is also awesome because of the customization and gaming potential and the ability to make your computing experience truly personal, however not to the degree of Linux... People need to get off the bandwagons for every OS and take advantage of the features offered by each. I love my iOS devices, Android devices, Windows desktop, and Macbook Pro because each OS has their pros and cons and that is what really gives the end user the ultimate technology experience."}, {"text": "Dmitry, don&#39;t ever buy a Mac you pleb! xD"}, {"text": "if the software was tailored for all variations of setups, that are possible, the Adobe Premiere Installer would be 5x bigger. Yes, Final Cut Pro is optimized on RMBP but it&#39;s not used anywhere else.  if Final Cut does render on the background then you should prerender all the parts on Premiere, just to be correct with comparing times. And I also wonder if hard drives were bottlenecking or not (SATA vs. PCIe, or what is Apple using...)"}, {"text": "you forgot that you can put final cut on your PC? lol"}, {"text": "What about final cut on a hackintosh"}, {"text": "Let the flame wars begin! ;D"}, {"text": "Dmitry, can you do a video showing us how you do your VFX in AE? I really wanna know how to get that text style and tracking..."}, {"text": "Final Cut Pro X is the main reason I own a Mac. I can&#39;t stand Adobe software."}, {"text": "two things I picked up in this video. Adobe sucks (surprise?) and Dimitry bought a Mac."}, {"text": "should i get a i7 5820k or a i7 6700k for my new editing pc build??"}, {"text": "When will the new Macbook Pro come out? Is it a bad time to buy 2015 Macbook Pro now?"}, {"text": "the video was awesome. would love if you could do more types of mac vs pc"}, {"text": "Mac is for digital content creation and pc is for gaming.  My 2 cents."}, {"text": "MacBooks are awesome."}, {"text": "This shows that Adobe Premiere is total shit, not that Mac is some king of a miracle :D - it still is overpriced fashion gear in most cases."}, {"text": "You know... It was after I bought my Macbook Pro Retina (with i7, 16 RAM, and 1TB SSD) and did my first render in FCP X that I&#39;ve never looked back on the decision. The renders are so fast and smooth... and you can read/access/edit all the key codecs in FCP X... and I personally find the visual/tools approach that FCP X uses to be more intuitive and sensible. <br /><br />Really good video in terms of content and editing."}, {"text": "I&#39;m interested in how a hackintosh would perform"}, {"text": "You abuse your wallet like gaben abuses our wallets in sales."}, {"text": "Amazing review! Love the way you were able to show the closest way to compare them! I&#39;m happy to know that the MacBook Pro is much faster! I have one on my lap right now, and I can say that, as a YouTuber, I&#39;m really happy with this computer! It&#39;s amazing the way you can make such wonderful videos in a really easy way! Thanks!"}, {"text": "Want to edit videos and make music ? Get a Mac.<br />Want to do everything else decides making music and editing videos ? Get a PC."}, {"text": "PC"}, {"text": "I&#39;d really be interested in adding a Mac Pro into the mix to compare it to everything else. If the RMBP is that fast for rendering, I wonder how the Mac Pro would slice through it 🤔"}, {"text": "i&#39;ve been using frameserver with premiere to encode videos with meGUI. i haven&#39;t done a comparison on rendering times using a project i&#39;ve already worked on, but then i don&#39;t work with effects or color correction or cameras just yet, just game footage. i just look for whatever mp4 compressor gives me the highest quality during motion."}, {"text": "Imagine all the time and money FOX would have saved if they used FCPX vs. Premiere. Deadpool would have better X-Men."}, {"text": "Solution? Hackintosh + windows"}, {"text": "I feel like this is more of a comparison of software than of hardware because both programs have different features. imagine if premier had background rendering it probably would do better than final cut. Also software is open to changes as new versions come out and more features are added to both."}, {"text": "try hackintosh fanboy"}, {"text": "if i can watch porn and listen to music on it its good"}, {"text": "Did it took any longer to import the raw video files into FinalCut, than it did into Premiere?<br />Good video overall"}, {"text": "What about Cuda vs opencl?"}, {"text": "Great video man!"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23resolve12masterrace\">#resolve12masterrace</a>"}, {"text": "<a href=\"http://www.youtube.com/watch?v=-P5UWEKSUXo&amp;t=01m15s\">01:15</a> You did WHAT?! :)"}, {"text": "1 word. Hackintosh"}, {"text": "hell yea awesome review. notifications turned on."}, {"text": "What export settings did you use on Final Cut and Premiere? Codec, bitrate, number of pass?"}, {"text": "Haswell or skylake keeping money in mind"}, {"text": "He just goes out and buys a MacBook Pro... Good choice"}, {"text": "GOGO HC:. :)"}, {"text": "Pc is da bomb yo!"}, {"text": "I&#39;m curious how your workstation PC would do as a hackintosh machine using final cut. Although it&#39;s not a legal scenario, I&#39;d like to know for science."}, {"text": "Part of me wishes the non-retina MacBook Pro would stick around a little longer but with an additional spec bump. Considering that the MacBook Air is effectively an endangered species with the 2015 MacBook, Apple&#39;s gonna need a new &quot;affordable&quot; option to fill the void if the Airs get killed off."}, {"text": "CUDA!!!"}, {"text": "clearly consoles are better for editing"}, {"text": "Is Adobe Premier the option for PC though."}, {"text": "why not turn your workstation into a hackintosh and use final cut pro on that beast to get the best of both worlds, maybe even benchmark it as well to see the gains of doing this"}, {"text": "Whats about quality, both use the H.246 Codec but is there any difference in video quality?"}, {"text": "Can&#39;t beat working on a Mac. Look great, superb OS. Love PC hardware but Windows and most Windows software is crap."}, {"text": "mac brook really"}, {"text": "cool video thanks! Maybe I should give final cut a try :P"}, {"text": "i hate waiting for the stabilization to finish on my edits! and i hate the slow scrubbing too! but i dont know if i hate it enough to even think of a mac/apple software!! we need to flame adobe!"}, {"text": "Great video! I&#39;m using the Final Cut Pro and I&#39;m really happy with it as I&#39;m using an old 2012 underpowered Macbook Pro. The Adobe Premiere simply wouldn&#39;t work properly on it. However, I wish the FCP had some more effects that can be found on the Premiere."}, {"text": "What I miss though, how much more cheaper was the entire setup in comparison? Apple is expensive, yes. But how much did that M5 or your workstation cost? And how much did Premiere cost vs Final Cut?"}, {"text": "why not build tourself a dualbooting hackintosh?"}, {"text": "Nice vid! <br />Since you already have a Macbook, how about a review on FCPX - haven&#39;t seen any good insights on it lately. <br />Does it still has that terrible magnetic timeline? I hope they will some day return to FCP 7 style :/"}, {"text": "Next step : building an hackintosh ?"}, {"text": "Really amazing. Never thought that final cut was so impressive compared against premiere pro. <br /><br />It would be very interesting to see how that MacBook compares against a hackintosh in final cut, to see if the key component is the program itself or if the hardware optimization from Apple also play an important rol."}, {"text": "I think for me adobe lack optimization throughout every program they bundle with Creative Cloud. Indesign sometimes fails to render correctly pages. Illustrator takes way to long to render an image trace and photoshop sometimes it freezes when editing photos like 300 ppi photos for print."}, {"text": "+HardwareCanucks you have MARTENITSA on your hand or whatever you are calling it in your tradition. :)"}, {"text": "I think it&#39;s more of an Adobe vs Final Cut argument. Premiere has some serious shortcomings, even on a monster rig like my Sledgehammer. 72 virtual cores, 256GB of RAM, dual Titans, and 6 SSDs. Premiere doesn&#39;t fully take advantage of my hardware in any given situation. Adobe could do a lot of optimizing IMO."}, {"text": "Haha take that Jonathan Morrison! Apple noob!"}, {"text": "why would you use final cut though, comparing premiere on mac and on pc would make more sense to me, still a great video though :D"}, {"text": "This video is not about Mac vs. PC it&#39;s about Final Cut Pro vs. Adobe Premiere. If you&#39;re going to compare Mac to PC then you have to use the same software on both."}, {"text": "Is it only me or this video in 4k seems oversharped?"}, {"text": "I don&#39;t really see it as Mac vs PC anymore, I see it as PC vs PC. I see Mac as an OS that comes with a bunch of hardware. Both have their strengths and weaknesses, that being said, I would probably only buy a Mac if I was developing software for Mac and/or iOS users. I just simply like my every day work flow better on Linux, or Windows (yes, even Windows, I still use it sometimes). It&#39;s just my preference for what I do, and I know some people might not agree."}, {"text": "How could you dimitry? you treat your wallet like shit"}, {"text": "What about a Hackintosh?"}, {"text": "Can you revisit this topic with a hackintosh?"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23pcmasterrace\">#pcmasterrace</a>"}, {"text": "If you really want Final Cut I guess you can get a hackingtosh."}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23PCMASTERACEFORLIFEMAN\">#PCMASTERACEFORLIFEMAN</a>"}, {"text": "I tried building a Hackintosh to do FCPx and some adobe stuff. Maybe it&#39;s different  but it was really hard to get the right specs that Apple have to work with FCPx. They really fine tune the app to work with the GPU but yeah I am really surprise how fast ti can encode things. Sometime I think it&#39;ll take hours and it&#39;s done in 30 minutes."}, {"text": "Great Video Dimitry!! I love the optimization Final Cut Pro has. I don&#39;t think that a Hackintosh would be as effective as some people think mostly due to the optimization Apple does between the hardware and software on the computers they manufacture. I would love to see a video about a Hackintosh to see if you see the same benefits as the first part software from Apple. Thanks for the video!"}, {"text": "I do not video edit at all, I play games and program a ton. I love the modern looks that Apple uses but need everything my PC does, as mentioned before group environments. Classmate of mine used a Macbook Pro 15 Im pretty sure and had to try and dual boot for some things because the programming side of the world doesn&#39;t entirely like OSX, but saying that optimization is probably the only I can bring up. He tried to play some games but they ran like poop, he dual booted and got better performance, I dunno I&#39;m not opposed to switching but I game alot so this means a ton to me. Sidenote the price is another barrier I get into with Apple. The hardware compared to price for Apple is just not worth IMO......... But all in all good video! Dam Good Award!"}, {"text": "thank you for the good Apple to Apple  lol comparison"}, {"text": "I JUMPED OFF MY CHAIR ! IS THAT  WRONG? JEJE!!"}, {"text": "PC MASTER ACE"}, {"text": "if adobe products r as fast as fcpx then casual editors will obviously choose it over fcpx<br />adobe lacks two things n other being monthly sub cost which is insane for youtubers, people who r starting video editing or people who have less time ... but can some one workout how many months sub one can buy with the cost difference of pc n mac n how much time one can save in pc vs mac"}, {"text": "Nice video"}, {"text": "Actually a Mac is a pc because pc stands for personal computer. Even you phone is a pc... Just saying.."}, {"text": "ew wtf? Who edits with a Mac? That&#39;s disgusting. I edit with my Wii u."}, {"text": "Should have tried Sony Vegas Pro."}, {"text": "When Dimitri says &quot;my maxed out system&quot; he means his consumer grade PC. Not even x99..."}, {"text": "Not trying to start a flame war, but you could also try building a hackintosh with final cut and test it out vs. your main workstation, a macbook pro and your notebook. I&#39;d like to see that."}, {"text": "What lenses do you use? Great video btw!"}, {"text": "I love Final Cut Pro X on my dual boot of Win10 and OSX. But I refuse to pay for the joke of prices that Apple charge."}, {"text": "The only reason why apple optimazation is great it&#39;s because apple has only 1 laptop(lineup) that they can optimize a software for it."}, {"text": "HACKINTOSH, HACKINTOSH, HACKINTOSH!"}, {"text": "Great video.  Thanks.  This helps me since I will be traveling soon and I&#39;ll need to edit on the fly in my hotel room.  For me though, it makes sense to stick with Premiere on my MacBook Pro since I already own the software on my PC workstation.  I&#39;m really looking for portability more than speed.  I can pre-render my channel intro so it will help (only slightly), but at this point I&#39;m sticking with Premiere.  In the long run however, I will most likely purchase Final Cut as well on my MacBook Pro."}, {"text": "this is interesting i recently moved from final cut pro to premier cc and honestly the only thing i miss is the background rendering i love that i have freedom when it comes to what machine i want to use i can use my workstation (formally an imac with an i7 8gb ram and a descrete amd gpu now a pc with a i7 and a 970 plus 32gb of ram)  or i can use my laptop (formally a macbook pro with i7 4gb of ram and a descrete amd gpu and  now a dell xps 13 with i7 skylake 16gb ram) or i could go back and use my old macs again and since so many other people i work with use premier now it made it a pain when working on projects together and it plays alot nicer with after affects witch is always a good thing"}, {"text": "This is the power of an all-in-one package. 100% Support. . ."}, {"text": "You should try windows on the Mac with premiere pro"}, {"text": "I wonder what would happen if the same clip was rendered in Sony Vegas Pro. :-/"}, {"text": "I knew linus would never do this."}, {"text": "has anyone tried <a href=\"http://www.youtube.com/results?search_query=%23FCPX\">#FCPX</a> on a hackintosh??"}, {"text": "I don&#39;t use a laptop for gaming so a 13 or 15 inch Macbook pro would mac more sense for me personally. It runs  OSX, Windows and with a few tweaks Linux, Chrome OS or even Android. Mind you a PC can do all of that too, but it requires more effort than some people are willing to put in. Hackintoshs even when following the exact guide given have been buggy for me at best and spending the hours to figure out why is something I just don&#39;t have. I rather get the Macbook and boot camp it rather convert a PC into a hackintosh any day. Mind you when it comes to desktops I still build my own."}, {"text": "Eh.... I don&#39;t think at all that the MacBook pro is doing all by cpu, I think it&#39;s using quick sync all the time and so with lower quality results than cpu encoding.... It&#39;s something to investigate BTW."}, {"text": "It&#39;s more about Adobe vs. Apple I guess... And here is Apples clear advantage, they know which hardware they have to optimize their software for. It&#39;s like Google which has to make an Operating System for hundreds if not thousands of different smartphone hardware whereas Apple only has like ten or so different Phones/Tablets.<br />And before anyone starts flaming, I use an iMac for my daily work and some light video editing as well as, hold on, even a little gaming from now and then on.<br />Now, take out your guns fanboys an demolish me! :D <b>grabs popcorn</b>"}, {"text": "OK let&#39;s try now with an alternative to premiere and final cut. iSkysoft video editor work on both platform and seem to be the best alternative to Adobe product. Make this combat logic. Apple Vs PC Vs Adobe. compare what it&#39;s possible to compare not what it&#39;s already different. Peace"}, {"text": "It&#39;s my understanding that in 2015 Adobe removed a lot of the GPU rendering from CC. I&#39;m not sure why, but they &quot;promise&quot; it will return. <br /><br />Render times aren&#39;t as important to me as smooth playback and AE integration. I think what you&#39;ll notice is that things like Warp Stabilizer, it has more Pro level setting options that YouTubers maybe won&#39;t find use. For example, Deadpool was edited in Premiere Pro CC, not FCP. Just a thought."}, {"text": "2 things, 1) what case is that? 2) I&#39;m really glad you made this video. I&#39;ve been using FCP X on my MBP for a while, and I&#39;m always surprised that the export times are almost always a couple of minutes even though I&#39;m running a now 4 year old computer. Happy to see that you were open-minded to test this out, be pleasantly surprised, and then share your experiences."}, {"text": "Dmitry, great video. Now do it again with your promised Hackentosh!  Really did enjoy the comparison"}, {"text": "Also, please, stop capitalizing Mac... it&#39;s not an address"}, {"text": "It&#39;s got something to do with software rather than hardware. So yes this is not Mac vs PC"}, {"text": "PC all the way boys......"}, {"text": "Would be interesting to see how FCPX in a Hackintosh compares to the MacBook... not so much for a production setup (it&#39;s well known there are many stability issues), but just to test whether FCPX can make use of all the hardware power available in a custom PC"}, {"text": "How about Mac vs Windows? Both are to some degree PCs."}, {"text": "Some one did the same type of review and came to similar results but he edited the video when he found out that by unchecking the open GL tab cut PC editing times by 2/3 and then the PC won"}, {"text": "Also to those wanting to see a Hackintosh comparison on his desktop - via tweets between MKBHD, TLD, et. al. they&#39;re saying their Macbooks render faster than Mac Pros due to FCP optimization for Intel iGPU - which means this is not &quot;PC vs Mac&quot; but &quot;MacBOOK FCP optimization vs Everything else&quot;"}, {"text": "Intel Quicksync support is key here. Pretty much all new Intel iGPUs have a dedicated encoding chip, and it happens to be one of the best of all the major GPU manufacturers in terms of quality. It decreases encoding times vastly, and IMO too few applications utilize it, Premiere Pro being the biggest one. Also, they really need to figure out how to make it work well if you have a dedicated GPU. Since desktops don&#39;t have switchable graphics, you need to do some workarounds to enable the iGPU and get Quicksync functionality. Either that, or add support for the other two main hardware encoders, AMD&#39;s VCE and Nvidia&#39;s NVENC (the same thing used for Shadowplay)."}, {"text": "Linus should do it"}, {"text": "I was SUPER interested in this conversation when it started, but I feel like it&#39;s gone out to left-field.<br />Like... render times are not all that important. Yeah, sure, if you&#39;re editing/rendering on a laptop (Macbook) it might be, but for the rest of us, raw render times are only a TINY portion of the equation.<br /><br />The editing workflow &amp; experience on a laptop (I keep bringing that up because I&#39;ve seen MKBHD/TLD/etc. talking on Twitter that their Macbooks are rendering better than their Mac Pros due to the iGPU stuff etc etc) is going to be quite limiting compared to a comfortable, multi-monitor editing setup and workflow on a desktop.<br />And for those of us (which should be a majority given video editing is never JUST video editing), utilizing the entire Adobe Creative Suite is kinda key (Audition, Photoshop, AE, etc.) so using FCP just because it can render faster doesn&#39;t seem like the best choice.<br />And not counting in prices and fanboy stuff and all the BS.<br /><br />I&#39;m actually highly interested in getting a 2016 Macbook Pro at some point when I can afford it, but I don&#39;t plan on it EVER being my main render machine, regardless of how quick it is.<br /><br />And I know Dimitry already knows that timeline scrubbing can be sped up via Cineform transcoding."}, {"text": "Now make a Hackintosh then repeat these tests."}, {"text": "+HardwareCanucks Good video but you are missing one crucial part of your benchmark. Running FCP on windows, I know it is not natively available for windows but perhaps it can be run using a virtual machine, this way you can utilize FCP features with the PCs hardware performance. Possibly even using a hackintosh would improve performance greatly."}, {"text": "step your damn game up Adobe<br /><br />For the people bringing up hackintosh, the hardware apple chooses is apart of the optimization so it may not be as viable as you think."}, {"text": "Macs are nice, but underpowered for their price point. If Apple didn&#39;t charge so much for their products I would be more interested in them."}, {"text": "Hackintosh on the PC now lol"}, {"text": "SOoo software wise the mac is better...Why cant you just get the mac OS on your customized PC?"}, {"text": "eeoooaaa Don&#39;t understand any shit.... Sorry"}, {"text": "Windows Live Movie Maker FTW!!"}, {"text": "Now, try it on an hackintosh ! ;)"}, {"text": "install MacOS onto your workstation PC and run the Final Cut. PROFIT!"}, {"text": "How about testing it against something that isn&#39;t slow beyond compare to render (Premiere). You can&#39;t compare a piece software that does something (rendering the background) with one that don&#39;t. That is like comparing someone who works 16 hour a day with someone who works 4 housr a day, then to find out yeah the 16 hour guy got the job done in fewer days. That would be kinda self explanatory."}, {"text": "finalcut 4 windows....."}, {"text": "MAC IZ BETTUR CUZ PRICIER $$$"}, {"text": "I think It depends on the codec used on the footage capture."}, {"text": "I am curious what would happen if you somehow were able to put Final Cut on your PC. Not as a Hackintosh, but just installing it. Probably won&#39;t happen though. Good video."}, {"text": "Such a helpful vid!! Thank you thank you thank you!!! I personally use Vegas Pro, which I think would be giving similar results to Premiere. I&#39;ve got access to a Mac, so I think I&#39;ll be giving Final Cut Pro a go 😁"}, {"text": "Nicely done. Great video!"}, {"text": "Next step, hackintosh!"}, {"text": "So the question isn&#39;t if the Mac is better, because it proved it wasn&#39;t better. The problem is that adobe sucks vs final cut."}, {"text": "i think macbooks are extremely sexy and sleek computing devices, i&#39;ve been thinking and adoring those for a while and i will get one eventually. this video was insightful, thanks for it!"}, {"text": "whats your camera?"}, {"text": "Brilliant video.  Adobe needs to step up their game."}, {"text": "&quot;Let&#39;s sell cheap hardware for more than it&#39;s worth&quot; - Apple"}, {"text": "I would use FinalCut on an overpriced weak Pos Mac than Adobe on my powerful PC, not for optimization or speed, but because FinalCut doesn&#39;t have bullshit subscription only payments. That said, I want to see this test done with dual boot hackintosh to see how much of Apple&#39;s optimization is software side rather than software to hardware."}, {"text": "i would be interested to see the benchmark results on a hackintosh. also, what speakers are those? they look clean."}, {"text": "Linux"}, {"text": "This was a really interesting video! I was astounded by the render times but does the Mac not have a super expensive M.2 PCI-E SSD (Samsung PM951 I believe) that costs a ton? That would make it work significantly faster and I bet adding that to your desktop would change the benchmarks a ton (unless you have one in there, idk what your build&#39;s like). The Eurocom also has a 1TB SSD but I don&#39;t know what type you have in there. <br /><br />I actually bought a 2015 MacBook Pro for doing CAD in school and although is is a beautiful machine, it would just chug. I now have a Dell XPS 15 that cost a fraction of the MacBook and it runs flawlessly. It&#39;s great when optimization works for Mac but realistically imo a normal workflow won&#39;t include Apple programs exclusively and that&#39;s when the cost of hardware makes the optimization of a few programs like Final Cut moot."}, {"text": "Does your workstation look cute and fit in your manbag so you can do your editing in Starbucks and everyone can see your stylish Apple logo ? Don&#39;t think so !"}, {"text": "change your workstation os to a hackintosh"}, {"text": "they should port the binaries to linux..."}, {"text": "Isn&#39;t this more telling about Adobe&#39;s shitty software instead?   And Dimitri, PLEASE get your hands on a Hackintosh and see how it performs versus your MBP, pretty please?"}, {"text": "I don&#39;t see this as a Mac vs PC comparison, but more as a Final Cut Pro vs. Adobe Premiere comparison. It&#39;s purely a software advantage, nothing to do with hardware and hardly with the OS. The only thing with Final Cut Pro is that you need to have a Mac to use it. If they&#39;d be bothered to make a decent version for Windows, you&#39;d get the same results on a similarly specced Windows laptop compared to this 15&quot; Macbook Pro."}, {"text": "So was that PC still worth sacrificing X99?? XD"}, {"text": "But since you only bought the mac recently surely it wouldnt have many files and junk stuff on it where as your, workstation PC has loads of programs open eating up the power? Please tell me if i am wrong."}, {"text": "I have a feeling that dbrand sent out that macbook"}, {"text": "Let the battle of MAC and PC begin!"}, {"text": "Well now the question is : will final cut be this powerful on a hackintosh machine ?"}, {"text": "Turn that workstation into a Hackintosh."}, {"text": "What if you turned the workstation pc into a hackintosh and ran finalcut on that?"}, {"text": "I have started to like apple"}, {"text": "thats it, macs are &quot;not&quot; that good, final cut is, adobe optimisation is horrible, and its really impresive for such a low spec mac, to do the work that it does, still over priced as hell. But.....will the results be better on a pc workstation W/ mac OS and final cut? is it posible to do a video?"}, {"text": "Both pc and Mac are beautiful machines. All down to what software you want to run untimely. I don&#39;t video edit but I prefer Mac OS for general use but obviously for gaming it&#39;s Windows all day. You have to give it to apple for build quality though. Although I&#39;m not saying all pcs hate bad build quality just with a Mac you know what you&#39;re going to get."}, {"text": "Are you sure you had GPU acceleration enabled and were using a CUDA capable codec to export? Doesn&#39;t seem like it would be that much faster, but I suppose even macs are good for something sometimes."}, {"text": "I AGREE! I have a macbook pro for school, video editing and internet browsing and I have my own built PC for gaming and such and I love both for what they do best."}, {"text": "It&#39;s not about any hardware or software, it&#39;s about their synergy  &amp; optimisation which makes both of them more efficient..."}, {"text": "Finally it&#39;s here"}, {"text": "lets start a framewar you guys decide the topic"}, {"text": "mac are more for content creation and modded pcs are more for gaming ... shouldnt be a surprise, its been like this since the beginning of time"}, {"text": "Why do so many people get offended that some people prefer Mac over PC or vice versa? Who cares? They both have strengths and weaknesses. They both make people money. They both make people happy. They both frustrate people. I&#39;m not saying they should never be compared, I just don&#39;t understand people who take it to a personal level (name calling, insulting, etc...)."}, {"text": "Well Mac is for working Pc is for gaming but still im a gaming so pc all the way"}, {"text": "Excellent and thorough comparison, impressive! thank you!"}, {"text": "conclusion:<br />Adobe is piece of shit company"}, {"text": "I still think fcpx is the superior video editing tool, and its way more user friendly than premiere pro"}, {"text": "mac for gays"}, {"text": "Martenitsa instead of some bullshit smartwatch , I salute you for that ! <br /><br />But yea, for video editing apple products are a solid choice, in the laptop category probably best (not sure if we can count that asus laptop with the liquid cooling cause its kind of weird)."}, {"text": "WOW"}, {"text": "I&#39;m pleased to see you opening your eyes to what is out there and giving the hardware a fair review. It&#39;s more expensive, it&#39;s a gated garden, and it lacks the true customization and upgradeability of windows machines... but excels with multimedia applications. My Mac is over 3 years old, and I have not felt the desire to upgrade. With a windows laptop, I was replacing it every two years. It&#39;s still as fast as the day I bought it. I still have a PC, and I use it for certain things, but I love my Macbook Pro for programming and multimedia."}, {"text": "Macbook pro is a beast! Can&#39;t wait till the 2016 version comes out :)"}, {"text": "Nice to hear that there are people like me who can appreciate both devices/OS&#39;."}, {"text": "I run OSX 10.11 on my custom PC (i5 4440, 16GB, GTX 960). I used to have Windows 10 earlier, and its true that FCPX is quite faster than PrPro.<br /><br />My intention when hackintoshing my PC was to give FCPX a try, and maybe shift over to it. But I still end up using PrPro, because I&#39;m just used to it, and it works well with Ae."}, {"text": "Thanks Dmitry for these video. You nail the word optimized. It will be great to see that else you can make using the platform! Cheers"}, {"text": "Science Wins!"}, {"text": "I always hate how Android fanboys are like &#39;oh look, the new iPhone has outdated specs, lmao who even gives money for that&#39;, then watching a speed comparison between an iPhone and a flagship Android device and the iPhone being just as fast or even faster. Don&#39;t get me wrong, I have an iPhone but I&#39;m 100% sure my next smartphone will be an Android, since I&#39;m tired of the absence of customization."}, {"text": "MACs are good for work ... Beyond work, it falls to the PC to do the job ..."}, {"text": "Interesting"}, {"text": "I&#39;m glad this isn&#39;t a Mac vs pc video because Mac and pc both have there place."}, {"text": "In all fairness, you have a gaming PC, not a workstation. I have almost the same setup (SSDs in RAID0) and I wouldn&#39;t call my PC video editing ready. It&#39;s not bad, but it&#39;s not perfect. From a dual Xeon setup upwards we can talk about a workstation."}, {"text": "Now turn your main rig into a Hackintosh and repeat these tests."}, {"text": "Oooh, so tempting. My only expereince with Mac&#39;s was when I was working at my local newspaper. At least I could concentrate on work, when I couldn&#39;t do anything else :) That text editing program was simple, but I couldn&#39;t picture the end result as well as with Word.<br /><br />I can live with render times, but uploading to YouTube is probably more annoying problem for me."}, {"text": "The benefits also carry over to a hackentosh. Compared to adobe,  Apple has been dealing with underpowered hardware longer,  and thus put real effort into GPU acceleration, in as many areas as possible,  while with adobe,  only a select few aspects of the timeline,  and export have GPU acceleration. For example,  adobe refuses to implement quicksync and nvenc into their software, both would significantly cut down on the render time.  Little to nothing makes use of openCL or CUDA.<br /><br />While the MacBook Pro may be very under powered,  even it&#39;s low end GPU,  will crush a top end core i7 when it comes to video related tasks."}, {"text": "The results speak themselves.<br /><br />Adobe, your move."}, {"text": "Being a well rounded person when it comes to technology is good especially when you are a tech reviewer."}, {"text": "I prefer Final Cut, I use it in my film class and it is beautifully efficient."}, {"text": "TLD would be happy"}, {"text": "I&#39;ve been looking for a video like this for years"}, {"text": "Great video, thanks. Premiere is a real power hog. When you think of it even having RAID 0 SSD, GTX 980 and i7 CPU one can struggle to comfortably work with 4k videos. Crazy... Adobe - how about including one button solution for down-sampling all your clips while working on the project and using original videos for final output?"}, {"text": "You should think about adding another ssd to your rig and installing OS X(hackintosh) on it. tonymacx86 guides make it super simple."}, {"text": "Thanks for the insightful video!"}, {"text": "Is was planning on giving you a kiss but you gone eat my skittles and I lost my pony just before that night we didnt went out but his dad was a bitter man with lots of regrets in his eye. As I walked down the steppes to the hallway I realised that he was actually the shadow who followed me last night on my way home from work I ordered pizza and for some reason we did not find a tape measure so we had to get like some sort of wand which Gandalf the gray stabbed the ground with and yelled &quot;I AM YOUR FATHER, NEO!!!&quot;. Good review and I wrote this in a hurry while I was picking up poo and ofc my dog decided that HE was the designated driver that night....douche... but we finally made it to Neverland and managed to kill Peter with Harrys wand of justice."}, {"text": "I still do not understand how your have so little subs? Seriously?"}, {"text": "I bet now your gonna ditch all your PC gear <br />and get a Mac Pro and start reviewing Apple products and get stuck in their beautiful prison aren&#39;t yah ?<br /><br />/s"}, {"text": "i totally agree with you but does you really need this... i mean as i&#39;m a fan of your work and watching every video of yours.. do you really need this 10min faster render time?? your videos aren&#39;t like 1 hour long  .. so i thing this won&#39;t make a HUGE difference in your render times ..."}, {"text": "dislike video because I can&#39;t afford a macbook."}, {"text": "Try your workstation config for an hackintosh maybe to see the difference between final cut and adobe ?"}, {"text": "More PC vs Mac stuff in the future please!"}, {"text": "could you please try a hackintosh on your main editing pc so you could try wether final cut is optimized for Mac OS or for the apple hardware and you would have maybe better performance in video editing on your pc. so you could get the best out of both systems"}, {"text": "OH hi Svetlana! I&#39;m glad you like your apple gear!"}, {"text": "just buy a Mac Pro, should be a good investment for youtubers"}, {"text": "Mac&#39;s the Best!"}, {"text": "Did you buy final cut? I&#39;m just using iMovie now and got sticker shock. $400!"}, {"text": "Can&#39;t argue with results lol."}, {"text": "The only problem I see is that it&#39;s not all about render times, what happens when you have to do stuff in After Effects or better yet.  When you have two people editing the same video (group environment).  Final Cut lacks so many features that Premiere has that you have to pick your poison.  I think both platforms are great and depending on what your workflow is like one will outshine the other.  Let&#39;s not forget about codec either, that can make a huge difference especially on the PC side.  Using Cineform or Prores on Premiere will cut through it like butter, great video non the less!"}, {"text": "I&#39;d say the pc render times would be much faster if he had a 5960x in the pc, the 6700k is only a quad which is mainly used for gaming"}, {"text": "Really good video! Makes me wish they were a bit cheaper.."}, {"text": "No, Dmitri, it&#39;s a trap!"}, {"text": "I&#39;m saving for a MacBook now because of this Video (until now I was strictly a pc user and have an X99 build)<br /><br />Don&#39;t hate, just appreciate."}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23HardwareCanucks\">#HardwareCanucks</a> ohmigosh I wasn&#39;t expecting to see those numbers! Do you think the price of that gear will be offset by the productivity enhancements?"}, {"text": "I dont know what for a shit workstation you have haha <a href=\"http://www.youtube.com/results?search_query=%23neverapple\">#neverapple</a>"}, {"text": "I have the luxury of both PC Desktop, Gaming Laptop 4910MQ @4.2GHz, Macbook Pro, Premiere, and FCPX.  FCPX is way faster in almost every way. Although I prefer Adobe Premiere because I&#39;m more comfortable with it and I can edit on all machines with it but once I learn FCPX I might stop using Premiere all together. Don&#39;t nock it till you try it. overpriced is something people who can&#39;t afford say without even trying it in most cases anyway."}, {"text": "I have the luxury of both PC Desktop, Gaming Laptop 4910MQ @4.2GHz, Macbook Pro, Premiere, and FCPX.  FCPX is way faster in almost every way. Although I prefer Adobe Premiere because I&#39;m more comfortable with it and I can edit on all machines with it but once I learn FCPX I might stop using Premiere all together. Don&#39;t nock it till you try it. overpriced is something people who can&#39;t afford say without even trying it in most cases anyway."}, {"text": "I do wonder what kind of results you&#39;d see if you make your desktop a hackintosh. Perhaps Final Cut is just a better program than premiere, where the hardware optimization plays no role."}, {"text": "install mac on workstation pc (hackintosh), download final cut pro, problem solved. <a href=\"http://www.youtube.com/results?search_query=%23teampc\">#teampc</a>"}, {"text": "Loving my 15&quot; Macbook Pro with M370x. I have no doubt it is better for what I need it for and I am loving Final Cut Pro X. My workflow is much much better!"}, {"text": "Johnathan Morrison would be real happy now."}, {"text": "Insightful video!  Thanks for the upload."}, {"text": "nooooo don&#39;t go to the apple side...."}, {"text": "Thanks for this Dmitri! It was pretty damn helpful. I currently use the Adobe suite on a PC. But I was planning on getting a macbook because of how portable it is and still use Premiere on it. But I&#39;ve now realized that working with Premiere on a Mac would be a lot harder. Thanks!"}, {"text": "It&#39;s all software stuff not hardware, the only thing if final cut only has to deal with 1 OS in development while premiere is &quot;multy platform&quot; i think they will eventually have the idle rendering as well it&#39;ll just take them a bit"}, {"text": "Finally someone did a conclusion! Thanks Dimitri :)"}, {"text": "Final Cut is shit, but MacBooks are really durable and with a dedicated graphics card preatty good for video editing on the road."}, {"text": "This video would be really interesting if you can find exact same specifications of Mac from PC world and compare Apples to Oranges."}, {"text": "The Phantek evolv is so sexy"}, {"text": "I&#39;m not sure if I need to applaud Apple for their optimized software eco system or laugh at the joke that is Adobe."}, {"text": "Build a hackintosh Dimitry"}, {"text": "finalcutt is the only good things about macs."}, {"text": "Watched full video I think I should get mac"}, {"text": "Can you build a hackantosh and test this again? :D"}, {"text": "Just build a hackintosh, solution to all problems"}, {"text": "Actually was the best video ive seen about a mac device by a PC user."}, {"text": "Nice video!"}, {"text": "guys, I&#39;m a PC user through and through. but the numbers speak for themselves. The optimisation you get from apple finds plenty of real life application in things like video editing."}, {"text": "why not build a Hackintosh and dual boot windows/OS X?<br />you get everything good from the windows side of things but you get the convenience of OS X/Final Cut Pro x"}, {"text": "only reason FAST RENDER"}, {"text": "lame late april joke"}, {"text": "Apple is Shit its so overpriced"}, {"text": "Curious to see the results! Watching now"}, {"text": "Damn it guys! Jon got to him!!!!"}, {"text": "I&#39;ve always said, mac and PC both are great at many things and not so much in others, this proves my point, sure I&#39;m not a fan of Apple but gotta give credit where its due, If you can&#39;t respect all types of PCs then you are the reason the PC community gets a bad rep in the eyes of everyone for being so argumentative with eachother."}, {"text": "When I saw the thumbnail, I thought a new TLD video went up, not a HWC video.."}, {"text": "mac is a  pc pc stands for personal computer"}, {"text": "1 like = 50 years in prison"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23PCMR\">#PCMR</a> lol ;p"}, {"text": "nice but <a href=\"http://www.youtube.com/results?search_query=%23TEAMPC\">#TEAMPC</a>"}, {"text": "Lol"}, {"text": "mac should stay in cheese"}, {"text": "Third"}, {"text": "3rd"}, {"text": "first"}, {"text": "Nice"}, {"text": "first"}, {"text": "Let me think of a joke<br /><br /><br /><br /><br />Mac."}]