[{"text": "Hi Jane, thanks for posting it. I really like the music and want to practice it. but which version of the music sheet ? thx"}, {"text": "Hi, i dont know what is m1,m2,m3,m4....Can you explain? Thank you so much!"}, {"text": "Where can I get the sheet music for this?"}, {"text": "Jane, I like this song very much and your tutorial is awesome . Would you please show the score?"}, {"text": "Oh My God.  Thank you so much for this.  Hands down, the best tutorial EVER!  No pun intended, although...."}, {"text": "Thanks for putting this video tutorial up."}, {"text": "Excelente !!<br />Thanks from Colombia."}, {"text": "i found it<br />thanks jane"}, {"text": "thank you so much mrs jane , its help me a lot ,😊 greeting from indonesia"}, {"text": "Which is the level of this piece?"}, {"text": "This is the best tutorial I have found for this song! You rock Jane!"}, {"text": "Thanks Jane for supporting us. You are very talented. I hope I can play like you some day. greetings from Brazil."}, {"text": "Do you have sheet music for this one, Ms. Jane?"}, {"text": "Hello Jane, this is hi from France, i&#39;d like to thank you for your work, it helped me a lot when i tried to learn this piece, a few years ago :) I&#39;m currently having a go at it again, with a live version of Yiruma you can find here <a href=\"https://www.youtube.com/watch?v=rhN7SG-H-3k\">https://www.youtube.com/watch?v=rhN7SG-H-3k</a> and i&#39;m in trouble because of course, Mr Yiruma doesn&#39;t always do the exact same thing. For instance, at the beginning (matching your version between 1&#39;22&#39;&#39; and 1&#39;40&quot; approximatively), the right hand repeats itself ; that much i can understand, and it&#39;s absolutely gorgeous but i&#39;m utterly unable to find out how the hell he is playing with the left hand at the same time. Poor hearing, and poor me too ;)<br />Well, would you be kind enough to enlighten me, if you&#39;re able to ? That would be really, really great !!<br />Anyways, thank you for everything, and i&#39;m looking forward to having good news from you (well, maybe).<br />Sincerely yours,<br />Nervi"}, {"text": "This is by far the best piano tutorial for the song I&#39;ve ever seen! God job and thank you so much for this perfect tutorial! You totally mastered it ;)"}, {"text": "Can you make a tutorial , &quot;Mistral Gagnant Renaud&quot; pleaze il slow , Thanks from france"}, {"text": "Thank You Jane ! ♡"}, {"text": "Nice job! Feel free to watch and react to my version of this song on my channel :)"}, {"text": "when i heard this one ( river flows in you) i felt in love with piano 🙈 and then i decided to learn it <br />.. Amazing God bless u ❤"}, {"text": "Thank you so much Ms. Jane! I&#39;ve subscribed and made sure to also like each video I watch from your channel. All of these has been very very helpful and inspiring. =)"}, {"text": "thanks man"}, {"text": "what level is this song？"}, {"text": "Thank you so much for all the beautiful piano tutorials, Jane! It has helped us a lot. <br />I have a request for you. Can you please make a tutorial for the soundtrack from the movie Jane Eyre 2011 &#39; My Edward and I&#39;.<br />I&#39;m very sorry for bothering you, but i don&#39;t know how to read notes but i would so love to play it. Please try your best. and also make a slow version of it so that it&#39;ll be easy to follow. <br />Thank you so much, Jane!"}, {"text": "Thank you Jane!!! It helps a lot!!!"}, {"text": "What sheet music are you using?  I see so many variations out there?"}, {"text": "bless pope"}, {"text": "Ok thank you so much Jane :-)"}, {"text": "Beautiful"}, {"text": "Excellent piano tutorial, Greetings!"}, {"text": "Thank you so much for this it helped me with the part I was stuck at !"}, {"text": "Hi Jane I love  this tutoria I think that you´re a great teacher  I can´t play like you :(  I don´t know but  the sound is different when I play  and I don´t know why    I would like to send a recording  and  you could correct me please   this is the song that play  on a recital   and I want play this song  like you  :)<br />sorry I don´t speak english  very well  Thanks."}, {"text": "It would be nice to what keys you press clearly "}, {"text": " I Still cant play this song"}, {"text": "Nice tutorial (;"}, {"text": "thisis sooo helpful. i cant play both hands together but this video helps cause i can work out which notes are played at the same time :) thankyou!!!! "}, {"text": "I love your tutorials Jane! Always enjoyable and helpful. Could you help me learn Regina Spektor&#39;s Old Jacket? <a href=\"http://www.youtube.com/watch?v=e40j9MyPPD8\">Regina Spektor - Old Jacket (Stariy Pedjak)</a>"}, {"text": "FINALLY someone that shows when to use the left hand slowly with the right hand, you are brilliant!!!!! Favorite tutorial of this song!"}, {"text": "congrats. keep playing :)"}, {"text": "that&#39;s good news :)  good luck and have fun learning it"}, {"text": "you&#39;re welcome. have fun learning it."}, {"text": ":)"}, {"text": "thank you so much for updating this,ma&#39;am :D I&#39;ve been looking for this tutorial for a long time :D"}, {"text": "The only sad thing is, I can&#39;t like this video more than once :("}, {"text": "you&#39;re welcome :)"}, {"text": "thank you !! alam ko na pagsabayin .. :D"}, {"text": "if you study, you will :)"}, {"text": "I do not know english"}, {"text": "that is not a sentence, and whatever you see is not a skirt :)"}, {"text": "DOES ANY ONE of the skirt :)\n"}, {"text": "thank you. I did upload an at tempo tutorial."}, {"text": "Awesome teacher! I would love to hear you play this song at regular tempo"}, {"text": "thanks for understanding"}, {"text": "it&#39;s ok no problem, thank you anyway."}, {"text": "sorry, copyright problems. please read the webpage why I will not make new Yiruma tutorials."}, {"text": "very useful thanks, plz  can you make a piano tutorail of this music &quot;Yiruma Ever Since&quot; it&#39;s beatiful music really"}, {"text": "if I recall correctly, it would be about Level 5."}, {"text": "At what level is this song? I&#39;d really like to learn it. :)"}, {"text": "back then, there was a 10-minute limit. this squeaked by..."}, {"text": "you&#39;re welcome. hope you finished it :)"}, {"text": "A bit slower perhaps?"}, {"text": "thank you"}, {"text": "exelent\n"}, {"text": "thanks :)"}, {"text": "big like for u, clear tutorial which i don&#39;t see at anyone else&#39;s tutor &lt;3\n"}, {"text": "you&#39;re welcome :) thanks for writing."}, {"text": "don&#39;t know that, but thanks :)"}, {"text": "I would pay good money to have hands like that. My hands are so small I can&#39;t even reach an octave. Try learning piano with my hands. The hands in this video are very beautiful."}, {"text": "thank you :)"}, {"text": "Mabuhay!"}, {"text": ":)"}, {"text": "LIKE!!"}, {"text": "you&#39;re very welcome. your papa is lucky to have you :)"}, {"text": "Thank you so much! this is great I could learn it and show it to my papa so that he will be proud! thank you so much!"}, {"text": "Its not a him Gosh. Cant u tell? Xx"}, {"text": "Well, his fingers are pretty long and quite ideal for playing the piano so I guess his &quot;anorexic&quot; hands are pretty awesome."}, {"text": "Was it you who posted a video response? Read the video description and didn&#39;t see it had anything to do with my tutorial. Clicked ignore (I get too many). Sorry. Good playing by the way."}, {"text": ":)"}, {"text": "Че качества лучше нет?"}, {"text": "you&#39;re welcome. thanks﻿ for the compliment too :)"}, {"text": "you&#39;re welcome. and thanks for the compliment :)"}, {"text": "Thank you so much this is the best tutorial I&#39;ve found"}, {"text": "That song is so romantic and you did it more romantic:)Im in love"}, {"text": "csal!\n"}, {"text": "I did? you&#39;re welcome :)"}, {"text": "You save my life. Thanks !!!!!!!!!!!!!!"}, {"text": "thank you :)"}, {"text": "you are good"}, {"text": "thanks man, i have the sheet but don&#39;t know the finger kombination :))"}, {"text": "you opened an account just to say that? lol"}, {"text": "jeigu jau groji tai grok greiciau as vos neuzmigau :PPP\n"}, {"text": "If you are playing the correct notes, then it must be your counting. Use a metronome, play slowly, and increase the tempo gradually upon each repeat."}, {"text": "i can play this song. but when why i play it at normal speed, it just seems off. why is that so?"}, {"text": "they usually line up vertically in the sheetmusic. are you following the sheetmusic?"}, {"text": "Okay I&#39;ll give that a try, thank you! Also, how do I know which notes from the right hand and left hand to play together? Does that makes any sense?"}, {"text": "just practice with 2 or 3 of the hardest measures. play so slowly that both hands can play together. best is to use a metronome. upon each repeat set it a TINY bit faster. soon you will be at tempo. the brain will adjust and you will be able to coordinate both hands from then on."}, {"text": "Can you help me? I&#39;m able to play both the right hand a left hand separately, and can play them together in the very beginning of the song when it&#39;s still rather slow and mellow, but once the tempo kicks up, (m4) I can&#39;t seem to figure out how to play both parts together. Any pointers? I&#39;m desperate, as this is one of my favorite songs. Thanks!! :)"}, {"text": "Those hands :o\nBut you can play so beautiful :)"}, {"text": "I like the way you react to people hating :) don&#39;t ever let it bring you down! You are an awesome human being^^"}, {"text": "thanks, u save :) ! i really like u &lt;3"}, {"text": "Tutorial"}, {"text": "Best tuorial eva !!! Tysm u helped my LIFE with this video ty ty ty"}, {"text": "you are all very welcome"}, {"text": "Thank you so much for all of the advice, I really appreciate it.  I agree with your quote too. :)  And thank you I&#39;ll try to get in touch with her.\nBest regards."}, {"text": "It&#39;s important to build a strong foundation. My website &quot;scales&quot; page lists two highly recommended technique-building books. You can add YT songs  to spice up your learning. Pay attention to your posture. And don&#39;t be anxious, doing anything well does take time, right?  If you have questions about which books to learn from, contact Cheryl at piano-pal. She is a piano teacher, friendly, helpful and knowledgeable."}, {"text": "PT. II months and it makes me anxious, I need to advance.  How do you suggest I go about doing this?  I can play two full Alicia Keys&#39; songs (learned from sheet music) and River Flows in You (from sheet music) as well as several bits and pieces from other works.  However, it takes EXTREMELY long for me to learn because my foundation (reading bass clef, playing with both hands) is not very strong.  Do you think I should invest in beginner&#39;s piano books or YT tutorials?  Thanks. :)"}, {"text": "It...vexes me to see all of these ignorant comments on your videos; people always feel the need to type their opinions to strangers today, no matter what they&#39;re doing.  I, for one, appreciate your works, thank you.  I&#39;ve been playing piano for a little over a year but am fairly good.  I played clarinet and saxophone for 4 years prior, so I began piano knowing how to read the treble clef very well.  I took lessons for about 6 months, but now I&#39;m on my own.  Progress has been slow these last few"}, {"text": "i took lessons from age 12 to 17"}, {"text": "At what age did you start playing the piano? Apology my English, I am Argentine"}, {"text": "haa thank nha cam on nhung cIip nay gjup tui hoc rat tot trong thoi gjan wa ^^\nrat chan thanh cam on "}, {"text": "mmmmh. i dont know its to complicated"}, {"text": "sorry, no more yiruma tutorials. too many copyright issues."}, {"text": "Can you make a tutorial for &quot; YIRUMA REMINISCENT &quot; ?"}, {"text": "Thanks a lot from Switzerland. This tutorial is a big help for learning this wonderful song."}, {"text": "tenia alguansa dudas sobre esta cansion pero me di cueta gracias ati que abia escrito la partitura mal gracias eres la mejor "}, {"text": "sheetmusic is just sheetmusic, subject to the transcribers opinion. yiruma however, can play whatever he wishes at the moment. wouldn&#39;t be surprised if each of his performances of the piece differs. composers can improvise all they want."}, {"text": "Hey great tutorial, but i&#39;ve got a serious question. At 2:07 you play the really fast B C# B bit, but when I hear the original, Yiruma plays something different. I&#39;m pretty sure I hear an E in addition to the B and C#. If I slow the original down you can hear it clearly. In every sheet i find on the internet it is B C# B but that is just not correct. Does anyone have an opinion on this? Agree or disagree? And does anyone have the 100% perfect sheet music?"}, {"text": "no idiot she have musician hands"}, {"text": "Thank you for the tutorial, thanks to you I can play this beautiful music ! :)  \nIf you have time, watch and suscribe my cover on my channel ! Thks"}, {"text": "how nice :) "}, {"text": "Good i love"}, {"text": "buu!! u.u nevermind thanks!"}, {"text": "YT removed one of my Lanz tutorials due to copyright problems. Sorry, won&#39;t touch his works again."}, {"text": "can u do a tutorial for return to the heart????? a david lanz&#39;s music :3"}, {"text": "Thank you!"}, {"text": "I loooove your tutorials, and your responses to negative comments make me laugh SO hard!!!! You are amazing(:"}, {"text": "Kennt das einer in deutsch? XD"}, {"text": "Tiene unas manos de artista preciosas"}, {"text": "very nice. good luck."}, {"text": "feel better now that you said it?"}, {"text": "you have anorexic hands"}, {"text": "THANK YOU. Without this i would&#39;ve never been able to play with both hands. :D"}, {"text": "my best wishes to you in your recovery :)"}, {"text": "thank you so much I&#39;ve been wanting to play this before my surgery, thank you so much this song calms me down so much! this made me feel a lot better about it!"}, {"text": "I AM THE LIKE BAR!"}, {"text": "Thank you so much for your help! I appreciate it!"}, {"text": "You have the most Beautiful hands!!!!!&lt;3"}, {"text": "det var en så stor hjælp til mig! mange tak for det :)"}, {"text": "THankyouu soo much!"}, {"text": "oh, here you go, no hands!!!\n\nseriously though, focus on my finger movement, not the keys under them. and learn to read music to follow along."}, {"text": "practice with a metronome. when few mistakes are made, set it a tiny bit faster. you will hardly notice the increased speed, and sooner or later you will reach tempo!  :)"}, {"text": "my hands are to small... ):"}, {"text": "Ah my apologies. I can&#39;t stand people who don&#39;t appreciate others&#39; hard work, and sometimes forget my own boundaries. Please excuse me and keep up your good work."}, {"text": "@roflrofl87 was replying to another comment and clicked yours by mistake, apologies."}, {"text": "Thank you so much."}, {"text": "You guys are being Jerks. People get old. And FYI, if you think their hands are ugly, then yours is too. This Person is trying to help us and you should appreciate it. "}, {"text": "It doesn&#39;t Matter. It&#39;s just Hands like Ours. God created Us. Who cares. "}, {"text": "How rude. Who cares. If you think this person&#39;s hands are ugly, then same thing that they said about you. Right Back at ya."}, {"text": "Yeah, this tutorial really helped me play this feat song and eventually well all get old so suck it up princess!"}, {"text": "@SacoMohamad ha ha, you are so funny  :)"}, {"text": "@goosh63 please see request page on website :)"}, {"text": "Thank you"}, {"text": "@SayhitoIvy just don&#39;t try to practice with both you&#39;re hands at the same time, both separately until you are an expert with both hands, then try step by step with both. baby steps"}, {"text": "@TheNaaadlfee that means you are great, not me :)  you have strong mirror neurons, and a good ear!"}, {"text": "when you pause i always think my computers frozen, haha"}, {"text": "Just for the beginners who have trouble combining their left and right hand: this is not just a song you can learn without even knowing how to play propperly."}, {"text": "yea, thanks, thats cool"}, {"text": "@ConnorRandallHD we call those lifesavers :)"}, {"text": "I REALLY HATE PEOPLE MAKING FUN OF THIS VID!..\nthey are just jealous because they don&#39;t have this talent!..\nSO HATERS!..SHUT UP...!!!\njust watch and learn!\n"}, {"text": "@SayhitoIvy Oh, and learn from sheets first, before remembering everything. People who think they are too lazy to read the scores are just plain stupid. It takes more effort to remember everything at once. While when you practise slowly and read from the sheets you&#39;ll remember the piece automatically and are not obliged to force it into your brain. Furthermore, it reduces the chance of mistakes which are difficult to recover.. "}, {"text": "@SayhitoIvy Don&#39;t give up! - That&#39;s the most important part. Now, play really really really slow, as if you were dumb. It might sound stupid, but all professional musicians practise this way, it really works! I&#39;ve asked a professional about it, he said that it activates your brain, because it actually makes you think before you play. When your brain has processed all these notes, your brain and limbs start to work together and everything just comes out naturally."}, {"text": "@Kevindoma try to focus on my finger movement instead. follow the sheet music too. it might sink in a little even if you do not read music YET :)"}, {"text": "a super video ;) but the fingers are to high i can´t see the key whitch you press :(  and its al little bit to fast why do you not press a key all 2 seconds :D at first in original and then all 2 seconds :DD plss"}, {"text": "Ugh.. I can&#39;t get my two hands to work together :("}, {"text": "@nadaskater1 oh! sorry... still working on old requests. so no new requests for a while..."}, {"text": "@bbdhrggl they are both by jon mclaughlin!"}, {"text": "@nadaskater1 &quot;love me&quot;? did that one. please see my website &quot;yiruma&quot; page. &quot;I&#39;ll follow you&quot;? can&#39;t find this on youtube at all."}, {"text": "@bbdhrggl can u also do &quot;loving me&quot; and &quot;I&#39;ll follow you&quot; please!!!!!!!!! I love ur tutorials they are the best and u r really good at piano!!! :)"}, {"text": "@nadaskater1 did &quot;so close&quot; :)   easiest is to check my website tutorial list. good luck"}, {"text": "CAN YOU PLEASE DO TUTORIALS FOR JON MCLAUGHLIN SONGS!!!!!!!!!!!!! some are reallllyyyy nice and I love ur tutorials!!! The songs I really want tutorials on are &quot;so close&quot; &quot;loving me&quot; and &quot;I&#39;ll follow you&quot; all by jon mclaughlin!!!!!! "}, {"text": "@prohardyfakerd if you really like to play piano, it is best to save up to buy a full-sized (88 keys) keyboard. perhaps you can find a used one? good luck!"}, {"text": "@bbdhrggl Hi :) First of all I&#39;m from the Philippines and i appreciate your lovely tutorial :) but i have 49 keys only in my electric organ :( and I&#39;m sad that i can&#39;t learn this piece of art :( I didn&#39;t wish to have a piano because its to expensive , Can i ask you a question? how many keys needed that i can play this song ? :) that i can buy a new cheaper electric organ and have more keys. :) Once again thank you... Sorry for my wrong grammar xD"}, {"text": "@bbdghrggl don&#39;t listen to this idiots your brilliant and your hands look lovely and mosturized better than mine and I&#39;m 14 hahA x"}, {"text": "@Tocik1996 thats horrible. dont call her/his fingers digusting, we all have some thing bad about ourselves, nobods perfect. i just cant belive how judge-mental you r"}, {"text": "@1718Jordan np ;)  6 months is a very short time. have to be patient. the best things don&#39;t come easily."}, {"text": "I love this song and i was looking forever and when i seen your name.... i clicked on the vid! whenever i see you name i will learn the song from you!... but this one i am having loads of trouble with :/ i have only been playing for six monthes.\r\nbtw sorry for the foul talk ;)"}, {"text": "@Tocik1996 what kind of reaction is that?"}, {"text": "why do people keep insulting her hands :O Do I spot jealousy there? It it because her hands are so accomplished ..? Cause I don&#39;t see it, I think they are beautiful hands"}, {"text": "@Tocik1996 that&#39;s a problem. avoid my tutorials or see a psychologist. good luck."}, {"text": "I have no words for this, I just love you, thanks for making this tutorial :-*!"}, {"text": "@JAJAJANDRES Muchos espectadores masculinos comentar que mis manos son sexy. Así que ten cuidado, es posible que te has insultado."}, {"text": "No Es Insulto, Pero Tus Manos Parecen Que Fueran De Hormbre."}, {"text": "@dexaegos143 yes, requests come from all over the world. music unites.\nThank you for your good wishes."}, {"text": "@bbdhrggl: i got a question...?\nthis video of yours is requested from the PHILIPPINES?...\nwhat a coincidence, im a PILIPINO..!..\nBTW....we really thank you for this vid!...you helped a lot!....may good blessings come to you!...^_^"}, {"text": "@dexaegos143 you (are others who thanked me) are very welcome. glad it helped."}, {"text": "i really wanna thank you for this vid...\n"}, {"text": "awesome, thank you"}, {"text": "This is so awesome! It&#39;s very easy to follow and not too fast. :)"}, {"text": "@dango211 10:04"}, {"text": "did u tape a camera on ur forehead for 10 whole minutes???"}, {"text": "tanks,  i like your tutorial cover..."}, {"text": "I like the way you taught~\neasy to follow~:))\n"}, {"text": "@risingbanana good luck on the playing have you fugured out the main part already"}, {"text": "Your River Flows in You version is different of mine ! But i enjoy :D"}, {"text": "Thank you, so much. It really helps to watch someone else play it. I can&#39;t wait to go take another whack at the song and see if I can do a little better now. "}, {"text": "@TheBlueHeroes thanks, but no foul words under my videos please."}, {"text": "CAN YOU TEACH ME !!!!??? PLEASE??"}, {"text": "I can never get the main part ._."}, {"text": "@lerachka04 I&#39;m learning quick too. my sister is having me play this at her wedding in six months and I&#39;m only 12 years old. this video is helping me! THANK YOU BBDHRGGL!!!!!!!!!!!!!!!!"}, {"text": "@bbdhrggl thanks :D"}, {"text": "@alyssa4239 sure hope you play better than I by then :)"}, {"text": "@bbdhrggl hahaha! I know that :D"}, {"text": "@aftercake pls follow request instructions - link in profile"}, {"text": "@alyssa4239 do you know when you get to my age, your hands might look scarier than mine?  :)"}, {"text": "your hand scary me!! but good job :D"}, {"text": "@MegaOtog try this pianomusicsheet (dot) net/yiruma-river-flows-in-you/\nif you want anything... google it ;)"}, {"text": "I&#39;m too dumb! :&#39;("}, {"text": "@fluffibunni2 lol i feel ya"}, {"text": "im too stupid i cant get it lol"}, {"text": "Thank you for this video! Really helpful!!! :)"}, {"text": "This really helps with figuring out finger ideal placement... I know how hard it is to play something at slower tempo, I rely so much on hearing myself play that if I can&#39;t hear the proper melody I get lost, so thank you for having the patience to play these tutorials"}, {"text": "thank you, i&#39;m learning this song :)"}, {"text": "Thank you so much! I tried to learn this song for quite a long time, but there were no results. And now I finally learn it. Thank you! It&#39;s one of the best tutorials I&#39;ve ever seen!!!"}, {"text": "you can tell its a girl because her legs are so close.\nand btw, if you practice guys, you all should kno this pretty well,\nwell i am grade 8 learnt for 10 years, and i played this song fluently within 2 days, XD"}, {"text": "oooh looks good ^-^ i can&#39;t wait to learn this song once i have free time."}, {"text": "there are many tutorials about &quot;River flows in you&quot; and yours is THE BEST!!! :):):)\n\nTHANK U SO MUCH!!"}, {"text": "GREAAAATTTT!!! Thank YOU"}, {"text": "very good!!)"}, {"text": "awesome! thanks a lot buddy."}]