[{"text": "It looks delicious and simple! Can&#39;t wait to try it"}, {"text": "My husband was watching this video behind me.  Guess what I have to make for Halloween?  LOL  Thanks again, Gemma.  You Rock!"}, {"text": "I&#39;ve made this several times and it&#39;s been a favorite!  Quick question, would I be able to use this filling as a filling for a cake? Or should I stick to a buttercream instead?"}, {"text": "Emmm yum yum...... but oh wait wait wait !!! A spider ??? You RUINED it dear.  😕😕😕"}, {"text": "Can you please do a TWIX Ice Cream? Thanks."}, {"text": "Twin is amazing and the pie is an amazing idea. Cheers for Gem."}, {"text": "The white chocolate part can be eaten all year round too."}, {"text": "I have not tried a TWIX but it is going to be amazing!"}, {"text": "WONDERFUL! I LOVE Twix as well, but I am making it with regular caramel! Salted caramel SHOULD NOT exist!"}, {"text": "This is so good! thanks for this recipe. You are my favorite baker in the whole wide world."}, {"text": "Gemma, I just finished making a couple of goodies for my grandkids for tomorrow.  I made Oreo Truffles &amp; Witches Broomsticks.  The broomsticks turned out so cute.  All you do is cut a mozzarella stick in three pieces, turn it so the longer piece is perpendicular to yourself &amp; cut 3 to 4 little slashes only going about half way up.  Then you push a thin pretzel stick in the opposite end.  That&#39;s it &amp; I know my son&#39;s their wives will appreciate one less sugary treat!  Oh my goodness though, I watched both of your videos, the S&#39;More Pie &amp; the Twix Pie!!  I swear I gained weight just watching them!!!! You make the best desserts!!  And my favorite thing about your recipes is how easy &amp; quick they are, and no exotic ingredients.  I bet your neighbors all love to see you coming to neighborhood gatherings!!!"}, {"text": "Too many coincidences I love Twix I had a few yesterday never thought to use them as a base like I do with the crunches bars. Delicious and easy!"}, {"text": "I LOVE Twix! This is just perfect!"}, {"text": "Gemma Stafford where can I find the salted caramel recipe??"}, {"text": "Twix is life"}, {"text": "I tasted cookie butter ice cream at a store and I was thinking that you could make a no machine  cookie butter ice cream"}, {"text": "Can I freeze it... Sort of like an ice-cream pie?"}, {"text": "Umm... There&#39;s a spider on the pie!!!"}, {"text": "Hmmm this does sound pretty nice but I really can&#39;t quite get behind the taste and texture of unbaked cream cheese fillings. I wonder if there&#39;s a way to do a bakeable version of this..."}, {"text": "you look so pretty :)"}, {"text": "U are seriously awesome😘😘😘😘"}, {"text": "I also love twix...more than it, i love ypur goyee, and ecstasy baking just over tantalizing me, richly yummy...."}, {"text": "Reese butter cup"}, {"text": "What are baking emergency?"}, {"text": "Du u store it in freezer where we freeze ice ?"}, {"text": "is it possible to make the crust in a blender?"}, {"text": "Can i use nestle munch  instead of twix?"}, {"text": "My my, does this look like the yummiest Halloween treat ever &lt;3 I wonder if it&#39;s possible to make the same, but as cupcakes? Shouldn&#39;t be too hard, right?"}, {"text": "You deserve 10 million subscribers😭"}, {"text": "we are so happy that u did this"}, {"text": "my sons gone love this one."}, {"text": "awesome! good job gemma. love to watch your videos. hi from sweden"}, {"text": "I love the theme song"}, {"text": "Do you have a recipe for the salted caramel sauce? I love your videos btw!"}, {"text": "Thanks Gamma but we don&#39;t get twix in India I will try with other bar"}, {"text": "What is twix is it vegan"}, {"text": "you&#39;re the best chef I&#39;ve ever seen"}, {"text": "this is probably my favourite video i love to watch it over and over again"}, {"text": "Which channel the show is going on"}, {"text": "cam i replace salted caramel with unsalted caramel"}, {"text": "lovely &lt;3"}, {"text": "Thnx Gemma this d best recipe <br /><br /><br />No eggs and no oven <br /><br /><br />And d spider was super cute"}, {"text": "Hi Gemma this was my first experience of making your Oreo cheese cake at home and OMG it turned out so perfect and off course too yummy 👍🏻thank you soo much for sharing such a great recipe  and now I can&#39;t wait to try more of your yummy recipes 🤤God bless you dear"}, {"text": "Cling filium ;-)"}, {"text": "This pie is highway to your death bed."}, {"text": "You are so swwwweeeet"}, {"text": "Where can I find the proportions of this recipe?"}, {"text": "So then how are you supposed to demoed the pic cuz it&#39; looks very difficult"}, {"text": "Twix is by best friend&#39;s favourite chocolate bar, I made this as a surprise for ger birthday and she went crazy! She told me it was delicious! Personally, I don&#39;t have an opinion, I didn&#39;t tried it because I don&#39;t like twix."}, {"text": "it&#39;s like she&#39;s watermarbled a pie"}, {"text": "even TWIX is my favourite"}, {"text": "..."}, {"text": "Can&#39;t make it <br />I don&#39;t have a food processor"}, {"text": "Im sad because my grandma passed away when you upload this video 😖😖😖😖😥😥😥😥"}, {"text": "i was so happy until she said salted caramel sauce i dont have it where i live GREAATTT -.-"}, {"text": "i feel like this would be good with snickers"}, {"text": "wow !!! 1 million subscribers ....congrats. Love all your recipes"}, {"text": "hope you will release more halloween treat videos for this year!"}, {"text": "it looks very good, but Gemma you are so slim😊"}, {"text": "I didn&#39;t like this pie. I loved it. twix crust + salted caramel means great texture, means creaminess, means carameliness, means everything I love about life.! keep up the good work"}, {"text": "هههه"}, {"text": "نفسي. لو اذوك"}, {"text": "ياي محلا هاظا الكيك"}, {"text": "I have to try making this it looks delicious"}, {"text": "Can u show how to make geisha chocolate pie without eggs"}, {"text": "delish😍😍😍😍😍"}, {"text": "Also your s&#39;more pie is the BEST recipe EVER"}, {"text": "Hey gemma thankyou sooooooooooooooo much . The best recipe EVER😍😍😍"}, {"text": "Twix is my favourite but you should make a snicker version"}, {"text": "I love Butterfingers there delicious!😆"}, {"text": "Beeyaf ful"}, {"text": "can you do a video of how to make just the caramel please"}, {"text": "love your spatular. so cute"}, {"text": "Twix are very expensive in my country. Like $4. I can&#39;t do this :("}, {"text": "I literally liked the screen"}, {"text": "Yummy 😍💖"}, {"text": "Love all your no bake cheese cakes. Thank you for the extract videos I have made them all.😍"}, {"text": "how I make caramel?"}, {"text": "There are ingredients,  but no quantities. Quantities are important."}, {"text": "when you blend the twix yours was soft mine was crumbly because i don&#39;t think my caramel was in the mixture but mostly around the food processor how can i stop this from happening?"}, {"text": "What cream did you use?"}, {"text": "dieting"}, {"text": "can you make snickers pie"}, {"text": "do all the cream measurements have to be at room temp?"}, {"text": "u will get around a thousand more views if you remove that spider away from the cake... seriously it ruins the whole look of the cake."}, {"text": "does twix contain egg"}, {"text": "Can you make Kit Kat pie too?"}, {"text": "Twix is my favorite candy bar too."}, {"text": "That looks so delectable! I wish I could bake it lol"}, {"text": "Yum!"}, {"text": "my favorite candy bar is snickers"}, {"text": "Gemma Stafford can I use maple syrup instead of salted caramel. I mean just for the taste"}, {"text": "Dear God! I love this recipe but that spider! I know it is fake but no, just no!"}, {"text": "Hey, is there anything you could use to substitute for the cream cheese? Thanks!"}, {"text": "and chocolate"}, {"text": "how much twix bars do you need"}, {"text": "Can you make a recipe with how to make twix and snickers? I would like to make twit and snickers but unfortunately I think a whole pie is way too big. I absolutely love your channel because you show how to make EVERYTHING! You show how to make caramel sauce, marsh mellows, graham crackers and I was hoping if I watched this video you would show me how to make Twix but unfortunately you didn&#39;t show us how to."}, {"text": "What are the differences between cooking chocolate and regular chocolate?"}, {"text": "omg I jumped when emma put the spider down on the pie XDXD I&#39;m so lame."}, {"text": "I love watching baking videos but I never make them 😂"}, {"text": "I love your videos and I love twix too. Can you make homemade twix bars? Thank you!"}, {"text": "OMG, it&#39;s SO refreshing to see someone openely say it&#39;s a sponsored video, you even have a hashtag. There&#39;s nothing wrong to be sponsored sometimes, some youtubers need to learn from you."}, {"text": "I had a question about the salted caramel sauce. I went to take a look at it, and when you list the ingredients, it says half a teaspoon of salt, but when it gets to step 7, it says a teaspoon of salt. Which one is it?"}, {"text": "Guess what I&#39;m craving"}, {"text": "For Christmas you can leave the filling uncovered and make white chocolate ganache color it green and red and make a ganache wreath on top."}, {"text": "Hi Gemma! I&#39;m such a big fan, always trying some recipe of yours :)<br />I made this the other night and it was brilliant. But the cream cheese n whipping cream together made too big a layer so I made it in a springform pan. The crust stuck to the bottom though. I should have put a cling film.<br />But the cream cheese needed more caramel sauce for this recipe, in my suggestion.<br />Thank u again :)"}, {"text": "and remember the red velvet pancake you posted in the past ? The owner of Buttermilk truck created that too and it was very famous it even went on TV ! you could do a business too !"}, {"text": "Gemma I loved all your recipes there were so good"}, {"text": "Can you make a spare Halloween candy cake please respond"}, {"text": "Where do you get your cocoa I need to know for your other videos"}, {"text": "When I made this I but crushed twix in the filling"}, {"text": "Can you teach us how to make the salted caramel sauce"}, {"text": "For the filling, would using regular caramel sauce or cajeta work as well?"}, {"text": "I like this idea of a no bake pie because I like to eat Twix too :)"}, {"text": "Twix is also my favourite bar. Thanks for making this recipe."}, {"text": "Where can I get the same chocolate you use. What brand is it"}, {"text": "I am so mad of the people that they don&#39;t subscribe you deserve 5 million subscribers"}, {"text": "Looks not Lola&#39;s"}, {"text": "Wish I could do it but my parents do not let me have candy. Lola&#39;s great and probably tastes great.  :("}, {"text": "where I get salt Carmel"}, {"text": "The recipes you made so tasty I love your vids so much. while watching it made me hungry."}, {"text": "what is the difference between this and a cheesecake?"}, {"text": "hey Gemma instead of whipped cream can I use regular milk"}, {"text": "can I use normal cream instead of cream cheese?"}, {"text": "Your welcome"}, {"text": "Hi Gemma...... can you plz tell me that how to make coconut cookies"}, {"text": "German name: Raiderpastete :D"}, {"text": "How do you have the heart to crush all those twix bars lool looks really good!"}, {"text": "Take a shot everytime she says &quot;this guy&quot; ..."}, {"text": "how can we made sauce at home ? the caramel one?"}, {"text": "love u gemma this looks so good !! might try this tommorro :) :)"}, {"text": "i bet you gat your man happy with all this awesome sweet you make...:)"}, {"text": "I&#39;m a Twix fanatic and THIS IS JUST SO DECADENT * A * I must make this!! Also congratulations on being sponsored by Twix Gemma, that&#39;s such an awesome achievement!! :D"}, {"text": "OMG I love the way u designed the pie"}, {"text": "ur accent is beautiful what part of Ireland r u from"}, {"text": "this is ultimate"}, {"text": "Looks good made me hungry 👍🏽"}, {"text": "wtf are twix???"}, {"text": "My family would have to eat the entire pie in one day, I would not rest peacefully knowing that pie is in my refrigerator."}, {"text": "Oh my gosh it looks gorgeos ! yummy"}, {"text": "congratulations! you got sponsored by twix😊"}, {"text": "oh my goodness.this looks so FANTASTIC.i love making desserts based on a candy bars.i make a milky way cake that is very good.you have so many helpful tips for making a decadent dessert.thank you fo sharing with us today.TAKE A BOW YOU HAVE A WINNER."}, {"text": "Can you make something with green tea flavour please? :)"}, {"text": "looks like a cooke"}, {"text": "<a href=\"http://www.youtube.com/watch?v=1Ld1Wl-d1EY&amp;t=2m24s\">2:24</a> - <a href=\"http://www.youtube.com/watch?v=1Ld1Wl-d1EY&amp;t=2m25s\">2:25</a> Cweamy, Reawy."}, {"text": "Is it possible for your no machine ice cream to be a pie filling?"}, {"text": "😍😍😍😍😍😍😍😍😍"}, {"text": "I can&#39;t believe I managed to miss this video. Looks awesome"}, {"text": "Do I have to use cream cheese"}, {"text": "Who dislikes pie?"}, {"text": "Such a cool recipe! I&#39;ll definitely try this. Also, I heard you say that the chocolate ganache could be used for making truffles. Do you have any truffle recipe videos?"}, {"text": "this looks sooo delicous."}, {"text": "what is deep inside in nations soul who celabrait helloween?ku-ku!!!"}, {"text": "can I use all purpose cream instead of whipped cream?"}, {"text": "oops..dessert look yummy mm and your nails colour is gorgeous."}, {"text": "dessert look"}, {"text": "Nice!!Good idea!"}, {"text": "And that fellows,makes me hungry. It reminds me of a really nice bonoffee pie i had yesterday in a resteraunt in gorey,wexford. omg I NEED THAT PIE!!!!!!!!!!"}, {"text": "i hate cooking shows but i love them. WHY I HATE THEM:They make me hungry. WHY I LOVE THEM:I love learning to cook and trying new recipies. I find them amusing aswell. dont know why.....its just my thing."}, {"text": "omg wonderful!"}, {"text": "and also by the way did u make the black spider. it looks so cool!"}, {"text": "i love twix so much too! This is probably my most favorite pie ever! :)"}, {"text": "Shes so cute! i love this recipe!!"}, {"text": "This looks so good! SO TRYING IT! You&#39;re one of my favorite bakers on youtube!"}, {"text": "Well let&#39;s see uh.... 2 mini Twix and 2 mini Hershey bars."}, {"text": "OMG I NEED THIS IN MY LIFE im making this tomorrow"}, {"text": "Cheat day soon!!!!!"}, {"text": "I think I just might have found THE PIE for my birthday next month."}, {"text": "Her accent. Oh, man. Scary..."}, {"text": "While I&#39;m watching this, I&#39;m eating a twix with a Milky Way smashed on top and I never tasted something so good"}, {"text": "This doesn&#39;t work...<br />We made it for Halloween, but in the end the crust was too hard and my knife couldn&#39;t get through it and the filling was running out on our plates (it wasn&#39;t runny when I poured it in the pie).<br />It was delicious, though. Heavy, but delicious..."}, {"text": "OMG! Soooo delicious!!! :-)"}, {"text": "Can I use a square baking tin instead of that one? And congrats for the sponsor. Greetings from Spain :)"}, {"text": "Thank you twin for asking her to create this. So darn good! and indulgent!!"}, {"text": "nice !!!"}, {"text": "562,007th subscriber :)"}, {"text": "I just put this together and OMG there was a HUGE amount of filling! I had a suspicion I wouldn&#39;t be able to fit it in a pie tin and put it in my big ol&#39; cheesecake springform and thank goodness because it&#39;s a lot!"}, {"text": "Dear Gemma, why you say to use 350gr and 120gr of cream? Which quantity i have to use?"}, {"text": "can i change the candy bar i use i like cadbury"}, {"text": "I love your smile"}, {"text": "+Gemma Stafford <br />hey,Gemma i have a question for you can i put half twix half digestive biscuits?And if i can,do i have to add something else?thank u!"}, {"text": "soo sorry that I forgotyour video last week. I love this one soooooooo much :) love you and your channel :)"}, {"text": "Can&#39;t wait to taste this...BUT my white chocolate hardened almost immediately ( in the time it took me to grab a toothpick out of the drawer). :( Having it at our pumpkin carving party tonight."}, {"text": "amazing...!!! definitely trying this...<br />love u Gemma"}, {"text": "Can u use a different type of chocolate bar instead of Twix?"}, {"text": "Yum yum yum! Will definitely be trying this! Have you ever made a twix milkshake Gemma?:&#39;) x"}, {"text": "chocolate love it !!!!!!!!!!!!!!"}, {"text": "I LOVE TWIX!!!"}, {"text": "Wow Twix congrats &lt;3&lt;3 i love Twix bars and your recipe is awesome :-* "}, {"text": "How can you not be fat?"}, {"text": "Gemma, Could you suggest an alternative crust - not made out of TWIX? I prefer baking from the scratch, from simple ingredients. I loooooooove your channel, THAN YOU! &lt;3"}, {"text": "could you substitute to another candy bar???"}, {"text": "Gemma !!! You are hands down the Queen of Desserts:):):)<br /> You make such beautiful deserts!!! Sounds delicious.!!!<br />Thank you so much for such super creations and such clear cut instructions. You make us look good at our family occasions with our friends and family. Many many thanks.You have a huge fan following here in Mumbai.<br />My friends are always very pleased when I take A Gemma Stafford Dessert for our gatherings.I wish you loads of luck,happiness and success always:)"}, {"text": "you gunna do anything really special for your 100th? do something that is your favorite desert!! maybe experiment!!"}, {"text": "She sounds Irish"}, {"text": "plz the cupcakes 😉"}, {"text": "Don&#39;t bang on your countertop!!! It&#39;s very unhygienic. Anyway, I hate twix, they&#39;re so disappointing. It&#39;s just cheap, tasteless millionaire&#39;s shortbread. This looks great though."}, {"text": "Love the idea of using Twix in the crust! I bet this pie would taste great frozen also :) This is awesome!"}, {"text": "so easy and yummy!thanks for recipe :)"}, {"text": "OOOOOOMMMGGGG"}, {"text": "Wow Gemma! I&#39;m so proud of you&#39;ve been sponsored by TWIX!! I love this recipe I&#39;ll try it tomorrow and post many pictures of it. Oh I can&#39;t wait to do that!"}, {"text": "I&#39;am Waiting for the new episode 😃😀 now"}, {"text": "@Gemma Stafford Could you tell me where you buy yours cooking utensils? (If there are online like: Amazon or  Ebay. Is much better for me. Thank you! I&#39;m still loving your videos! ♥ ) I hope delicious desserts for Christmas! :)"}, {"text": "Twix is my favorite too! This looks so delicious."}, {"text": "Love all your videos I tried the twix candy bar before but not the twix pie before "}, {"text": "Hi Gemma plz do the cupcakes 😉"}, {"text": "Hey Gemma I would love it if you show us how to make deep fried oreos :)"}, {"text": "I hope Gemma will do a no machine egg nog ice cream or show us how to make egg nog because I want egg nog year around.lol"}, {"text": "sweet condensed milk + cream + juice of one or two lemons = best filling in the world. make a recipe with this for us, Gemma"}, {"text": "Hi Gemma, congrats on getting twix to sponsor you.<br /> I have a couple of questions:  <br />1.Can you freeze this pie?<br />2. Will it be just as delicious without the caramel sauce?<br />3. What about a digestive biscuit  base and some chopped up twix bars mixed into the cream (without the caramel sauce)<br />*AND CAN YOU PLEASE MAKE SOME HOT CHOCOLATE ON A SPOON *  :)<br />Thank you!!"}, {"text": "Nice recipe .. Can u tell the recipe of microwave cupcakes 😍😍"}, {"text": "😘😘😍 CLASH OF CLAN CAKE"}, {"text": "Frankeinstein&#39;s monster spatula YAS! Just like Rosanna pansino"}, {"text": "How old you"}, {"text": "How old are you"}, {"text": "How old are you"}, {"text": "DO MORE HALLOWEEN DESSERTS! !!"}, {"text": "looks good &amp; slightly reminded me of trader joe&#39;s cookie butter cheesecake. can u make a recipe for that one day gemma?"}, {"text": "I&#39;m wondering if you could recommend some substitutes for this recipe? I&#39;m completely dairy free and can only tolerate goat cheese. I&#39;ve made cheesecakes before with a mild goat cheese and it turns out great, so the cream cheese is easily subbed out with goat cheese. My problem is the cream in the filling and cream for the ganache? Any suggestions, I&#39;d love to make this cake!!"}, {"text": "thankyou so much, this looks delicious! I am defiantly going to try this recipe. you are amazing!"}, {"text": "I don&#39;t have a food processor, what can I use instead? A blender?"}, {"text": "mmmmm....... PIE ❤it"}, {"text": "What can i replace cream cheese with?"}, {"text": "can u please do does cupcakes imma be so happy If u do them thanks bye!!!! 🍰"}, {"text": "omg it looks insanely good!!! xx"}, {"text": "I am loving this, Gemma! I love Twix, too! I&#39;ll probably make this over the weekend but no chocolate Ganache. Probably something tart like a raspberry puree or blueberry compote just to balance the sweetness."}, {"text": "great job getting sponsored! 😁"}, {"text": "Doesn&#39;t Rosanna Pansino have the same spatula?!"}, {"text": "Hello people u really needed to make this recipe it was super yummy"}, {"text": "Could you please make eggless mousses"}, {"text": ":D Yaay! A candy pie, finally! ^^ I love your recipes and videos..and it always cheers me up when you smile. It&#39;s funny how people often forget that. Oh, and I have a request...can you teach us how to make a Hazlenut-Cocoa Spread? I love Nutella, but I&#39;d like a healthier version even better. Thank you!"}, {"text": "This recipe looks pretty epic, Gemma!"}, {"text": "Hi Miss Gemma! :) I have request :) Christmas is coming soon..and i just wondering that making a GRAHAM CAKE ICE CREAM will be perfect to make my mom happy!? please show me of GRAHAM ICE CREAM! hope that you will see this..thank you!"}, {"text": "can you use another different thing to mix the filing like,a wooden spoon or do I really nee to buy one?"}, {"text": "Twix are also my fav candy! I obviously had to make this &amp; it was amazing all my friends loved it! Awesome recipe Gemma!"}, {"text": "My mom and I, make a cake, make a spiderweb and call it spider cake 😀"}, {"text": "OMG, my insulin spikes to the sky just my looking at the video and the pie!!!"}, {"text": "I&#39;m dying plz do it"}, {"text": "please do a girl scout cookie microwave mug"}, {"text": "please do a microwave one minute mug"}, {"text": "please do a girl scout cookie microwave mug"}, {"text": "hi pls can you do a video for quick snanks"}, {"text": "This is my first time here and I&#39;m really glad that I faund it. This is a perfect cake to make if you need something easy. Thanks for sharing! Hugs from Norway."}, {"text": "Can you pleaseeee make a video about things to make with left over pie filling like the twix one... Btw love the video.... Because i had some left over pie filling from the twix pie and I don&#39;t know what to do with it and it&#39;s not enough to make another pie"}, {"text": "2 questions I can&#39;t tell if ur Irish or Scottish and can unsalted carmel be used"}, {"text": "yay twix is my favorite candy bar too!"}, {"text": "Twix here is expensive :( but i want to make one"}, {"text": "Gemma CAN You MAKE whoopie pies....3 DIFFERENT FLAVORS RED VELVET/CHOCOLATE/CHEESECAKE!!! please!!"}, {"text": "Thanks and I will gemma"}, {"text": "can you show how to make blueberry cheesetart or any other flavour...pleaseeeee"}, {"text": "Make a Starbucks Mocha Frappucino"}, {"text": "I want !!!!!"}, {"text": "My boyfriend loves twix definitely want to try this at home ...thank you new subby ☺️☺️☺️"}, {"text": "I just tried to make this and it turned into a big mess. I didn&#39;t know which part to use the cup and a half of cream for and which part to use to half cup of cream for so my ganache turned into a soupy mess :( I used the four oz of milk chocolate with the cup and a half of  cream since that&#39;s what it looked like she was doing. Maybe I&#39;ll get it next time!"}, {"text": "Did you make a s&#39;mores pie yet? If you didn&#39;t can you please make a s&#39;mores pie 💙💙"}, {"text": "+Gemma Stafford Thank You so much for all the recipes. I was the 10 th subscriber, i have been watching your videos since the start of this amazing channel. Baking is my escape to happiness . I Love Your videos keep on baking. ❤️"}, {"text": "How divine! That salted caramel secret ingredients is genius:)"}, {"text": "I tried this recipe for a party and it was a huge hit! A delicious treat and really puts me in the Halloween mood!"}, {"text": "Hello Gemma, another question. Can I use vailla flavored cream cheese instead of cream cheese and vanilla extract? does it make a big difference?"}, {"text": "if i am to change the twix crust with graham crackers or any other crackers, what&#39;s the amount you suggest that goes along with this recipe? thankyou 😄<br />btw, i have tried your red velvet mug cake and it was supeeer delish! 👍😋"}, {"text": "where do you get whiping cream?"}, {"text": "Yummy, this looks an sounds amazing. I will be putting that spider we effect on everything. I love Twix too and Daim. I am eager t make this with a shortbread base."}, {"text": "When i read the tittle writen &quot;no bake&quot; i was like OMG gemma you are lying but its true its true it is no bake i am trying this recipie"}, {"text": "what I would do to work for gemma, just to taste those big and bold creations..."}, {"text": "That&#39;s awesome and so cool ~<br />Always like your decoration it&#39;s so amazing and gorgeous<br />~LOVE IT"}, {"text": "What&#39;s the title of the music?"}, {"text": "did you make the caramel sauce...or did you get it from the store? if you made it....do you have a recipe?"}, {"text": "T-T wut is lyf"}, {"text": "your channel is so unique!<br /> other bakers just do either cupcakes or cookies, but you change it up all the time! keep up the amazing work <br />🍫🍪"}, {"text": "I swear. Just by watching this I can feel my teeth falling out."}, {"text": "Oh my lord Gemma!!!! That looks good enough for the Gods ❤❤❤❤❤🍫🍫🍫🍫. You are just amazing!"}, {"text": "haha I know this is weird but i can&#39;t wait to see what gemma will post for ep 100"}, {"text": "I was thinking if the filling could have been ice cream :00"}, {"text": "Gemma you are killin me!!! I am blaming you for 25Lbs weight gain. LOL. I am loving all your videos and cannot wait every week for the newest one to come out. Thank you for sharing. Congrats on your sponsorship very exciting news!! Adorable little mini halloween spatula. Thank you!"}, {"text": "My favourite candy bar is Twix too!! And that pie looks soooooo delicious, I can&#39;t wait to try it!!"}, {"text": "Looks really gorgeous!! It seems to taste good and I think it is really easy to make!!! Thanks for your wonderful idea!!!!"}, {"text": "I&#39;m really digging these sponsored videos! You&#39;ve been making some really great recipes and sometimes we get more than one video a week! It&#39;s great, thanks :)"}, {"text": "Hi Gemma, i made this pie last night and we got got it out of the fridge..eating it nows its delicious!<br />but i was wondering our twix base was a heap crumply and it wasn&#39;t like your demonstration,like it wasn&#39;t moist enough<br />do you know why this was?"}, {"text": "oh yum! i&#39;m definitely making this for halloween :)"}, {"text": "Don&#39;t you ever think to mix to flavors you like and make it into a cake"}, {"text": "So is there anything I can sub for the cream cheese? I have a family member who is allergic but loves twix! Great recipe!"}, {"text": "Big and bold pizza!"}, {"text": "Would it be ok if I used 1 of your recipes in a YouTube video but sponsor u"}, {"text": "Yummy😍 I&#39;m going to make it for Halloween💕"}, {"text": "My sis love ur videos only even me. I like the way how u tell tips. Thnxs."}, {"text": "If I do not like caramel, could I use some other filling?"}, {"text": "seriously all of her recipes are easy to make! i already tried the giant cookie and the no machine ice cream! keep up the great work! :D"}, {"text": "could this be done with snickers too?"}, {"text": "Please Make more no bake deserts 😍"}, {"text": "That looks so unbelievably delicious and mouth watering.  yuuuuuummmmmm"}, {"text": "Hi Gemma! Love this receipt!"}, {"text": "That is such a cool spatula! Where did you get it?"}, {"text": "I went to crisis management course last week and baking emergencies wasn&#39;t covered. I am going to complaint to the management."}, {"text": "Instead of cream cheese can I use something else?"}, {"text": "I can I make mini twix pie "}, {"text": "I also love twix!"}, {"text": "it must be extremely sweet :O"}, {"text": "This is great, as usual! I have a video suggestion: could you please make a healthier option meal or something for Halloween? I know it kinda defeats the purpose but.... Please consider, THANKS!! :)"}, {"text": "House tour pls"}, {"text": "I love twix"}, {"text": "I love how easy crust is!!"}, {"text": "even I love twixt"}, {"text": "wowwwwwwwwwwwwww"}, {"text": "Love your spider design on top. So clever and artsy!!!"}, {"text": "Do you mean 3x regular doble packed twix? Or six of them?:)"}, {"text": "luv all your recipes!!!"}, {"text": "Omg ur so lucky !!!!"}, {"text": "+Gemma Stafford so nice of you to reply."}, {"text": "I LOVEE TWIX I&#39;m def making this :D XD"}, {"text": "Going to make this for my niece and nephew on Halloween. I always choose the wrong times to watch your videos."}, {"text": "Twix are some of my favorite as well! I&#39;m dying to try out this recipe!!"}, {"text": "Oh-my-Gosh!!! I LOVE TWIX!!! I love them SO much and I can&#39;t get them anymore where I live. I used to get them anywhere, then from one day to another... bam! no more Twix for me. It makes me feel SO jealous to see that amount of Twix you have there, lol. Great recipe though. Love all your vids, Gemma! Keep up the good work!"}, {"text": "Oh Gem, you are singing my song! Twin are my fave also."}, {"text": "My 13 year old daughter just saw me watching this video (her favorite is Twix too) and she literally screamed &quot;MOM please say you&#39;re making that!&quot; :) My question is about the cream cheese for any pie or cake recipe, how do you get it to room temperature without just leaving it out and chancing it being bad?"}, {"text": "Yum I love twix!!!!"}, {"text": "why does everything have cream cheese in it"}, {"text": "Could you make a pineapple mango smoothie??"}, {"text": "That is great !"}, {"text": "love this recipe im making this for my Halloween party :) :)"}, {"text": "love this recipe im making this for my Halloween party :) :)"}, {"text": "love this recipe im making this for my Halloween party"}, {"text": "love this recipe im making this for my Halloween party"}, {"text": "Can u make different kinds of Halloween candy bar ice creams?"}, {"text": "Wow , that spider on top !!!<br />It just completed the look of your Halloween inspired pie👌🏻"}, {"text": "you are by far my favorite to watch for baking recipes!!! plus youre irish (?), which makes you that much more amazing!"}, {"text": "What is a diet now ;-;"}, {"text": "Woow! that`s amazing!"}, {"text": "This looks so good! Twix is my favourite candy bar :)"}, {"text": "Please marry me"}, {"text": "Hi Gemma I just wanted you to know that I appreciate you for taking your time out of your day to record and edit and also make recipes for us so thank you 💙"}, {"text": "Hi Gemma, I love this this recipe!!! I was wondering if your could do some Halloween themed cupcakes please ☺️"}, {"text": "I just absolutely need to try this! I make almost everything u make but I need to know a substitute for cream cheese?! Thanks For the great videos!"}, {"text": "I LOVE TWIX!!!!! I could eat it all day long😋😋"}, {"text": "I love this pie Gemma!  Great idea to use the Twix as the crust!"}, {"text": "Such a moussey, chocolatey tart! Looks absolutely gorgeous Gemma! ❤️"}, {"text": "Hi Gemma, can you make something like this vegan? That would blow my mind ;)"}, {"text": "My goodness I have to make this! I love the idea of that twin crust Gemma. Thank you it&#39;s a keeper"}, {"text": "Looks yummy, will have to try it!"}, {"text": "That looks so decedent! I want to eat that so bad lol."}, {"text": "OH MY GOODNESS!!! This is just absolutely gorgeous and looks delicious! I must make it! Did anyone else say &quot;Cut me a slice&quot; as well when she said she was going to cut a slice for her? :&#39;)"}, {"text": "I LOVE TWIX SO MUCH"}, {"text": "I can&#39;t wait to try this"}, {"text": "Shit I&#39;m on a diet T.T"}, {"text": "Best idea everrrrrr"}, {"text": "Looks so good!!"}, {"text": "Wow! I think there should be a Kitkat version or the Green Tea Kitkat! Both will be so good! Thanks for this Gemma! It&#39;s early morning here in the Philippines and love to wake up to this video! &lt;3 :)"}, {"text": "this looks gorgeous clever idea you&#39;re the best ."}, {"text": "what else can u use if u don&#39;t have cream cheese"}, {"text": "hi gemma love u"}, {"text": "How sweet is it?  Isn&#39;t cloying?"}, {"text": "Twix are my favorite too! Ohhhhh my gosh this looks amazing, I will definitely be trying it out!"}, {"text": "I don&#39;t have a food processor or a good blender. Are there any other ways to crush the Twix?"}, {"text": "So delicious i hope i could go through the screen and cut a pease and eat it by the way you look amazing"}, {"text": "Hi Gemma! Are you able to please make Halloween themed drinks? Non alcoholic and alcoholic-if you&#39;d like. One idea for the non alcoholic ones could be something like a witch&#39;s potion? Sprite with gummy worms and stuff."}, {"text": "wow no bake pie"}, {"text": "When you make your ganache I would advice you to cover it with a plate or something it makes it a lot better🤘🏻🤘🏻"}, {"text": "That looks delicious!"}, {"text": "Hi Gemma!!! I LOVE this recipe! Could you maybe do some more recipes with other candy bars too? Only if it&#39;s not too much trouble though..."}, {"text": "I&#39;m so obsest with your channel💗"}, {"text": "OMG, Fabulous😍😍 I&#39;ll Make It For My Mom, She Loves Twix😍 Tanks For These Recipe <br />Love You Gemma"}, {"text": "can you make a maltesers food idea plz i really love your recipes your always amazing"}, {"text": "Oh shame on you  Gemma !! I knew from the title this recipe was going to be absolutely  Devilish! Well done . Now I will have to make this TWIX Pie .Thank you Gemma."}, {"text": "My favorite candybar is also twix😄 Lovely pie Gemma:)"}, {"text": "This looks delicious. I love Twix but may try it with Almond Joy or Mounds bars b/c I love coconut"}, {"text": "woo thanks  I love you  recipes excellent"}, {"text": "Oh my god. I&#39;m going to make this for my birthday Gemma ;) thank you"}, {"text": "&#39;Baking Emergencies&#39; 😂 TYPICAL GEMMA!!"}, {"text": "this looks amazing!"}, {"text": "i love twix :&#39;)"}, {"text": "Hi Gemma!  Silly question: will it make a difference to use lower fat cream cheese?<br /><br />Thank you :) :) This looks sooooo delicious!"}, {"text": "mwhaaaaaaaaaaaa only joking , looking amazing you and the twix pie xxxxx love ur vids"}, {"text": "I can almost taste it. Looks spectacular! I love twix , I recently finished making a twix milkshake. Btw, your kitchen looks really nice."}, {"text": "looks yummy"}, {"text": "your receipt is so yummy can you do some vegan receipt cake or dessert please thanks"}, {"text": "I wish I could try your creations!"}, {"text": "I love all your recipes Gemma!! &lt;3<br /><br />Could you do a sweet potato recipe?"}, {"text": "Twix is one of my favorites too. I&#39;ll definitely be making this pie. Another great recipe! Cheers! p.s. cute Frankenstein spatula."}, {"text": "This looks AMAZING!! Thanks Gemma I love all you videos! I needed this in my life!"}, {"text": "Oh my goodness! Twix is my favorite candy bar also, and I can NOT wait to try this recipe! I&#39;m going to have to wait for a family get together, otherwise I will eat the entire thing!! Thanks for another great recipe!! :)"}, {"text": "yummy your  videos are awesome :)"}, {"text": "You are the favorite of your favorite candy bar. Sweet &lt;3"}, {"text": "i loovvee your videos, youre so talented"}, {"text": "This is awesome because I&#39;m having a Halloween party at my house"}, {"text": "Gemma! Amazing! Love the detail of the spider web. :) &lt;3"}, {"text": "It looks DELICIOUS!!! &lt;3"}, {"text": "Hi Gemma, this is kind of a stupid question but I live in Finland and in here (and I guess all around the world) regular size twix bars are sold in paggages that include 2 bars each, so just to be sure, when you say that 6 regular size bars is needed, do you mean 6 bars or 6 paggages of bars 12 bars total? I just want to make sure."}, {"text": "That&#39;s an amazing dessert , considering my kitchen is renovating and I have no stove . Just a microwave and fridge and a processor will do the trick :) Thank you! :)"}, {"text": "Ir there are no twix in Mexico any alternative we could use ( although I think I&#39;ve seen them) Loooved this one! Big hug from Mexico"}, {"text": "I love your channel and recipes! This looks amazing :)"}, {"text": "That Twix crust looks like it would make great truffles, too!"}, {"text": "angel food cake please!"}, {"text": "Oh Wow!! That looks crazy good! What a clever idea for a crust. This recipe is going on the to-do list. Twix are one of my favorites too! Awesome Gemma!! :D"}, {"text": "Does it melt and get runny if it&#39;s not refrigerated right away after cutting?  I have a potluck in early November but may not have access to refrigerate the pie after cutting."}, {"text": "They have trix in America, I thought it was Australian."}, {"text": "I am subscribed to so many baking channels on YouTube, but I can honestly say that yours is the best! Your videos are just way too fun and creative! I&#39;m so glad you made this channel. We really, really love it! :)"}, {"text": "This is so amazing! Your recipes have inspired me to bake more! You are so creative! I want to be a chef when i&#39;m older😀"}, {"text": "This looks delicious! Love how you use actual twix for the crust, and that spiderweb on top looks gorgeous!"}, {"text": "yummy!!"}, {"text": "It looks amazing! You&#39;re really cool"}, {"text": "Yummy😋😋😋"}, {"text": "Oh my that looks amazing!! I think you read my mind because i have been craving twix!! every week you come up with Something i have been craving!! Thank you!"}, {"text": "Wow looks so tasty!  <b>-</b><br />Could you show a vegan recipe next time? :3"}, {"text": "This looks delicious! :D"}, {"text": "I LOVE Twix! That pie looks delicious!"}, {"text": "Twix is my favorite candy bar too !!! Ugh that&#39;s so good ! :D"}, {"text": "this recipe is awesome Gemma you rock"}, {"text": "hi how do u make the salted caramel sauce @gemma . Thanks so much"}, {"text": "looks so so good, maybe I&#39;m going to try it after"}, {"text": "I&#39;m gonna try this next week :)"}, {"text": "this is an absolutely BRILLIANT use for Twix :D, and we can use this recipe for other Twix-like candies too right? maybe KitKats?"}, {"text": "another great video. just fantastic Gemma :)"}, {"text": "Someone shared this on my G+ feed after watching this i just had to subscribe."}, {"text": "When your favourite candy bar pays you to make a chocolate-caramel pie, you know you have done something right in life. Go Gemma!"}, {"text": "Twix ICE cream please💗"}, {"text": "are u god of baking woah"}, {"text": "OMG TWIX IS FAVOURITE CANDY BAR, IM SO EXCITED TO TRY THIS WHEN IM NOT ON MY DIET T_T"}, {"text": "oh my gawwwddd!! I just bought a pie tin yesterdayyyyyy, so this recipe is amazing for mehhh! Mymum loves twix so I will be making it tomorrow! Thanks for sharing this great idea!"}, {"text": "Yum yum!!  Another great receipe that never fail to impress me!!! Halloween is one of my favourite time of the year! how about u? 😄"}, {"text": "This looks amazing."}, {"text": "oooh would love to make these mini size :)"}, {"text": "Twix is my favorite too ❤️"}, {"text": "TWIX!! I&#39;m in love with them!! And these pies look SOOOO tasty I still remember your Halloween special from last year I still often watch it. Best special ever!!"}, {"text": "it&#39;s looks so delicated I wish I could try yours!!!"}, {"text": "OMG looks so good, that&#39;s awesome that twix has sponsored you congratulations."}, {"text": "Is the salted caramel sauce bought or self made and is there a recipe either way? (I don&#39;t think I can buy it in my area, at least I haven&#39;t seen it so far.)"}, {"text": "can you make something with Toblerone as well??"}, {"text": "Haha i add nuts and oreos on top of the pie as well. Cant go wrong with more treats."}, {"text": "wowwww!! I love Twix!! will definitely make it!!"}, {"text": "looks lovely as always n I can&#39;t wait to try dat caramel filling"}, {"text": "I think you&#39;re deserved to be a gourment channel host in a family tv show, your every video is gourgeous yet perfect."}, {"text": "Ooooooh my, Gemma! Looks so delicious!"}, {"text": "Another awesome recipe gemma! 💕🙈👅 xoxo love lots"}, {"text": "Can&#39;t wait to cook this !!"}, {"text": "gemma, youre the only youtuber whose recipes i really trust and follow... unlike other youtubers who give you wrong measurements or has a secret ingredient... keep up the yummy treats!!! happy halloween!!"}, {"text": "is there another way to make the crust witowt twix?"}, {"text": "gemma may i request for deep fried milk..thank you!!"}, {"text": "YUM! I wanna make this as soon as possible!"}, {"text": "The 37th 😂. I love twix💟 I think this îs going to be my favourite pie💗!<br />PS: Dear Gemma, I made the chocolate brownie ice cream and it turned out amazing,thank you soooo much for the recipe , love you❤️💗💜"}, {"text": "This pie looks amazingggggg.. 😍😍"}, {"text": "Oh Gemma you are my Food Fairy Godmother! This is awesome!! Sending you love from the Phils! :*"}, {"text": "Gemma its fantastic . I will make this for sure. thanks ☺😊"}, {"text": "I LOVED THIS RECIPE A LOT!!!SO EASY!!But I have a question can I use any chocolate bar like which has caramel and kinda soft and hard outside??But still I loved this recipe a lot!!!! (!"}, {"text": "Yummy!!!!! I know who&#39;s door am going to knock so as to get loads of good stuffs for Halloween hi hi"}, {"text": "I love twix candy bars! Another great video Gemma! Always so happy to see your videos they make my Thursday! :)"}, {"text": "i love the intro!"}, {"text": "I may do this for my brother&#39;s birthday he loves pie"}, {"text": "This recipe looks delicious! I love your videos so much! 😍❤️"}, {"text": "the best chocolate pie ever yum"}, {"text": "the best chocolate pie ever yum"}, {"text": "Hi, Gemma. That Twix pie looks absolutely beautiful and mouthwatering. You are such an awesome baker. Your music selection really impress me. Do you have any baking tips on how to be a great baker like you, InTheKitchenWithKate, Rosie&#39;s Dessert Spot, Emma&#39;s Goodies, and Rebecca Brand? Please let me know. See ya next week, Gemma. Byron. ;-) By the way, I have a suggestion for Orange Cream Cheesecake, that would be awesome."}, {"text": "looks yummy!!"}, {"text": "yum"}, {"text": "it is more like a cheese cake then a pie"}, {"text": "do you have  room in your house ? i wanna live with you<br />i love you soo much"}, {"text": "Can&#39;t wait to try this!"}, {"text": "yummy!! what a delicious pie looks gorgeous 💕"}, {"text": "yummy"}, {"text": "yummmm"}, {"text": "Twix sponsored you?? OMG! Congrats!"}, {"text": "Omg love your videos. I should try this"}, {"text": "looks delishhhhhh <b>_</b>"}, {"text": "my partner would LOVE this, hes quite partial to a twix. they&#39;re not my favourite, something about the crunch of the biscuit with the soft caramel and chocolate doesn&#39;t sit well with me."}, {"text": "I am already in love! Love this recipe 😍"}, {"text": "Love it 😍😍😍😍😍"}, {"text": "You are out of this world Gemma!😄"}, {"text": "14❤️"}, {"text": "early"}, {"text": "omg I love your videos you are amazing I love the music so much and the recipe you are amazing"}, {"text": "second"}, {"text": ".❤"}, {"text": "early"}, {"text": "Great recipe Gemma! Love your videos❤️"}, {"text": "I&#39;m early!! love it❤"}, {"text": "u r too wonderful gemma"}, {"text": "😄"}, {"text": "looks delicious!"}, {"text": "Third"}, {"text": "Yum"}, {"text": "Adorable!"}, {"text": "Adorable!"}]