[{"text": "If anyone has doubts about the beauty of precision engineering then look no further than a My Mechanics video. Amazing attention to detail along with exacting standards where nearly good enough is not acceptable to him; only as close to perfection as possible will do. And then to top it off a beautifully shot and edited video for us all to enjoy.  Really well done Sir!"}, {"text": "When you did the blackening with the oil, did you heat it and quench only one time each part?"}, {"text": "Vouuwww"}, {"text": "how do you remember how it all goes together?"}, {"text": "Very good restoration Sir"}, {"text": "Am I the only one that thinks that this will be a lightsaber after it is rebuilt?"}, {"text": "That has to many parts."}, {"text": "Amazing an air  tool no orings only machined surfaces"}, {"text": "May it see many more years of use! 👍👍👍👍👍"}, {"text": "I was wondering.. is the sand not melting when you heating the metal?"}, {"text": "Every time I thought &quot;okay, that&#39;s probably taken-apart enough&quot;, I was proven wrong.  I got three minutes in and started wondering if I was about to see a man disassemble an object down to the molecular level like Doctor Manhattan.  It was glorious."}, {"text": "I watched all your videos in one week lol I need more🧐"}, {"text": "Best"}, {"text": "Crap watched all of them now I’m bored"}, {"text": "Now just do an air compressor restoration"}, {"text": "1st Class Job, Wonderful, well done, pleasure to watch."}, {"text": "You Are Amazing ...."}, {"text": "rpm,ses seviyesi,gürültü,basınç gibi karşılaştırmalı ölçümler vermen bu profesyonelliğe yakışır ayrıntılar olurdu. düşünebilirsin."}, {"text": "Круто"}, {"text": "You made it so pretty! Awesome."}, {"text": "Привет из России!!!. Дружище у тебя золотые руки а что в голове боюсь представить. Крассавчик!!!."}, {"text": "I love your work👌"}, {"text": "Very well done. Extremely satisfying to watch."}, {"text": "awful lot of fidget spinners inside that thing"}, {"text": "Deine Videos sind super. Was genau für eine Drehbank benutzt du? Ist das eine Schaublin? Gruss aus Obwalden"}, {"text": "подшипники нихера не смазал. Густой смазкой надо их забивать.а не капнуть с писюна."}, {"text": "I&#39;ve seen all your videos now, please make some more."}, {"text": "HE DIDN&#39;T REPLACE THE WEAR FINS. I GUESS HE DOES NOT KNOW HOW TO SINGLE-POINT (TURN THREADS ON A LATHE OLD-SCHOOL?)"}, {"text": "Спасибо вам большое что вставили комментарии на русском языке! Очень приятно смотреть на вашу работу,удачи вам!"}, {"text": "Can I..."}, {"text": "I know it&#39;s been a while. Can you describe what has happened to make the pitch of the Air Die Grinder, drop, from first demo to after restoration demo? Why did the pitch go down, and does that impact performance at all? When you buy a tool it has certain specs and maybe rebuilding it has changed those specs a bit. Maybe it&#39;s slower now, and is that good or bad?"}, {"text": "Perfection 👌"}, {"text": "Where could I learn more about rust proofing using olive oil, please?  I&#39;ve tried googling and evidently haven&#39;t figured out the right search terms yet.  Thanks!  Great video!"}, {"text": "Parabéns... muita técnica apurada"}, {"text": "Making and bending that air chuck fitting was so awesome need to come out with 2 vids a week man keep it up"}, {"text": "You is a master. Congratulations!!"}, {"text": "Технопорно. На это можно смотреть бесконечно."}, {"text": "не плохо"}, {"text": "Dude, i see you using your die on a few vids. You should restore it, take out those ugly machine marks.That would be cool to watch. Love the vids bud :)"}, {"text": "Warum haben Sie die Wälzlager nicht ausgetauscht?<br />So ein Schleifer dreht sehr hoch, neuer Lager wären nicht schlecht."}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=6m20s\">6:20</a> &quot;Looks ugly&quot; and it says GF on it :("}, {"text": "I have watched all your videos that I can find and I thoroughly enjoy your methods and how you think and how  you never quit when you’re restoring something because if you can’t get the parts then you make them and I really enjoy watching you and your work! It’s been a while since you posted anything new and I’m hoping everything is OK with you?"}, {"text": "I love how you disassemble parts until you literally can’t. No other restoration channel even comes close to this level of detail."}, {"text": "Superbe ! Pourquoi chauffer le roulement à 80°C ?"}, {"text": "Wow you&#39;re not kidding a lot of parts"}, {"text": "You don&#39;t repair, you don&#39;t restore, but you reinvent the object, often better quality than the original one !"}, {"text": "IF some one were to offer to buy one of those rebuilt tools...<br /> I would NOT use them at all! They would be displayed in a Lexan display case."}, {"text": "I would never have imagined so many parts in a grinder."}, {"text": "My Mechanics:<br />This part is broken = Lets make a new one.<br />This part looks ugly = lets make a new one.<br /><br />This part is not working = lets make a new one.<br />This part looks not good = lets make a new one.<br /><br /><br />Me:<br />My old favorite phrase is not good = I made this my new one."}, {"text": "You REALLY are the master of dis-assembly and the lathe.  &quot;I don&#39;t like this piece so I will make a new one&quot;<br />What a talent.  Keep the vids coming! !! !!!"}, {"text": "Вы делаете лучше чем на заводе.Просто фантастика!"}, {"text": "Мне кто нить может объяснить смысл &quot;восстановления&quot; вполне неплохо работающего инструмента?"}, {"text": "Золотые руки"}, {"text": "Comme l&#39;ont dit les autres, t&#39;as le soucis du détail. C&#39;est du putain de boulot. Bravo, mec.👍👍👍"}, {"text": "Beautifully restored ! Loved the way you heated the ball bearing housings before assembly 👍"}, {"text": "Вы хирург механизмов, браво!"}, {"text": "just watched your whole channel would love to see you do an espresso machine. thanks"}, {"text": "Este es tu único canal o tienes otros canales? Saludos desde Perú."}, {"text": "You’re a wickedly smart and talented young man! The restoration that you perform is on a whole new level... brilliant craftsmanship! Yes indeed!👍🏻❤️😊"}, {"text": "Все пересмотрел твои ролики, этот вообще можно было не делать, всё хорошо изначально было с этим пневмобуром или пневмодремель (но не как не шлиф машинки)). Зря вытачивал муфту угловую, были же хорошие. Да литые, не очень взрачные (полирнуть и всё было бы ок), но которые не ржавеют как эта твоя, хоть и воронённая, но оно облезет через пару часов работы."}, {"text": "people need more videos!)"}, {"text": "I&#39;d wear this as a necklace, it&#39;s that beautiful"}, {"text": "Perfect Engneering"}, {"text": "Nice close work and editing as usual. Although I do think it looked more attractive before restoration !"}, {"text": "Must be way better than a new one! 👍 Great job!"}, {"text": "I thought it looked fine before he started taking it apart. Why fix it? (I&#39;ve seen many of his videos.) Then I saw this seemingly endless number of parts, all looking gungey against his shiny wrenches and other equipment. I can&#39;t believe how many parts are in this thing - and that he knows what each of them does. And the pink potholder - LOL!"}, {"text": "I would have had extra parts left over. lol"}, {"text": "It actually didn’t look bad to begin with."}, {"text": "Nevermind the thing working properly. The simple fact that there were no parts left after the final assembly is enough to amaze me! Very cool."}, {"text": "These are so relaxing to watch and the bending action was out of this world !"}, {"text": "If i was making this video. this would have ended right after testing it. Good thing I don&#39;t make videos."}, {"text": "this video felt a little more like maintenance  rather then a restoration"}, {"text": "❤"}, {"text": "We are privileged to watch an accomplished craftsman at the peak of his skill. The amount of technique in your arsenal never ceases to amaze me."}, {"text": "such a privilige to watch such superb talent and skill."}, {"text": "What -- can&#39;t make a ball bearing from scratch? ;-)"}, {"text": "That buffing wheel certainly sees a lot of use."}, {"text": "&quot;looks ugly let&#39;s make a new one&quot; - my parents"}, {"text": "Шикарно. Спасибо за труды!"}, {"text": "These restoration videos are good for my soul.<br />I love how incredibly painstaking, detailed, precise, and knowledgeable these videos are.<br />Keep up the good work, hoping you make it to 1 million subscribers very soon, because your work is worth it!"}, {"text": "You are such talented I would like to work with you sir"}, {"text": "Hay varios canales con este formato y cada uno tiene su propio estilo pero, este chico tiene una forma de hacer las cosas que me gusta mucho. Pone mucha atención hasta en los más mínimos detalles y eso es digno de valorar."}, {"text": "Really, really beautiful work. I watch in disbelief at the patience you have when flatting a nut on the oilstone. The end result justifies the effort though."}, {"text": "Классно ты новую жизнь даёшь старым вещам. А ты откуда? с:"}, {"text": "As I have said before, Zehr schöne!😁 great job on making a beautiful tool👍( I would have commented in Swiss but Google translate doesn&#39;t have it)"}, {"text": "Another 14 min of my life gone without regret another beautiful job"}, {"text": "It&#39;s a tune up not a restoration it fucking worked."}, {"text": "I have yet to see one of your restorations that didn&#39;t belong in a museum or sold to a collector. Bravo!"}, {"text": "OK, so I just finished binging your entire catalog in one day, and your craftsmanship is unbelievable. I could watch your videos for hours.... um... yeah... <b>literally</b> hours. I look forward to your next restoration. Keep up the great work!!"}, {"text": "What kind of metal large do you use"}, {"text": "Oh no... I&#39;ve run out of videos...."}, {"text": "&quot;Looks ugly lets make a new one &quot;<br /><br />Naaah dude,, &quot;I will make my own air fitting because I can bitches&quot;"}, {"text": "WOW!!"}, {"text": "I&#39;ve watched all his videos before this and I&#39;ve noticed one thing: <br />the table used to be so clean. XD"}, {"text": "Great work"}, {"text": "perfect"}, {"text": "I love you editing!"}, {"text": "I&#39;m new here, found your channal yesterday and i&#39;ve seen almost all videos, but one to go. Hope you come up with a new one soon."}, {"text": "Ocd"}, {"text": "This guy can restore something new."}, {"text": "You are  nr 1 of restorations."}, {"text": "The grinder sounded lower pitch at the end making it seem like it wasn&#39;t as fast as before it was restored, I wonder if that&#39;s the case and why."}, {"text": "Спасибо за труды. Мне очень интересно смотреть, назвал бы не видео, а сюжеты. Прекрасная режиссёрская работа и видеообзор исключающий дополнительные вопросы. Ещё раз спасибо. (некоторые вещичьки, даже хочется приобрести)"}, {"text": "Superb!"}, {"text": "As always, it is up to the mark, but it seemed there was little work to restore the small parts, were they in good condition or was it left overs !?"}, {"text": "god damn. i can&#39;t even figure out how to put the whip cream canister lids back together at work."}, {"text": "I`m amazed he didn`t make the ball bearings he can make a spring out of wire. You are one smart dude my mechanics"}, {"text": "Five minutes after starting the strip down I would have forgotten how all the parts fitted together. Three days later when I finally had it assembled again I would be scratching my head wondering why I had fifteen left over bits. Thanks for the olive oil tip though, I never knew."}, {"text": "You are a craftsman, an engineer, of the highest degree matey, but did you get permission to use the crocheting as an oily rag?"}, {"text": "Left thread!? Left hand thread!?<br /><br />Uncivilized is what that is."}, {"text": "The MacGyver of restorations, hands down"}, {"text": "I GOT DENTIST VIBES FROM HEARING THE DRILL!!!😂😂😂😂"}, {"text": "That&#39;s a lovely hot pad you&#39;re using to assemble heated parts (:"}, {"text": "super"}, {"text": "Why the masking tape? To not risk scratching the freshly polished metal piece? <br />Also, would&#39;ve loved to actually see it grind something, even a little bit! :D"}, {"text": "looks ugly, let&#39;s make a new one!<br />OK...."}, {"text": "Why put sand in the fitting before the bend?"}, {"text": "São muito bom o seus vídeos... parabéns!... assistindo direito do Brasil"}, {"text": "You are miles above everyone else in this field. I can&#39;t watch any other restoration videos without thinking you&#39;d do it better."}, {"text": "Excellent work. Love the nearly obsessive attention to detail and how he strives for perfection."}, {"text": "Why don&#39;t you just thread with the lathe?"}, {"text": "Is Tysy Tube him too or just a friend?"}, {"text": "You have so much skill!! Do you have a list of what equipment you have? I’ve considered doing some experimenting in this direction because I enjoy working with my hands. I would love to know what you would recommend for starters as basic equipment."}, {"text": "I am currently working on a wooden bench.<br />...½ way there!"}, {"text": "&quot;This is ugly. Let&#39;s make a new one!&quot; is my favourite part of every My Mechanics video. If only more people afforded their project this sort of care and precision. Brilliant work. Also, I have learnt so many valuable  techniques from these restorations. I do believe these videos are of great educational value."}, {"text": "Among all other objects, I think this was the one that needed least restoration."}, {"text": "Чувак, ты крут. Если бы я разобрал так, то этим запчастям оставалась бы одна дорога- в металлолом."}, {"text": "Superb video. I just realized I know nothing about the innards are air tools. It&#39;s now my responsibility to read more because I wouldn&#39;t even be able to take this tool apart. Great inspiration!"}, {"text": "This week on &quot;Pimp My Die Grinder&quot;..."}, {"text": "The engineering and machining of that part are sexual."}, {"text": "Jaw dropping!"}, {"text": "Why do you usually part off on the lathe with a hack saw rather than a parting tool?"}, {"text": "This one confused me a bit. You took a working, non rusted tool, and &quot;restored&quot; it into a working, non rusted tool that looks a bit nicer? Very satisfying video along with your other videos, keep up the amazing work."}, {"text": "This one is realy a piece of master craft,  You can clearly hear the difference between the sound of new and before."}, {"text": "So beautiful......................"}, {"text": "Fixed something that wasn&#39;t broken."}, {"text": "I need more Lathe in my Life."}, {"text": "круто! прямые руки!"}, {"text": "By far some of the best restoration  I have seen. Good job. Keep posting videos...such a pleasure to watch"}, {"text": "My old dad &quot;if a jobs worth doing it&#39;s worth doing well&quot; would have loved you!! Genius."}, {"text": "be my father!!!"}, {"text": "п"}, {"text": "Super!"}, {"text": "Wow, blew my mind when you remade the air fitting. True skill and art!"}, {"text": "In welchem Shop beziehst du deine meisten Kleinteile(Kugellager,Schläuche etc.) Grüsse aus Zürich:)"}, {"text": "You combine engineering with art - excellent work. Thank you for an excellent video"}, {"text": "More vids please! Forget about beer and women. Go back to your man cave. I mean back to OUR man cave because we all live there as well when you work 😆🤗🤘🤙🖖✌"}, {"text": "1. How did you remove the pins from part with sand inside?<br />2. Did you add grease for bearings?"}, {"text": "it looks like a lightsaber at the end"}, {"text": "Why olive oil, and not some other random oil?"}, {"text": "A restoration legend was born..."}, {"text": "A thing of beauty..."}, {"text": "Simply stunning work fella.  Pure perfection I could and am watching all your videos.  Any chance of a workshop tour.  Loved to pressure gauge episode with you screen printing"}, {"text": "I&#39;ll have to remember that sand pipe bending trick. Excellent video mate!"}, {"text": "Love the shot (at <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=3m47s\">3:47</a> ) of putting the items in the cleaning booth, 1 went in - then all but one were there - then placed the last one.  Why did he have to heat up the bearings and some other things during assembly?"}, {"text": "You are amazing. You have gold hands i love watching your unbelieveble videos. Big respect to you."}, {"text": "Beautiful work as always, but why go through the trouble for this particular one? It looked to be in pretty good shape and functioned just fine."}, {"text": "А смазку в подшипники?"}, {"text": "Затянет вот руку в патрон. Правильно, на хуй нам техника безопасности."}, {"text": "Работает же, на хрен её ремонтировать?"}, {"text": "Почему мало видео на канале?"}, {"text": "This is the best restoration channel out there!!  We need more videos!!😁😁❤❤"}, {"text": "THIS GUY&#39;S A MECHANIC NOW"}, {"text": "the parts you blackened at around <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=6m17s\">6:17</a> , were they stainless steel?"}, {"text": "I’ll take more"}, {"text": "Dang"}, {"text": "Wow what a complicated machine!  So many parts, eh?  I was wondering about the vanes, did you use new ones?"}, {"text": "Air Die Grinder: looks in relativately new condition<br />My Mechanics: <b>HEAVY BASS</b>"}, {"text": "I love pneumatic machines."}, {"text": "Like it but does it have to be bent"}, {"text": "My jaw is dropped with the attention to detail and quality of workmanship.<br />Few questions:<br />1. How in the world do you keep track of parts for proper reassembly? What an incredible parts count! There were a million spacers, shims and bits &amp; pieces.<br />2. How did you clean the air filter? I don&#39;t think that was shown.<br />3. What is the liquid in the washing machine?"}, {"text": "More of a tune up than a restoration... that looked and worked fine already"}, {"text": "Very cool bro"}, {"text": "How come you make your own air fittings? Are they of a certain thread size or diameter or whatever that isn&#39;t sold today? (I&#39;ve seen you make one in a different video that looks exactly like the standard fittings we see in air tools and the like, so I guess I&#39;m only asking about that one, as I can see how the wonky nature of the one in this video could warrant making it youraelf)"}, {"text": "nice nice"}, {"text": "I like Kiwami Japan and thus I love this channel as well. I enjoy the quiet nature of these videos. Very relaxing!"}, {"text": "That bluing is just beautiful. I love the way you let the tools and parts do the talking. Perfect videos!"}, {"text": "nice job! missing the hanging wire loop on the back of the tool it goes in two small holes.<br />i have allmost the same grinder branded  FIAM model SM3"}, {"text": "Hope you used a new collet. They are a consumable."}, {"text": "Спасибо за субтитры!"}, {"text": "Have you had any issues with the heat + olive oil method ruining the integrity of nuts and bolts?   I&#39;d like to try this myself but I&#39;m worried about it making them too brittle."}, {"text": "Perfección!"}, {"text": "Absolute perfection. PLEASE don’t add music, the clicking and spraying and sanding noises are what makes this so addictive. Love your editing too - just please make some more if you have the time!"}, {"text": "Zen !!!!!"}, {"text": "Watching those super long drill bits being slowly drawn back out of the mill is basically pornography"}, {"text": "Awesome"}, {"text": "Don&#39;t really see the need for restoration"}, {"text": "If it’s not broken... fix it until it is! (Kidding!). Another brilliant upload, keep them coming."}, {"text": "for some reason i had the impression you were disassembling and reassembling a lightsaber."}, {"text": "Wow! I didn&#39;t expect that many parts in that thing!"}, {"text": "Lovely work, as always."}, {"text": "This video and the 1950&#39;s Tire Inflator video were the two I watched last.  Yet they were the most satisfying to watch.  Amazing work."}, {"text": "I appreciate that you don&#39;t speed up your videos. It&#39;s really hard on the ears when people have the sped of video along with the sped up audio in so many restoration videos. The way you do it is relaxing and easy to watch at night."}, {"text": "I loved it"}, {"text": "hace vos los rulemanes gil"}, {"text": "I know I&#39;m late to the discussion and you probably explained it somewhere, but how do you know how to take everything apart and then put it all back together without leaving any extra parts out?"}, {"text": "Nice crocheted  square."}, {"text": "The test sound at <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=0m32s\">0:32</a> sounds higher than at the end at <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=14m16s\">14:16</a> . Can it be that it is now slower than it was before?"}, {"text": "you had me at &quot;make it shiny&quot;"}, {"text": "Hello! Can you make a workshop tour video? Cause im amazed by how delicate your equipments are! Great videos by the way.."}, {"text": "I wonder if his wife knows he is using her dish rags and pot holders. 😁. That gets me in trouble every time."}, {"text": "That olive oil trick for the win."}, {"text": "Are you a professional or self taught?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=5m55s\">5:55</a> rustproofing aluminum?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=3m41s\">3:41</a>   Is THAT ever stunning !"}, {"text": "Something VERY satisfying the silence; only the tools; and MM  magic... &quot;MMM&quot;. If political YouTubers GOT the  hint .. the world would be a better ..place... I wonder if females find this kind of spiritual bliss when they buy shoes....<br />(My wife is gonna hit me with something sharp.. O JUST KNOW IT)"}, {"text": "I love your work"}, {"text": "so many parts, which one is the hardest you ever restored?"}, {"text": "Awesome video, thanks so much. What&#39;s the purpose of that teflon tape? Is it a seal?"}, {"text": "Everything it&#39;s much better when you say &quot;let&#39;s make a new one&quot; 😎😎😎😎😎 you&#39;re a fuckin&#39; genius 👏👏👏"}, {"text": "How old is it?"}, {"text": "That was beautiful. Thanks"}, {"text": "i watched this 1 like 5 times but my favorite is the tyre inflator"}, {"text": "You should make one of these from scratch its obvious your machining slills are adequate"}, {"text": "Love the &quot;exploded view&quot; once disassembled, and just prior to reassembly. As many others have said, you do exquisite work!"}, {"text": "My dad was a tool and dye maker for years and years........ Watching these videos with the precise and complex machining being done just makes me appreciate my dad that much more. Awesome videos!"}, {"text": "Once again, perfection!!!"}, {"text": "zu schade damit zu arbeiten :)"}, {"text": "You make me feel like I should have taken Metal Working in School"}, {"text": "Dude I love your work. This stuff looks so good and just like new. I have an old rusty axe you could restore. Do you think you are up to the challenge?"}, {"text": "Do you prefer Olive oil over Rapeseed oil for your blacking?"}, {"text": "Ну блин, собрать собрал... поточил бы им что-нибудь, деревяшку хоть какую."}, {"text": "&quot;looks ugly let&#39;s make a new one&quot; ~ my mom"}, {"text": "The tolerances on air tools are very tight. you need to take care when using abrasives to clean up the components. Making  a new PCL fitting is pointless. And just an Ego trip, to impress the drongos, who know nothing. It adds nothing to the &quot;restoration&quot; What was the reason for not using Air tool Oil, when re assembling?  You ran the grinder dry. which is completely wrong.<br />The Air fitting He, &quot;made&quot; is readily available. There are hundreds of different fittings to choose from.<br />The object of restoration, is to return the tool to it&#39;s original conditional condition. NOT polish the life out of it."}, {"text": "So what this man does is take apart things people made for a living, to put them back together, for a living."}, {"text": "Pardon me while I step over to my lathe and whip out a custom designed air fitting and then give it a right angle bend without collapsing it. Great skills. Well done sir...well done."}, {"text": "Интересно... В какой же стране у тебя такая мастерская..))?<br />Токарный станок вроде СССР... <br />а реставрируешь инструмент западный.<br />Но видео с твоей работой, лучше всякого сериала !<br />Жду весну, пойду в гараж - мастерить )))"}, {"text": "I bet at some point during reassembly you were thinking to yourself: &quot;Yeah, I&#39;m building a lightsaber.&quot;"}, {"text": "Air fitting! And you bent it! Bravo"}, {"text": "fantastic"}, {"text": "I wish I had these skills, and these tools!  Beautiful work."}, {"text": "Whats the point of the sand ? Is it to prevent crumpling the fitting when you bend it ?"}, {"text": "If you like &quot;my mechanics&quot;, you&#39;ll like &quot;Clickspring&quot;."}, {"text": "I am mymechanics #1 fan."}, {"text": "Didn&#39;t look like it needed restoring.  It&#39;s in better shape than most of my tools."}, {"text": "Ok, so thanks to you I can&#39;t watch any more other restoration videos. I just scrolled two videos in a row because the editing was bad and no attention to details. And you set such a high bar for these kinda of videos! Can&#39;t wait for the next one!"}, {"text": "That vice needs a resto lol"}, {"text": "Just so good... again. Your work is definitely the standard for tool restoration."}, {"text": "One of the most satisfying and relaxing things I&#39;ve ever seen. Bravo! [ and keep &#39;em coming ;-) ]"}, {"text": "Great Build on the air line fitting....enjoyed!"}, {"text": "AWESOME TECHNIQUE, especially when making a new air fitting"}, {"text": "normal person: <br />Test it...ok it works, done.<br />my mechanics:<br />Test it...ok it works, time to split it into atoms polish those atoms and put it back together again."}, {"text": "Crazy good stuff. A couple of questions:<br />1. What are the pre-requisites to turn the material black after heated: aluminium and olive oil? What is the process?<br />2. Are you swiss, austrian or german? Just curious?<br />I really like your videos..."}, {"text": "Warum werden nicht alle Kugellager geölt?<br />Ich fette Kugellager immer, ist das schlechter?<br /><br />Danke!"}, {"text": "And it takes me 30 minutes to adjust a stainless steel watch bracelet :D"}, {"text": "Best craftsman I’ve have ever seen"}, {"text": "Very professional"}, {"text": "An other excellent rebuild."}, {"text": "I simply adore your care and perfectionism!"}, {"text": "I was robbed by a plier restoration video, but then i found gold on this channel."}, {"text": "Video ist top! Interessant zu sehen aus wie vielen Teilen das Gerät besteht! This is ugly, I make anew one. Unglaublich! Das alles wieder zusammenpasst? Ich hätte 2 Teile über :-)  Frage - mit welcher Flüssigkeit reinigst du die Teile?<br />Den Stil wie du die Videos machst, hat was beruhigendes."}, {"text": "how to transform a faucet in a phaser   :)"}, {"text": "What a job! More of those projects please..."}, {"text": "The best restoration channel made by the best restorer!"}, {"text": "We love your videos, we have even watched them as a family! Please do an old gunky espresso machine!"}, {"text": "So many people restoring things on Youtube but I&#39;ve never seen anyone who applies the level of precision and attention to detail that you do. Awesome stuff."}, {"text": "The sand for bending, olive oil for blacking, preheat for easy bearing assembly, these tips are priceless! Thank you 👍🏻"}, {"text": "what&#39;s the red machine at <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=3m48s\">3:48</a>?"}, {"text": "I&#39;m going to need you to go ahead and quit your day job so you can upload ATLEAST one new video per week. Thanks- The YouTube Community."}, {"text": "+GF+ ist Georg Fischer?"}, {"text": "&quot;Let&#39;s make a new one&quot; should be your catchphrase - like &quot;Let me show you its features.&quot; for the slingshot channel."}, {"text": "That was bloody fantastic"}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=12m26s\">12:26</a> are you ok?"}, {"text": "Who would have thought that there are so many parts inside this little thing?"}, {"text": "Great work mate!! I&#39;m just wondering... On what metals does the process of heating up to 300-400 degrees and then puting it in olive oil to make a part black, works?"}, {"text": "Nice!"}, {"text": "I&#39;ve watched several of your vids so far and you do great work. I would be interested in the types and brands of tools  you use, they look better quality than anything I&#39;ve seen so far. maybe some affiliate links for those of us interested in  buying and a bit of revenue for the  channel?"}, {"text": "Meister des Werkzeugbaus"}, {"text": "Another great video showing how talented &amp; skilled you are, thank you for posting."}, {"text": "No &quot;hi you guys&quot;, no music, no talking, just skills. Love it."}, {"text": "What? You bought store-made bearings? You didn&#39;t make your own? That&#39;s just not right! LOL"}, {"text": "Awesome! The best I&#39;ve ever seen!"}, {"text": "i love your channel and your videos too &lt;3"}, {"text": "Alright get back in the shop!!! I&#39;m out of videos to watch. So no breaks we need more!!! I understand its days of work in every video but some how I&#39;m going to need a video from you every day. BUT REALLY EXCELLENT VIDEOS I SUBSCRIBED. THANKS"}, {"text": "Keeps me interested, amazed and calms me down at the same time. Like it a lot."}, {"text": "this tool should not be used , but placed in a glass case"}, {"text": "What comes to mind when I  watch these videos is bob ross painting, Stevie Ray playing riviera paradise, my grandma cooking... so relaxing and calm. A pure joy 👍👍👍"}, {"text": "Beautiful!!!"}, {"text": "The a mechanical engineering ASMR. Nice work!"}, {"text": "You are good! Do you teach this stuff?"}, {"text": "Super fine👍👍"}, {"text": "For some reason this is satisfying to watch. Yesterday found your videos and now have seen all the restoration ones. And have to say you are doing an amazing job. Waiting for more new videos."}, {"text": "So many things about this video are absolutely incredible.  The editing is well done, the lack of talking and background music adds to the desired atmosphere of a how-to video, and on top of that, you didn&#39;t like something you had, so you FREAKING MADE A NEW ONE.  I love this channel."}, {"text": "Nice work bro 👌🏼"}, {"text": "Wonderfully done."}, {"text": "I just watched all your videos ! Amazing work , and that bending was out of this world ! Keep doing such great content, no comments no music, perfect !"}, {"text": "There is sublime satisfaction in seeing something reach it&#39;s full potential. Many thanks for this channel, it is like therapy."}, {"text": "I’ve been looking forward to taking my lunch break to watch more of your videos. Making the air fitting, instead of screwing in a cheap replacement, was amazing. Your craftsmanship and detail work is inspiring. Thanks for sharing!"}, {"text": "VERY nice .. a great restoration for sure"}, {"text": "Perfect"}, {"text": "Juste tellement précis !"}, {"text": "My god, I want to be 40 years younger and start over. Such a complex of satisfying skills!"}, {"text": "This is so professional. The other channels doing similar restoration videos now look completely amateurish. Man, you seriously raised the bar."}, {"text": "Richtig cool 😍👍"}, {"text": "Hephaestus is real <b>CHANGE MY MIND</b>"}, {"text": "your english is fine specially as its not your first language. Excellent work, love it and I just subscribed (I did watch the newer videos)"}, {"text": "MVP：lathe"}, {"text": "I have not yet seen more impressive and versatile skills. Thanks for sharing your talent and expertise. On top of that your camera handling and editing is just fantastic. I am humbled by your art. Can&#39;t wait for more!"}, {"text": "Art."}, {"text": "will there be new videos anytime soon? the best channel on youtube when it comes to restoring tools, cheers"}, {"text": "Jedi lightsaber )))"}, {"text": "Es macht richtig Spaß, dir bei der Arbeit zuzusehen :-) Diese Hingabe, die du in die Restauration legst. Absolute Spitze! Das Ergebnis spricht für sich. LG Heiko"}, {"text": "This is the first time i ever subscribed to a channel in youtube. keep up the good work sir!"}, {"text": "Perfect!!!!!! Amazing"}, {"text": "A beautiful job on a beautiful tool.  Now I want to be an engineer."}, {"text": "Ok I&#39;m having withdrawals. I definitely need some more videos! Randomly found your channel a few weeks ago and cant stop watching these! Suprisingly relaxing and just satisfying as well! Great job and keep it up!"}, {"text": "Jewelery!"}, {"text": "At <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=9m56s\">9:56</a> you forgot to mention its now rust proof."}, {"text": "Eine Tolle Arbeit aber bitte verrate uns wer diesen Hammer Topflappen gehäkelt hat 😱😍"}, {"text": "the therapeutic benefit of these videosis on par with Mattius Wandel&#39;s"}, {"text": "Eres el mejor"}, {"text": "Eres el mejor"}, {"text": "Mehr, immer mehr davon.<br />Überragend. All deine Videos! Ich könnte Stunden lang zusehen.<br />Mit Ruhe und einem Selbstverständnis in Sachen Professionalität und Qualität! Wahnsinn."}, {"text": "Wie nennt man das Verfahren bei dem die Werkstücke schwarz werden?"}, {"text": "My only word of advice is that I see you get quiet and quite mixed up.<br /> Quiet = discrete, low volume, no noise, serene<br />Quite = exact,  absolutely, completely, upmost standards, very<br />Your videos are awesome! I work with metals as well at times, so coming here gives me some ideas and inspiration. Thank you, ironworker! From U.S.A."}, {"text": "who else watches these at 2x speed?"}, {"text": "Amazing work.  Absolutely amazing.  Please make more videos just like this.  No music and no talking makes me feel like I&#39;m actually doing the work beside you.  You are my new favorite channel"}, {"text": "Incredible.!!!!!!!!"}, {"text": "waoooooooooooo, pienso que si no tuvieras un video de estos, no hubieras podido montar el grinder.. esto es un rompecabezas.. demasiadas piezas ... es increíble que un grinder tenga todas esas piezas dentro....... gracias por este video"}, {"text": "I&#39;m curious. All these videos you do if you cleaning these tools and stuff. Why do you do it? I&#39;d it a hobby? Are these requests from paying customers? Or do you make a business or if buying old and worn tools and reselling them after a thorough cleaning and refurbishing?"}, {"text": "Swiss people should lead the Earth. They are worthy of it."}, {"text": "why did he put teflon tape at <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=11m05s\">11:05</a> ?"}, {"text": "This looks like a good quality die grinder. I didn&#39;t see any markings whatsoever on it, other than the air fitting. I find that very surprising."}, {"text": "We need more people like you in this world. I wish you all the best in your life dude."}, {"text": "Nice work and attention to detail there mate.<br />Watch out @jimmydiresta there&#39;s a new kid on the block :)"}, {"text": "ASMR"}, {"text": "Колоссальная работа, лайк те за это."}, {"text": "Wouldn&#39;t this be more of a refurbishment rather than a restoration?  It doesn&#39;t seem like this is antique or anything like the other restorations on this channel."}, {"text": "❤️👍"}, {"text": "Da ist ja wieder diese Putzmaschiene.... :D"}, {"text": "Well theres something really satisfying about your videos buddy loved it"}, {"text": "Bravo!"}, {"text": "die guten alten Topflappen von Oma :)"}, {"text": "gg"}, {"text": "wait a minute, you did not make your own Teflon Band... there must be something wrong ?  LOL greetings from Germany"}, {"text": "Wtf? No oil?"}, {"text": "einfach nur wow!"}, {"text": "So the thing is just a grinder with some air right? Cuz I&#39;ve never seen a grinder like that"}, {"text": "Klasse Arbeit, wirklich Hut ab dafür!<br />Eine Frage, vermisst du die Passungen vor der Neuanfertigung selbst oder arbeitest du mit technischen Zeichnungen? Ich könnte mir vorstellen, dass die Zeichnungen für manche Teile schwierig zu beschaffen sind."}, {"text": "Which kind of cleaning bath do you use? Is it a biocircle thing? I search a circle based one for a time now."}, {"text": "Please make more (as in like a couple of hundred thousands) of these videos before moving back to your planet, I am sure you cannot be from this planet... Such a precision and detailing... Great job..."}, {"text": "Wtf?!? You took a perfectly good tool and turned it into a work of art"}, {"text": "This is so interesting to watch."}, {"text": "Your videos are the best of this type. Keep it up"}, {"text": "This is restoration in its purest form, keep the video coming!"}, {"text": "I&#39;m sorry if this has been asked before, but do you not think that polishing the components to the level that you do removes some of the history and the story of the tool?"}, {"text": "Your sub count is going to increase dramatically very soon."}, {"text": "You keep amaze me with all your videos. I&#39;ve seen alot of these restoration videos but your skills are just out of this world! It&#39;s so satisfying to watch you remove all scratches and make things shiny again. And not to forget when you&#39;re making new parts by yourself. I f**king love it! I just want more, it&#39;s like a drug!"}, {"text": "&quot;Looks ugly - let&#39;s make a new one&quot; -lol"}, {"text": "Amazing videos and your process is flawless to watch. Thanks for making the videos."}, {"text": "No matter how many times I see it, re threading is still magical to me."}, {"text": "No fear at all, amazing"}, {"text": "Didn&#39;t think this was gonna be as cool as it actually was before I watched it. Keep up the awesome work!"}, {"text": "Unbelievable job.  I once &quot;restored&quot; an old Desoutter die grinder, but nowhere even remotely as detailed as this.  What brand is it?"}, {"text": "Absolut spitze. Diese Videos sind wirklich ein Schmaus anzuschauen, ich kann es nicht anders ausdrücken, die sind wirklich so gut.<br />Ich habe extra einen Account gemacht um das zu schreiben."}, {"text": "What type of quick connect after you using for air hose?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=0m31s\">0:31</a> vs. <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=14m15s\">14:15</a>"}, {"text": "With the machining skills you seem to possess, I&#39;m surprised you don&#39;t turn the threads on the lathe &quot;the proper way&quot;. Either way, stellar work!"}, {"text": "I need you to make more videos, this is THE best restaurantion channel on YouTube, you are a MASTER"}, {"text": "Tremendous work. Looks gorgeous as well"}, {"text": "Я ремонтировал такие пневмо машинки там все поверхности внутри должны быть зеркало а лопасти делаются по шаблону из стеклотекстолита и должны быть такой толщины чтобы выпадали под своей тяжестью и в тоже время не было люфта..)))"}, {"text": "Nice job man.<br />Can you tell me where I can buy the lighter you use at <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=9m21s\">9:21</a>;"}, {"text": "Bad ass  Die ,love it"}, {"text": "Are you self taught ?"}, {"text": "Your a beast"}, {"text": "One word -- BRILLIANT!!!!!!!"}, {"text": "you are the best realy great job"}, {"text": "I&#39;m so sad I have gotten to the last of your videos... Patiently waiting for more. Keep up the amazing work."}, {"text": "Work of art!!! Fantastic!!!"}, {"text": "This is another great video. Thanks."}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=11m40s\">11:40</a> - no lubricant on bearings?"}, {"text": "Why did the bearings need to be heated up to 80 C?"}, {"text": "man ...restore my life please :)"}, {"text": "Ive watched all 7 videos and everyone of them is incredible!! You are perfection!! The s may stand for stanley? Keep up the excellent work!!"}, {"text": "you broke the prime directive, if it aint broke dont fix it! :D"}, {"text": "😘"}, {"text": "56 Youtube &quot;click bite repainters&quot; didn&#39;t like this video."}, {"text": "Thanks to you I can&#39;t watch other restauration videos anymore. You are just a level above. <br />Watching you is like champions league. The other restauration videos are just 3rd league compared to you."}, {"text": "Great video! How do you clean the residue of the buffing compound from the parts after buffing?"}, {"text": "when he said lets make a new one im like wait hold on make what&#39; then he made the 90 degree air fitting im like wow thats next level shit! wish i had the skill to make my own things 😂 i ran out of videos i need more&#39;!! aha"}, {"text": "A job well done. Thank you so much for not doing as I´ve seen so many other restoration channels do and accelerate the video playback. It is so much better to hear the tools you use and properly see them in action. These other channels should take a lesson from the way you edited your videos.  Instantly subscribed.  Looking forward to more videos. Greetings from Argentina."}, {"text": "восторг"}, {"text": "you just earned a sub <br />keep making videos like this ;)"}, {"text": "THIS GUY MADE A FUCKING AIR FITTING<br /><br />THIS IS NO MAN, THIS IS A GOD"}, {"text": "Very good video. Could be used as an instructional. I used to rebuild pneumatic air tools for a Military Depot. Rebuilt precision grinders, impact wrenches, air ratchets, and air hammers. Good point to remember, when assembling, always use pneumatic tool oil on the parts, even on the rotary vanes. Also for the first few runs, always drop three to four drops of pneumatic tool oil in the air connector at first operation after rebuild. Again, great job."}, {"text": "Another great video, here I thought it sounded OK to begin with and you made it even better. bearings I&#39;m taking it wear bad. Time to buy a new one in my case."}, {"text": "Why the 90 degree attachment on the bottom? Why not a straight connector piece?"}, {"text": "i have a question : do you add these tools to your current tools collection?"}, {"text": "Wow I think I have the same grinder from my father in the garage how old do you think it is Rattles like crazy also  nice work   you have all the toys I see  real man cave"}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=5m02s\">5:02</a> I&#39;d rather be SHINY"}, {"text": "Did he just craft his own fucking 90 degree angle male air fitting? i don&#39;t know how to take this, i&#39;m so fucking jealous of his skill, shop, tools and the recording cameras. This is fantastic!"}, {"text": "Ich wünschte, man könnte 100 Daumen nach oben geben. Tolle Arbeit!"}, {"text": "I have to admit that i dont even know what some of the restored tools are for, i just enjoy watching someone who takes painstaking precision  in doing a great job.  Thanks for sharing."}, {"text": "das macht son spaß deine videos anzuschauen. suchtpotential. tolle arbeit!"}, {"text": "절라 깔끔"}, {"text": "Could you please do a video just on your workshop? The lathe/milling machine; compressor; the other tools you use, etc?"}, {"text": "What is that cleaning device that is looks like a red box with the brush attached to the line? What fluid are you using? Great video can&#39;t wait to see more!"}, {"text": "Anyways not bad for a young buck."}, {"text": "He really understands the premise of not forcing anything. He is almost as good as I am!"}, {"text": "so intricate"}, {"text": "&quot;looks ugly&quot; ahhhh send it lets just make a new one lol. Amazing attention to detail. Id rank you up there with hand tool rescue as far as the quality of your work goes"}, {"text": "そのジョイントって個人で作れるのねwww"}, {"text": "this precision makes me horny <a href=\"http://www.youtube.com/results?search_query=%23nohomo\">#nohomo</a>"}, {"text": "Great idea with sand inside the tube in order to preserve the cross section. I&#39;ll steal it.<br /><br />Отличная идея с песком внутри трубки для сохранения сечения. Я её украду."}, {"text": "How did you know that part would be linksgewinde?"}, {"text": "I like it."}, {"text": "Me encantaría ver en tus videos algunos momentos de cuando tomas medidas o haces esquemas, o cualquier trabajo de diseño. Trabajo en papel vaya ;-)<br />Contenido genial gracias."}, {"text": "Посадка с преднатягом, великолепно, что голова и руки на месте-факт, предлагаю при съемке использовать эффект слоу мо! Обзор мастерской думаю тоже был бы интересен всем!!!"}, {"text": "Why are there so many dislikes?!?!?! It&#39;s a restoration video!!!"}, {"text": "Wow, I was waiting to see how your going to machine the 90 deg. fitting. And when I read &quot;preparing to bend&quot; my mind was blown. Excellent job!"}, {"text": "What sort of metal lathe are you using?  Do you just stop every so often and take measurements so you know how much material to take off or is it programmed in like a cnc machine? I know nothing about this, just curious. I apparently need more tools. lol"}, {"text": "Thanks for your videos, they&#39;re super awesome, so beautiful.<br />What do you use clearing the parts? Is that just a water or what?"}, {"text": "I bet it never looked like that even when it was brand new"}, {"text": "Какая страна?"}, {"text": "Hi from Spain. I have seen all your videos and I think they are wonderful. Intelligence, skill ... Much more than a mechanic or an engineer, you are a true artist. I want more videos!"}, {"text": "I&#39;d love to know how you work out how something like this comes apart. I mean, do you twist it, knock it out, prise it open... so many opportunities to break something by mistake."}, {"text": "I absolutely do not understand how this device works, but your work is fascinating."}, {"text": "Best I’ve ever seen the detailed work put in is complete pride in his work."}, {"text": "I cant wait till this Channel is over 1 mill subs... Cause with this kind of content and the talent of this man... It will."}, {"text": "binged your videos and loved them. i love restoration channels and your work is just amazing. all the different tools and techniques you use to accomplish the video’s goal is awesome. your vice restoration was in my recommended, so that’s how i stumbled upon your channel. <br /><br />i’ve always wanted a restoration channel to acknowledge a little “challenge” i guess i’d call it. in the future of this channel in say a year or something, i’d love to see you revisit some old restorations and talk about what you may do differently especially if you learned new techniques. maybe ways you would improve it more, make it quicker, make a process easier. would love to see something like that if it’s ever possible. i like to watch the channel owner grow with their content but reflect back and see what’s changed and what they would do differently.<br /><br />thanks for the videos. looking forward to the next."}, {"text": "I love these videos!!"}, {"text": "It would have been really interesting to test the RPM before and after, I am certain you improved it!"}, {"text": "Highlights:  Machining the threaded connector and forming the 90 degree bend with the sand,  heating the bearings for an interference fit and proofing the surfaces with an oil bath... a work of art !"}, {"text": "make more videos!"}, {"text": "This is the latest one I&#39;ve watched. I&#39;m living your vids! It&#39;s incredibly satisfying to watch you restore these great tools! And thanks for showing that blacking technique! I&#39;m going to use that."}, {"text": "Of all the similar channel content (and there are a lot out there) I know you have seen a lot  because you have tried to emulate and despite your young channel you have ended up putting yourself in another league. Your attention to detail, sympathetic restoration of original parts and the sheer manufacturing skill is a lesson to the other wannabes. Keep up the fantastic work and I’m sure I’m not the only person to ask for a video about your workshop and engineering background :)"}, {"text": "Have watched several of your videos. Incredible work. I&#39;m guessing you do this for a living. Are these restores commissioned?<br /><br />Thanks again 😁"}, {"text": "That’s shit, lets make a new one 😂👍"}, {"text": "Devil&#39;s in details, everyone talking about air fitting and all. That&#39;s super fine but what really made me somewhat happy...at least one person on the whole YouTube (people that restores tools) who uses his god damn brain and fit new bearrings in this case with heat fit and vise instead of brainless smashing them with pipe and hammer. When I see someone is restoring some rotary tooling or with some axles with bearrings, i think that is cool and I pray for fitting them with brain, but no, in all cases I see a man with pipe or something else and a hammer after that i watch almost 30 seconds od sped up video of hitting that thing what means that in real time it maybe took like couple of minutes...sick"}, {"text": "Unglaublich gute Arbeit! Und soooo viele Teile..."}, {"text": "lækkert at se ordentligt udført arbejde.. <br />jeg plejer at  have krumtappe og andre aksler til at ligge i fryseren  før jeg smider lejer på.<br />gir samme resultat.<br />bare i en frysepose eller 2 så fruen stadig er omgåelig :)<br />hvad med restaurering af en gammel karburator og så shine den op ?<br />kunne være fedt at se.<br />elsker at holde liv i gamle maskiner men derfor behøver de jo ikke se gamle ud :)"}, {"text": "I mean, you could easily start making guns."}, {"text": "Мой перфекционист  во мне ликует."}, {"text": "Just WOW ;-) Seems you really know what you do - great !"}, {"text": "Thank you. I have watched all of your videos twice. I guess I&#39;ll have to go for third viewings until you are able to put up a new one! Your videos are the best on Youtube in my opinion."}, {"text": "Красота))"}, {"text": "More like a deep clean than a restoration (and remaking a part for aesthetics), still a really cool video. And I love your other videos too. You really know what you&#39;re doing to perfection!"}, {"text": "Superb video! If I needed to replace the vanes and wanted to make them myself, what material is used and where can I get it?"}, {"text": "Best restoration channel. Not even close."}, {"text": "He made his own air fitting. Tell me that didn&#39;t just happen!"}, {"text": "Gosh man! You have a new sub! Amazing work."}, {"text": "No music, no hyped up talking. perfect  my only complaint.......need more videos!!!"}, {"text": "Another superb video. I like your bending trick. No <a href=\"http://kinks.as/\">kinks.As</a> stated before attention to detail is overwelming, Great job. Lee not Charleen"}, {"text": "Bloody Awesome, was a pleasure to watch!"}, {"text": "The tool has a different sound after it&#39;s repaired, very interesting"}, {"text": "I somehow start to believe that you just can&#39;t set a foot in his shop. Not because there&#39;s a mess. Just because it&#39;s so shiny, pristine and luxurious in there that one is simply scared to touch and stain something. Amazing restaurations!"}, {"text": "I kept wondering &#39;why the sand&#39; and then I saw the magic. Hot damn! Love these videos!"}, {"text": "So much stuff inside ;D"}, {"text": "What I find utterly amazing is a tool that looks to be a throw away can be repaired whether buying new parts, MAKING new parts, or or even rebuilding the metal!"}, {"text": "This is incredible workmanship. I really love that you don&#39;t talk through what you&#39;re doing; it makes it a really relaxing and entertaining watch. Plus we don&#39;t miss out on all the awesome, satisfying sounds of each job. I&#39;m so damn impressed."}, {"text": "Kurze Frage am Rande: warum nimmst du zum Brünieren kein Leinöl? Das soll besser geeignet sein. Und soweit ich weiß bietet die dünne Schicht keinen nennenswerten Rostschutz."}, {"text": "Art."}, {"text": "It looked ok before the restoration, actually.  Didn&#39;t really need any work.  If it ain&#39;t  broke... don&#39;t fix it."}, {"text": "This is theraputic to watch... amazing work. Wish I will have those skills and tools one day"}, {"text": "Well done. What a great kind of work. You seem to have got an education in metalworks. Looks like you&#39;re used to these things. And I like your workshop. With that kind of tools and machines, I would leave my flat and life there. But I still have no idea where are you from. Your Hammerite paint cans have also an german text on it, so I thinks its a country next to germany. Your power socket also dont&#39;t help me. Where is it?<br /><br />Two more things:<br />What cleaning agent do you use in your part wash machine? And is it suitable?<br />The oter thing drives me crazy. You have this super workshop and do an excellent job all the time, but your till chuck or tail stock on the lathe seems to be out of center.  This is horrible. ;) :D"}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=9m42s\">9:42</a>. Heart in mouth time. !"}, {"text": "Like new, better than new, you make the impossible"}, {"text": "Brilliant......should be compulsory viewing in schools.....get kids interested in engineering."}, {"text": "Isch mega guet!"}, {"text": "Von schlechter Qualität habe ich beim Video nichts bemerken können. Und selbst wenn es Helligkeitsschwankungen gab:  Es ist ein Restaurierungsvideo, kein Hollywood-Spielfilm. <br />Und dass es eine Superarbeit gezeigt hat, brauch ich wohl nicht zu erwähnen. Danke dafür."}, {"text": "My favorite one so far. Keep up the great work!"}, {"text": "Please tell me why you are so freaking awesome with restoring (and I even saw the vice you did).... WHY dont you restore YOUR vice that you use!? I would LOVE to see that look all sweet and be used. You are a rock star!"}, {"text": "You are quite talented young man.  Thank you for sharing!"}, {"text": "Nice job, I can only aspire to such transcendent levels of OCD and PPD!"}, {"text": "More please.  Lots more!"}, {"text": "I have subscribed to your channel and binge watched all your videos and I could tell by the way you laid out all the disassembled parts and your attention to details that you were either German or Swiss, I now know you are indeed Swiss.<br />I have watched many &#39;restorers&#39; and you are by far the most meticulous and talented one I have seen.<br />Well done."}, {"text": "I am absolutely fascinated by the way you lay all the parts out in an exploded view pattern.<br />Great work as always, thank you."}, {"text": "Beautiful work"}, {"text": "i hope u can do more"}, {"text": "- Buys a car.<br />- It&#39;s ugly<br />- Let&#39;s make a new one!"}, {"text": "Wo hast du das alles gelernt?"}, {"text": "Voila as new"}, {"text": "Nice to see someone else using the sand trick. I’ve done in in a pinch to bend fuel metal fuel lines."}, {"text": ".... as if machining a custom air coupling isn&#39;t enough, he puts a 90 degree bend in it .... urgggh!!!! Too much! Love the detailed way you work."}, {"text": "Beautifully"}, {"text": "And crap I’m out of videos I need more!!!!!"}, {"text": "Ladies and gentlemen... I give you, Michelangelo of the 21st century."}, {"text": "Unbelievable.."}, {"text": "Of all the restoration videos I&#39;ve watched (and I&#39;ve certainly watched many), yours are by far, the most enjoyable. Your OCD (that&#39;s a compliment btw, lol) is admirable. Keep up the terrific work, I am subbing and eagerly looking forward to the next 5 videos of yours I need to watch today and also a lot more in the future. The suspense is killing me, lol."}, {"text": "Another Exquisite job.....you are a master craftsman! Love your attention to detail."}, {"text": "So that&#39;s where the precision mechanical skills from the Swiss watch industry went - into the Swiss CNC industry.....<br />Your skill in both engineering and video editing made your 15 minute video pass too quickly.<br />But you achieved the goal of the best entertainer - to leave &#39;em crying &quot;More, More&quot;."}, {"text": "I always wondered how pipes were bent without it simply collapsing or crimping at the bend! I learned something new!"}, {"text": "Very Well Done!  Who knew that simple thing had SO many precision parts <a href=\"https://youtu.be/nzVsUntib80?t=222\">https://youtu.be/nzVsUntib80?t=222</a> lol. Had never taken one apart."}, {"text": "That my friend is a thing of beauty"}, {"text": "Do your parts dropped in olive oil after heating remain black and protected for ever or is it temporary? Never saw that before, very impressed.... almost looks like powder coating"}, {"text": "It must be awesome to know that you can just make almost any metal object with this machine. I can make almost anything regarding electronics and computer software. Imagine what we could make combined."}, {"text": "You are a very good  at rebuilding things nice job keep up video&#39;s"}, {"text": "Amazing. Although i used to think explanations and narrations during a project are helpful, the beauty in being held at attention by watching a true craftsman with an eye for precision, gifted hands to match and a simple straightforward manner make your videos satisfying to behold.  Thank you.<br />To those reading this, watch the other videos and see if my humble opinion is off the mark."}, {"text": "Sand blasting and olive oil looks perfect to me."}, {"text": "Beautiful video I learnt something thankyou !! How you made the bent air fitting was really fascinating filling it with sand to hold its shape never seen that before !"}, {"text": "Хто піздец сколько составляющих"}, {"text": "I think that was the inspiration for the lightsaber from Star Wars."}, {"text": "Awesome resto on it. Had to Subbed..."}, {"text": "I started losing parts while you were only half way disassembling. Great job!!!!"}, {"text": "Man that is just super clean work. And that black finish with olive oil? Hnnnnngghhhh!"}, {"text": "Типично немецкий подход ко всему -  исправные и чистые инструменты, организованное рабочее место, порядок во всём, точность измерения и изготовлениия новых деталей ... одним словом, молодец. <br />Очень приятно смотреть твои видео!"}, {"text": "Gut gemacht! Echt mit liebe zum Detail"}, {"text": "The fact that you made ur own air line fitting boggles me"}, {"text": "Bạn thật tuyệt vời 👍👍👍"}, {"text": "You&#39;re one of the most precise and accurate guy who restore in youtube"}, {"text": "I wish I knew about the olive oil making things black back in highschool. I totally would have used that for jewelry class"}, {"text": "Incase ppl wondering why he plugged both ends and put sand inside at <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=10m00s\">10:00</a> If he didn&#39;t fill in with sand. the pipe would make a flat bend and cave in on itself"}, {"text": "This is the perfect restoration...well job ...excellent..eye teraphy for me"}, {"text": "👌👌👌👌👌👍👍👍👍👍"}, {"text": "You had a gas mask or had ventilation when you were sanding right, you don&#39;t wanna inhale metallic dust, it&#39;s horrible and I did it once accidentally when it got on my phone and I inhaled it by mistake and welp my lungs were hurting all night. I&#39;m fine but hey you gotta take safety measures when it comes to metallic dust."}, {"text": "Wow what a talented man you are. You do a terrific job, your parents would be so proud of you, please don&#39;t stop making these videos."}, {"text": "The sound it made was cute at the beginning."}, {"text": "Beautiful job well done!"}, {"text": "absolutely brilliant your engineering skills are superb"}, {"text": "Você é muito inteligente parabéns seus vídeos são tops de mais . Um grande abraço . Rio de janeiro Brasil 🇧🇷"}, {"text": "You Sir are a true artist. Even the taps on the screwdriver to disassemble it were precise, and the way you made the bent hose part was brilliant."}, {"text": "top level  restoration work, It can&#39;t be better; thanks you, Sir, for this pleasure of video!"}, {"text": "Your skill with your lathe is mind blowing.<br />May I ask what your background training was in ?"}, {"text": "Lovely restoration 👍🏼"}, {"text": "👍👍👏👏👏👏👌 انته دقيق في اصغر التفاصيل روعة"}, {"text": "Very nice. well done. Dont stop. Conglatulations from Paulo in Portugal"}, {"text": "Keeping craft alive"}, {"text": "super projekt daumen hoch"}, {"text": "That part with the sand was genius."}, {"text": "This guy...cant stop looking!🙏🏻🙏🏻🙏🏻"}, {"text": "Next time please use it. It was frustrating to not see it functionning after all the great work you put into :D"}, {"text": "This is some of the coolest shit on the internet !! So glad I found this channel !!"}, {"text": "you are a man of perfection!!! a perfectionist!!!"}, {"text": "Superb!!!"}, {"text": "Absolutely excellent!"}, {"text": "Great job....."}, {"text": "Keep on grinding Bro.....;-) p.s I&#39;m STILL in btw."}, {"text": "Really enjoying your videos and love the exploded view you always give!"}, {"text": "My hat&#39;s off to you ! No compromises and very professional. Bravo !"}, {"text": "Технопорно. Подписался."}, {"text": "Very nice job!!"}, {"text": "You know you&#39;re a machinist when you say fuck it and turn a new air fitting on the lathe rather than just spend a few dollars on one 😂"}, {"text": "The moment I saw it I remembered Antoine Sigure."}, {"text": "да вроде и так все работало xD"}, {"text": "Precise craftmanship. It&#39;s a pleasure to watch your works."}, {"text": "Love it!!!!!!!!"}, {"text": "We have gained understanding. I&#39;m glad to finally find out how that tool works."}, {"text": "Another level of restoration 👍...keep it up bro....waiting for another one"}, {"text": "молодец! браво!"}, {"text": "Don&#39;t worry about it,it all looked good from my house......"}, {"text": "Awesome work!"}, {"text": "Good work"}, {"text": "Great lathe skills"}, {"text": "Who would have thought that such a piece of equipment would have so many parts. Well done. You really can hear the difference in the pitch from old to restored."}, {"text": "Hi. <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=6m00s\">6:00</a> , <a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=9m21s\">9:21</a>  what is tool name?<br />left side, red color , flame fire"}, {"text": "How many years of machining do you have? You seem to be very good at it."}, {"text": "Who would have thought there&#39;d be that many parts inside a Die Grinder? Well done."}, {"text": "Great job man i enjoy every one of your videos your 15 minutes videos feel like 5 minutes can’t get enough!!"}, {"text": "you have inspired me.. i have a Cleco 34 series angle nut driver clutch type in my tool box that is in need of rebuilding.  worked for me for months.. the boss tried it and i don&#39;t know what he did to it.. it would not spin any more..  in looking at the info.. now i am wondering if he oiled it..  i got it from boeing surplus decades ago for 40 or 50 bucks.  i was amazed to see that they sell new for over $3,000 dollars. even used on fleebay for 700..  it sure sped up the engine assembly with all the external bolts on some of the builds."}, {"text": "The attention to detail and how things go and how they originaly looked new is amazing for your first video amazing it&#39;s up there on that neistat level I instantly subbed video and editing and restoration is your calling you will be in the 100k subs before long I see great things in the future for you on YouTube :D"}, {"text": "I think he has done that before! 🤔"}, {"text": "<b>WAY</b> to pretty to use. Might get dirt on it."}, {"text": "Cool I&#39;ve never seen some of these repair techniques before."}, {"text": "Look pretty damn good before still bud"}, {"text": "Absolutely stunning attention to detail and craftsmanship; I’m in awe at how finely you produce parts. Excellent work!"}, {"text": "wow nice!!!!"}, {"text": "Beautiful little job!"}, {"text": "For a second i forgot what i was watching, and i thought you were building a lightsaber. Lolll"}, {"text": "That is the highest quality air tool I’ve ever seen. I have taken apart A lot of air tools.  Never saw one like that"}, {"text": "Tu es un grand malade toi!!! Je comprend pourquoi les plus grands horlogers sont suisses... Vivement d&#39;autre vidéos!"}, {"text": "Out of all the tool restoration videos i&#39;ve seen, this really is one of the best. Love the editing and detail. Also appreciate how things are done properly. Will definitely keep an eye out for more of your videos"}, {"text": "Like the ABBA song &quot;As good as new&quot; ! Really love your videos. Subscribing now.Greetings from India"}, {"text": "I know next to nothing about tools, air or otherwise, but I sort of wondered why they don’t put a comfortable handle on such things (like a gun grip). It looks a little uncomfortable to hold and manipulate the lever at the same time with only gripping the rightangled tube.  Oops I forgot to say I thoroughly enjoyed watching!"}, {"text": "Really didn’t need to be restored but-"}, {"text": "Making your own fitting was a nice touch."}, {"text": "Nice work but could you rebuilt it if there were no video or pictures of it to aid in the assembly."}, {"text": "Oh my.. This was just perfection. Thank you for sharing, outcome was nothing short of spectacular!"}, {"text": "&quot;looks ugly lets make a new one&quot; i love it that made my day"}, {"text": "beautiful !"}, {"text": "Sehr schöne Arbeit! Bei dem Teilereiniger würde ich Handschuhe benutzen...<br /><br />Anhand der Steckdose würde ich dir jetzt Schweizer Präzision unterstellen :-)"}, {"text": "Nice job but the bent airline end would do my head in ."}, {"text": "Great job on the highest level."}, {"text": "That looks better than brand new one"}, {"text": "That was truly an amazing video. The die grinder even sounds better in the end."}, {"text": "Excellent"}, {"text": "Now that is a fantastic refurbishing project. Did you notice any increase in performance? And Did you replace the vans, or reuse the old ones? Either way, Bravo sir, Bravo"}, {"text": "I have one that needs a rebuild if you want the work?"}, {"text": "I know these videos are very in-depth, but now you&#39;ve got me hooked. You&#39;ve created both supply and demand. Now supply more videos. <br />j/k Honestly can&#39;t wait to see what you&#39;ve got in the works."}, {"text": "I&#39;m pretty sure that&#39;s one of the cleanest rebuilds I&#39;ve ever seen. Using the lathe to sand and polish, then using the olive oil to add the beautiful tone, and then hand fabricating the nozzle and then using that technique with the sand to bend it.... I&#39;m slow clapping to this at 1:00 AM in my basement."}, {"text": "Amazing"}, {"text": "Beautiful work -- and beautifully presented video!  You&#39;ve got yourself a new subscriber!!!"}, {"text": "Absolute perfection of job well done. Keep up the good work. It was a pleasure watching you doing it. Thank you very much."}, {"text": "Hi from England <br /><br />High standards of work... <br /><br />Subscribed"}, {"text": "Complimenti anche per questo spettacolare lavoro di precisione. bravo!!!!"}, {"text": "Great job. I worked at a tool warhouse in cleveland Ohio and we did our own warranty work. I hated the die grinders."}, {"text": "Kraftwerk tools any good?"}, {"text": "Nice job, you did it as best as possible"}, {"text": "Lots of parts in that ...Great job man...;-p<br />Thanks for sharing."}, {"text": "Good job but use more grease on all bearings always and oil oil oil every day air tools listen to before and after in quick succession. You want that very high pitch not the low pitch of the after."}, {"text": "Great work."}, {"text": "While I&#39;m clueless as to how hot you&#39;re getting everything (because I&#39;m an ignorant american) you did an awesome job. Looking forward to more content."}, {"text": "Superb work! I like the way you turn the parts black, havent seen that anywhere. It looks very nice, the shiny surface and the black parts are perfect together."}, {"text": "So satisfying to watch the parts getting cleaned as they turn! Turned out beautiful and your attention to details is incredible! Great job!"}, {"text": "You Sir are a pro.. Great job"}, {"text": "absolultely incredible"}, {"text": "Compliments for a job professionally done.<br />The machining for instance, very skilled.<br />One of the few videos where bearings are mounted in a correct way (heat, pressing in etc.)<br />All in all, a pleasure to watch, so keep them coming :)<br />Btw; some great tools and machines you have."}, {"text": "Now there&#39;s a proper die grinder.  No one makes them like that anymore.  Swiss made too.  Didn&#39;t know Georg Fischer made anything like that."}, {"text": "That was some grade A restoration. Very well done!"}, {"text": "Wow! Learned a few awesome tricks!"}, {"text": "The only thing wrong with this channel is, absolutely nothing! Awesome videos, just need a lot more."}, {"text": "Excelent!!. Better dan new!!. More videos please!!! Saludos!!"}, {"text": "❤❤❤❤❤❤"}, {"text": "not gonna lie, it would awesome if the whole tool was black"}, {"text": "Well played!"}, {"text": "I see it, you are fresh youtuber. <br />I watchin few restoriation YT channels i.e. - hand tool rescue - restore it - random hands-  and I see your potential, and that gonna be a good YT channel as well  !!!<br />Catch sub from me and KEEP GOING dude."}, {"text": "Fantastic Work!"}, {"text": "Awesome, marvelous"}, {"text": "<a href=\"https://www.youtube.com/watch?v=nzVsUntib80&amp;t=6m07s\">6:07</a> that&#39;s how you turn metal black? ok"}, {"text": "Great skills"}, {"text": "Awesome man, subscribed!!! ✌️"}, {"text": "Beautifully restore"}, {"text": "Your editing is great.  Reminds me of Primitive Technology"}, {"text": "Your method of recording the whole process is incredible. The shot choices are great and the pacing of the editing is spot-on. Well done!"}, {"text": "More brilliant work. Subscribed!"}, {"text": "I haven’t the slightest clue what that is, but it was intriguing nonetheless. I appreciate your level of craftsmanship. I’ve used a laser cutter before and glued layers of wood together, if that counts...best of luck with your channel!"}, {"text": "Nice video I like it! Good idea to restore something! Schweizer sind gut!!!"}, {"text": "Nice, The Fastest Van is Now a professional mechanic 😏"}, {"text": "Awesome work ! It would be nice if you could explain briefly why you do certain steps. Also a quick before/after comparison at the end would make it look even better :)<br />Otherwise, fantastic job !"}, {"text": "Very good job man. Definitely learned something new from this video. Wish you good luck with your new channel 👍 I subbed"}, {"text": ":o<br />Success on the new channel, man!"}, {"text": "Dude! Thats awesome! Nicely done good sir! I learned a couple tricks during the video too."}]