[{"text": "Plz attend weekly contest biweekly is a bit easier. I really enjoy watching you solve problems"}, {"text": "Is it just me or does he kind of looks like Edward Snowdon?"}, {"text": "Screw leetcode. How long did it take you to get to Div1 on codeforces? Also how many ad hoc problems did you practice?"}, {"text": "git ziomuś"}, {"text": "high I m a novice in competitive  programming plz create  basic to advance data structure  and algo  along with this type of videos bcz It would be helpful to us .plz reply"}, {"text": "So basically 4 of 4 problems are fine with brute force since constraints are hillarious. I don&#39;t enjoy these problems at all"}, {"text": "This is really cool, seriously here before 100k subscribers.!"}, {"text": "It would be great if you can keep ur mic closer ..."}, {"text": "Jesus you are so fast. Congrats!"}, {"text": "Any plans to do the weekly contest? (biweekly is locked behind a paywall)"}, {"text": "Congrats man keep up the good work"}, {"text": "This are some nice skills!"}, {"text": "Could you <br />please make a video on how you setup your coding environment for coding challenges. It will help me a lot."}, {"text": "How you have perfectioned writing that fast?, specially for programming. I can write fast but only words, programming characters is different matter"}, {"text": "At least the statements were short :P"}, {"text": "Natrafiłem na Twoj kanał przypadkowo i mimo tego że nie umiem programować to oglądam Twoje materiały. Pozdrawiam."}, {"text": "Is there anybody like him coding in javaScript ?"}, {"text": "Can anyone suggest me how to start programming step by step. I am confused where to get started 😬😫"}, {"text": "Was this filmed live during the contest? Or published after the contest? Anyway, great video @Errichto! I&#39;m rooting for you!"}, {"text": "The best"}, {"text": "what make you can solve it fast like that @@ like a superman"}, {"text": "as a humble request, kindly stream for all the leetcode contests."}, {"text": "I have been watching your channel since google kick start round G, and I really learnt a lot from you! Thanks a lot, genius!!! I will always watch your channel and try to improve~"}, {"text": "Really weird silent cocaster twin"}, {"text": "make video on your thought process while you solve dp, backtracking.... how do you think... what are the key poiints you keep in mind while solving them... what were your struggles learning them when you were starting out.. thanks"}, {"text": "anyway your are first in our hearts"}, {"text": "Bro can u do a video on maps, hashmaps in detail ? (I am a C++ beginner and the concepts are not very clear on the web)"}, {"text": "awesome👍"}, {"text": "Beautiful :)"}, {"text": "Thanks for doing these LeetCode contests/problems! I like when you do LeetCode since it has all types of algorithms/data structures problems compared to other OJ. Also the problems are not wordy on LeetCode, I don&#39;t like when the questions have so many words, it&#39;s not an English reading contest"}, {"text": "thanks for great content. Imo if you want to win leetcodes you need to have 2nd monitor with challenge description on it"}, {"text": "Can you try solving this challenge.This will be really helpful.<br /><a href=\"https://www.codechef.com/NOV19B\">https://www.codechef.com/NOV19B</a>.<br />By the way,great video.Thanks to walk through your thought process."}, {"text": "Sir I have done my graduation In computer (coding) and Master too. <br />But I still don&#39;t understand what test set and limits under Google code competition questions , will you please tell me where will I find the answer or if you can please make one video over it . I love to code but some how I am unable o reach to level you have . Hope so you will read it and reply . Thanks 😁"}, {"text": "Dobra robota ;d"}, {"text": "Hi Errichto, please make more such videos.<br />Also, how could you come up with the solution for the 4th problem. You must be a great genius."}, {"text": "I was able to done only 3 questions wasn&#39;t able to done last one."}, {"text": "Hello,there is a question in leetcode which i cannot do for a long time.If you do it with explanation,I will be happy to watch it.<br />Question : 309. Best Time to Buy and Sell Stock with Cooldown<br />Thanks in advance :)"}, {"text": "Thanks errichto,  I am improving my dp skills by your helpful videos. 😁"}, {"text": "U are awesome Sir. Can you plz put atcoder AGC contest screencast. Would be great to see your take on logically difficult problems. Thanks Kamil for your videos."}, {"text": "legends says errichto still think he is first hahaha <br />Congrats for second btw"}, {"text": "Thanks for sharing video"}, {"text": "Please make video on topic : DP on interval"}, {"text": "You deserved the win for sure there<br />Can we get some graph problems thatd be very helpful<br />thanks in advance"}, {"text": "Thanks a lot! It&#39;s really helpful!"}, {"text": "Please make a video about DP on intervals, and thanks for making this video really helpful.<br />Also if you can share how you started your journey of competitive programming like from which resources you started practicing and give some recommendations then that would be great 😊."}, {"text": "A variation of first problem showed up in my coding interview yesterday. Very easy and boring."}, {"text": "Thanks a lot!! I find these really helpful."}, {"text": "I like these videos a lot really gives some insight into what a competitive programmer does when under time constraints."}, {"text": "Can we expect  screencast of tomorrow&#39;s  Leetcode weekly as well?"}, {"text": "You rock.😎😎"}, {"text": "It feels really comforting that everyone makes such mistakes. Today i was very frustrated when i was getting wa on a very simple problem. Thanks a lot for these videos."}, {"text": "Soooo good..... 😎"}, {"text": "Well done errichto.<br />All of this helps me to have an idea of what kind of thoughts flow in the mind of any competitive programmer during the contest.<br /><br />Its a motivation for me that reaching that level is not impossible. And that is all i need.<br /><br />Thank you so much for creating one of the best YouTube channel for competitive programming.<br /> 😍😍"}, {"text": "Thank you for these videos. They are very helpful for me!"}]