[{"text": "I am so happy that i found  a high quality competitive programming channel.  Thanks a lot Errichto!"}, {"text": "Yo, where are u from?"}, {"text": "What is programming language are you use ?"}, {"text": "Hi...which language do u use to code?..<br />Is it python?"}, {"text": "Well now I like bears too :D"}, {"text": "i thought you are going to serialize a tree and save it 😅"}, {"text": "Сan you rotate these trees without additional memory?"}, {"text": "brilliant! :)"}, {"text": "From where should I start into programming field from scratch ??"}, {"text": "I just realised how much life has changed!<br />So much for being a CS undergrad :("}, {"text": "please tell me <br />what is the name of your compiler ??? it is so nice,,, i use just codeblocks !!!!!!"}, {"text": "I honestly got so baited by the title and thumbnail of this vid well played good sir."}, {"text": "I’m 420th like"}, {"text": "Senpai"}, {"text": "U are a legend sir."}, {"text": "Im proud of you that you did this video :)"}, {"text": "I just became a great fan of u becoz u teach and protect environment for all of us. I like your bear too. 🐻."}, {"text": "good initiative"}, {"text": "Hey I am from Bangladesh.I tried to donet here but I can&#39;t donate it"}, {"text": "i wonder when gates will donate"}, {"text": "I usually don&#39;t comment on videos, but what you&#39;re doing is really great Kamil, keep up this good work. Thank you very much for caring for the planet. <a href=\"http://www.youtube.com/results?search_query=%23savetrees\">#savetrees</a> <a href=\"http://www.youtube.com/results?search_query=%23savebears\">#savebears</a>"}, {"text": "thank you for your time bro great idea !"}, {"text": "Donating is much easier than solving a Tree problem. Believe me, I have done both. ;-)"}, {"text": "Why then we hesitate to plant trees by our hands?"}, {"text": "Errichtron Musk."}, {"text": "Tell me your codeforces user IDs I will make you my friend"}, {"text": "Does anyone know what drawing program he uses, it&#39;s not in the FAQ?"}, {"text": "Awesome brother!!"}, {"text": "great initiative."}, {"text": "Fantastic! We need to protect Limak!!!"}, {"text": "Yes Errichto yes."}, {"text": "Knowledge"}, {"text": "Hello! i wanted to start competitive program. Please guide me where to start and how to practice."}, {"text": "Next video on trees please!"}, {"text": "lol"}, {"text": "ErTreeichTo"}, {"text": "Good video."}, {"text": "Nice :)"}]