[{"text": "You forgot to polish the wire that holds the wick!!!!!!"}, {"text": "👏👏👏👏👏👏"}, {"text": "would it make sense to put a cover and a wick on the pilot light?"}, {"text": "that leather part was absolutely ingenious"}, {"text": "I’m always in awe watching your videos. Truly amazing work! Any chance you could tell us in your videos how many hours each project took? I’m always curious how much time you spend on them."}, {"text": "Я в восторге с какой точностью и аккуратностью вы работаете , вы настоящий мастер своего дела . Очень приятно смотреть ваши видео , на одном дыхании ! Успехов вам !"}, {"text": "I&#39;m super disappointed that you didn&#39;t clean up the wire for the wick. SMH..."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=14m52s\">14:52</a>  he didn&#39;t polish that spring...so disappointed"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=6m40s\">6:40</a> he can make his own silencers for guns like that"}, {"text": "Wait, you can&#39;t engrave? That&#39;s it, dislike, unsubscribed and reported lol"}, {"text": "What&#39;s the difference between blueing liquid and heating it and quenching it? Which is better?"}, {"text": "Мало отверстий для подсоса воздуха"}, {"text": "Со своими руками и оборудованием он мог, по-моему, сделать эту лампу новую с нуля. Красавчик!!!"}, {"text": "Next video restoration a chainsaw👍"}, {"text": "Anyone else thought this was a vickers machine gun at girls glance"}, {"text": "I knew this was gonna be good, but wow,"}, {"text": "Belle restauration, dommage que se soit en anglais."}, {"text": "Amazing quality work. Thank you so much for this. It made my day."}, {"text": "<b>HYPNOTIC to watch your work! It&#39;d be fun to be your apprentice</b><br /><b>Personally I wouldn&#39;t envy anyone using that blowtorch</b>"}, {"text": "Honestly Speechless"}, {"text": "&quot;It&#39;s too beautiful to set it on fire again&quot;<br /><b>*sets it on fire*</b>"}, {"text": "👍"}, {"text": "Wrap it in a hummus.."}, {"text": "age?"}, {"text": "Saludos 🇦🇷🇦🇷🇦🇷"}, {"text": "Nice Job!  I picked up a couple of tricks from you too.  I know they used to silver braze bicycle frames with kerosene torches in the past, but I had not seen a Swiss long one like that.   That hole punch set of yours was nice too , especially for larger holes.  I&#39;m subscribed now, so thank you!"}, {"text": "i find myself saying it outload like other viewers , as soon as i read , this has seen better days , I chime in , lets make a new one . !!!"}, {"text": "cool!"}, {"text": "Another Meisterstück."}, {"text": "Thank you for your videos, great work on all.<br />Interesting approach to making your leather cup washer ! <br />With the small pump valve washer, you may find that the rubber component of cork/rubber composite swells with hydrocarbon fluid immersion over time becoming ineffective. Try a small leather washer in these situations, even in the cap washer where they are more resistant to both the heat and hydrocarbons."}, {"text": "AMAZING!!!!  BEST COMMENT ON AN IMPOSSIBLE PART.... LETS MAKE A NEW ONE!!!!!  LOL!!!!"}, {"text": "Excellent job!<br /><br />But it has too many new parts to be considered &quot;original&quot;"}, {"text": "<b>FUEL</b> all burnt .<br /><b>Lets make a new one</b> 😄"}, {"text": "The flame is short . But it&#39;s not a blowtorch it&#39;s a flamethrower 😆"}, {"text": "I watch your vids with huge enjoyment. They are inspiring enough for me to want and go out and buy a lathe,  a belt drive sander, tools and the like. The one thing I don&#39;t have is the engineering background.  But that is ok. Your sheer skills and talent for reviving old equipment is exciting and mentally rewarding. You revive these items so that I don&#39;t have to, and thus it becomes so rewarding to see the finished item.  It would be easy to skip to the end and see the before and after result, but that isn&#39;t the point. Watching you make a new part is, for me, a joy to watch. We the viewers are then rewarded by the &quot;eh voila&quot; moment.  And it is ALWAYS superb. Then I think, I wish I could do that. But that is my envy of your excellent skills. Superb channel."}, {"text": "Que maravilla!"}, {"text": "Thanks for lighting it on fire again."}, {"text": "Its nice to see a craftsman make an error and admit it. a beautiful blow torch. the fuel tank looks like an ornament rather than a part of a blowtorch. every time i watch your videos i wish i had access to such a well equipped workshop.<br />Beautiful work and attention to the intricate details as always"}, {"text": "Takiego palnika jeszcze nie widziałem.Ale naprawa jest ciekawa☺️"}, {"text": "I want one!"}, {"text": "OK, why cork?"}, {"text": "I&#39;m waiting for a good opportunity to try that flour, vinegar, and salt trick on something. The results are shockingly good, considering how stubborn copper/brass/bronze can be."}, {"text": "👍"}, {"text": "Antique blowtorch.  Oh, the possibilities....  😉"}, {"text": "Ok, I&#39;ve watched 3 videos in a row now. After this one, I promise not to watch another one until tomorrow. Btw, you should fire-blue/heat blue some of your parts. That always looks great."}, {"text": "La pieza donde unida la boquilla no la pusiste y se ve fea."}, {"text": "Please do some gun restorations..especially  shotguns"}, {"text": "You are AMAZING 👍™"}, {"text": "I&#39;d have given up after 4 minutes of this..."}, {"text": "That polishing wheel has brought a great many smiles to my face."}, {"text": "Ого, для русского языка места уже не осталось.  Вы теперь только иностранных подписчиков рассчитываете? Обидно."}, {"text": "this is in real bad shape....a lot work to fix this one....looks pretty.....imagine all those parts for a torch...the tinnie bits had me worried."}, {"text": "The best restoration channel on YouTube it give me great ideas"}, {"text": "Did I just see Victorinox scissors @<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=9m17s\">9:17</a>?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m49s\">5:49</a> that&#39;s a lot of material wasted."}, {"text": "Кто ставит дизлайки!??<br />Автор все делает идеально, смотришь и глаз радуется!"}, {"text": "Мне бы стока терпения!"}, {"text": "&quot;Why didn&#39;t he polish the front of the blowtorch? ... ... ... ...wait THAT&#39;S how it works?!&quot;"}, {"text": "Je pense sincèrement que vous etes le plus doué de tous les restaurateurs que j&#39;ai pu voir sur le web. On dirait qu&#39;aucun domaines ne saurait vous faire reculer. Bravo."}, {"text": "видео о том как из хуйни сделать блестящую хуйню))"}, {"text": "These vape modding videos are getting out of hand"}, {"text": "У вас золотые руки...👍👍👍"}, {"text": "Чётко, интересная паяльная лампа, вот только почему &quot;тело&quot; горелки не зачищал до блеска? А так всё прекрасно)))"}, {"text": "If you turn it fire on after completion, it will be dirty and it will not be easy. It ’s wonderful workmanship."}, {"text": "Нельзя накачивать холодную лампу - в случае утечки бензина, потушить её будет невозможно :)"}, {"text": "Интересно конечно. Но он это потом продает?"}, {"text": "God has given you a great talent."}, {"text": "Вы супер"}, {"text": "WHAT????  You can&#39;t engrave???  I am so upset. I thought you could do ANYTHING."}, {"text": "Looks more like a flamethrower"}, {"text": "Next video restoring my old tools by my old tools 😆😆"}, {"text": "Hey, my mechanics! I got a bench grinder at home, but I don&#39;t have an wheel wire disc and an polishing disc."}, {"text": "Дай Бог тебе здоровья)"}, {"text": "Calling this restoration is like calling a F1 engineer a mechanic. Yes that is what they technically do, but they take it to another dimension. <br />Best restoration channel on YouTube"}, {"text": "This is one very dangerous flame thrower"}, {"text": "How come you didn’t polish the handle part and make it shiny? Either way it looks great as always"}, {"text": "So cool"}, {"text": "Pure workmanship yet again, you need more videos now as I&#39;ve watched them all. Everyone is truly high standard workmanship. Thank you for taking the time to do them for us mere mortal men and women"}, {"text": "I don&#39;t know what planet you&#39;re from, but they&#39;ve trained you well. Brilliant!!"}, {"text": "We say &quot; golden hands&quot;. That&#39;s about you. Thank you very much that I didn&#39;t spend my time in vain."}, {"text": "Please do not apologise about your English. It is far better then most. The important thing is that you communicate well."}, {"text": "Great work bro"}, {"text": "Wtf would this item have been used for 100 years ago?  I just don&#39;t see it.  But I also don&#39;t know that much about the history of tools."}, {"text": "Crazy crazy skills, so rewarding to watch"}, {"text": "Hallo out of New Zealand. You are in a class of your own. I absolutely enjoy your work, ability, precision, etc. Thanks for making my life better by sharing your video&#39;s with us. Keep going and I wish for your quality of life to be: As good as it gets !. God Bless."}, {"text": "como hacen para que no se oxide?"}, {"text": "Really beautiful! Congrats! A pleasure!"}, {"text": "Классно сделал"}, {"text": "Quand on a la chance d&#39;avoir du matos et de savoir le maîtriser, on peut effectivement, réaliser un ouvrage de restauration, digne de ce nom. Franchement, le résultat est vraiment remarquable, ça méritait largement du commentaire positif.<br />Congratulations, mec, je reste pantois !!!<br />👍👍👍🏆"}, {"text": "I can&#39;t believe it, but really you&#39;re my hero. 👍👍👍👍"}, {"text": "It looks like there should be a wooden sleeve on the pipe from the compression cylinder, and a cover for the igniter basin with an oil wick coming out of the spout."}, {"text": "Hi, it seems like there was a cover on the pilotburner, so it wouldn&#39;t leak while moving the blowtorch, and avoid that wild fire. Great work besides this !"}, {"text": "Love the way you did that leather cup"}, {"text": "I love watching all you videos. 👍👍"}, {"text": "Кран открыть тогда, когда  исчезнет красная пламя, и горит только синим пламенеем!"}, {"text": "I was just a little disappointed that you didn&#39;t shine up the handle but still a great job."}, {"text": "Imagine breaking into this dudes house and he pulls out the antique blowtorch."}, {"text": "Sorprendente soplete de fontanero, portátil...."}, {"text": "Good lord, what do you do with all those metal shavings?"}, {"text": "Круто."}, {"text": "Anybody else’s OCD get bothered when he didn’t touch the main body?"}, {"text": "Tipps aus der Petromax Ecke: das Pumpenleder über Nacht in Motoröl einlegen. Wird schön weich. Danach dick mit technischer Vaseline fetten. <br />Vorheizen mit Spiritus statt Benzin - dann verrußt nichts. <br />Alternativ zum Keksrezept bei Messing geht Zitronensäure in heisses Wasser und dann Ultraschall.<br /><br />Tolle Arbeit!"}, {"text": "isnt there suppose to be a wick in the front aswell? looks wierd when the whole thing is on fire"}, {"text": "Tienes una infinidad de herramientas..."}, {"text": "It’s amazing how much you have improved even since this video! Polishing has gotten so much cleaner! Keep the stuff coming!"}, {"text": "Sehr interessant ihnen zu Zusehen. Woher wissen sie das alles ?"}, {"text": "Good job. Next time use alcohol to heat it up. It will not leave stain on the burner."}, {"text": "Just amazing, from beginning to end! Now I&#39;ve run out of videos... I hope you&#39;ll soon make a new one :)"}, {"text": "It&#39;s amazing to think someone had to actually work with that torch.<br />Technology has grown up  fast."}, {"text": "просто супер"}, {"text": "&quot;I would like a shirt that simply states, &quot;I make a new one&quot;"}, {"text": "The Brass taper nozzle is your best turning to date, as a pro machinist it impressed me."}, {"text": "So many skills.  I&#39;m learning but a long way to go......"}, {"text": "Brilliant great work"}, {"text": "Я дико извиняюсь, но пояльная лампа не так должна работать , сопло не правильно гарит ."}, {"text": "Your channel has taught me one thing: if any of these can be fully restored, maybe restoring my life is no big deal!"}, {"text": "Great video!  And THANKYOU for not ruining it with some stupid music track!   Your work speaks for itself"}, {"text": "How many years of schooling does it take for someone to learn how to work with metal this well?? How many years did you go to school or did you grow up in a shops environment? How do you know what metal you&#39;re working with? How do you know if it&#39;s pure or an alloy, or coated with another metal? How long does it take to become so proficient with the machines?? Could you start your own museum of stuff with everything you&#39;ve repaired / restored?? Would you ever work for the Smithsonian museum or do contracts for them?"}, {"text": "Шик!!!"}, {"text": "A piece of art"}, {"text": "Nice craftmanship"}, {"text": "Watching you make that nozzle was like watching someone whittle down an entire tree to make a single toothpick......there has to be a better way without shaving 5 pounds of metal away to make a 1 pound nozzle, lol."}, {"text": "ich habe nun schon einige Restore-Kanäle hier auf youtube entdeckt, aber das Level an Perfektion und Hingabe, welches DU an den Tag legst, erreicht kein anderer auch nur annähernd! Hut ab vor deinem handwerklichen Können und deinem Auge für&#39;s Detail!"}, {"text": "what happens to those metal shavings?"}, {"text": "Я хочу эту горелку, хотя мне она и не нужна:)"}, {"text": "Wow, you are amazing, what a work of art. Too bad you had to light it, Lol. All your work is perfection!!!!"}, {"text": "why not polished the head part"}, {"text": "goddamn"}, {"text": "... всё сделал отлично,а вот форсунку не отрегулировать!!!"}, {"text": "Making something new is not restoring"}, {"text": "Why did you leave the body looking shitty?"}, {"text": "👍"}, {"text": "Dude, I love your videos. It&#39;s so amazing what you do, especially when you make new bolts and screws and things. But for goodness sake, can you PLEASE wear some gloves when you disassemble stuff and wash stuff? I get so anxious watching those parts, watching you barehandedly handle stuff that could give you tetanus, or damage your skin. @_@"}, {"text": "Very good, very good. But...can you now turn this blowtorch into a lightsaber?"}, {"text": "Hallo<br />Sie sollten ein Museum eröffnen für ihre wundervolle Arbeit!<br />Bildmaterial „vorher“ und dann das Objekt „nachher“ präsentieren. Ich bin total begeistert von ihrer Arbeit."}, {"text": "долго не вьезжал, что это такое, оказывается горелка обыкновенная, но наше советское выглядит круче и без всяких заморочек как тут."}, {"text": "I don&#39;t think you let the blowtorch heat up for long enough, so not all of the fuel had been vaporised before it burned"}, {"text": "NO PROBLEM I will just make a new one! !! !!!"}, {"text": "Eso es lo bonito, que despues de la restauracion lo vualevas quemar jaja, no me decepcionas, siempre me gusta ver su funcionamiento, porque sino lo haces me frustro :3"}, {"text": "A super lesson on how a master machinist can renew the most lost looking tool."}, {"text": "I love polished brass. Sigh....."}, {"text": "Great video but why you didn&#39;t restored better this middle part? Well i know that this will end up in fire but can&#39;t it at least be polished? And if not why? :) greetings from Poland :)"}, {"text": "When the video started I was like &quot;That nozzle piece is going to suck&quot; but he made it look easy. So so nice. P.S. scratching is engraving on a beginner scale. Gaskets can also be made from the original parts by hammer or dip in poster paint method or something that will rub off."}, {"text": "Liked. Commented, subscribed.<br /><br />Now what?"}, {"text": "That pilot light definitely is supposed to have a cover.  It should only have a flame out the spout."}, {"text": "I have never seen that style of blowtorch and would love to find one some day and fix it up. Does anyone know where they can be found?"}, {"text": "These restorations are fucking mind blowing"}, {"text": "These restorations are fucking mid blowing"}, {"text": "I&#39;m not a mechanic.<br />I never thought it would,<br />I never thought I could,<br />but somehow this video made me have some sort of mechanicgasm several times during the process.<br />I just advised my grandfather to subscribe to your channel, as he is a good DIY mechanic himself with a lathe on hand, I think he will like your work as well.<br />Great job as usual, keep it up!"}, {"text": "Considering how many parts were re-made from scratch because they were deteriorated i would call this a re-creation, or re-making instead of restoration, still amazing to see!"}, {"text": "Это, пожалуй, самая убитая вещь, с которой ты работал. По началу прям аж безнадёга берёт, так всё плохо."}, {"text": "You are in the turely different level. Amazing. Spectacular!"}, {"text": "чувак, я понимаю что ты врядли все переведешь. но кожух из латуни это полная шляпа. я работал паяльной лампой когда был ребенком) она выгорит очень быстро.<br />мне очень нравятся твои видосы, я смотрю от новых к старым. очень тщательный подход к деталям. просто поразительный. спасибо тебе."}, {"text": "Nooooo it’s too beautiful to light up! 😂"}, {"text": "Me and the boys are gonna burn some thots with this bad boy."}, {"text": "verry good job"}, {"text": "Used more cork than usual"}, {"text": "oh crap vids are ending. i want more!"}, {"text": "Hiya, I have inherited one of these from new.  It’s never worked nor do I have instructions.  Is it a paraffin blow torch or some other fuel?  I understood that to heat the nozzle the little tray is filled with methylated spirits and set on fire.  When hot, open the valve and allow the pressurised paraffin through.  Is that the correct fuel and procedure?  Many thanks!"}, {"text": "Sublime"}, {"text": "Who else loves that the way you light it.  Is literally just by lighting have of it on fire"}, {"text": "Do you have one camera covering each machine you use? or set up new shots each time you use a machine?"}, {"text": "Bb"}, {"text": "Goodness, watching that torch at the end, thinking, that would not pass workplace safety nowadays."}, {"text": "impressive!!! <br />It would be even more interesting to see how it was done with tools and machines of those old times."}, {"text": "Это как невероятная техническая эротика!!! Просто превосходно!"}, {"text": "Wow great job"}, {"text": "What I like about MM is that he does not use gloves, for the most part, unlike other so called &quot;restorers&quot; that are content with doing a half-assed job. MM does not subscribe to the &quot;no glove, no love&quot; BULLSHIT. He is the real deal."}, {"text": "What is the name of the technique at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=11m32s\">11:32</a><br />I need some kind of conical gasket for a manual water pump, it could be useful if I could make it from scrap leather like that."}, {"text": "Где найти такую горелку? Работа супер.👍"}, {"text": "You are setting it on fire on wrong way. This little nozzle at pre burn reservoir is the one you set on fire. There should be a special tool to set fuel on fire."}, {"text": "awesome!!"}, {"text": "Next project: WW2 Oerlikon 20mm restoration. xD"}, {"text": "Let&#39;s make a new one gang pull up!!"}, {"text": "if I show this to my grandpa he will get WW2 flashbacks"}, {"text": "Não tá traduzindo em português esse vídeo."}, {"text": "Thats really nice ..."}, {"text": "im so blown away that you are able to make pretty much any damn part you seem to need that nozzle or whatever it was that you made a new one of i was so amazed how did you know how to make a new one? when did u leanr how to make stuff like this is it just experience? cause i cant imagine u restored many antique blowtorches so is it just editing that makes it look like you got it right first try or was it really done first try no mistakes?<br /><br />and this may sound stupid but i didnt know people could just make new screws without the help of industrial equipment"}, {"text": "Did you forget to polish the middle part, the part above the nozzle, it just seemed un restored for some reason. Then again, it was about to be burnt black anyway, so it may not have mattered too much."}, {"text": "I wish you could restore me to brand new. Lol"}, {"text": "Out of curiosity, why didn&#39;t you polish the front part of it before reassembly?  Love your work!"}, {"text": "i am fascinated. such a perfect work ! „ LET S MAKE A NEW ONE „ ....."}, {"text": "Золотые руки!!! Снимаю шляпу"}, {"text": "When people comment on something and say that it is “breathtaking”, it’s rarely true.  However, I sit and watch your videos and suddenly I realise that I have been holding my breath while I watch a particular part of the process and I need to breathe: your videos are truly breathtaking!"}, {"text": "You&#39;re a master! My hat is off to you. I stumbled on your videos by accident and just watched them all tonight. I love them all. You should have auctions for your restorations. They are so beautiful and I wish I can buy them all to display even I don&#39;t know how to use a few of them."}, {"text": "une bete !"}, {"text": "Очень трудноёмкая работа была сделана"}, {"text": "Covering itwith flour, viniger and salt... this batter clean it."}, {"text": "I love this piece"}, {"text": "As always beautiful work.<br />But! After restoration burns noticeably worse. Incomplete combustion. Perhaps insufficient air access?"}, {"text": "Конечно все прекрасно, но интересно почему он так любит все позолоченное😁"}, {"text": "that is one safe from the scrapper.<br />thank you.<br />Greetings from the Netherlands,, Kitty."}, {"text": "What happens next with this shavings? :)"}, {"text": "Aside from being terrifying, what use is a flame thrower... Tactically<br /><br />Aside from burning down villages and maybe clearing shrubbery"}, {"text": "what happens to the items once they are restored?"}, {"text": "Witam i pozdrawiam!!Super renowacja palnika!Duża wiedza,dokładność daje dobre efekty,dalej będzie służyć,wygląda jak nowy,precyzja wykonania super,dobry pokaz filmu!!"}, {"text": "I&#39;ve watched a lot of these restoration vids lately, and as near as I can tell, you&#39;re the best. Good job!"}, {"text": "It rocks thank you for your restoration videos!"}, {"text": "its.... awesome. just awesome.  GREAT respect from Russia and from 3 workers of military plant =)"}, {"text": "Back in the day (over 40 years ago), I had a petrol (gasoline) blowtorch. Very clean flame, very hot and - because it didn&#39;t need a pump - it was extremely reliable. If you ever have the chance, it would be a brilliant restoration project."}, {"text": "It looks odd when you light it. Are you sure it doesn&#39;t miss a wick and a lid on that small tray beneath the burner?"}, {"text": "Perfecto es un artista"}, {"text": "How do you know the exact measurements? Like how do you know the circumference of each layer of Circle on a rod or some screw?"}, {"text": "Thats a work of art!! Great restoration!! Great video👍🏻👏🏻"}, {"text": "Wow! 👍👍👏👏"}, {"text": "I wish he would tell us how much time it took to do the full restoration."}, {"text": "Ni el mismo Dios puede hacerlo mejor."}, {"text": "I REALLY need this one...<br />  Excellent ! Was wondering what you were going to make that pip for the nrv out of...😉"}, {"text": "Well saved!"}, {"text": "My final marathon watching all of your video in one day."}, {"text": "Whats the thing called which he make the things shinier?"}, {"text": "My husband is Swiss and we just found your channel.  Curious why you didn&#39;t restore all of the parts? (never mind - just read through the comments)<br />Thoroughly enjoying you Swiss precision! Binge watching. Hopp Schwiiz!"}, {"text": "It’s not “ I make a new one” it’s I will make a new one or I’ll make a new one."}, {"text": "And what was this thing used for? interesting."}, {"text": "Making a new wick......john wick"}, {"text": "This is my favorite, i wanna see you making more brass replacement parts, thats cool as hell"}, {"text": "I loved the video. I appreciate the attention to detail (polishing even the bolt heads). I watched during disassembly and when I saw the leather cup washer, I said he can find one of them at an old hardware store that still has old faucet parts, but he&#39;s going to spend a lot of time finding one. Then, to my delighted surprise, you showed how to make one.<br />Continue these great videos of the lost arts. It&#39;s wonderful to see old tools repaired instead of tossing for new cheaper versions"}, {"text": "My favourite part of these is the machining of new parts. It&#39;s so satisfying."}, {"text": "Dude, you are a freakin&#39; wizard."}, {"text": "Why some parts didn&#39;t get polish or shining?"}, {"text": "I&#39;ve never even seen one of these. Totally amazing how &quot;pretty&quot; it looks after restoration. Good work."}, {"text": "Hi there, I haven&#39;t come across this in any of your videos yet, but I was wondering how you would recreate a crosshead or torx bolt. Are these types of bolt cast or is there a way to recreate them with a lathe or other methods?"}, {"text": "Can someone explain to me the parts making machine. Sorry, I’ve very ignorant of tools/handy stuff. So, is it a computer based automatic process, or is that all done by hand/eye? I’d love to get into stuff like this."}, {"text": "What the hell machine is that which helps you make your own bolts and parts? Watching you do that is one of the most impressive things I’ve ever seen!!"}, {"text": "I swear I can&#39;t help to think these videos are analogous to your own self improvement. How you need to break things down to easier to manage approachable situations. As a whole it looks impossible but it&#39;s really not, if you fix the components."}, {"text": "Just plain awesome!"}, {"text": "You have legendary status in my eyes I’m currently explaining to my wife that I need a sand blaster and a lathe"}, {"text": "This guy is a GOD with that metal lathe..."}, {"text": "Wow 😮 just wow😲!👍🏻"}, {"text": "Another fantastic restoration. Almost all of your restorations turns out pieces probably better than when they left the factory. It looks an incredibly dangerous piece of kit, with all those flames licking around the tray. Are you sure that’s supposed to happen? It just doesn’t look or feel right somehow!"}, {"text": "Certo che hai una bella voglia, un lavoro &quot;di fino&quot;. Complimenti..."}, {"text": "Your job is amazing! One tip: every time you write I is this way &quot;I&quot; and not &quot;i&quot;. On your description box.  I&#39;m also learning english and my teacher told me this. Kisses from Brazil!"}, {"text": "I love watching these restorations, but have one complaint.  As a teacher of machinists, I cringe when i see people file or polish on a lathe in the manner shown here - and elsewhere.  These operations are ALWAYS done left handed.  Never reach over the chuck to file or polish.  I&#39;ve heard far too many horror stories of guys getting wrapped up in the chuck.  Any before someone says, &quot;oh it&#39;s ok he has abre arms&quot;, that simply is not a good answer.  Other than that, I can&#39;t wait for the next one!  Keep up the good work."}, {"text": "This was so awesome."}, {"text": "You make me want to be a better person."}, {"text": "Do you make a new gasket punch for each size you need or do you just have an assortment laying around?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m44s\">5:44</a> min yikes, are you hurt?"}, {"text": "Watching this and remembering &quot;Oh! I&#39;ve got an antique torch from my grandfather that needs restoring!&quot;, then realizing &quot;Oh, I don&#39;t have the resources and skills this guy has to complete the job properly....&quot;."}, {"text": "I don&#39;t know why, I&#39;m not an engineer, but I find these videos compelling viewing."}, {"text": "where does one learn how to do this? Tech school?"}, {"text": "18 минут как завороженный😲"}, {"text": "with how beautiful you make all your stuff, it&#39;s surprising to see a dirty workshop ;)"}, {"text": "amazing as always. why is it that you didn&#39;t do anything to that pipe piece besides remove the soot and patina"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=2m58s\">2:58</a>"}, {"text": "Thank you for setting it on fire even though you did all the hard work to make it look great. It was worth it."}, {"text": "Is a amazing restoration"}, {"text": "انت أستاذ كبير"}, {"text": "This is just his name of restoration art .."}, {"text": "&quot;Let&#39;s make a new one...&quot; as in: &quot;Let&#39;s continue&quot;..."}, {"text": "Never watched an full restauration Video twice. Well, there is a first time for everything."}, {"text": "I&#39;m assuming &quot;Record&quot; means it&#39;s been patented....am I correct in that assumption?"}, {"text": "Waiting for a video where the whole thing is too bad, so after video of the original, you just say, &quot;Let&#39;s make a new one&quot; and it&#39;s a completely new build."}, {"text": "mi abuelo tenia, uno de esos un anda y el otro no"}, {"text": "Whatever hahahahaha"}, {"text": "Amazing restoration"}, {"text": "Simply incredible and beautiful yet again. For the record, your English is better than the English of most Americans. I know you replied to this question, per your comment to another fan, but for the life of me I can not find the answer....why did you not polish up the body of the torch? Français Suisse oder Deutsch Schweizer? Ma famille, du côté de ma mère, habitent à Arles."}, {"text": "That last 30 seconds of this restored blowtorch spluttering over the echo of those bells makes me so glad to be alive in this day and age I can witness such a juxtaposition thanks to the power of the internet and your hard work."}, {"text": "Me encantaría saber sobre el mecanismo de esta maquina? por cierto, excelente restauración, me inspira a realizar cosas así en mi casa!"}, {"text": "Incredible restoration! In particular, custom fabricating the nozzle and every indent and angle on it. Unbelievable!! <br /><br />I’m a diy Guy ..... but holy smoke, your skill is off the charts."}, {"text": "Wooo difficult to assembly . congrats !! Great man"}, {"text": "Next time you fire it up, use the front  spout in the cup for a wick.. That&#39;s it&#39;s purpose.."}, {"text": "Simply wooooowww"}, {"text": "Well presented."}, {"text": "So he can&#39;t engrave."}, {"text": "Are u German or European by any chance?"}, {"text": "Incredible!"}, {"text": "Great Job . Thanks"}, {"text": "Salut, travail magnifique, le soucis du détail, c&#39;est du grand art. Bravo...<br />Quel type de disque à polir tu utilises sur ton touret? Merci"}, {"text": "Damn! Amazing work, sir. Hats off to you."}, {"text": "These vids usually require skipping to the end to see final product.  Your superpowers make it necessary to watch every second. You’re incredible."}, {"text": "What sorcery is this"}, {"text": "found this Gentleman&#39;s channel an all I&#39;ve been able to do sides sub is keep clicking like to all his vids...."}, {"text": "Nice"}, {"text": "Can you use that to melt cheese?"}, {"text": "koenigsegg&#39;s brother"}, {"text": "The noise at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=1m20s\">1:20</a> just had me XD"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=9m17s\">9:17</a> Ah i see youre a man of culture as well using Victorinox :)"}, {"text": "&quot;too much damage to restore, I make a new one&quot;<br /><br />Of course. Easy peasy. WHAT AM I DOING WITH MY LIFE?!"}, {"text": "Toolmakers created the world. Tell that to an engineer."}, {"text": "I just spent an hour watching your videos. It&#39;s so relaxing! I have one question. When you make new bolts and stuff what happens to the waste metal? Can that be recycled? For example, when you made a the new front end out of a cylinder a lot of material was cut away."}, {"text": "This wasnt worth the restoration"}, {"text": "restore<br />set on fire<br />restore"}, {"text": "Lit vid, bro."}, {"text": "а иди ты в жопу -- просто акуенно"}, {"text": "BEAUTIFULLY DONE!"}, {"text": "Nothing like you anywhere. Great video."}, {"text": "You did the perfect level of restoration. The cast part sets of the polished part with brilliancy. Keeping the original surface is nothing short of genius! You are a master at restorations."}, {"text": "Ээ, че за халтура, почему не все отреставрировал????"}, {"text": "i cannot believe he pulled off creating the blowtorch ending, like i was literally astonished"}, {"text": "Fiddly bits made me anxious. Magical to watch. Kudos"}, {"text": "جميل جدا اين تضع هذه الأ شياء اللتي تصلحها"}, {"text": "* Audible metal screeches *"}, {"text": "My life isn&#39;t doing too well.. lets make a new one!"}, {"text": "Dude this youtube channel has 100% legit and pure satisfaction in his videos..."}, {"text": "The ignition bucket underneath needs a lid and wick, my grandpa had one of these in great condition. Good work on this piece, i like the contrast with the one old piece."}, {"text": "Супер!"}, {"text": "It&#39;s quite therapeutic to watch your restorations man. Thanks for everything you do!"}, {"text": "Mini flame thrower lol"}, {"text": "I go to college in Oerlikon"}, {"text": "From where you geht these old stuff ?"}, {"text": "Great work! I always love the copper parts."}, {"text": "I love the immense amount of detail that you put into everything. I know it&#39;s a &quot;perfect restoration&quot; but man. I think this is beyond perfect. Better than perfect."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m17s\">4:17</a> what this?"}, {"text": "I love that you lay out the item in an exploded view..."}, {"text": "I need a lathe now"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=13m33s\">13:33</a> <br />for your sake, don&#39;t kill his dog dude.."}, {"text": "Are you sure the tip wasn&#39;t steel?"}, {"text": "I have watched all of your videos and am anxiously and impatiently waiting for the next new one. The waiting is the hardest part. I am going to have to buy a lathe and learn to machine parts, in order to entertain myself until your next video is released."}, {"text": "Antiquairs really hate your videos m8."}, {"text": "nice work! A Moment in the test it sounds a little bit like a pulse-engine from WWII-V1 :)"}, {"text": "Вподобайка"}, {"text": "You put the other restorers to shame man. i really like the way you go about you work. Very professional"}, {"text": "It looks like it uses a wick in the bottom"}, {"text": "It looks good! i personally would have restored the whole piece"}, {"text": "amazing relaxing views video..........thank you for your content makes been in bed of work with a bad back a little less awful."}, {"text": "I&#39;m just curious why you didn&#39;t polish the cast portion of the torch."}, {"text": "Der Meister höchst persönlich. Wie immer, excellent."}, {"text": "@<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=6m47s\">6:47</a> that was a lot of material..."}, {"text": "I am a fan of your works!..."}, {"text": "Просто АХУИТЕЛЬНО!"}, {"text": "Very nice thanks fro showing us this, all the best!"}, {"text": "All the metal shavings from your lathe, do you recycle them or melt them down?"}, {"text": "P. E. R. F. E. C. T."}, {"text": "Most intimidating lighter ever made"}, {"text": "Superbe... encore. 👍"}, {"text": "I think you forgot something!!!! Polishing the torch body!!!! Great job &lt;3"}, {"text": "Just sat threw a 5 min Golf commercial never played golf in my life lol"}, {"text": "Looks like a torture machine XD"}, {"text": "yes"}, {"text": "I adore your work. It&#39;s dedicated, it&#39;s detailed. You try to keep it original as possible. Love it all shiny. But one part i also adore is the fact that you don&#39;t restore just for display. You restore also to keep it working. And you test it in the end. I adore. It doesn&#39;t make it look just like a piece to be displayed in a museum and never used again, but something that works and can be used just like it has been years ago :). Keep up the good work. Like your videos. Already subscribed your channel. It&#39;s interesting and oddly satisfying  and relaxing to watch :)"}, {"text": "Old world craftsmanship new world craftsman. Thank you for sharing."}, {"text": "nobody: &quot;But the nozzle cone is too damaged to be restored !&quot;<br />my mechanics: &quot;Hold my beer&quot;<br />Makes a new one."}, {"text": "Love all your videos!! I have a question. To <b>make it black</b> can i use motor oil or does it have to be vegetable oil??thanks!!"}, {"text": "you are a true artist &lt;3<br />respect from egypt &lt;3"}, {"text": "👍🏼😍👍🏼"}, {"text": "That was beautiful. Thank you."}, {"text": "I want to do stuff like this"}, {"text": "How come you didn&#39;t polish those two parts you didn&#39;t polish?"}, {"text": "Should there be a cover for the &quot;pilot light&quot; bit? Just looks kind of weird being open like that and the spout seems a bit pointless."}, {"text": "You got skills, love your videos"}, {"text": "Super!"}, {"text": "The fact you made a new nozzle(?) not sure what it&#39;s called. Beautiful!"}, {"text": "I was watching the disassembly all excited seeing the bolts because I knew “let’s make a new one” was coming"}, {"text": "a real masterpiece! i love it! &lt;3"}, {"text": "Are you making money by doing this?"}, {"text": "I broke my arm<br /><br /><br /><br /><br /><b>Lets make a new one!</b>"}, {"text": "&quot;im gonna make a new one&#39;&#39; you sir are crafty"}, {"text": "so is it for just heating things?  I mean, the flame gets blue, but I imagine it can&#39;t cut, right?"}, {"text": "This guy can make anything he bloody well feels like,, literally!!"}, {"text": "👍🏽"}, {"text": "lit"}, {"text": "👍🏻"}, {"text": "You make me nervous using the sanding belts so near your fingers without gloves!"}, {"text": "Is it just me or you&#39;re wasting A LOT of materials on the lathe? I know it&#39;s a wasteful process in itself but at times you start with material that&#39;s clearly way too overside for the finished part."}, {"text": "“Let’s make a new one “ you’re awesome dude"}, {"text": "Genius! Your videos are asmr, I get so entranced by watching your restorations."}, {"text": "Excellent as ever. it is too beautiful to set on fire. however, you did it anyway painful Lol. best restoration vids I have seen. you are the master"}, {"text": "&quot;Setting it on fire to dry&quot;  I see I&#39;ve been doing things wrong my entire life."}, {"text": "That new handle at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=10m40s\">10:40</a> - <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=11m15s\">11:15</a> is amazing!  The curves 😍"}, {"text": "Loved the ending."}, {"text": "I hope he will invest in a pantograph engraver in the future."}, {"text": "Getting rid of scratches WITH scratches"}, {"text": "im very jealous of your skills, do you ever start something and just say &#39;no, i cant do anything with that&#39;"}, {"text": "<i>it&#39;s too beautiful to set it on fire again</i><br /><b>put dislike</b><br /><i>whatever</i><br /><b>put like</b>"}, {"text": "This video&#39;s help me sleep, I don&#39;t know why, but your video is the only one on YouTube that helps me sleep, very good asmr video."}, {"text": "You are so talented. I admire how well you put it all back together!"}, {"text": "How old is the blowtorch.?"}, {"text": "John <b>Wick</b>"}, {"text": "When was it originally made"}, {"text": "Очень круто! Отдыхаю когда смотрю!"}, {"text": "Amazing work!"}, {"text": "This guy has got to be one of the most talented people I’ve ever seen on YouTube. So glad I found this. Subscribed"}, {"text": "I’ve got a soldering iron very similar to this, I think I’ll have to watch this more than a few times before I try and tackle it"}, {"text": "What kind of monster downvotes or dislikes this video?"}, {"text": "heinz <br /><br /><br /><br /><br /><br /><br />get the flammenwerfer"}, {"text": "For his million subscribers I hope he does a million subscriber special, fixing a old car. It would be a live stream of the entire process."}, {"text": "Gosu;;;;"}, {"text": "Wonderful. Does anyone else think it looks like a steampunk Vickers gun though?"}, {"text": "I wonder, what happens to all those metal shavings?"}, {"text": "Awesome."}, {"text": "Grüße, warum benutzt du kein Abstechmesser? <br />Deine Videos sind einfach Relax 😎"}, {"text": ".... And my new favorite phrase is: &quot;Let&#39;s make a new one&quot;."}, {"text": "В конце горит как и до рестоврации, или непрогрелась?"}, {"text": "try acid etching instead of engraving"}, {"text": "HAAAAAAAAAAAAAAAAAAAAAAAAAAANS!!!"}, {"text": "does the patina removal mixture have to sit 7 days ?"}, {"text": "Is this how Norte Dame burned down?"}, {"text": "for future refrence, please try to avoid getting black gunk from anything that used to light on fire on your hands, its usually filled to the brim with carcinogens"}, {"text": "shouldnt the pilot thingy , have like  acover, because what is the point of the little funnel? thingy?"}, {"text": "Outstanding."}, {"text": "Genius"}, {"text": "@my machanics the little pan that you set on fire is supposed to have a lid on it with a wick in it, so you could keep a small flame there to relight the torch after extinguishing it. Beautiful Restoration btw/ love this video."}, {"text": "I love the way you look at each piece with such curiosity."}, {"text": "Beautiful amazing"}, {"text": "This guys needs a grammy"}, {"text": "looks perfect!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m43s\">5:43</a> - OUCH! (&gt;.&lt;)"}, {"text": "Wow"}, {"text": "I have only two things to say...<br />Amazing work as always.<br />And...<br />Thank God for Bernzomatic. That may be the most complicated torch design in the world. I mean you practically need a degree to operate it. If Id found that laying around before this vid I’d have no clue how to use it, and this is from a former mechanic, restorer, model builder, and fabricator."}, {"text": "Blowtorch? That&#39;s a great fucking flamethrower from Battlefield 1<br /><br />Great video, i love this! ❤"}, {"text": "Man with all due respect, you’re a fucking genius !!"}, {"text": "I think fuel tray at the bottom is to hold a wick and a slow burning pilot flame."}, {"text": "Beautiful restoration, but does anyone else feel as I do that the original design of this thing looks incredibly sketchy."}, {"text": "Szczela?"}, {"text": "The threading of a new screw is as miraculous to me as the birth of a baby :p"}, {"text": "I would also like to work with you"}, {"text": "What year is it from?"}, {"text": "Judging by your hands, you are young. What a blessing to be a Master at that age!"}, {"text": "&quot;Never cross the streams&quot;"}, {"text": "Antique not a flamethrower"}, {"text": "Welcher arme Tropf durfte denn hinterher die miesen Messingspäne von der Drehbank putzen? 😂<br />Aber viel mehr interessiert mich die Polierpaste; 400er Endschliff und dann Spiegelglanz egal welches Material? Wird in mehreren Durchgängen mit feiner werdender Paste poliert und dann materialabhängig verschiedene benutzt oder alles eins? :)"}, {"text": "Nobody: <br />My mechanics: let&#39;s make a new one"}, {"text": "Hans, get ze Flammenwerfer"}, {"text": "Оооо этот голос в конце, такой родной)"}, {"text": "Switzerland is synonymous with skill and precision ...now we get to see it live!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m55s\">4:55</a><br />RIP headphone users"}, {"text": "That is a lot of &#39;gebrochen&#39; to deal with!  ....I&#39;m looking forward to this :-)"}, {"text": "It works not very well. My is better"}, {"text": "@my mechanics I’m a big fan. How do you keep your hands and nails so clean when you work with so many solvents and particles? Keep up the great work!!"}, {"text": "We should make sticker that says `` I make new one.`` :D"}, {"text": "Ready for some Bioshock cosplay"}, {"text": "I could spend my entire day watching this <b>-</b>"}, {"text": "I think there&#39;s suppose to be a wick in the bottom tray part. Could be wrong though."}, {"text": "You made a new this <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m41s\">5:41</a><br />But fixed this <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=9m22s\">9:22</a><br />WHAT!?"}, {"text": "HERO"}, {"text": "Elon would be proud."}, {"text": "Queria vee-lo restaurando uma arma de fogo antiga."}, {"text": "Já vou dando like antes de assistir 😉"}, {"text": "Very good work and nice result 🧐"}, {"text": "What about the centre part where everything attaches? How can you leave it like that?"}, {"text": "It looks to me like the tray at the bottom is supposed to hold a wick"}, {"text": "very beautiful"}, {"text": "I&#39;m pretty sure there is a cover missing on that preheater container. It has a nozzle pointing at the front end but it burns everywhere. That&#39;s why the bakelite knob was burned so ugly. I think it should not heat the center section so much."}, {"text": "Where do you get all those old things? At a scrapyard? Or do people bring them to you for restoration and you make good use of the situation and show us how to restore them?"}, {"text": "That thing looks terrifying in action.."}, {"text": "I have one of these, now I now what to do with it. thanks."}, {"text": "Once again ,good job."}, {"text": "Nice job!!"}, {"text": "I think the firepan needs a lid so the flame only comes out of the forward tube,also with a wick."}, {"text": "Just found your channel.. there goes SEVERAL hours of my day. Thanks!"}, {"text": "You do amazing work!  I love your videos!"}, {"text": "I love your videos, How you learn these thing, I wish i could work with you"}, {"text": "Antique peoples already prepare for zombies apocalypse"}, {"text": "Quick question how many days did it really take to finish this torch?"}, {"text": "You are a genius when it comes to restoration luv your videos! #1 💯"}, {"text": "if i ever find another 88 toyota Cressida i would want you to restore it. lol Great restoration as always. you bring back that old school bling to everyday things. keep it up."}, {"text": "Hans, get the flamethrower. one minute my Captain, this guy is polishing it."}, {"text": "You waited basically 8+ days to make this vid that&#39;s dedication good job love your vids"}, {"text": "I consistently love that at the end of every video you actually use the things you&#39;ve restored. It&#39;s my favorite part"}, {"text": "Dude&#39;s so talented he could probably restore my life"}, {"text": "Seems like the description always has an apology, don&#39;t sweat it we love you and your videos!"}, {"text": "You really should heat the metal before bending it back, the metal has memory."}, {"text": "there was way more individual parts then I expected. Pretty cool it still worked tho, they dont make things that last like that  anymore"}, {"text": "These videos are so satisfying to watch!  Siigh!"}, {"text": "I can definitely use this for killing off roaches."}, {"text": "Beautiful 10000000"}, {"text": "&quot;I make new one&quot;"}, {"text": "Äääää"}, {"text": "ALWAYS PUT  LIKE TO THE VIDEOS"}, {"text": "Hey man, do you ever freak yourself out over how good you are?"}, {"text": "splendid"}, {"text": "I&#39;m so surprised at the little details that go into making the item or taking them apart. And also the restriction of them"}, {"text": "&quot;I can&#39;t engrave&quot;<br />Finally, something you can&#39;t do."}, {"text": "Have you ever tasted the mixture to remove the petina?"}, {"text": "iv been trying to figure what kind of tip does a victor 1125 take and how old it is"}, {"text": "MM - your film-making skills are on par with your machining skills! This is my new favorite YouTube channel. Thx for the awesome work all around."}, {"text": "Your most beautiful restoration yet."}, {"text": "you should do a restore on something where you make as many of the parts yourself as you can, sort of to show off your skills, but also to have the best restore you can"}, {"text": "Ахуенно!"}, {"text": "красавчик! ты токарь фрезеровщик от Бога! дай бог  тебе здоровья!!!"}, {"text": "Серьёзно, он паранит на станке сверлит?"}, {"text": "Magic hands...."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m55s\">4:55</a>"}, {"text": "Geniale Arbeit wunderschönes endergebnis ist das dein eigener Maschinenpark ? Du bist auf jeden Fall sehr sehr erfahren mit konventionellen Dreh und Fräsmaschinen machst du das beruflich? Danke für die tollen viedeos und dem guten lehrmaterial weiter so"}, {"text": "You are impossible!"}, {"text": "Super"}, {"text": "what year is it from?"}, {"text": "My first reaction .. at 29 seconds is that would work great for a Star Wars prop as a weapon"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m58s\">5:58</a> drill bit is coming up a bit when you press on it while drilling the center. is that normal/okay?"}, {"text": "At the very least you&#39;ll be ready for the zombie apocalypse with that thing!"}, {"text": "making a new wick!?!? thats wicked! hehe no but in all seriusness as a man who loves to tinker and restore stuff whatever it may be i find these videos sates a sertan thirst i did not know i had befor. i truly love your work and i cant wait untill the next video"}, {"text": "Какая модель токарного станка? Я так и не увидел."}, {"text": "I think there should be a short wick in the ignition bowl. It would make more sense to ignite the wick not an entire bowl of fuel."}, {"text": "Wow this one is better than the Boring Company&#39;s flamethrower."}, {"text": "It worked very  well!"}, {"text": "YOU ARE A VERY GOOD CRAFTSMAN!!! AFTER 4-6 VIDEOS I AM POSITIVE. I&#39;LL KEEP WATCHING. THANK YOU FOR VIDEOS WHICH YOU DO WELL!"}, {"text": "Polishes brass, then proceeds to get fingerprints all over it."}, {"text": "Awesome!"}, {"text": "Nice..👍👍👍👍"}, {"text": "Love your work."}, {"text": "@<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=1m30s\">1:30</a> what multitool is that?"}, {"text": "Dragon restoration  :)"}, {"text": "incredible job!!!!"}, {"text": "What year was this torch made?"}, {"text": "Nicely Done."}, {"text": "Whatever..."}, {"text": "Genius"}, {"text": "un chef d&#39;oeuvre"}, {"text": "Indonesia mana suaranya"}, {"text": "задрот"}, {"text": "This is true craftsmanship"}, {"text": "lovely job on the brass turning, i have rejuvenated several blow lamps, but my lathe is ancient, and my turning skills nonexistent ."}, {"text": "Flammenwerfer 35 - pocket edition"}, {"text": "Very nice, it reminds me of a machine gun."}, {"text": "Cool device! Great clean up and restoration."}, {"text": "I like Oerlikon i live near there❤️😂"}, {"text": "Ruined!"}, {"text": "OMG I loved that thing working it was like a jet engine."}, {"text": "haha yessss burn it!!! another great &amp; cool video."}, {"text": "God your videos are addicting. More please"}, {"text": "It&#39;s amazing, so perfect 😍 can you show/explain how you measure and set everything when you make a new piece? It look pretty difficult and elaborate precisely 😱<br />My regards from Brazil 🙌"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=7m10s\">7:10</a> sounds like a heckin&#39; jackhammer."}, {"text": "I love how thorough you are in this videos. It&#39;s really relaxing to watch."}, {"text": "just me or are these videos satisfying to watch?"}, {"text": "Excellent work, as always."}, {"text": "Your milling of that new blow torch end/tip was amazing. As was this whole restoration."}, {"text": "What is this made for?"}, {"text": "That’s what I like about you. When something is just so far beyond repair you take a heavy dose of fuckitall and just make a new one"}, {"text": "What is your background? Mechanic, engineer,  metal worker..?? Incredible restorations!"}, {"text": "Awesome Creation!!!!Awesome Video!!!!"}, {"text": "I CANNOT watch any other restore videos or restore channels except for yours... they seem so rushed and sloppy compared to you!! You are a true craftsman."}, {"text": "Grandmaster!"}, {"text": "Very good on the leather pump gasket. I was wondering how to make one."}, {"text": "This is like a machinist asmr"}, {"text": "If you don’t have something, just make it"}, {"text": "Only one word to describe u... &#39;subscribing&#39;"}, {"text": "I want one, it looks intimidating when lit."}, {"text": "looks like a miniature flamethrower"}, {"text": "18MINS OF NOTHING BUT THE SOUNDS OF BUFFING WHEELS AND OTHER MACHINES"}, {"text": "Amazing !!!"}, {"text": "Just curious, why do you use a hacksaw instead of a parting tool on the lathe?"}, {"text": "like"}, {"text": "In difference,its a best restoration.<br />But not understand how support the air pressure,explaining please :)"}, {"text": "What do you think, Elon Musk?"}, {"text": "Even though one part of it is unfixable he did not bought a new one but MADE a new one 😎"}, {"text": "Почему ты не используешь отрезные резцы?"}, {"text": "That&#39;s some fantastic lathe work their!"}, {"text": "Awesome job bro"}, {"text": "I know that a lot of things you&#39;re doing make these parts &quot;less desirable&quot; for collectors i.e. removing patena, new parts etc. I&#39;m a quality assurance tech that deals mostly in the automotive industry. My job is to make sure parts are perfect (or pretty close to perfect. You&#39;d be surprised what the auto industry lets slide) so to me, the work you&#39;re doing is pure artistry. After taking a magnifying glass to shoddy workmanship and slapped together mass-produced parts all day, seeing your restorations actually make me tear up."}, {"text": "Looks like a mini gun"}, {"text": "Perfect 👌. Thank you"}, {"text": "Amazing video . Great job :-)"}, {"text": "i rlly want you to wear gloves more when u make these videos bc i care about your safety and all of this stuff and the beginning is gross but you don&#39;t have to ily bye."}, {"text": "I cannot get enough of these videos. They are masterful."}, {"text": "What&#39;s the screw up at the top for? I can&#39;t really see any use for it."}, {"text": "Я не знаю зачем мне паяльная лампа, но я ее хочу купить))) работа супер"}, {"text": "that just blew me away"}, {"text": "Are the old unusable parts able to be re melted or recycled in some way? Just curious"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=12m37s\">12:37</a> - <b>Finishing by hand</b><br />“Who am I kidding”<br /><a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=12m40s\">12:40</a> - <b>Onto the brush wheel!</b>"}, {"text": "I love the way you work."}, {"text": "That part you did not shine is an eyesore"}, {"text": "You spent all that time making the torch beautiful by polishing and fabricating.and left half of the torch untouched? Quite disappointed that it looks half finished"}, {"text": "Looking at the thumbnail, I thought this was a steampunk bong"}, {"text": "Wow.. love your work, thank u for setting it on fire at the end, i needed that hahaha"}, {"text": "I could have made it nice and shiny but I’m pretty sure it would have blown my face off when a lit it again. Just sayin."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m49s\">5:49</a> what type of metal is that? It kinda looks like gold"}, {"text": "Ugly design but good restoration."}, {"text": "thanks for the video!<br />What year is this equipment?"}, {"text": "I love your videos, you are very skilled in many trades!  Do you sell the pieces you restore or do you keep them?  What is your profession?  Thanks for the excellent videos!"}, {"text": "So is there like a place to learn how to do this, or does he make it up as he goes?"}, {"text": "You are a new kind of human alien. OMG! ♥"}, {"text": "Show me the shiny! Great video as ever 😊"}, {"text": "very talented"}, {"text": "+my mechanics  Love your style...your videos are so therapeutic.  I love your lathe skills.  Nice work."}, {"text": "Warum hast du das leder vorher in Benzin getaucht und abbrennen lassen? hätte man es nicht auch direkt in Form pressen und abschneiden können?"}, {"text": "restoration is best no doubt but if u will use the the restored material and show us after using it then no doubt I will like subscribe and share it :)"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=13m45s\">13:45</a><br />asbestos<br />rip."}, {"text": "Franchement ça fait un moment que je regarde tes vidéos c’est impressionnant. Vraiment respect!"}, {"text": "Wow again"}, {"text": "これなんだ？しかし仕事が丁寧でいいな"}, {"text": "That thing is mental! much cooler than modern propane torches. Wish I had one."}, {"text": "Awesome"}, {"text": "You might of answered this before, but how do go about finding your projects??"}, {"text": "my mechanics, Words.... I know a lot of words but there are not enough to adequately describe what you do time and time again with the items you choose to, re make/engineer/design and redefine with that 7 lbs of gray matter inside your skull. I am truly a fan of watching you exemplify genius in the form of an old tool. Thank you again for existing in the world at the same time as me."}, {"text": "&quot;i make a new one&quot; ledgend...."}, {"text": "Well fuck me sideways!....never thought the gnurled grips on brass were done with a wheel..."}, {"text": "Elon musk can eat a dick! Nice work and test!"}, {"text": "People that just “make bolts” are the true definition of a mother fucking badass.  End of story."}, {"text": "I have fallen in love with your videos and other channels as well.  Can anyone out there recommend a good starter project for someone that’s new with limited tools and an apt as far as a shop space goes.  Thanks in advance"}, {"text": "it looks like to do justice to this hobby, one needs a machine lathe and a milling machine. And a sandblasting booth. And a welder. And the skills of a machinist. And advanced software and printing machines. The most outrageous thing I saw you do was make a new printed dial for the inflator. I didn&#39;t even think that was possible. <br /><br /><br />The bench grinder with buffing wheel is only the beginning."}, {"text": "Thing looks like a Vickers machine gun. 😂"}, {"text": "Euhh<br />&quot;Restoring&quot;<br />More like building a brand new one lol"}, {"text": "Просто замечательная работа! Такой вещью, теперь, даже пользоваться жалко, только на полку, за стекло."}, {"text": "I feel you were just flexing you lathe skills when you made that end handle, rightfully so i must admit."}, {"text": "Might have been able to restore the flame shroud with a bit of brazing. Brass is easy enough to braze with a torch."}, {"text": "Another fantastic restoration! Good stuff..."}, {"text": "I wish I could like these more than once.  These are so satisfying to watch.  Thank you for your work on these videos, and your attention to detail is a balm to those of us who are ADD lol.  Thank you."}, {"text": "RIP Headphone Users at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m55s\">4:55</a>"}, {"text": "Hi.. I think you should use more light for shoot. Use led light for shooting."}, {"text": "You have perfectly restored it and made it look like a steampunk flamethrower. Incredible job, dude!"}, {"text": "Nur eins kann ich an diesem Video kritisieren.  Es verdient mehr Views!"}, {"text": "wow thats beautiful."}, {"text": "Fantastiskt arbete! En fröjd för ögat att se ett sådant hantverk. Här har du direkt värvat en prenumerant. Lycka till med YouTube-kanalen i framtiden!"}, {"text": "I don&#39;t know what reason a person would have to actually dislike this video."}, {"text": "ich glaub wir sprechen beide die selbe Sprache :o"}, {"text": "Oerlikon? They made a lot of really big machine cannons in WW2."}, {"text": "Wow, that one has seen an awful lot of use and maybe some abuse. People collect the old Lenk and other petrol (gasoline) blow torches here in the USA. The have a nasty habit of spitting gasoline out the pump shaft and onto the user, sometimes causing the user to catch on fire. . I am going to have to try the vinnegar flour &amp; salt thing! Buy a set of 6 basic gravers and a sharpening stone. Engraving is not that hard, and you will just be chasing over old stampings anyway. That is pretty easy.  Keep an eye out for a used set of 6 or more. I paid $20 for my gravers. US dollars and at that  time the Pound Sterling was worth a lot more."}, {"text": "Wie gerne würde ich mir auch so einen Workshop zulegen:)"}, {"text": "What fuel it consumes? Lamp oil or gasoline?"}, {"text": "This video must be the result of days worth of work.<br />Really nice job"}, {"text": "Красота золотые руки👍👍👍"}, {"text": "Job. Well. Done. <br /><br />Amazing restoration and recreation. Incredible."}, {"text": "I gotta say what an unbelievable job you do. Who would have  thought I could  enjoy watching you restore a piece  of metal  equipment!   Lots of fun and educational  too! Thanks for sharing."}, {"text": "what would that torch be used for? soldering copper? roofing?"}, {"text": "This was incredible. Holy shit."}, {"text": "this channel is the first channel ever where i&#39;ve never, ever, skipped a single bit of a video. the visuals, the annotations, the editing and the noise is perfect. then there&#39;s the actual restoration itself. per-fec-tion"}, {"text": "I love that you make new parts when needed. Nice touch!"}, {"text": "since the brits call a flashlight a &#39;torch&#39; ...would they in turn call this a flashlight ?"}, {"text": "Holly hell you mad lad actually lit that thing on fire before fixing it. You are one brave soul great work as always looks amazing"}, {"text": "You go big,you don&#39;t go home.<br />I love how you don&#39;t half ass anything. You Sir are a true craftsman. Excellent Job."}, {"text": "You make it look so easy. (The editing must hide hours of hard work.)"}, {"text": "Why didnt you clean off the one part towards the front?"}, {"text": "One word mate. GENIUS"}, {"text": "I don&#39;t believe you when you say &quot;I can&#39;t engrave&quot;. But I would also not believe you if you said that you couldn&#39;t do anything."}, {"text": "You, Sir, are the epitome of &quot;Job well done&quot;."}, {"text": "TOM PIPPS . FOAM - BATON ROUGE LOUISIANA USA . HI HELLO . I LINK YOU WORK ."}, {"text": "Would the salt, vinegar and flour mixture work on old rusted steel?"}, {"text": "That was a terrible “restoration“"}, {"text": "WOW!! That’s so awesome."}, {"text": "Boss"}, {"text": "I love your videos and i subscribe your channel. greetings from winter wonderland finland."}, {"text": "How do you even know how to do this stuff? I think I&#39;d lose a limb if I  breathed near any of your industrial equipment lol I have no idea how you&#39;re so skilled but damn do I respect and admire said skill level ✌"}, {"text": "I&#39;ll give you £20 For that lighter 😀"}, {"text": "Dammit...it&#39;s my bed time. Your ass hooked me on the (first seen) oil can resto, and this was next up."}, {"text": "This guy is so freaking good"}, {"text": "One day I want to work on a project that requires me to set something on fire in order dry it."}, {"text": "What initially got you into restoration? Are you an engineer or mechanic in your day job? Or just someone who’s good with tools and passionate about antiques?"}, {"text": "Cleaned up I think it almost looked like a mini maxim gun."}, {"text": "Look great !"}, {"text": "der flammenwerfer"}, {"text": "Me: Skins knee.<br />Him: Lets make a new one."}, {"text": "Hermoso !"}, {"text": "I have a question about the vinegar, flour and salt mixture. You seem to wrap it up pretty tightly in that cling wrap. Is that because you want an oxygen free environment for it to work, or is it just because you don’t want it to squelch out everywhere and make a mess?"}, {"text": "Impecable saludos cordiales de Uruguay"}, {"text": "do you have a job that you use the lathe etc for or is it all for restorations. looks some quality kit"}, {"text": "good remake"}, {"text": "Flamethrower a-la steampunk"}, {"text": "I subbed and watched every vid. Please more restorations!! Also the oiler restoration was my fav."}, {"text": "Very nicely done! I&#39;m sure the people that once produced this would certainly agree! I also enjoy how you do the exploded look of all of the parts laid out on the table so that you can see what all makes it tick! I&#39;m no lathe expert, but man you make it look nice!"}, {"text": "Am I hearing bells?"}, {"text": "Is that blowtorch able to reach the same temperatures as modern blowtorches? I wouldn&#39;t think so."}, {"text": "Your restorations are literally the most relaxing and beautifully intricate videos on the internet...thank you so much for sharing"}, {"text": "well done  keep up the good jobs"}, {"text": "You make die and stamp. I was wondering what tool you&#39;re gonna use. You just make one."}, {"text": "Subscriber earned."}, {"text": "at least in the end the job is done"}, {"text": "You are a lathe master! You machine new parts like a factory!"}, {"text": "How can anyone watch this and not Subscribe?"}, {"text": "Ohh wait.. so you cant engrave... shame on you!!! :)"}, {"text": "Hey man😎, grreat job restoring the torch. But what was it used for do you know? I never have seen one of those before. It seems to be a one handed torch? How did they use it, tho?<br />You do a great job in restoring tools and machines. Keep up the great work and keep the videos coming. I really enjoy watching your videos and you were storing and fixing the machines and tools.<br />Holla back<br />tbjr41806@<a href=\"http://yahoo.com/\">yahoo.com</a>"}, {"text": "Really good work man it&#39;s beautiful keep it up. I don&#39;t think anyone can compare with you restoration work on YouTube"}, {"text": "Asmr for men"}, {"text": "Primus sucks!! (I hope you get that. Lol)"}, {"text": "Мне кажется, что эта поебень, не очень практична. В сравнении с нашими паяльными лампами."}, {"text": "Can you build one of those badass flamethrowers from WWII? From scratch subscriber challenge? :DDDD"}, {"text": "The original wick makes me nervous. Given the dust that came off when it was manipulated the first thing I thought was that it might be made of asbestos."}, {"text": "Can you restore my dignity?"}, {"text": "perfekt 👌"}, {"text": "this is better than watching a movie"}, {"text": "Из какого металла был сделан наконечник? Похоже на латунь."}, {"text": "Schade, habe jetzt alle Videos durch. Hast du dich schonmal ernsthaft verletzt bei dieser Arbeit?<br />Grüße"}, {"text": "I found it. it&#39;s definitely missing a part  <a href=\"https://picclick.com/Extremely-Rare-Vintage-Antique-Sievert-Blow-Torch-311354491898.html\">https://picclick.com/Extremely-Rare-Vintage-Antique-Sievert-Blow-Torch-311354491898.html</a>"}, {"text": "I doubt it was this shiny as new. You basically made it better than the original."}, {"text": "Cool 🔥🔥👍👍"}, {"text": "Hans get ze Flammenwerfer"}, {"text": "Just a quick FYI the used is incorrect and wont last very long. You can buy replacement plunger on ebay for very little money.<br /><a href=\"https://www.ebay.co.uk/itm/PRIMUS-STOVE-CUP-WASHERS-PICNIC-STOVE-PUMP-WASHERS-KEROSENE-STOVE-OPTIMUS-PARTS/111610161399?_trkparms=aid%3D555018%26algo%3DPL.SIM%26ao%3D1%26asc%3D20140122125356%26meid%3D4d915a3e18844018993038a34321d59b%26pid%3D100005%26rk%3D4%26rkt%3D12%26mehot%3Dpp%26sd%3D111707753902%26itm%3D111610161399&amp;_trksid=p2047675.c100005.m1851\">https://www.ebay.co.uk/itm/PRIMUS-STOVE-CUP-WASHERS-PICNIC-STOVE-PUMP-WASHERS-KEROSENE-STOVE-OPTIMUS-PARTS/111610161399?_trkparms=aid%3D555018%26algo%3DPL.SIM%26ao%3D1%26asc%3D20140122125356%26meid%3D4d915a3e18844018993038a34321d59b%26pid%3D100005%26rk%3D4%26rkt%3D12%26mehot%3Dpp%26sd%3D111707753902%26itm%3D111610161399&amp;_trksid=p2047675.c100005.m1851</a>"}, {"text": "this is dope man"}, {"text": "Liking the 60° guide. That&#39;s given me an idea :-)"}, {"text": "Another superb restoration! So enjoyable to witness your skills!"}, {"text": "The old wick looked as though it may have been full of lead powder from leaded fuel?  I enjoyed the video sir."}, {"text": "that thing looks hella dangerous"}, {"text": "What is uber mechanism??"}, {"text": "There is almost certainly supposed to be a wick drawing oil up from the lower reservoir to light the torch."}, {"text": "What do you do with these once you&#39;re done?"}, {"text": "I waited until the end just to see it working again. Great job!"}, {"text": "Looks like a bong!"}, {"text": "oh wow that is some restoration work compared to some other &quot;restoration&quot; themed youtube channels"}, {"text": "Thats one large chunk of brass jeez"}, {"text": "WAIT A MINUTE! You can&#39;t engrave!!!! Just kidding. ;P I love your videos, keep it up. You are so addicting to watch."}, {"text": "&quot;I can&#39;t engrave... so I just scratch it deeper.&quot;  AHA!  So there is something you can&#39;t do!"}, {"text": "Unbelievable.  And that ending was so funny."}, {"text": "my mechanics, Looks like someone is using your video...\r<br /><a href=\"https://www.bilibili.com/video/av32555954/\">https://www.bilibili.com/video/av32555954/</a>"}, {"text": "fuck me dude, that&#39;s some jaw dropping stuff"}, {"text": "Superbe ! J&#39;aime beaucoup le &quot;VOILA&quot;, lorsque c&#39;est terminé :o))"}, {"text": "Where do you find this stuff?"}, {"text": "the clickspring off restauration la restauration d&#39;outils façon horlogère bravo"}, {"text": "I love your work, keep on doing this!"}, {"text": "the restoration gods are pleased with your offering"}, {"text": "Big fan of your work"}, {"text": "are you serious,way to alienate every male viewer, now we all very inferior,, just joking of course absolutely amazing,what a skill set,you are the kind of guy you want in a tight situation like stranded on an island,we will be living in luxury treehouses in days"}, {"text": "Great job!"}, {"text": "I wish the quality of his restorations was the standard."}, {"text": "You&#39;re the Bob Ross of restoration. I really enjoy watching your videos."}, {"text": "Quite a show piece"}, {"text": "I am mymechanics #1 fan."}, {"text": "Awesome!!"}, {"text": "Jesus that’s not a blowtorch that’s a mini flamethrower! Great work once again dude - sheer quality!"}, {"text": "Great!!! 👍"}, {"text": "Oddly enough your videos are helping me through a very depressive phase in my life."}, {"text": "Do you know a home-made recipe to remove rust too other than electrolysis? Or should I just go with something commercial/make an electrolysis set up for that? I&#39;m having reasonable success using cheap WD-40. Love your vids :)"}, {"text": "👌👌👌👌"}, {"text": "Incredible! Its beautiful."}, {"text": "This is a link: <a href=\"http://www.blowlampsociety.com/BN92.pdf%C2%A0\">http://www.blowlampsociety.com/BN92.pdf </a> to a pdf w/similar torches as yours. It may help answer the lower fuel reservoir cover, and wick issue. Someone mentioned &#39;paraffin&#39; also, and as I was researching the &#39;lower reservoir&#39; issue, I found that it was the correct fuel for many of the lamps. Wettstein and Oerlikon are mentioned in this link, and look similar to your torch also. Hope this helps to fully complete the piece.<br /><br /><br />Also, theres an &quot;iron&quot; which attaches to a rod that goes through the hole on the top front end of your torch thats missing, which allows the iron to sit in the flame for soldering. Many of the torches I found were referred to as: blow &quot;lamps&quot; - &quot;pressure lamps&quot; - &quot;torches.&quot; In many cases &quot;lamps&quot; is actually the proper name. This is another link to information which includes approx. date of mfg, and origin for many of the torches that were made:<br /><a href=\"http://blowlamp.co.uk/MY%20WEBS%20~%20Primus%20date%20&amp;%20number%20codes%20-%20FOR_SERVER/primus_blowlamps_a%20brief%20history%20-%202nd%20attempt.htm#notes\">http://blowlamp.co.uk/MY%20WEBS%20~%20Primus%20date%20&amp;%20number%20codes%20-%20FOR_SERVER/primus_blowlamps_a%20brief%20history%20-%202nd%20attempt.htm#notes</a>"}, {"text": "I&#39;m not telling you anything new regarding not being able to please ppl, so I&#39;ll just say...well done."}, {"text": "Having severe panick attacks, watching your videos really calms me down. I sincerely thank you for your videos and wish you all the best."}, {"text": "That shit looks dangerous af"}, {"text": "Honestly man, I just watched all your videos one after the other now, it&#39;s amazing what you do and love the mini explanations, can&#39;t wait for more videos!"}, {"text": "This vid is a good show of why I prefer you over TysyTube. TysyTube doesn’t have the proper tools or knowledge to give the stuff he restores the REAL kind of TLC that you give to yours. The right tool for the right job goes a long way in respecting the object and it’s history. (And not giving everything a tacky aluminum handle helps.)"}, {"text": "Beautifully done"}, {"text": "Any idea how old it is?"}, {"text": "I need your brain, How are you so damn smart? I probably couldn&#39;t figure out how to take that thing apart with a manual."}, {"text": "Suberi Sach!"}, {"text": "Man your videos are amazing, like your work."}, {"text": "Awesome! Also, I might wrong, but it seems to me like the burner or whatever it&#39;s called – I mean the part you show us at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m46s\">4:46</a> – is meant to be used with a wick :-) That&#39;s what the pipe is for."}, {"text": "That Fahrenheit 451 flare is pure joy for the eye"}, {"text": "193 losers gave you a thumbs down because they have trouble tying their own shoelaces. That said, you are now my favorite restorer on YouTube."}, {"text": "Just discovered your videos recently started binge watching. All I can is I love this series. Don’t ever “make a new one”"}, {"text": "I am a girl who doesn’t understand how tools work (mostly) but really your art made me sink into your restorations videos and also because I love vintage items. Please make a lot of these vintage restorations."}, {"text": "It&#39;s mindblowing how you make new parts! Love that! Well done!"}, {"text": "ur amazing.."}, {"text": "I searched for YouPorn on the internet.. and this came out. Cheers from la Suisse"}, {"text": "Кул"}, {"text": "When things were built out of iron, steel,  brass,  copper,  and leather parts they can be restored after a hundred years of neglect...wonderful work dude!"}, {"text": "Sos un mago!"}, {"text": "Amazing! How do you always how to take it apart?"}, {"text": "اتمنى ان يكون عندى هذه الامكانيات وهذه العدد والالات ولكن"}, {"text": "So there are still people in the world that take pride in their work...  Thanks for restoring my faith!  (as well as these various items)  Beautiful work, GREAT videos.  No annoying music, no chatter, no ads, no B.S.  The way it should be - STFU and fix stuff.  :D"}, {"text": "&quot;lets make a new one&quot; my favorite line :DD"}, {"text": "Very nice job!  Your videos are so relaxing to watch.  I&#39;m going to bed now."}, {"text": "wooooohoooo!!!"}, {"text": "You restore such beautiful things with so much hard work and you still keep your hands clean not like other mechanics that I&#39;ve seen. Like really WELL DONE."}, {"text": "I just love how nothing stands in his way 😱 he literally recreates broken parts that were made YEARS ago."}, {"text": "I don&#39;t know how you remember where everything get put back on! Kudos"}, {"text": "No i super!"}, {"text": "NICE"}, {"text": "I&#39;m excited to see your first concours car restoration."}, {"text": "See him cut the gasket with his Swiss Army knife (scissors)?"}, {"text": "Where are they? I baked them. It wasn&#39;t cookie dough? Sorry."}, {"text": "You set the restoration standards that others need to strive for.  Superb stuff, keep it up."}, {"text": "This restoration was done with pure determination."}, {"text": "I love when u say in your videos: i&#39;ll make this part again, and the result its identical :O!!!"}, {"text": "i follow from turkey ❤"}, {"text": "I’m curious, are most of your hand tools made in the USA or perhaps Germany? All of my hand tools are made in the USA, but I live here. I don’t know how available our tools are over there. I assume you are in Switzerland because your said you were Swiss in a comment."}, {"text": "How long have you been doing things restoration? I mean u are very talented and experienced guy. Excellent :)"}, {"text": "Supreme skills!"}, {"text": "love your video! i find them relaxing. the only thing i want to say is please compress your audio so that is leveled through out the entire video. parts where your cleaning or screwing are quiet and parts where you&#39;re using power tools are loud. when the video starts you&#39;re showing the object you are going  to be working on and it&#39;s quiet so i turn the volume up and then 2 minutes into the video, you&#39;ll like cut to a power tool and its super loud to point where it hurts my ears. that&#39;s all. thanks for making these videos! (you may already be leveling your audio but i don&#39;t think the effect is strong enough)"}, {"text": "That bolt u made from scratch is complete perfection. incredible"}, {"text": "Great work!"}, {"text": "Aside from torching someone if you&#39;re being attacked, either by an ordinary human or a zombie, what sorts of things would you use a blowtorch for in modern times? (This is a genuine, non-sarcastic question.)"}, {"text": "Why 👏 does 👏 everything 👏 you 👏 do 👏 turn 👏 out 👏 so 👏 beautiful? 👏"}, {"text": "Könntest du in einem Video vielleicht auch mal zeigen, wie du die Teile an der Drehbank planst und dann die Vorgehensweise erklären? Das wäre interessant!"}, {"text": "Gute Videos ich liebe sie<br />Good Videos i love them<br />and i love the &#39;&#39;voi­là&#39;&#39; in the end<br /><br />Greeting from Bavaria, germany"}, {"text": "Awesome Rebuilds"}, {"text": "Superbes vidéos. Autant sur l&#39;inspection des pièces, des détails que sur le travail. C&#39;est incroyable et ça détend vraiment."}, {"text": "What amazes me is how you remember how to put everything back together! 🤣"}, {"text": "This things are way better than new. This things are jewelry. Wow..."}, {"text": "&quot;Too much damage to restore...I make a new one&quot;<br /><br />holy shit this guy is really badass in what he does"}, {"text": "I used to used many similar techniques in restoring antique vehicles. However, much more frustrating (to me), as there are so many components and easily lost during the long process. I miss that type of work. Thanks for sharing your excellent videos. Also, your skill and knowledge on the lathe is just incredible."}, {"text": "your videos are awesome! You make it look soo easy to do! I wish to have a tenth of your ability! From wich part of Switzerland are you from? Greetings from Italy! :)"}, {"text": "Puxa, tanto trabalho para deixar as peças polidas e brilhantes e ao atear fogo, fica tudo preto novamente. Mas o trabalho é excepcional. Parabéns!"}, {"text": "Super класс"}, {"text": "Some parts are not clean properly"}, {"text": "Nice 😍😍"}, {"text": "I’m curious if the pan under nozzle should have a cover so the flame can only come out circular nozzle"}, {"text": "@@ now i know how to made a leather gasket pump learning sumthin&#39; new"}, {"text": "I like the way you don&#39;t talk in the videos"}, {"text": "You never cease to amaze me! Very Nice!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=9m16s\">9:16</a> Is that the scissor from a Victorinox? Looks familiar."}, {"text": "When tools were works of art, and a skilled user could repair them himself!"}, {"text": "Looks much rather like a flamethrower than a blowtorch ! ^^"}, {"text": "Jo, you polished the ring for the wick! lol. I&#39;m done"}, {"text": "Why didn&#39;t you polish the whole device but just the easy parts"}, {"text": "Schöne Restauration, sehr aufwendig. Die Idee mit der Reinigungspaste für die messing Teile ist genial. Das werde ich auch mal ausprobieren. Die Dochte sind original auch immer so ausgefranst, damit er besser saugen kann. Das ist nur sehr nervig die wieder in den Tank zu bekommen."}, {"text": "Can you restor my motor? hehe"}, {"text": "I really hate being a dis-loyal fan but I think you go even further and do a more complete restoration than HAND TOOL RESCUE. I will stay subscribed to his channel because I found his channel first but you my dear man have him beat by a mile.<br /><br />This blow torch is so beautiful after you had your way with it that I could almost cry. Its a piece of art and wouldn&#39;t I love to own it, just to display it. I did mention I like all things shiny and yellow in one of your other videos, didn&#39;t I? <br /><br />What a gorgeous tool it is and now it has been given a face lift. (O: AWESOME, STUNNING, BRILLIANT JOB. My photo isn&#39;t me, its a disguise so I can watch this type of channel without being stereotyped. I am a female."}, {"text": "Liked, speechless (no comment), subscribed."}, {"text": "And here I find myself at 12:10 am. What am I doing Idk. But I like the videos. Good job. Masterful and well done. Not annoying or redundant, so thanks for the quality content. Only thing is I wish there was more, though I know these things take a while."}, {"text": "I really enjoy watching your videos, I find it relaxing and great joy to watch.  It seems to me you are a young person who knows his stuff, well done. Thank you for these videos and keep it up."}, {"text": "I like the way you lay out the parts after disassembly. Thanks for this!"}, {"text": "ive got an old Paraffin Blow Torch Restore."}, {"text": "Congratulations on your way to perform your restoration and very good at producing videos. You deserve millions of views. cheers"}, {"text": "This is my kind of &quot;ASMR&quot;. So relaxing and amazing to watch. You sir, are almost more of an artist rather than mechanic!"}, {"text": "Dude i swear when i grow up i wanna be like you 😁"}, {"text": "So beautiful!  I too was like don&#39;t set it on fire again...  but was glad you did to show it actually working and not leaking anymore."}, {"text": "I was conflicted when you lit it up. Part of me wanted to see it in action, part of me did not want to see it sullied..."}, {"text": "omg that tip remake was fucking perfect. you&#39;re unbelievable"}, {"text": "Wow - great job - you are an expert machinist - I am looking forward to your next video!"}, {"text": "Dopamine."}, {"text": "That was bloody fantastic"}, {"text": "Respect for best quality restoration and no music."}, {"text": "Always turned out excellent... Thank you"}, {"text": "i&#39;m scared that a metal shaving will get in my eye through the screen lol"}, {"text": "Really neat"}, {"text": "Fascinating to watch and deeply satisfying all at the same time, the end result is sublime, I&#39;m so glad I found your channel! :-)"}, {"text": "Lo haces ver facil de realizar. Felicidades, magnificos videos."}, {"text": "Hey dude your videos are amazing and I watch them all the time my name is Michael in watching you restore older and antique stuff and tools really has inspired me to do it myself I&#39;ve started doing simpler stuff like restoring an old bike that was sitting in my yard and old 50 60s Ross with the shifter in the middle but I didn&#39;t do nothing on your scale I just cleaned off the Rost and made it look nice and pretty but really the inspiration you gave me to do this I would never got anywhere else you&#39;re amazing and keep doing what you&#39;re doing cuz we love you out here dude"}, {"text": "It has those neat little bipod to stand by itself!"}, {"text": "Lieg im Bett, genieße einen Apfel und dein Video"}, {"text": "Also awesome work."}, {"text": "I need one so bad😢"}, {"text": "What a wonderful thing to behold - the skill, craftsmanship, simplicity of the presentation. Simply delightful."}, {"text": "Just incredible workmanship.  This is by far my new favorite channel.  Don&#39;t change a thing......no talking, no music.....just your passion and skills on display.   Perfect!"}, {"text": "Excellent, well done!"}, {"text": "Looks like something Kevin can use to set Harry&#39;s head on fire with..."}, {"text": "Although these were primarily used for soldering, they were also used for removing paint from woodwork. Old paint had lead in it and in the smoke when it&#39;s burnt off. When breathed in, the body will absorb that lead easier than any other way. It can still happen now with heat guns if you overheat old paint to the point of  smoking, so beware!"}, {"text": "Man if I had a polish wheel.. Everything I own would be shiiiny!"}, {"text": "MacGyver eat your heart out !! this guy is amazing !!!!"}, {"text": "When you remake any parts, how do you know if it&#39;s the correct size?  Surely you&#39;re not eye-balling.  Also, is there a computer that handles the control of the machine?<br />Still great work!  keep it up"}, {"text": "I really like how he lays out the parts in the right order and opened up. It&#39;s like seeing a design schematic. I don&#39;t think anyone else does that..."}, {"text": "I want to see a whole tool remake!!"}, {"text": "Great piece great work. The company is still in existence perhaps you can send them a picture of your great work. Maybe they would buy it from you for historical value."}, {"text": "You do great work. I enjoyed it."}, {"text": "Неужели манка, так хорошо очищает латунь🤔"}, {"text": "It’s called parting off! I struggle to understand why you’re using a hacksaw when you have a lathe."}, {"text": "some of the older wicks had asbestos embedded in them the fluff would burn off but the asbestos would remain the glowing asbestos tip of the wick would ensure a hotter flame<br />so be careful and take care to wear a mask I see a lot of gray dust when you took the wick apart that dust could be that nasty stuff"}, {"text": "Geile Maschinen, geile Arbeit und tolles Teil. Abo platziert. Weiter so 😊👍 liebe Grüße und einen guten Start ins neue Jahr aus Deutschland"}, {"text": "I don&#39;t like polishing nicely aged brass parts. Cleaning dirt is understandable but removing nice patina is misunderstanding. Restoring could be more artistic if you know that not everything needs to shine."}, {"text": "AMAZING JOB!!!"}, {"text": "heh I have one of these at my parents place in dads shed, somewhere. except it has a copper slug on a steel rod for soldering on the end."}, {"text": "Nice work bro 👌🏼"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m44s\">5:44</a> If that is me I&#39;d be stabbing my finger..."}, {"text": "Beautiful work"}, {"text": "Das ist ja so geil. Männervideos perfekt."}, {"text": "is that emco maximat 7 lathe that you own ?"}, {"text": "WE SHOULD THANK YOU FOR THIS BEAUTY ..."}, {"text": "Is it wrong if i am turned on by how amazing this work is..."}, {"text": "I love that &quot;yeahh nahhh, let me make a new one&quot;  hahahah"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m54s\">4:54</a> Ewwwwww... Ewwwwww...Ewwwww, :("}, {"text": "Just Amazing!!!!"}, {"text": "Awesome"}, {"text": "Parabéns muita dedicação."}, {"text": "Keep these videos coming."}, {"text": "Brilliant I&#39;ve never seen anything restored as well as that. Thank you for posting."}, {"text": "well done..a fine restoration..."}, {"text": "dude your a fucking wizard. Spend the whole day watching some of your videos and there awsome. my battery is about to die now."}, {"text": "I just read where you said that English isn&#39;t your first language. May I ask what part of the world you reside in I&#39;m just curious. Love the work though keep it up"}, {"text": "Your videos are relaxing as well as educational."}, {"text": "That Brass is lovely stuff to turn. I quite like 316 in some ways; but Brass even looks better.<br />You did some lovely leather work in that. Most instructive. I was imagining the person who originally made it and then watching you.<br />A lot of metalwork love went into making that. Thanks for sharing it."}, {"text": "Excellente vidéo"}, {"text": "My goodness!! outstanding!!! your are an artist!!! greetings from Argentina"}, {"text": "I would have been very upset if you had not set it on fire! lol Great job;"}, {"text": "Wow! Just...WOW!"}, {"text": "блять дайте ему уже кто нибудь отрезной резец, зачем ножовкой отрезать детали?"}, {"text": "WOW! :)"}, {"text": "Elon Musk wants to:<br /><b>KNOW YOUR LOCATION</b>"}, {"text": "I love these old gasoline, kerosene, parafin or petrol torches.  I collect and restore them too, but I don&#39;t think I have ever done one as extensively as you did here.  Beautiful torch, fantastic job sir."}, {"text": "Спасибо! Утащил пару приемов))"}, {"text": "I have never seen a torch like that"}, {"text": "Me encantan tus vídeos ¿podrías publicar las descripciones también en castellano?, un saludo."}, {"text": "the best restoration video I ever watched, and no obnoxious music!"}, {"text": "More great work buddy, I don’t understand why anyone would hit the dislike button. Great channel, keep it up !"}, {"text": "You are one hell of a craftsman"}, {"text": "The sound of the tools, no blah-blah and perfect execution. Love it!"}, {"text": "very cool ! 👍"}, {"text": "🙏🙏🙏"}, {"text": "Da fehlen einem echt die Worte. Wie neu aus dem Regal :-) Hut ab! LG Heiko"}, {"text": "For me this whole process looks like sorcery. :-O"}, {"text": "I hate sanding thats why i never did workshop"}, {"text": "You are incredible sir. Fine work."}, {"text": "What a work of art it has become... though I really wouldn&#39;t have risked firing it up in the original state, I value my eyebrows."}, {"text": "That bowl gasket though !!!!!"}, {"text": "Been addicted to your videos for a good week now!  Awesome stuff...but my work productivity is starting to deteriorate, haha.  What’s also impressive (and I haven’t seen comments on this), is just how quiet you are!  Half the time I’m watching, I’m thinking “yeah, that was an oh sh*t moment if it were me”."}, {"text": "That hummus you put everything in looks pretty good."}, {"text": "I Don&#39;t know why im watching your videos. It must be your time,effort and hard work to bring these masterpieces back to life. Very Well Done!!!"}, {"text": "does it work?"}, {"text": "I don&#39;t want to seem inappropriate, but only my fiancee has satisfied my soul this deeply before."}, {"text": "Einmal Schone Maschine!!!<br /><br />Vielen danke"}, {"text": "You are just Amazing man you doing wonderful job your brain is God gift thanks for wonderful Videos"}, {"text": "WHY ARE YOU NOT USING ANY CUTTING FLUID?!?!?!?!?!?!!!!!<br /><br />THIS MAKES BOTH MY EYES AND EARS HURT."}, {"text": "Oh my God. &quot;Fire leaked everywhere..&quot;  (in the description). I was going to give it a Like just for the title..  Youtube needs a &quot;Love it! That is the most awesome thing I will see for a while&quot; button. It takes some serious stones to restore a blowtorch. I can&#39;t wait to watch it."}, {"text": "Amazing"}, {"text": "Great for lighting candles I would say."}, {"text": "Testicular pain"}, {"text": "蛋疼"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=8m34s\">8:34</a> You like the risk, dont ya?"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m35s\">4:35</a> Now into the oven for 30 minutes and enjoy your meal. Best served with a bottle of red wine. :)"}, {"text": "how do I download happy weels"}, {"text": "Love your restorations! Please do more vids!"}, {"text": "This is ASMR for mechanics and tinkerers and DIY fans.<br /><br />Oerlikon... also well-known for its top-quality 20 mm cannons, used by both sides of WW2."}, {"text": "Wowza you got some skills bud"}, {"text": "Your videos are so chill! It&#39;s very relaxing watching you work and everything ya refurbish turns out amazing."}, {"text": "The “Almazan Kitchen” of engineering. Fantastic 💯"}, {"text": "oublie jamais tu a quelque chose qui na pas de prix ,la science ,la patience . je crois que cette façon de vouloir remettre les objet en état ce perd de plus en plus . j&#39;aime te voir travailler,mais du coup je travaille plus devant mon pc a cause de toi haha"}, {"text": "You&#39;re doing good, do more videos!"}, {"text": "Unintentionally ASMR."}, {"text": "I smoke cigars and watch this....."}, {"text": "Your a Genius, I love your Passion for restoring. There’s other people who do restores too but yours is my favorite."}, {"text": "Can you make a new leather piece for my torch pump!?"}, {"text": "You sir are an artist"}, {"text": "Your not playing fair, you have all the best toy&#39;s  for restoring these tools! LOL keep up the good work"}, {"text": "Yaaay fire!"}, {"text": "This is jewellery!"}, {"text": "Your a cool bro..😃😃😃🤣🤣...nice.."}, {"text": "Beautiful work. Pleasure to watch."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=18m30s\">18:30</a> That looks so dangerous! D:"}, {"text": "Just SUB to your channel. These vids are awesome!!!!"}, {"text": "I absolutely love your videos! But do you own a metal working company or why do you have so much machinery?<br /><br />And can you explain how this blowtorch works? I still don&#39;t get it."}, {"text": "The cup for the pilot light seems to be missing something like a wick and a lid, so fire only burns from the chimney. It seems odd to light a fire that licks up around the valve handle like that."}, {"text": "Do you have a system of keeping track which part goes where when you work on this stuff?"}, {"text": "OK, that&#39;s like some deadly weapon from WW1. Looked awesome before you even started. Double plus awesome afterwards!"}, {"text": "Are those turning and milling machines NC programmed or classic ones?"}, {"text": "This is not your first rodeo, is it!"}, {"text": "There are many so called restoration channels on YouTube that should watch your channel and learn what restoration really means keep them coming"}, {"text": "I love the part when he wrote &quot;lets make a new one&quot;"}, {"text": "Next time please do assembly with clean hands - the lubricant should not get into the gas - this is a round explosion<br />Google &quot;lubricant explousion gas cylinder&quot;"}, {"text": "This can&#39;t be your first channel. You are a terrific craftsman, no doubt. But the production and video editing is very professional and condensed to where it is also very mesmerizing. That&#39;s another skill unto itself. Do you have help with this?"}, {"text": "I guess you don&#39;t like making watches :D"}, {"text": "Haaaaans!!!! Bring ze..................."}, {"text": "Who in the hell would want to use THAT as a blowtorch?"}, {"text": "❤️👍"}, {"text": "Schöne Restauration, wie alle, die ich bisher angeschaut habe! Bezüglich dem Ventil verstehe ich die Idee dahinter zwar, muss aber auch sagen, dass es trotzdem etwas seltsam aussieht (es wirkt etwas wie &quot;keine Zeit mehr gehabt&quot; oder &quot;Teil war zu kompliziert&quot;). Ich denke, man könnte es chemisch reinigen, ohne die Struktur anzugreifen. US wurde ja schon in der Kampfdiskussion genannt ;) genannt. Eventuell auch mit &quot;weichem&quot; Strahlmaterial arbeiten... So würde ich es zumindest probieren.<br />Ansonsten: weiter so :)"}, {"text": "Could I suggest Frutiger, DIN or Univers in a light weight for your video captions. Everything else in these videos is beautiful, why not the captions too."}, {"text": "It puzzles me as to how 139 people could thumbs down a video demonstrating so much artistry, craftsmanship, and beauty!!??"}, {"text": "Du bist eine Koryphäe in deinem Bereich. Hut ab and Thumps up. 👍🏼 Ich lass mal ein Abo da. I will Subscibe.. 🤘🏼Grüße aus Nordfriesland"}, {"text": "It seems to be missing a part which would concentrate the fire from the bottom part used as ignition/heater through that small &quot;neck&quot; it has. I do not think that it is supposed to burn like that. Don&#39;t you think so?"}, {"text": "Great job on the blowtorch but it still looked like a fire hazard lol"}, {"text": "Hans ?"}, {"text": "Fantastic work!!!!"}, {"text": "dat minigun"}, {"text": "Fair play to ya man! I felt like standing up and clapping every 5 minutes! keep the videos coming!"}, {"text": "every time I see this kind of videos, I want to go to some junkyard and try to rescue some junk and leve it this way. You are awesome."}, {"text": "That looks painful <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m44s\">5:44</a>"}, {"text": "A master craftsman at work"}, {"text": "for me: its too dangerous to use it.."}, {"text": "the tools in the old days were so pretty to look at, and made so well. not like the cheap junk they make today"}, {"text": "Absolutely superb - you are so skilled - really enjoy your videos, great Chanel 👌🏻"}, {"text": "Deinen Kanal durch Zufall gefunden... echt super wie du in liebevoller Kleinarbeit die alten Dinge zu neuem Glanz bringst. Top!"}, {"text": "You are a very well skilled man, I would of thought years and years of learning too....well done on another beautiful restoration 🏆👍🏼"}, {"text": "WOW! thats really cool."}, {"text": "I came across your videos and I have to say keep up the good work but what’s killing me is I wanna see more from you please put some more videos out"}, {"text": "You´re a true wizard and one of the most talanted people i´ve ever seen!"}, {"text": "Man... You awesome. You must be super calm :D I get frustrated when building Lego Technics and you working with all that small pieces and not cursing and throwing it on the ground!!! You are my mentor now! :D <br />And the blowtorch (!!!) it looks like an art not a tool!!! After test I was ok... now go AND CLEAN IT UP!!! :D :D :D<br /><br />Overall Incredible skills, marvelous restoration! I really envy you! Waiting for more vid!"}, {"text": "great"}, {"text": "Rumour says you Swiss also have great skill in making fine watches . You Sir are a fine  engineer."}, {"text": "Пожалуйста, расскажие, что дает нагревание + оливковое масло?) Прочность?"}, {"text": "So many times in this gentleman&#39;s videos I find myself watching him hand-make some obscure part (&quot;Here we soak the leather in rocket fuel, then punch it in, then burn it, then cut away the burnt excess 24 hours later&quot;) that I say &quot;OH COME ON!&quot; because I am in awe that someone takes this stuff so seriously.  I would give you all my upvotes.  This is wonderful, nourishing content. Thank you."}, {"text": "Was the patina wash (equal parts of vinegar-flour-salt) meant only for brass and copper?"}, {"text": "Please open up a Patreon so we can support more"}, {"text": "I can&#39;t believe you actually tested that lol, I&#39;d be too afraid it would just combust entirely. Can&#39;t believe it actually worked as well as it did even."}, {"text": "Amazing work"}, {"text": "Rip your hands"}, {"text": "Enganchadísimo al canal. Deseando que alguien me mime tanto como este hombre mima sus restauraciones xD"}, {"text": "&quot;I can&#39;t engrave...&quot;<br />Sir , you can do anything with your skills, it looks like magic! Awesome job!"}, {"text": "Aus welchem Jahr ist das Teil eigentlich ?"}, {"text": "I love you yum—yum"}, {"text": "On the plunger, did you have to research the material (leather) used to seal the rod?  Or did you examine the dried remains and find it to be leather?  These videos are very well done and definitely a watch for me!  Thanks."}, {"text": "агонь блед!"}, {"text": "I can&#39;t have enough of your restorations! You sir are a true technical wizard and artist!"}, {"text": "One can&#39;t help but wonder : where did you acquire this technical knowledge?"}, {"text": "Muito bom! O problema é que eu fico assistindo e esqueço de trabalhar kkkkk"}, {"text": "I could binge watch these videos.  I like the detailed machine work.<br />Most people would say this torch is irreparable.<br /> Keep them coming."}, {"text": "Deine Rücksicherung  ist perfekt und schön!!!!Vielen dank!"}, {"text": "du bist absolut großartig...ich mag deine videos :D"}, {"text": "das du dich an sowas rantraust hat meinen vollen Respekt... das Ergebnis ist der Hammer...die se polierten Messingteile begeistern mich immer wieder..."}, {"text": "My favourite sentence: &quot;I&#39;ll make a new one&quot;. This could be your channel&#39;s motto : )"}, {"text": "These are wonderful restorations. I especially like the exploded views of the objects."}, {"text": "Terrific!"}, {"text": "take that Elon! nice work"}, {"text": "How small could u make one"}, {"text": "man watch at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=8m35s\">8:35</a> make me nervous"}, {"text": "I’m so impressed with your skills! Keep up the excellent content."}, {"text": "Beautiful Job! Ignore the haters. It amazes me how someone could give this a thumb down. I appreciate all the hard work and taking the time to film this! Thumb&#39;s up for you sir!"}, {"text": "I&#39;m jealous of your equipment, skill and new toy :)"}, {"text": "When you tested it out before you fixed it, i thought it was going to spontaneously combust"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23PewDiePie\">#PewDiePie</a>"}, {"text": "Suisse?"}, {"text": "Is this a hobby your doing?Or are all those tools[mill,lathe and so on] used for other things like your home business."}, {"text": "So satisfying."}, {"text": "your work is amazing i watch all your videos on 2x speed try it guys ❤"}, {"text": "Почему не все блестит?)"}, {"text": "i think you could have done better, just buy a new one... KIDDING !!! Your videos are a plesure to watch and learn. Greetings from germany"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=3m38s\">3:38</a>  looks like an artefact you find in an ancient tomb"}, {"text": "Some Swiss Army nail clipper action at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=9m16s\">9:16</a>, nice!"}, {"text": "Keep this you and you will be at 1 million subs in no time. Excellent restoration."}, {"text": "Наверное, только швейцарцы могут так подгонять друг к другу новые детали сделанные вручную!"}, {"text": "nice."}, {"text": "New sub here, I also am a fanatic for working with metal.  Love your skills dude!"}, {"text": "It looks like a ww1 machine gun"}, {"text": "Love your vids. So satisfying"}, {"text": "That was incredibly satisfying.  I often work with old sewing machines and typewriters, myself.  Not as much machining involved, but I know the feel of a good restoration."}, {"text": "Your cookie recipe was the worst I&#39;ve ever tried. Smh (<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m06s\">4:06</a>) 8/10 would try again."}, {"text": "Thank you for sharing this..I love old tools. This was one great video to watch, especially that you fired it up after restoring it. Old tools were made to last and be used. Thanks again..Subscribed and will share it."}, {"text": "Wahnsinn!! Chönti der stundelang zueluege👍🏼 gruess us bade!"}, {"text": "Ce type est incroyable! Tu lui file un vieux tromblon tout rouiller et il te le transforme en bijou!<br />Encore du beau boulot, bravo!"}, {"text": "Your attention to detail and machine skills make for quite the amazing restoration and repair!"}, {"text": "You are the best mot....fu...er !!!!!! you are the 1 !..... y hate youuuuu ;)"}, {"text": "Fantastic work again!"}, {"text": "Your videos are so therapeutic to watch. Very enjoyable and educational also. Thank you for sharing these restorations!"}, {"text": "Incredible workmanship right here. I give my utmost respect to your fine skills."}, {"text": "Wow, what a restaration. It looks awesome. Thanks"}, {"text": "I do envy your set of skills and tools. Great video!"}, {"text": "I have watched loads of restorers channels, you are the only one who works how it really should be, keep it coming"}, {"text": "You, sir, are a craftsman and an artist, and watching your videos is a real pleasure."}, {"text": "Amazing"}, {"text": "I find these videos so captivating I could watch and watch. Thank you."}, {"text": "You&#39;re a brave man to light that thing in its original condition."}, {"text": "It&#39;s fantastic, thank you! Hi from Ukraine!"}, {"text": "Love these videos!"}, {"text": "Excellent work! These old things are almost pieces of art!"}, {"text": "never seen an antique blowtorch like this, impressive."}, {"text": "Not only are your mechanical skills spot on, example, cutting out the gaskets and restoring the brass, but your video skills are very very good. Quality video, very interesting to watch. Thanks so much for posting. I look forward to seeing more from you."}, {"text": "U have some great technics!"}, {"text": "very very professional work. thumbs up .....best of the best. thanks for posting."}, {"text": "Великолепно !"}, {"text": "Do you made it from german waffe WWII?"}, {"text": "Another cappuccino break very well spent. One of the many reasons your video is so appealing, aside from the many skills demonstrated, is that this takes me back to my own childhood when I would follow my grandfather around while he tinkered at his workbench, fixing everything from clocks to violins and hand making lost parts. AND much like my grandfather, you go about your tasks without speaking and yet the lessons are well learned and the methods passed down. You must be an old soul, as today, we live in a disposable society, where the old is cast away and there is the perception that newer is better. What you have there is the ultimate and elegant equalizer for confronting a hornet&#39;s nest. Thank you for improving my day."}, {"text": "This was mesmerising to watch. Thank you for sharing your incredible talent."}, {"text": "Impressive work man :) I&#39;m impressed not only with your skills but the design of this piece of engineering! It has so many tiny pieces that you would never imagine haha<br /><br />I think the design was too complex for the final results, I mean, the compartment that you set power fuel is not very efficient as it sets everything on fire, but still impressed with the device and the alloy they used to construct it. It looks like gold!<br /><br />Also, you&#39;re very good by doing new pieces, nice skills! Oh, and I bet this guy had you a hard time to restore!"}, {"text": "Bravo 👏🏼"}, {"text": "😘"}, {"text": "Buenísima restauración. Funciona al cien por cien.<br />Tienes mi like. un saludo."}, {"text": "These are  clock maker level skills. It&#39;s fantastic to watch something beat up trough a hard working life restored like this. Well done."}, {"text": "faultlessly"}, {"text": "I cant get enough of your restorations i keep coming back every time i see a new video."}, {"text": "Most mind blowing part of the video. You can’t engrave?!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m43s\">5:43</a> Christ man, be careful!"}, {"text": "This makes my willy hard."}, {"text": "impressive, tg for rewind."}, {"text": "Lets buy him a blunt for this lighter!"}, {"text": "Not one time did he tell me to like comment and subscribe...and don&#39;t forget to click the notification bell down below."}, {"text": "It was used by the Nazis?"}, {"text": "Ist und bleibt messing Schrott"}, {"text": "Great! I like the silence in your videos!"}, {"text": "At <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=3m40s\">3:40</a> I look at this parts and I said FUCK, its almost 2:00 AM."}, {"text": "you are just amazing <br />please keep the videos coming <br />subscribed btw"}, {"text": "Fantastic job!"}, {"text": "Beautifully done! Great video!"}, {"text": "You have to have a patience like a donkey. Would not be for me. Thumbs up Master."}, {"text": "I can tell from these amazing videos that your workshop is whistle clean, tidy and extremely organised! New sub."}, {"text": "This channel is a hidden gem among all the crap on YT!"}, {"text": "What a wonderful restoration!"}, {"text": "A true craftsman! Love your work!"}, {"text": "Cant Restore my bike:D"}, {"text": "Из прутка точил оболочку.... Ким стремится к нулю блин."}, {"text": "The lower reservoir does not have a cover. It&#39;s open to allow the fuel to flame up and over the upper main flame chamber (to pre-heat it). Once most of the fuel in the open reservoir has burned off (about 3-5 minutes), the upper main chamber/tube should be hot enough to use. Turn the knob to start the flame (it should self ignite). If it doesn&#39;t, just use a stone igniter or zippo/lighter. In about 1-2 minutes the main flame will go from orange to blue. That is when it&#39;s ready to use. Then adjust the knob to get the size flame you need. You can also open the knob a little bit during the preheating phase to help speed things up a bit. Btw, the above blow torch (from what I found after using Google) is actually a soldering iron (which can also be used as a blow torch). The holes in the top part of the body/casting is used to hold/lock in a soldering &quot;tip&quot;. Kinda like this one. <a href=\"https://tinyurl.com/yc44yatv\">https://tinyurl.com/yc44yatv</a>"}, {"text": "Masterfull"}, {"text": "How much this restoration cost? So amazing!"}, {"text": "This is, like, How It&#39;s Made levels of soothing and informative.<br /><br /><br />Also SHINY."}, {"text": "ART!"}, {"text": "You missed to restore the middle part, everything is shiny but that middle part is sill old looking. Don&#39;t be lazy"}, {"text": "Weiter so,einfach Top👍👍👍"}, {"text": "Dieses Qualitätsniveau habe ich bisher bei noch keinem Restore-Kanal gesehen. Meinen höchsten Repekt! Weiter so :)"}, {"text": "Curious...  what is your native tongue?  <br />you use the term &quot;salz&quot; - is that German?  or maybe Dutch?<br /><br />I loved watching this video - it is interesting to learn how things work and how people solve problems, fixing things that don&#39;t work..<br /><br />BEST"}, {"text": "can you colab with how to basic?"}, {"text": "Impressive!"}, {"text": "Лайк потом просмотр!!!"}, {"text": "I’m so glad you lit it up again even if it did ruin some of your beautiful polishing and finish. After all that work it needed to burn again."}, {"text": "Good shit man keep em coming"}, {"text": "Impressive as always, I really hope you will continue to restore these old gems. The only thing that I am curious is to how long each project takes. You rock dude, thanks."}, {"text": "seem like lot of work when u can just buy new one off amazon"}, {"text": "I bought a bunch of those from army surplus about 15 years ago. <br />They were in original boxes unused.  Collectors love them and turned a big profit."}, {"text": "very good"}, {"text": "There&#39;s nothing like watching a master at his craft"}, {"text": "just beautiful work dude,outstanding!"}, {"text": "Too cool....looks almost new...."}, {"text": "A lovely job, I appreciate your care for old mechanical things. And your English is fine, I’ll bet it’s your third language anyway! Thanks again,<br />Les in UK"}, {"text": "Wow, you&#39;re good at this stuff, do you sell any of your work?"}, {"text": "hey awesome video :)<br />but is it just me or do i feel like it is missing a part, at the front the little container that is ignited to have the little flame burning. i feel like there should be a little plate covering it (everything except the hole where the flame will come out - then again maybe it wont have enough oxygensupply :/ )<br />does anybody see where i am coming from?"}, {"text": "Set it on fire to dry, thats something i&#39;m taking with me"}, {"text": "MORE VIDEOSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS"}, {"text": "where do you find this broken stuff?"}, {"text": "Seriously !! What you are doing to me???! I just can&#39;t believe my eyes ! Where are you from?"}, {"text": "Perfect. Just perfect."}, {"text": "Doing great man keep up the good work. Love the vidoes"}, {"text": "Love your works, well done."}, {"text": "@my mechanics <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=8m06s\">8:06</a> es oro? o que metal es?"}, {"text": "good,better,the best. ты проделал классную работу. well done"}, {"text": "Battlefield v looks cool"}, {"text": "He: &quot;have problems with girlfriend&quot;<br />Also he: &quot;lets just make a new one&quot;"}, {"text": "this looks like a headache"}, {"text": "hi, please test the equiment moren time, is good to see those beautis  working again:). Amazing job, you know I have many old equipment that I&#39;ll start to restore...somehow:) thank you."}, {"text": "This might be an annoying question but can you list your machines please? <br /><br />What is the lathe model? <br />The mill? <br /><br />Do you have some sort of milling head that attaches to the tail stop of the lathe for that radial work on the duroplastic handle?"}, {"text": "Карманная керосиновая горелка:)"}, {"text": "You truly are a master of your trade!"}, {"text": "How long does it take you to edit these? It&#39;s really well cut."}, {"text": "THIS IS INCREDIBLE. I heart this so much. Dearly wish I had all these tools, makes me want to spend days in a workshop of my own."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m55s\">4:55</a>"}, {"text": "maybe i missed it, but what year is this blowtorch from??? I absolutely love seeing these videos! I currently work on a ship built in the mid sixties, so I definitely get my fair share of restoration as well ;)"}, {"text": "where do you find this stuff."}, {"text": "Try turning your threading tool upside-down with the spindle in reverse and turn your threads away from the headstock so you don&#39;t have to worry about having no spindle brake"}, {"text": "Since I&#39;ve found your page, I am simply blown away at the detail you go into in restoring things. Someone else said you set the bar, and IMHO, you certainly do and you make it look easy..."}, {"text": "so relaxing..."}, {"text": "Beautiful work."}, {"text": "brass is such a beautiful material, not matter how filthy it gets you always know the beauty underneath is just waiting to come back out"}, {"text": "Another awesome wow!"}, {"text": "I cant believe you didn&#39;t buff the one main piece. After watching a few of your videos I gave you the nickname Warren Buffitt."}, {"text": "Don&#39;t use the flame tray. It soots up the gorgeous device. Use a welding striker and it will stay much cleaner igniting the gas directly. Another wonderful job!!! BRAVO!!"}, {"text": "Excellent"}, {"text": "As an American I&#39;m cringing at the osha violations"}, {"text": "Eres el mejor"}, {"text": "Very satisfying to watch. I didn&#39;t quite get how you Knurled the knob."}, {"text": "well done bro👍"}, {"text": "nice"}, {"text": "My grandfather had a similar model blowtorch. Is there a piece missing from yours? On his I’m sure there was a wick in the heating pan below. He also used a smokeless fuel in the heating pan (it may have been methylated spirits, though this was 40 years ago)."}, {"text": "&quot;set it on fire to dry&quot; XD yeah that will probably work just fine."}, {"text": "Your depth of knowledge is amazing.  Not only do you have an impressive array of tools, you know how to properly use them.  Please keep making the videos, they&#39;re very inspiring for a hack like me!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m08s\">4:08</a>. Flour, salt, vinegar?!  My simple mind is blown.  Brilliant!"}, {"text": "I was hoping you&#39;d test it again at the end and you did!"}, {"text": "Some of this doesn&#39;t even seem possible!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=1m20s\">1:20</a> that is the most magnificent plop I have ever heard"}, {"text": "Fantastico!senza una parola è bellissimo!bravo"}, {"text": "Бляха он не мастер, он какой то фокусник"}, {"text": "I remember one of these blowing up in my unle&#39;s hands."}, {"text": "&quot;I can&#39;t engrave, so I just scratch it deeper.&quot; Wait a second! So there is actually something you can&#39;t do? That is such a relief! Seriously though, awesome content sir! I am so subscribing. Liebe Grüße in die Schweiz!"}, {"text": "Is that going in a museum?"}, {"text": "Awesome!"}, {"text": "Human are attracted to what&#39;s beautiful. This is art, Craftsmanship, that takes time, passion, focus, and effort. Amazing! You know what you&#39;re doing and thank you for sharing it!"}, {"text": "You have one of the best restoration channels on YouTube but you only have 6 clips. You need to make more."}, {"text": "One of the best restorers on youtube."}, {"text": "Wish I had your machining skills! 👌👍"}, {"text": "so much hard work to restore this - amazing"}, {"text": "That was a real work of art!  Beautiful."}, {"text": "You&#39;re the god, that&#39;s how you restore things, you&#39;re the BEST in this job! ❤️"}, {"text": "Very Nice"}, {"text": "SO 1"}, {"text": "&quot;Well that&#39;s no good, I&#39;ll just make a new one!!&quot; Holy poo Dude, I have no more words!!!"}, {"text": "Respekt.<br />Warum hast du eigentlich das eine Teil nicht aufpoliert? <br />Ich hab auch noch altes Werkzeug (darunter auch Lötkolben) und deine Videos inspirieren mich dazu dieses zu restaurieren und als Deko aufzustellen."}, {"text": "Get Grammarly, it will help you correct your English even if you&#39;re not sure how to spell a word, I&#39;ve been using for about a year and it&#39;s awesome!!!"}, {"text": "Now I know what I wanna be"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=10m14s\">10:14</a> you scared me a little, lol!! thought you slammed the lathe onto the metal, lol but it was a sudden change in video clips gave it that look. Great work!!!"}, {"text": "cant even get a gluten free blowtorch these days"}, {"text": "Why didn&#39;t you polish the handle?"}, {"text": "Dude you put the other resoration channels to shame by far yours is the best and most high quality I can&#39;t believe the work you put into these videos just wish I found your channel sooner. Subscribed!  😀"}, {"text": "Deine Restaurationen sind sowohl vom Ergebnis als auch Arbeitsprozess eine echte Augenweide 👍 Mir stellt sich in diesem Fall allerdings die Frage, wie sich der Vorwärmprozess mit dem Kunststoffgriff versteht? Klappt das bei den Temperaturen denn auf Dauer?"}, {"text": "Yet another show room restoration, well done!"}, {"text": "Love your videos  , very satisfying!"}, {"text": "no music, no gimmicks, and the real sounds. Love it!"}, {"text": "Such a joy to watch the results of the polishing."}, {"text": "Beautiful vid with a gorgeous ending. 😁😁"}, {"text": "Just out of curiosity were do you find these relics to do up into these amazing pieces of art. Garage sales? Love your work."}, {"text": "Super renovation ! You are the King of “fake” things renovation !  I like you !"}, {"text": "I&#39;m running out of accolades (Lobe) to describe your videos. Suffice it to say that I am watching them more than once. They just make me feel good! Thank you."}, {"text": "Hope that old wick wasn’t asbestos 😬"}, {"text": "Why no full restoration?"}, {"text": "Damn damn damn damn damn, this was beautiful to watch."}, {"text": "Fuck that piece I&#39;mma make a new one"}, {"text": "This man deserves more subs!"}, {"text": "I&#39;m amazed, you sir are a true craftsman. Salut!"}, {"text": "&quot;Set on fire to dry&quot; Has to be my favourite technique i&#39;ve seen in one of these tool restoration videos"}, {"text": "That is just awesome !  Wish I had those skills."}, {"text": "Cover it in mash taters for a week!! Good as new 👏👏👏"}, {"text": "How many hrs went in to this?"}, {"text": "Love your videos. Satisfied after watching them"}, {"text": "Looks like a @colinfurze contraption :)<br /><br /><br />Nice work!"}, {"text": "Yes ! Of course it has to be set on fire again ahah thats its &quot; raison d&#39;etre&quot;. The leather trick is awesome, was wandering how the hell you&#39;ll be restoring that.<br />Great channel !"}, {"text": "Молодец!"}, {"text": "wie findest du die ganzen Objekte"}, {"text": "Беспонтовая паяльная лампа."}, {"text": "So satisfying! 👍👍👍👍"}, {"text": "me:do you have a fire you: sure"}, {"text": "First of all forgive that I use translator, I love old tools and see how from nothing you do pieces with that level of detail and you give life ... is a pass, I&#39;m convinced I subscribe, I like this work, follow So, my like"}, {"text": "Я испытал технологический оргазм)"}, {"text": "I think your brass-work is quite superb.  You turn out such elegant and practical parts.  Thank you."}, {"text": "ok now i am hooked to your channel. You need to upload weekly...chop chop...ha!"}, {"text": "No need to apologize for your english, it is quite good and sufficient! I appreciate that there are no words or music in your videos, pure simplicity with no distractions. I am a new subscriber and very inspired by the work. Cheers."}, {"text": "I have discovered an amazing corner of YouTube. Awesome vids man"}, {"text": "Great job dude 👍🏻 Serious time went into that ✌🏻"}, {"text": "Настоящий реставратор! Все до мелочей. 👍👍👍"}, {"text": "Danke für die tollen Videos- Was ist das für eine Pampe bei <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m06s\">4:06</a> ?"}, {"text": "There is no wick in the wick holder..."}, {"text": "Dude your probably the best restorer on YouTube rite now .Your restores are awesome.Not like some of these half ass restorers that don’t go above beyond like you do ."}, {"text": "You could add how many hours it took. I mean every time."}, {"text": "Its a pleasure for a fools of restoration to wacth the love you put in your work. Thanks for your youtube channel"}, {"text": "“it’s too beautiful to set on fire again! ...whatever” 😂😂😂😂"}, {"text": "If you can improve your english to a level where you can narrate your videos and take us through your restoration work this will by far become youtubes best restoration channel. Impeccable work. Keep it up and you will soon be ridiculously rewarded."}, {"text": "Autism gang locked in"}, {"text": "Wow.  The tool is terrifying (especially when it was leaking!) but your restoration is beautiful.  I was very impressed with your creative solution to making the leather cone.  Also interesting to see what vinegar, salt, flour and time did on that rust.  Better than I expected."}, {"text": "Personally I don&#39;t think a deep patina and super shiny parts work together, either it should have been restored with a patina finish or it should be been cleaned entirely."}, {"text": "One of the most dangerous tools. I have seen multiple times gasoline blowtorches suddenly  catching  or spiting fire."}, {"text": "Just tool sound. Great. Work well done."}, {"text": "Love it"}, {"text": "You should use methylated spirit in the heater tray. It burns cleaner and doesn&#39;t cover everything in soot."}, {"text": "&#39;...set it on fire to dry....&#39;  yesss!!!!"}, {"text": "Bent like a banana isn&#39;t always bad..."}, {"text": "This thing looks like a medieval torture device."}, {"text": "RESTORATION GOD"}, {"text": "Your lathe is awesome, the Ultimate man toy."}, {"text": "Finished with love"}, {"text": "Ich hätte nicht gedacht, dass du sogar die Dichtung des Pumpenkolbens selber machen würdest, die Methode ist einfach unglaublich. Und ich die Sache, einen Stahlbolzen zu schwärzen, habe ich als Schlosser nie gelernt. Faszinierend. Weiter so, ich freue mich auf neue Projekte. Übrigens habe ich den gleichen Wagenheber, allerdings unrestauriert aber mit Mittig klappbarer Kurbelstange."}, {"text": "Simply amazing skills, just amazing!"}, {"text": "this is fucking ASMR!"}, {"text": "You are a very gifted person keep on making cool videos 👍🏻"}, {"text": "Отличное видео."}, {"text": "Superbe video !!! Vous etes suisse ?"}, {"text": "Until you re-lit it, I was confused why you didn&#39;t re-finish the &quot;action&quot;. You partially answered that below in your &quot;FAQ&quot;, but the re-lite kind of illustrated why: it&#39;s just going to get exposed to the pilot flame anyway so it would be a waste of time polishing it all pretty."}, {"text": "it&#39;s a piece of ART"}, {"text": "Perfect work!!!!!!!"}, {"text": "museum piece result."}, {"text": "Nice to see a restoration that is more than wire wheel, paint, and polish.  You are in another league keep it up I love it"}, {"text": "Very well done, I like it."}, {"text": "Why doesn&#39;t your lathe have a brake on the spindle?"}, {"text": "beautiful work!"}, {"text": "Outstanding work."}, {"text": "That was great to watch u can tell u put a lot of heart and soul in 2vthe restoration 👍👍👍👍 t"}, {"text": "Great Job"}, {"text": "profesional"}, {"text": "Didn&#39;t know the swiss got light sabers haha! Cheers!"}, {"text": "I love the way you do it"}, {"text": "where do you come from ?"}, {"text": "Wo findest du all diese Geräte?"}, {"text": "Whaa..., what a cruel beauty!.  It must have somehow inspired the makers of ALIËN"}, {"text": "You should have a TV show, far too good for YouTube"}, {"text": "Very cool.....yes I know its hot....LOL"}, {"text": "und wieder einmal hast du es geschafft, aus einem Werkzeug, ein kleines Kunstwerk zu machen. Einfach nur klasse. Ich beneide dich um deine Werkstatt die es dir ermöglicht so schöne Dinge zu erschaffen. Du hast ein Talent alten Dingen ein neues Leben einzuhauchen.. Danke das du uns teilhaben lässt."}, {"text": "Man, I love the germans. Y&#39;all are so ocd and it really works in your favor. +1 sub."}, {"text": "I just finished all five our your videos. I enjoyed every single of them. Keep your format. Don&#39;t add music. Quality &gt; Quantity remember. <br />Can&#39;t wait to see what you could do on your next project. <br /><br />Thanks"}, {"text": "Wow what a style , could be made into a flamethrower or a ww1 Maschine gun by the looks 😂nice work"}, {"text": "What are you using to polish like that? Very nice video bro!"}, {"text": "Excellent bon travail et pas mal la formule de nettoyage"}, {"text": "Only the Swiss could build a workshop tool and make it look like a fine musical instrument."}, {"text": "Your skills are......well.....fire! Love the video!"}, {"text": "Your attention to detail is astounding and your metal lathe ability I’m jealous please keep the videos coming 👍"}, {"text": "Nice result but this ... <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m48s\">5:48</a> is just lazy and wastefull"}, {"text": "Just awesome."}, {"text": "If that was a genuine antique you would want to keep the patina, just remove the Soot. I am a perfectionist, I have been critical.<br />I have given a HUGE thumbs up for your machining skills. It takes me back to my days as an Apprentice Engineer, way back in the dim distant past. I had to learn about all aspects of Engineering.<br />Thanks for showing your skills."}, {"text": "What do you do with the things you restore?"}, {"text": "Nice, I have the same solderbolt. <br />Now I&#39;ve seen how to do it.\r<br />You must have a nice day.."}, {"text": "I am in aww of how amazing of a restoration job you did.<br />I have watched nearly every tool restoration video on YouTube and you sir are on of the very best I have seen thus far.<br />Congratulations man, its such a beautiful tool. You truly do love restoration work.<br />Your machining is amazing as well<br />What can&#39;t you do"}, {"text": "Another Fine Restoration :D"}, {"text": "Looks better than new"}, {"text": "Subscribed and loved after seeing the first one !! My mouth is still open ‼️ Please tell us WHO you are and where from... Thanks and I see that you respond to every comment. That is remarkable. And your English is PERFECT... technical or otherwise 🙏🏽"}, {"text": "More videos please"}, {"text": "Subscribe"}, {"text": "Very fine!!<br />Respect....great work.<br />But to pretty to use😅"}, {"text": "Love ur video man..truly satisfaction..."}, {"text": "What was that steel bolt for? Did the whole blow torch attach to a hot bulb engine??"}, {"text": "price ?"}, {"text": "Guau perfect!!"}, {"text": "You appear to be missing a piece...the short bit of wick that goes in the tray below the head. It fits in the round bit pointing to the head , directing the flame to where it needs to be to ignite it. It&#39;s not meant for the entire try to catch fire, just that forward portion. Also, kind of curious as to why you didn&#39;t polish up the entire torch body, to match the new head and the prettily polished tank."}, {"text": "Nice work Sir."}, {"text": "Well done Sir! You&#39;ve earned my Sub. Keep&#39;em coming :)"}, {"text": "Excellent and thoroughly enjoyable."}, {"text": "Не знаю что за штука но прикольно."}, {"text": "better than the original at  beginning"}, {"text": "A fascinating and very informative video, nice machining and thank you for the tip on making a tool for manufacturing the leather pump washer."}, {"text": "Sounds like a V1"}, {"text": "proficiat kunstenaar"}, {"text": "wander"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m35s\">4:35</a> I swear that i wanted to eat this dough."}, {"text": "The vinegar removes zinc from brass a little.  This is why some of it was more copper colored on the top part.  Extended acid contact is a harsh treatment.  In this case the part is thick and pressure low but be careful with it on anything like pressure fittings or water fittings.  But in any case this is another amazing job."}, {"text": "❤️"}, {"text": "Beautiful work! I just started teaching myself how to do such work!"}, {"text": "Remedy for my soul this video"}, {"text": "Amazing"}, {"text": "You are a true Artisan and Craftsman, you do superb work and should be very proud of the results you get. When finished, your restorations belong in museums"}, {"text": "BEAUTIFUL !"}, {"text": "Bravo Bravo 😍😍😍😍😍😍✌❤❤❤❤"}, {"text": "Great skills! it&#39;s a pleasure to see your videos ;)"}, {"text": "When you do a restoration, it is worthy of being polished and shiny.  Too many “restoration” channels concentrate on the polish and shiny part and not enough on making it work better than new."}, {"text": "When you have every tool on the planet"}, {"text": "Watching you working with the lathe and making all kind of parts,one easily forget the precision measurements behind each part.<br />Your knowledge of craftsmanship is perfect as you demonstrated with the gasket.<br />You&#39;re a genious air, my respect."}, {"text": "De museo 😎😎😎😎👍🏻👍🏻👍🏻👍🏻👍🏻"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=08m04s\">08:04</a> &quot;I can&#39;t engrave&quot;...I&#39;m disappointed in you ;- haha<br />I&#39;m thinking TV for you....&quot;How It&#39;s Made&quot;,  to be redone as &quot;How It&#39;s Restored&quot;<br />Do you undertake commissions?"}, {"text": "This kind of work is why you have 19,000 subscribers in the space of a few months, I hope this is the beginning of something large on YouTube as you obviously have the skills, tooling and love for the projects you take one &amp; the way you film and edit the videos makes them all the more enjoyable.  By the way, it seems from the comments that the trolls haven&#39;t caught onto this channel yet. Makes the comments section all the nicer place to be &amp; long may it continue."}, {"text": "Easy, only took 18 minutes to repair."}, {"text": "wow that was chilling to watch operate and typically watching primitive tools is.  and yet beautiful in craftsmanship."}, {"text": "These videos are almost too good for youtube. Selecting the item to be restored, planning, research, all of the measurements, drawings, machine time, filming, editing. It’s remarkable."}, {"text": "nice to see your video,<br />greetings from indonesia<br />👍👍👍"}, {"text": "Love your videos"}, {"text": "I am coveting you workshop and your skill using your tools.  You know how to make the best of your toys."}, {"text": "Very nice work."}, {"text": "Thank you for setting it on fire :)"}, {"text": "روعه دقت العمل انك دقيق في كل شئ ........ ملاحظة كانه بودي ان تلبس القفاز.... انتضر المزيد متابع من 🇮🇶 👍👍🌺"}, {"text": "What a treat! Restoration taken to the next level. So tired of the polish and paint, call it good channels. This is where it&#39;s at."}, {"text": "Now that&#39;s what I would call a hot piece of work LoL(Cheers✨🍺🍺🍺🍺🍺🍺🍺🍺🍺✨👻🎃👻🎃👻🎃👻🎃👻)"}, {"text": "A * M * A * Z * I * N * G  the best 19 minutes of my day!"}, {"text": "Great Video."}, {"text": "Amazing"}, {"text": "I think you&#39;re missing the wick for the pilot"}, {"text": "Serious skills , and awesome machines you have to work with. Beautiful work and you set it on fire 🔥👏👏👍👍"}, {"text": "Simply amazing"}, {"text": "Was hast du für einen Maschinenpark bei dir zuhause? Der Wahnsinn Oo"}, {"text": "The existing work and the work you did (cleaning up and making new parts) are a work of mechanical art."}, {"text": "Прекрасная работа ! Этому гаджету необходима вторая жизнь ! Спасибо !<br />Вы художник !"}, {"text": "&quot;&quot; YOU ARE A GENIUS &quot;&quot;"}, {"text": "Stunning restoration 👍"}, {"text": "I love your work man this one is my favorite! I’m excited to see more restorations!"}, {"text": "Beautiful work."}, {"text": "Very good job ! Please more videos !"}, {"text": "Looks absolutely stunning"}, {"text": "That was an awesome renovation - came over from your friends site TysyTube Restoration - you guys do great videos! Thank you for sharing"}, {"text": "Artistry right there 👏🏻👏🏻"}, {"text": "This is the best restoration which i have seen on  Youtube, looks like a gangster gun🔫😍😱"}, {"text": "These are my favorite types of videos. I&#39;ve fallen asleep four times already to your videos mostly because its just so relaxing. You have all my support, keep looking forward to new vids. Thank you."}, {"text": "I liked it a lot, I think there were too many parts, and I think that having the opportunity to create new pieces It was incredible. good work I want to know already with which you will surprise us now.<br />Something that I really liked is the magic recipe that includes your video, I liked that you kept everything natural."}, {"text": "Klasse 👍🏻"}, {"text": "Mad fabricating skills. Some here wish they were you. The rest of us wish we owned your machinery. ;)"}, {"text": "Amazing!!!!!!"}, {"text": "Браво!! Классно!!"}, {"text": "Damn fine job!"}, {"text": "Looks like he took a mini gun apart at <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=3m55s\">3:55</a>"}, {"text": "your work is absoulutly stunning, i would love to see videos of you learning how to use different techniques like engraving. I feel it could also teach the viewers!!"}, {"text": "Before video it looks like it&#39;s last use didn&#39;t turn out very well"}, {"text": "Wow, I am truly impressed by the diversity of your skills. You, sir, have a subscriber! Nice work"}, {"text": "Очень круто брат"}, {"text": "I&#39;d hire you!"}, {"text": "You&#39;re such a genuine person I became you&#39;re fan )))"}, {"text": "Habe gerade deinen Kanal entdeckt, alle Videos angesehen, und direkt abonniert! Freue mich auf deine nächsten Projekte!!!"}, {"text": "Every second one of this type of video gets labelled &quot;beautiful&quot;, but this one truly is beautiful."}, {"text": "I fucking love your channel man<br />what a pleasure<br />you&#39;re like the engineering Jesus; <br />resurrecting that which deserves to live"}, {"text": "KKKK This thing is a bomb !!!!"}, {"text": "Wonderful work !! Very good indeed ( Brazil)"}, {"text": "One of the good things about your videos is that you show up closely, it helps to &quot;participate&quot; in the makeover.( Brazil)"}, {"text": "Заебись 👍🏼👍🏼👍🏼👍🏼👍🏼"}, {"text": "Больше видео это супер!!"}, {"text": "Perfect.<br />Awesome video"}, {"text": "Incredible workmanship. Just the right amount of commentary."}, {"text": "Очень круто. больше видео"}, {"text": "Great restoration jb. Thumbs up !"}, {"text": "As usual, GREAT GREAT work."}, {"text": "je suis sans voix l&#39;amour et la pérfection que vous mettez dans tout ce que vous touchez est sublime j&#39;aurai aimé etre votre disciple croyez moi bravo"}, {"text": "Hello @my mechanics<br />Can you please NEVER jump over the sandblasting part?(on projects where you use it) I think it would be great to watch. <br />Thank you."}, {"text": "Such a pleasure seeing you, a kind of relaxing. Nice one the vinegar and flour technique. You got a new sub!"}, {"text": "Some of the best restoration work I&#39;ve ever seen on YouTube!"}, {"text": "Some of you guys were asking the same questions in the comments, so i&#39;m gonna answer them right here. <br />Why didn&#39;t i polish the main part?<br />I wanted to keep that parts original cast structure. That&#39;s why i didn&#39;t sandblast, grind, wire brush or polish it. I also think it gives a nice contrast to the rest.<br />Thank you guys for all your support lately, i really do appreciate it."}, {"text": "Thanks. Interesting technique with the flour/vinegar. How can someone have so much talent?"}, {"text": "Anyone know the brand and model?"}, {"text": "Was there a reason why you didn&#39;t give much attention to the cast brass part? To keep a bit of it&#39;s original character? Love your videos mate!"}, {"text": "Master!"}, {"text": "Наше горела лучше"}, {"text": "That was awesome!"}, {"text": "Very nice, mate."}, {"text": "my mechanics<br />You are excellent! Can you restore something even older? Maybe something from the 1700s? Sometimes we see an old blunderbuss rifle for sale which is in very bad shape. That would be wonderful if you restore something like that, and then put it up for sale on eBay and for people here to buy it when it&#39;s done. :)"}, {"text": "As a 19 year old female, i will never do anything like this or even operate a blowtorch, but these videos are so pleasing to watch"}, {"text": "Incredible"}, {"text": "ABSOLUTELY BEAUTIFUL!!!!! I thoroughly enjoyed this vid."}, {"text": "It looks beautiful.<br />although, I think you might be missing a wick in the &quot;spout&quot; on the igniter tray and use a heavier fuel (like parafin oil), so that you get a &quot;glowing&quot; ember on its end (rather than a raging bowl of fire) to light the torch off."}, {"text": "Genioooo"}, {"text": "Видео в хорошем качестве! Спасибо!"}, {"text": "Very nice and thank you"}, {"text": "Great Job!!  Congratulations! A lot of attention to details <br />I loved the way you arranged all the parts in that 3d exploded view over the table!! Will try that cleaning paste, Thanks for the tip!"}, {"text": "¡¡Impecable!! Saludos desde Argentina."}, {"text": "Incredibly cool, well at least for a blowtorch.."}, {"text": "looks amazing. love your work"}, {"text": "I did not understand why he didn&#39;t restore/ paint the neck but I realized that it would be pointless since that part catches fire lol"}, {"text": "I think this the best resto channel on YouTube (and I watch a lot of them) subbed."}, {"text": "It;s blowtorch REMAKE!"}, {"text": "Was fascinating to watch this restoration"}, {"text": "Excellent work. Thanks for sharing."}, {"text": "🔥Bang up job!🔥 Looks great!!!"}, {"text": "Love your videos,it,s so satisfying to watch these old tools getting refurbished . Mad skills too."}, {"text": "Dude, i am amazed. Your skills are awesome. And endurance. SUBSCRIBED"}, {"text": "Heh, this thing looks like mini gun!"}, {"text": "next lvl asmr"}, {"text": "Awesome :D not only you restore it to its former glory, but also show that it actually works like it was meant to :D! Will subscribe and wait for more videos !"}, {"text": "Impeccable restoration!"}, {"text": "That was just impressive that like proper skill mate love watching someone who makes stuff look easy when it&#39;s not good job mate"}, {"text": "Such a fine restoration.....and just in time for the end of the WWI Centennial.  It looks almost as though it belonged on the battlefield.  Interesting technique for recreating the leather packing, but I missed your technique for preserving all that lovely?, shining brass...."}, {"text": "Is it wrong to say that I love you"}, {"text": "Love the exploded diagram shot prior to assembly"}, {"text": "I love it"}, {"text": "Quality work and attention to detail. I like it!"}, {"text": "Liked, commented, and subscribed. Totes crushing on your methodology and skills. And your workshop. It looks like nirvana in there."}, {"text": "Wie das Messing glänzt nach dem Polieren. Gut investierte 19 Minuten, danke dafür! Top Arbeit."}, {"text": "Grüß Sie.Could you pls indicate the proportions of a anti-rust mixture. ( Don t think that I m  lazy. I google it.)"}, {"text": "amazing job 👍👍👍👍"}, {"text": "3 euro if you like to sell it to me any time you can call me or email me"}, {"text": "Superbe travail de restauration j&#39;adore les détails bravo."}, {"text": "I hope you keep it under glass or give it to a museum."}, {"text": "Man just how people used to build these things in the old days !? With what tools? Engineers..."}, {"text": "holy shit this is the best resto vid I&#39;ve seen on here so far, we got lathe work, buffer wheel, filing/sanding. you got it all man!"}, {"text": "This is a really relaxing Video, I like it nice work."}, {"text": "Hay is that really gold"}, {"text": "جالب بود .....تشکر.. <br />Tank"}, {"text": "thanks"}, {"text": "Great job ;)"}, {"text": "Perfect!!! Every honor for patient and skills to do nice job also video with this restoration."}, {"text": "Is it wrong that I have an erection?"}, {"text": "Wow. You should be proud. Amazing detail"}, {"text": "Very <a href=\"http://impressive.how/\">Impressive.How</a> you replaced the damaged parts in their mirror image."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=7m32s\">7:32</a> was that asbestos?"}, {"text": "May I ask why you left the grip not to the sane standard of the other parts . I know nothing about tools by the way I just restorations"}, {"text": "Clever little chap aren’t you lol . Fantastic restoration mate !"}, {"text": "Like AVE - hands only - but no voice.... good vid! 🤓👍👨‍🔧🍾🏅🏅🔧🔧🔧⛏🛠🇨🇭"}, {"text": "Que buen trabajo, eso es puro talento."}, {"text": "So glad we have gas burnets nowadays. But a remarkable restoration. I like the way you film and edit the proces."}, {"text": "👍🏻"}, {"text": "More videos please 👏"}, {"text": "The tool is a soldering iron. There has been a hammer-like copper head on a steel shank earlier.<br />The shank was held in place, adjustable, by the screw you decided to make anew. Good work!"}, {"text": "Impressive workshop! I like your precision too."}, {"text": "Amazing work! Love watching you restoring these old items and looking forward to your next video!"}, {"text": "Отрезной резец!!! Нееее,не слышал)))"}, {"text": "bist du ein Verarbeiter?"}, {"text": "Fantastic. You are taking off, on various levels. Congrats on that. <br />You have expressed wanting to do more with youtube, I think that &quot;essential craftsman&quot; is a beautifull example of an proffesional craftsman channel.<br />Have a great journey!"}, {"text": "For to warm need use alchohol."}, {"text": "Guys, I had to watch it again. Y&#39;all did an amazing job!!! &quot;Skills&quot; folks &quot;Skills&quot;!!!!!!"}, {"text": "A lovely job of restoration on a worthy tool.  The formation of the leather pressure cup was one I had not used but will from now on.  Subscribed to your channel because of the quality of your work."}, {"text": "To many parts replaced try and fix them keep it as original as possible so what it takes longer we don&#39;t mind yes it&#39;s more work but thats what makes it good to watch take pride in the fact that you can repair a part and not just through a new one on you dont want to be like that tool rescue channel"}, {"text": "Having some queries on How to weld/Braze bronze wire together without affecting their natural color, can you give some insights."}, {"text": "Beautiful! Marvelous job that was so inspiring, I want a shop now!"}, {"text": "not doing the cast bits , or the copper bowl really let this project down. you should rethink that choice ."}, {"text": "Do AK47 restoration.<br /><a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=4m55s\">4:55</a> eargasm..."}, {"text": "Well done! Nice work 😃"}, {"text": "This guy seriously knows his shit, take me as your apprentice oh master!"}, {"text": "I am in awe."}, {"text": "Nice! came out great ! <br />u have some skills"}, {"text": "Excellent video. Why use the hacksaw in the lathe instead of a cutoff tool?"}, {"text": "Wow. That was great. No wick for the ignition burner though? That piece of tubing looks like it would hold one."}, {"text": "I thought it would light up like a BernzOmatic but great resto anyways."}, {"text": "Looks awesome"}, {"text": "Why you don&#39;t pulled the body?"}, {"text": "It&#39;s curious, how mesmerising it is to watch someone work with such skill and care that time seems to fly by! Machining the new cone was a joy to watch. Superb video and bravo on the finished article!"}, {"text": "I&#39;m thrilled. Watching this video was so much fun - unbelievable enthusiasm, skills and endurance. Stunning result. Thanks a lot for showing us this master piece of restauration."}, {"text": "Круто! Отличная токарная работа!"}, {"text": "Superb 🥃🥃👍👍"}, {"text": "One of the best 20 minutes on YouTube. Soul food"}, {"text": "Really impressive craftsmanship, my hats of to you"}, {"text": "Great work, amazing patience. Just a question, why didn&#39;t you polish the main housing of the blowtorch?"}, {"text": "muy bueno"}, {"text": "respect!! i really enjoyed watching your amazing work bro, this kind of content should be recommended to all youtube viewers!!"}, {"text": "Looks great and great job restoring it as well"}, {"text": "Parabéns."}, {"text": "Keren cantik banget"}, {"text": "I watched this twice in a row. Just like a good movie you want to see details you didn&#39;t pick up before. Your mechanical knowledge is amazing. Loved this video.<br />Would love to see you get a television show of your own."}, {"text": "...первый раз вижу такую конструкцию паяльной лампы, а за реставрацию старины/ респект😉..!"}, {"text": "Excellent restoration. <br />Very professional. <br />Greetings from Argentina. 👍👏👏"}, {"text": "it went from a cheap neglected BIC lighter to a flamethrower... even though it&#39;s just a metal water gun with essentially a lit match stuck on the end, it&#39;s powerful AF."}, {"text": "Beautiful restoration"}, {"text": "I think I&#39;ll just sit here with my popcorn and wait for the Patina Police to issue a citation.<br />FTS, my respect on an excellent job."}, {"text": "you are an artist"}, {"text": "Great work!"}, {"text": "THAT is what i call a real &quot;restoration&quot;. You got the spirit, my friend. Completely at the opposite of the crap made in the recent &quot;Restore it&quot; video (&quot;100+ Year Old Rusty Joseph Lucas bicycle Carbide Lamp Restoration&quot; which made me cry in front of such a sacrifice on the hostel of Amateurism, have a look and prepare your kleenex)"}, {"text": "nice shop..great projects..and you know what you are doing with out acting like a jerk..great editing..your site will grow!"}, {"text": "Awesome!!!!!!"}, {"text": "I’d be willing to bet that torch wasn’t that nice looking when it was bought off the shelf! Beautiful work!"}, {"text": "The wick and the wire birds nest would have done me in for sure, I don&#39;t know how you managed to get all that back in there. It almost looked too nice, it was good to see you light it up at least once."}, {"text": "Wasn&#39;t Oerlikon the first company in Switzerland to make electric motors?"}, {"text": "Good job!"}, {"text": "Looks amazing, great job"}, {"text": "Great job!!"}, {"text": "It is so beautiful, it brings a tear to my eye."}, {"text": "Gute Arbeit! Ein kleiner Verbesserungsvorschlag zu deinen Videos: Es wär interessant zu wissen was du in den einzelnen Schnitten denkst/sagen/machen willst/etc. Aber nicht vertont, oder als Untertitel im Video direkt, sondern es reicht wenn du die Youtube-Untertitel dazu benutzt, sodass diejenigen die sich dafür interessieren, es einschalten können.<br /><br />So ersparst du dir den Text in der Videobeschreibung und mehr Leute werden es sehen. bzw. diejenigen die nicht auf dem PC gucken, sondern im Vollbild, oder TV, können es dann auch lesen.<br /><br />Ein Beispiel: <a href=\"https://www.youtube.com/watch?v=VVV4xeWBIxE\">https://www.youtube.com/watch?v=VVV4xeWBIxE</a> <br />Primitive Technologys Untertitel. <br /><br />Keep up the good work!"}, {"text": "You&#39;re just as talented as a storyteller as you are a craftsman. These videos are extremely well made, and really show the viewers how passionate you are about these projects."}, {"text": "Blowtorch of Theseus."}, {"text": "That looks awesome. New sub here for sure!"}, {"text": "Beautiful machine work especially on the brass nozzle."}, {"text": "I honestly would have left the patina but i’m so happy that you made new parts for it ! You gave it new life!"}, {"text": "The term &quot;craftsman&quot; doesn&#39;t do you justice. I&#39;m fascinated by your talent, patience and expertise. It&#39;s a pleasure watching your videos and seeing the end result of your labors."}, {"text": "Beautifull work!!. Amazing! Excelent handmade brass cone. Master!!. Where are you from dear friend?. Congratullations. Saludos from Uruguay!"}, {"text": "where the hell did you learn how to do all this ?<br />really interesting to know"}, {"text": "I love the way that brass takes a polish!"}, {"text": "Wow !"}, {"text": "Many years ago, I bought a gas &quot;jet engine&quot; that ran on white gas. The thruster section, a empty CO2 bottle with a removable brass gas jet at the rear of the capsule was loaded with white gas. Just like your torch there was a gas prompter dish which was loaded with a wick soaked in white gas which was clipped onto the CO2 bottle with stiff wire that held it below the CO2 bottle. The &quot;jet engine&quot; was suspended from a string.  The prompter dish was lit which heated the gas in the CO2 bottle causing it to get hot, ignite and cause the bottle to spin. It was sold as a model engine, but was never installed on any of my model airplanes."}, {"text": "To make it complete you need to get wick material that fits into the up tube portion of the  start up pan on the bottom, and only enough to pull the small amount of fuel you place into the pan (just enough the soak the wick and not completely flood the pan) so it directs the flame up to the torch tip and does not send flame up at the valve assembly section from the main pan, that is what is causing the sputtering and unstable flame, too much heat in the rear valve assembly area."}, {"text": "Thank you for another beautifully done restoration!  It is a shame one person has so much talent..... :&lt;)."}, {"text": "Brilliant method on creating and forming that leather gasket."}, {"text": "You got skills."}, {"text": "That looks amazing, fantastic work!<br />Looks like you didn&#39;t go cheap either. That&#39;s a big piece of brass you used for the front part :)"}, {"text": "It&#39;s rare that someone impresses me, you do! Keep up the good work. Just please show the restored piece in action in more detail next time!"}, {"text": "A mistura que você faz com farinha vinagre e sal pode ser substituída por catchup. Falo em portuguese"}, {"text": "You&#39;re so good at this! It looks amazing, splendid work!"}, {"text": "Nice"}, {"text": "Another great video, cant wait for the next one. keep it up 👍"}, {"text": "Wow! You delivered! Amazing attention to detail and finish! <br /><br />And that fire! Truly impressive. Keep that up!<br /><br />What was it you were brushing on the threads during assembly?"}, {"text": "Very nice. Nice attention to details. Very well done."}, {"text": "Wow such a quality work, well done sir, I subbed! :D"}, {"text": "Awesome job. Im pretty sure the small pan is supposed to have a wick."}, {"text": "AHUENNA!!!)))"}, {"text": "Shouldn&#39;t there be some sort of lid on the ignition chamber? It seems pretty wildly burning."}, {"text": "parabens."}, {"text": "wow so satisfied"}, {"text": "super Токарь, фрезеровщик, реставратор в одном лице."}, {"text": "Super travail bravo 👍"}, {"text": "This was amazing. Really well done!"}, {"text": "9k subscribers! Dude, I haven&#39;t watched your videos for a while and when I&#39;m back you have 9k subs?! Amazing news man, I&#39;m gonna have to check your newest videos tonight! Congrats on such successful channel!"}, {"text": "Awesome!"}, {"text": "This clip really captivated all my senses. Thank for the entertainment."}, {"text": "Careful man!... Asbestos is dangerous, be sure you have proper PPE. ok?"}, {"text": "Awesome restoration 👍👍<br />Waiting for the next one !!"}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=1m50s\">1:50</a> - lol XD!<br /><br /><b>MECH, Thank You!</b>"}, {"text": "I’ve watched a few of your videos, and I have to say, your attention to detail is unparalleled. Brilliant job and fascinating, as always."}, {"text": "Amazing work!"}, {"text": "👍Nice job 😊🐞"}, {"text": "I love your attention to detail, and the obvious joy in taking stuff apart and making it pretty again. <br />Just a question: Why didn&#39;t you polish the middle part?"}, {"text": "Simpry mahvuhruss"}, {"text": "Very nice work! Where did you get all the skills? Learned a lot about gasget making!"}, {"text": "Trés bon travail de restauration et de fabrication de nouvelles pièces de remplacement !<br />hâte de voir les prochaines vidéo."}, {"text": "Veri Nais"}, {"text": "Quite a work of art and machining!!"}, {"text": "Just the math required to calululate the number of grooves and distance between them on the duro plastic handle would stump me lol. Amazing job, it looks awesome and is a great item to find and restore!  Also fire! 🔥"}, {"text": "Make more videos please. Amazing work"}, {"text": "Looks like a ww1 machine gun"}, {"text": "Does this make anyone else want to go out and get a lathe just because?"}, {"text": "Supera restoration."}, {"text": "REALLY AMAZING. Nice working."}, {"text": "Netter Zigarettenanzünder! Ja, wirklich zu schön, um es zu benutzen."}, {"text": "Bravo, beautiful detail work!!!"}, {"text": "Its awesome to see how these old pieces were built back in the day, and great to see you breathe new live back into them."}, {"text": "Nice video! I think it would be interesting to know what you do with the piece after restoration. It would also be interesting to see how much it cost you to restore or even purchase the initial piece."}, {"text": "You are a pro."}, {"text": "Perfeito!!!"}, {"text": "Man you are so capable. It amazes me how you &quot;re-make&quot; things!<br />Just wondering, are you from Germany?"}, {"text": "WoW, This took the meaning of Restoration to an entire new level! Beautiful work!"}, {"text": "keep your fingers dirty so that we can watch new videos"}, {"text": "Very impressive!!"}, {"text": "Looking forward to your next video. Thanx for that great rust removal tip 😍"}, {"text": "Work of art ❤"}, {"text": "Another great job.Keep them coming.Big fan."}, {"text": "restoration on a different level  11/10 excellent"}, {"text": "really good job. nailed it as like before"}, {"text": "eher ein Neubau, als eine Restauration, echt super gemacht. Grüße aus Deutschland ;)"}, {"text": "Bravo. Well done!"}, {"text": "Elon Musk be like &quot;sick flamethrower bro&quot;"}, {"text": "👏👏👏👏 quality work Van,well done"}, {"text": "Amazing work..... thanks you"}, {"text": "Very nice job !"}, {"text": "Beautifully done! A culture saver. =)"}, {"text": "Another great video. Awesome detail"}, {"text": "My God that thing would work better as a flamethrower vs a blow torch."}, {"text": "Superbe restauration"}, {"text": "Damn good restoration.  However, your videos are always very well filmed and edited."}, {"text": "You trust your hands around the lathe chuck a lot more than I do.  I remember being in the shop while my teacher used a file that close to his 4 jaw, it snagged, stuck between two of the jaws and ripped his wedding ring off his hand.  Finger skin included.  Ended up cutting two tendons as well as the file came around again"}, {"text": "Well done my friend! I am now officially jealous of your talent! You know though----if anyone was to smoke around you, well----what a Hellava lighter you now have!lol! looking forward to next video!"}, {"text": "Oh to have proper tools. Bolts knackered I will make a new one.... No I&#39;m not jealous just saying... :-P"}, {"text": "Show!  :)  \\o/"}, {"text": "I think the lower reservoir (for lighting the main torch) is meant to have a wick, that way you can get a small flame off of the wick rather than a large flame that just sort of goes everywhere."}, {"text": "Yo know wat I like IT"}, {"text": "👍😉👏👏👏"}, {"text": "WHAT MAKE GOOD GASKET AND BOLT HOLE CUTTERS ARE OLD/CHEAP  DEEP WELL SOCKETS"}, {"text": "I never knew cookie dough worked so well at removing rust!"}, {"text": "Impressive restoration."}, {"text": "<a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=5m49s\">5:49</a>, &quot;Too much damage to restore...I make a new one&quot; <a href=\"https://www.youtube.com/watch?v=9oWOu7tTBxo&amp;t=18m11s\">18:11</a> &quot;It&#39;s too beautiful to set on fire again!!.....Whatever&quot; Not sure if you intended on these captions to be comedic but the timing for me made me laugh. Also if these little quips are your personality or sense of humor I look forward to more of them. And as always impressive machining skills, especially refabricating those parts and bolts."}, {"text": "What an interesting  way of removing batena never seen anything like that ,but isn&#39;t 7 days is too long ? Is there a faster methods ?"}, {"text": "Jako vždy moc hezke video :)"}, {"text": "本体をもっとキレイに磨いても良かったかな。"}, {"text": "that is fn stellar bro!! the effort you put in to that is outstanding"}, {"text": "excellent video; great work!"}, {"text": "Awesome restoration mate!"}, {"text": "Shao Kahn voice outstanding :p"}, {"text": "VERY nice sir :)."}, {"text": "ok , very nice resto in all but the Lathe work is awesome !!"}, {"text": "Супер!"}, {"text": "Incrível, poderia por legenda em português?🇧🇷"}, {"text": "Once again, Great Job!"}, {"text": "Also also wik!"}, {"text": "Once again, I enjoyed watching your restoration video. I especially liked the way that you showcased each piece as it came apart. Looking forward to the next one. Notifications on!"}, {"text": "Hermoso 👏👏"}, {"text": "Felicitaciones, que belleza de trabajo, saludos!!!!!!!"}, {"text": "Çok güzel olmuş."}, {"text": "Great channel, wonderful job on the restoration."}, {"text": "amazing work! and what a shop you have! welding back in the day was hardcore"}, {"text": "Very nice restoration. That torch is pretty badass!"}, {"text": "Insane work!"}, {"text": "That came out beautiful. What an awesome blow torch."}, {"text": "Nicely done! Good blend of keeping the original parts and making the new ones beyond saving."}, {"text": "Very nice."}, {"text": "Such an awesome restore! I restore Coleman lanterns as a hobby and can fully appreciate the workmanship and fine details involved. Wish I can own/operate a lathe like yours! Another masterpiece sir!"}, {"text": "Wow that&#39;s an absolute beast of a blowtorch! Nice resto! 👍"}]