[{"text": "Meanwhile I’m on my at least 15 year old ass tv"}, {"text": "Anyone buying the best only to parry lights in For honor"}, {"text": "After seeing this i think 50 inch tv will not be enough for me"}, {"text": "Whoa!!!! :-) :-) Demitri I am so grateful for this is HUGE for us wedding photographers and videographers in the areas of pre sales, after sales,  and during the bridal dinner. WOW WOW WOW!! The possibilities are endless PLUS how about editing with Premiere Pro...OMG !!! Keep up the Super duper great work. I love your videos!!! Five stars on this bro!!!! :-) :-)"}, {"text": "Man 42-55 inch look small"}, {"text": "Stop showing too much of yourself and start showing the TV"}, {"text": "Peter Quil makes YouTube videos???? Kudos for the editing on that intro!! Good video bro"}, {"text": "I was impressed of it until <a href=\"https://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m54s\">0:54</a> ... what that heck is that wabbling there? o.O"}, {"text": "Narrators voice is different from the actors ._."}, {"text": "So you were gaming 1080p on a 4k tv?<br /><br /><br />To present lower-resolution material on a 4k TV, the TV has to perform a process called upscaling. This process increases the pixel count of a lower-resolution image, allowing a picture meant for a screen with fewer pixels to fit a screen with many more. It’s important to remember that since the amount of information in the signal doesn’t change, there won’t be more detail present."}, {"text": "You call that gaming? Real gaming is virtual reality.<br /><br />See Ready Player One. Millennials . 😒"}, {"text": "U look like starlord"}, {"text": "Is a 65 inch tv big enough to sit a good deal back."}, {"text": "You call the nvidia shield a tv. Lol"}, {"text": "освещение в этом видео просто фантастическое"}, {"text": "I saw the intro and.....<br /><br /><br /><br /><br /><br /><br />RIP NCIX"}, {"text": "Unsatisfied by this video... More needs to explored about PC couch gaming"}, {"text": "It&#39;s incredible how Samsung kills the market. My god mine kills all other brands hands down. When that uhd is enabled it&#39;s almost 3d"}, {"text": "<a href=\"https://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=4m40s\">4:40</a> when you spent your last penny on a sweet tv and hold it up with stools you found in your neighbor&#39;s trash."}, {"text": "I got a 75 inch Samsung 4k hdtv"}, {"text": "Hi there! would you be kind to tell me what music you used for the intro? the first 1 minute? Thank you! :)"}, {"text": "is this hdr support?"}, {"text": "70&quot; ultra hd 4k tv SO GOOD TO PLAY GAMES ON it&#39;s samsung"}, {"text": "Please watch my review videos and subscribe. I&#39;m sure you will definitely like it. I need support of Awesome subscribers like you."}, {"text": "TARA LILA ROSE<br /> 👍💘💘💘💘👍<br />WENDELL L. GARCIA"}, {"text": "I didn&#39;t know Chris Pratt had a YouTube channel"}, {"text": "Viewing 65 inch LCD TV<br />7161"}, {"text": "NOT 4K. UHD IS NOT THE SAME THING AS 4K. JUST LIKE 1080P IS NOT 2K."}, {"text": "No more Samsung tv any more"}, {"text": "I have a Philips one and my God it&#39;s bigger in person"}, {"text": "King&#39;s Smith theme music <a href=\"https://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m07s\">0:07</a>"}, {"text": "I was confused when i saw the ncix ad then remember it was a video from 2015"}, {"text": "Lol u succ I have 70 inch"}, {"text": "Is this thing better than a girlfriend?"}, {"text": "4k tv on 37 dollar table.37!!!!"}, {"text": "Song is creepy"}, {"text": "Here&#39;s another one for a quicker million subs. cool content"}, {"text": "2018 GAMERS BE LIKE WHY DONT WE USE A T.V. INSTEAD OF 24 INCH MONITOR 😎"}, {"text": "NCIX is DOODOO"}, {"text": "Starlord?"}, {"text": "He kinda look like Chris Pratt"}, {"text": "&quot;I will not be playing first person shooter with a controller&quot; same old speech"}, {"text": "Why am I watching this? I already have a 60&quot; 4K tv"}, {"text": "How can I game on this without any chroma RGB"}, {"text": "Recently just got a Samsung 55&quot; qled TV for my computer."}, {"text": "What is your gaming consule"}, {"text": "Can buy a 65 inch 4k tv, cant afford to buy a decent stand for it"}, {"text": "Star lord is that you"}, {"text": "do a collab with linus tech tips"}, {"text": "Cmon man. I’ve been doing this since 2003. First on a 50” Sony HD TV. Now on 65” Sony 4K Android tv that is wall mounted on sharp angle facing down so I can recline and play in my media theatre."}, {"text": "Lol, s*xty-five inches...<br />WHY DID YOU BLEEP ME?!?"}, {"text": "I game in a 65 inch 4k built-in home theatre speaker. And a funny thing was I used a ps4 on it . But still getting a Xbox one x"}, {"text": "Imagine FIFA on this bitch😭😭"}, {"text": "If i but this one then i will have to shoot my own videos to support it...waste"}, {"text": "Here in 2018 with a 70&quot; 4K TV :D"}, {"text": "what racing game was that"}, {"text": "You know 120hz 4k hdr is possible when doing this"}, {"text": "I’m getting a Samsung 65’ 2018 4K tv with a surround sound system today. I think I’m gonna cry! I’m only 19! I feel like I’ve achieved something. :,)"}, {"text": "Rip ncix. f to pay respects."}, {"text": "On curved 4K 40 inches TV is real feeling for gaming . But most realistic feeling is Virtual Reality !!! I&#39;m still satisfied with my 32 inches LG TV Full HD , FX 8350 , 16GB 1866 Kingston , Gigabyte GTX 960 4GB , WD Caviar Blue 2TB !"}, {"text": "RIP NCIX<br />F"}, {"text": "Kerbal space program"}, {"text": "R.I.P NCIX"}, {"text": "A month after buying a 34&quot; Ultrawide monitor (that I loved), I hooked up my 65&quot; TV. I&#39;ve not used the Ultrawide since and that was a year ago. 4k Gaming is awesome."}, {"text": "i got the same TV bro"}, {"text": "60 hrz....hard passss"}, {"text": "still cant marvel over a tv after being into projectors...led in fact ...i dont deal with bulbs anymore...tvs are a better small form option but the loss in brightness if worth it when im watching at 90 inches"}, {"text": "My friend bought the most expensive tv at bestbuy, I cant remember if it was $5000 or $10,000 but it was the biggest piece of shit compared to my benq xl2411 when it came to gaming, never been so disgusted."}, {"text": "Cool stuff bro. I&#39;m happy with my 55&quot; 4K HDR tv :)"}, {"text": "Sennheiser HD800&#39;s FTW."}, {"text": "So Dimetry yours is 65&quot;?"}, {"text": "Is it me or this guy looks exactly like Chris pratt ?!!"}, {"text": "This is good to make home cinema , but for gaming some 32 inch ASUS anti-glare monitor is the best solution."}, {"text": "What type of joypad is that"}, {"text": "I dont use a curved tv but do game on a 4k 65 inch vizio and its awesome. using a stryx 1080 in the living room and love it. THere are no stutters and the resolution is great. I couldn&#39;t care less about fps but its always smooth and clear. gameplay is amazing. If you think you need a 600 dollar to 1500 dollar monitor to game well you&#39;re missing out on something great. try it... you&#39;ll never go back to that small monitor unless your just an fps nut that thinks you need 300 fps to have clarity when 60 fps is all your eyes need in fact 30 fps is what your eyes actually see. The rest is just for ego lol. And no I&#39;m not a nubie I&#39;ve been building systems since the 80&#39;s how &#39;bout you? If you never had or used an IBM P.C. Junior with cartridge drive or a Commodore 64 with tape drive and daisy wheel printing you might be a newbie. If you&#39;ve never used DOS 1.0 lol you might be a newbie and if you&#39;ve never spent a week writing code on a Commodore just to get a stick man bouncing a basketball across you&#39;re screen you might be a newbie lol... yes I&#39;ve don&#39;t all in the 80&#39;s when a80286 was awesome advancement in technology and your system loaded in under 10 minutes.  If you&#39;re first 3d game wasn&#39;t Wolfenstein and then duke 3d you are definitely a nubie...... lol<br />fyi a movie at the theatre on film runs at 30 fps... why? cuz thats what eyes see lol...."}, {"text": "We have the 55inch version :D"}, {"text": "Where.. where have I heard this music that plays in the intro?"}, {"text": "Hey, now that I realize it. You look like Chris Pratt."}, {"text": "I game on a 65” Samsung KS9000. Have zero issues with input lag for both PC and console gaming. 1440p is what prefer, but just wanted to chime in. Tons of false flag bullshit comments about input lag on this vid. Some of us don’t want to sit in a computer chair as we age..."}, {"text": "Input lag on TV kills"}, {"text": "Had to pause the video to make sure Kerbal Space Program wasn&#39;t running."}, {"text": "Giving away my xbox one x project scorpio, check my channel out for details"}, {"text": "Y u no have hb sli huh?"}, {"text": "too expensive"}, {"text": "*Cries in 768p"}, {"text": "You call that thin?"}, {"text": "Shooter games look shit on above 32inch TV.. And above 24 inch monitor.."}, {"text": "this is just an advertisement you shill"}, {"text": "you lool like iron fist"}, {"text": "How long you have had that same wallpaper background on your computer? :D"}, {"text": "U look like brad pitt"}, {"text": "Anything and everything Samsung is shit, I had so many Samsung products in the past with phones, tv, blue ray, speakers and had more than 1 of each and all of them broke down on me every single one, I bought Samsung because it was cheaper compare to say lg or apple phones etc, I guess you only get what you paid for. I bought proper brands in all those I mentioned and still going strong many years later and guess what? I only bought one product of each item unlike Samsung with multiple times and my tv, blue ray, iPhone etc still going strong with no hassle. Samsung brand is shit, that&#39;s why is cheaper compare to all other products that is in high quality. It is rubbish, it&#39;s good at first then problems arise after a year of use."}, {"text": "I have same tv"}, {"text": "I have a Panasonic 65 inches late tv 4k hd 3d glasses"}, {"text": "That looks a lil small for a 65 inch"}, {"text": "What is the rally game?"}, {"text": "Wtf ? Get an actual console"}, {"text": "There&#39;s no other TV better than Samsung"}, {"text": "Star Lord?"}, {"text": "Iron Fist is it that you?"}, {"text": "yeah right, my gaming screen in the living room is 72&quot;  4k, and 65&quot; 4k and 5 minutes into it you might as well be playing a 32&quot;..thats the truth, you get used to it, now going smaller is how you get really good at gaming, its true, people used to playing on smaller screens are have an advantage, look it up but its like I an lay in bed and watch a movie on an iPhone  and get into it just fine, then switch to my tablet which is much bigger an it feels no different, same with the tv,  I can get into a movie on the iPhone just as well as on the 72&quot;"}, {"text": "UGH THE CRINGE"}, {"text": "money machine broke"}, {"text": "£1,479.56 in amazon, going to have to wait abit, lol"}, {"text": "input lag<br />i can tell by comparing the controller movement to the tv movement"}, {"text": "Why do they use the one connect?  Seems like it would increase input lag compared to the HDMI connection onboard the TV?"}, {"text": "Who plays game on a Samsung TV.... Sony or Panasonic."}, {"text": "my god"}, {"text": "size of the screen is relative to view distance. sitting at a desk (with m&amp;kb) and using a 27&quot; is good enough. or 34&quot; at a desk would like a movie theater"}, {"text": "if you can feel the input lag, it must be really really bad. I used to to use a 40&quot; 4k tv for gaming and always wondered why I was so slow....then I got a 1ms response monitor and wow the difference. never again gaming on a tv."}, {"text": "What about the 65 1080&#39;s lmao?"}, {"text": "is it just me or he looks like chris pratt"}, {"text": "&quot;The hub&quot; (;"}, {"text": "What does one do with the i/o box if the TV is wall mounted? Is there some way to hang or connect it on the back of the TV? Which raises the question... Why not have at least one damn hdmi on the TV..."}, {"text": "So you can afford a 65&quot; tv and $200 Nvida shield media player, but you&#39;ve placed the tv on 3 stools that probably  cost $10 each. This is all ass backwards lol"}, {"text": "Lol this guy looks like iron fist"}, {"text": "how much in 2017 lol"}, {"text": "Send me a ps4"}, {"text": "kinda priceless when you got a 65inch tv and you have to buy 3 more chairs to support it ....... :D"}, {"text": "Racing game name?"}, {"text": "that glare..."}, {"text": "hahha watching this in 2017 look at the tv&#39;s now"}, {"text": "tv is not préférable fir gamming pc, 4k monitor is better at 144hz"}, {"text": "okay so 5 more years  before i&#39;ll jump on the 4K  hype train.  :D<br />too expensive  for just beautiful picture.     so far 1080p  still serves me good for the price it currently is at.<br /><br />4K screen + 4K @60fps  GPU = too expensive :p"}, {"text": "cough.....chris pratt....cough"}, {"text": "Just bought 2x 4k UHD samsung tv´s for my new pc build :) Can´t wait till i go get them tommorow haha.. It´s gonna be like i am inside the games myself!"}, {"text": "Lol. That is NOT a big tv. I&#39;ve got 130&quot; screen with Barco laser projector (native 4k&amp; Hdr). This is lame. This is not real 4k tv. Only uhd resolution."}, {"text": "Alguém do Brasil assistindo??"}, {"text": "New Samsung TV (2017 model), has 4K UHD, 120HZ and 50 INCHES for 600$ new! It&#39;s crazy good"}, {"text": "This guys looks like Chris Prat somewhere.. or is it just me?"}, {"text": "How about gaming at 1080p at 120hz..since the upscaling is pretty good and the 120hz would mean no lag..TIA."}, {"text": "Curved TVs are called OLED"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m57s\">0:57</a> boi ur laugh had me dead XD"}, {"text": "What game was that rally one? I&#39;m not into racing games but that one looks pretty good. Is it Dirt?"}, {"text": "Beastly setup brother 🤓"}, {"text": "Why did you bleep me?!"}, {"text": "The only games I play on TV are single player games like batman, witcher, skyrim, and gta."}, {"text": "Plz MAKE A NEW 4K TV AS MONITOR UPDATE SOON !!!"}, {"text": "&gt;buys 65 inch TV<br />&gt; &quot; i won&#39;t be playing any fps game&quot; <br /> so what&#39;s the thing with high resolution and high graphics , believe it or not you will get bored after spending a bit of  time with that 65inch, So you&#39;ll leave it aside to play fancy graphic games like gta5 etc. ,Input lag on TVs is the biggest problem for gamers ,especially fps gamers. You will only be able to play free-roam games with that huge tv. That makes no sense.<br />Anyway,<br />I would play Skyrim on that."}, {"text": "Я даже не ожидал, что ты Дмитрий."}, {"text": "wow, gaming in 4K res. Super Awesome...."}, {"text": "Someone pass me a bucket. I hate adverts that look like a Kids&#39; Drama Group made them.."}, {"text": "ksp music"}, {"text": "did he use ps4 pro???"}, {"text": "turn on gaming mode.. dude"}, {"text": "Should gamer bring they PC to testing session ;p"}, {"text": "samsung tvs suck don&#39;t compete with Sony"}, {"text": "its all fun until you get a toddler in the living room... that&#39;s when you realize, a 1K TV is more than enough for the living room"}, {"text": "What is the game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m15s\">7:15</a>"}, {"text": "Not even OLED. Not impressive."}, {"text": "still on 22 inch 1080p"}, {"text": "I like how you used ksp space music in the beginning"}, {"text": "Ad made by 14yr old Media Students perhaps?"}, {"text": "is it just me, or does this still not feel big enough? Like, I want a huge tv. I want to fill up a wall, anyone else agree?"}, {"text": "dont like the reflection , would annoy the fuck outta me"}, {"text": "Just bought the 2016 model of this TV for our new pad. Suggestions for first movie to break in this bad boy are welcome. :)"}, {"text": "Switch to WinSCP already. Filezilla is shit."}, {"text": "Hi, model number please?"}, {"text": "you sure have a sense of how to enjoy life.........!!!! Enjoy......."}, {"text": "What a fcking gay ass ugly intro"}, {"text": "I have the same tv but mine is 75 inch"}, {"text": "Man that pixel density is SOOOOO shityyyy...... 67,78 ppi meawhyle a 1080p 27&#39;&#39; monitor has a 81,59 ppp.<br />But if you realy want a nice experience try 4k 27&#39;&#39; monitor witch has a 163,18 ppi thats awesome. It matters how tiny the pixel is, not the quantity or number of pixels there are on a screen."}, {"text": "why there is an imput lag"}, {"text": "4k without passive 3d is crap."}, {"text": "What is the game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m10s\">7:10</a> ?"}, {"text": "Chris patt"}, {"text": "Hei mutch Nice teknologi In Your rom. I bouth New Tv myself Samsung SUHD 65 Inch 7005 In Europa and 8000 In America. Get it 6 Februar monday whoo come 5 days to. I sell my LG 55 Inch Tv. Be Nice With New tv. Cool video!"}, {"text": "4k gaming is just too overkill for my eyes and where do you place your keyboard and mouse in the living room? that&#39;s BS."}, {"text": "you have lags man xD"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m35s\">1:35</a>  that sun is so crisp, I thought the TV had issues"}, {"text": "I didn&#39;t know Chris Pratt has a YouTube channel"}, {"text": "All this just for gaming????? !!!!  Man"}, {"text": "i thought you were an actual gamer, how can you say that&#39;s &quot;insane gaming&quot; with that much input lag?<br />anything above 5ms is too much for enjoyable gaming experience<br />thumbs down for bull shit title"}, {"text": "what is it with kid with input lag is am 34 and play on 60sk7000 and have no problem to be nr1 in cod and if i died its because <br /><br />1 .he was faster<br />2. he got lucky and am not<br />3. some one walk in my way<br />4. internet lag<br />5. am older then most ppl <br /><br />is so hard to say that guy was beter"}, {"text": "On coscos site there is a 65&quot; 4K 124 hurts for 1000$ Canadian!"}, {"text": "I did it on a 72 inch"}, {"text": "t"}, {"text": "are you russian?"}, {"text": "Loved the unboxing sounds and editing.. Great work! Keep it up D! :)"}, {"text": "tell me the name of the game your playing with white car...."}, {"text": "imagine the despair in his eyes if he had kicked the screen while joy-jumping"}, {"text": "you look like Chris Pratt dude"}, {"text": "Why do tvs have such bad input lag"}, {"text": "Got it for my birthday and a new setup ... Thank you hardware, I wasn&#39;t sure what to do."}, {"text": "What a robot game?"}, {"text": "I&#39;ve noticed a big ol&#39; drop in 120hz + 4k tv&#39;s from vizio lately, but their reviews are still soaring.  Response times for the cheaper ones are reporting 17 ms, and the more expensive don&#39;t report it at all (not that I&#39;m sure whether that would even have any impact on performance, I just understand lower is &quot;better&quot;.<br />  Any chance you guys might test one of their more budget 4k tv&#39;s (50&quot; 499$ E series or 50&quot; 650$ M series) tv&#39;s?  Or have already and I&#39;m just not finding it?  Am just having a hard time buying their supposed specs and performance for gaming pc&#39;s."}, {"text": "The verdict? Wait until the tech got more content and proliferation, just like the other 2123276 times before. It&#39;s the same cicle over and over, lol At lest the 4k and the VR looks more promissing than the stupid 3d"}, {"text": "Anybody on the fence about 4k gaming.. this is accurate"}, {"text": "What&#39;s that game in the thumbnail"}, {"text": "Is it possible to run 3 in surround?"}, {"text": "he looks so similar to Chris pratt"}, {"text": "As a gamer playing on a 65&quot; tv looks like cancer"}, {"text": "I Hope can Buy This Tv someday, somewhere"}, {"text": "ohh el gingo culiao weon ctm"}, {"text": "Cringe"}, {"text": "that thing gives off a lot of reflection"}, {"text": "When he jumped up after setting up the tv I was choking on my water from laughin😂😂😂💀"}, {"text": "mines bigger"}, {"text": "When i heard the intro music i was like, &quot;Hey, i heard this music from somewhere.&quot; and then that&#39;s when it hit me, it&#39;s from the Doom &amp; Destiny game!"}, {"text": "would a samsung curved smart tv be good for gameing?"}, {"text": "to small you should buy the 105&quot; samsung tv"}, {"text": "Help my channel grow. Just $ 1 ... Thank you.<br /><a href=\"https://www.patreon.com/framos\">https://www.patreon.com/framos</a>"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m53s\">1:53</a> standing proudly beside his huge tv ... doesnt get more russian then that"}, {"text": "Nice review!<br />What was the name of the game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=07m08s\">07:08</a>?<br />Thank you!"}, {"text": "game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m10s\">7:10</a>??"}, {"text": "look it&#39;s Chris Pratt!"}, {"text": "I had the same Tv. I took it back it&#39;s 4kHDR I got 4KHDR10... make sure you get the right TV if you want to play PS4 PRO"}, {"text": "I have one of those"}, {"text": "I switched from a 44&quot; to a 32&quot; TV and my shot for shooters got so much worse.  I dont know what to do..  Has anyone else experienced this sort of problem?"}, {"text": "Lg oled shits on this Samsung"}, {"text": "Watching this in 4k on a 60&quot; 4k tv and a 4k laptop. All I see is the fucking glare on that screen!!!! Hahahaha."}, {"text": "Why can&#39;t they get this right. I WANT TO SPEND MONEY."}, {"text": "is u playing wit a pc"}, {"text": "I think in this test, you should have used a wired controller to clarify the input lag at 100%"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m50s\">0:50</a> If you can dead lift your tv then we can talk."}, {"text": "shop EKLEKTIX for the largest selection of of 4K high definition television <a href=\"http://astore.amazon.com/4ktvs0b-20\">http://astore.amazon.com/4ktvs0b-20</a>"}, {"text": "I have this TV.  The input lag is pretty bad compared to my monitor.  Too bad cause it looks awesome..."}, {"text": "what&#39;s the name of the racing game ?"}, {"text": "That hub is a great idea"}, {"text": "does anyone here play call of duty on a samsung 55 inch or bigger tv, is there input lag?"}, {"text": "Gaming is much better on smaller size tv&#39;s"}, {"text": "So when you say it can upscale in 4K does that mean while you&#39;re running from your system in what ever preferred resolution? Let&#39;s say 1440p for better frame rates on a GTX1070/1080. Does it impact performance at all when upscaled? Love your work @HardwareCanucks"}, {"text": "Which motherboard had you used in it for gaming"}, {"text": "Good but expensive. And can ruin every monitor because it&#39;s result is best ever"}, {"text": "4k $ :D"}, {"text": "I know that this tv is ultra big but in video is not looking like that."}, {"text": "Nice tv stand :DDD"}, {"text": "Nice tv stand ;)"}, {"text": "Watching this on 4K"}, {"text": "plis game en tv"}, {"text": "outdated!"}, {"text": "Speed regularly count doorway."}, {"text": "I can make my tv bigger simply by moving my chair closer to the screen. Why would I want to spend money on a bigger tv?"}, {"text": "THIS DUDE ACTUALLY LOOKS LIKE THAT GUY FROM JURASSIC WORLD LMAO HAHHHAHA"}, {"text": "Hey. I have a 40&quot; 1080p Samsumg TV in my gaming setup at the moment, however, I am thinking of switching to a 27 or 32 inch 4k monitor instead. I game a lot, but only casually and I am concerned that the smaller screen will be less immersive. I also have a 65&quot; inch 4K Samsumg TV in my lounge and I am wondering whether there would be any way to send my PS4 signal there ffor when I want to play games on a bigger screen? Thanks :)"}, {"text": "👍👍👍👍👍👍👍"}, {"text": "TURN ON THE GAME MODE SETTING. REDUCES INPUT LAG"}, {"text": "game mode on a tv does not what so ever make for a smoother experience. Input lag though is greatly reduced. -.-"}, {"text": "Great for playing Xbox 360 games."}, {"text": "For some reason it look&#39;s small for a 65inch."}, {"text": "really hope if it was cheap:-("}, {"text": "That TV with a PS4 for Tekken 7 and MKX + Beers and friends = fun times"}, {"text": "Wherever porch live similar mention line."}, {"text": "Don&#39;t expect low input lag on big screens"}, {"text": "Lol! of course this TV has a lot of input lag. it&#39;s one of the cheapest 65&quot; TV&#39;s you can buy. Many TV&#39;s have way lower input lag and faster response time. This is NOT a &quot;high end TV&quot;. Looks nice though."}, {"text": "Can someone explain why I get motion sickness on my tv? It is a 55 inch Samsung 4k uhdtv with hdr capability. I find that when I am playing games it seems like everything gets blurry when you are moving at a fast rate of speed. I tried playing in game mode, HDR mode, and sport mode with the same problem every time. I think I have to manually change the settings or something."}, {"text": "I try to check where I could buy it, but I found no place!!!!"}, {"text": "Projector &gt; TV"}, {"text": "What&#39;s the game with the white robot ?"}, {"text": "Please learn pronouncing the &quot;th&quot;!!!!!"}, {"text": "The latency for my 4k tv is a bit much for me, I like perfect gaming experience"}, {"text": "if your expecting to play online all the real players are gonna be beating you that tv probably has like a 6 millisecond response time the real gamers are gonna be beating you with 1 millisecond response time monitors"}, {"text": "The fact that this isn&#39;t LG triggers me lol"}, {"text": "Panasonic ftw"}, {"text": "wow samsung is way better with tv&#39;s than monitors"}, {"text": "i running my witcher 3 on my ps4 to my samsung f8000 series 55 tv with pumping on my st9 7.1 sony bar and my samsung triangle ar5000 blasting on cool mode..all in my 20 by 10 tv room.."}, {"text": "i just want to buy this big Tv .."}, {"text": "whats the point of playing xbox on a 4k tv"}, {"text": "Xbox scorpio be like..."}, {"text": "VIZIO D50u-D1  Windows 10 detects it as a 120hz panel when run at 1080p and it does 4k at 60hz. IT HAS THE LOWEST INPUT LAG of all 4k Televisions coming in at 13ms.  Used it costs $450 U.S.  New $550.  It&#39;s like haveing 4 1080p monitors with 0 bezel width."}, {"text": "i am new to your channel..i liked your videos a lot..will recommend my friends about you"}, {"text": "I want to go with a Samsung or LG 4k TV which brand do you feel is better for gaming?"}, {"text": "I have a 43&#39; 4k in my room 😁😁😁"}, {"text": "i feel poor .... why god why ...."}, {"text": "The background he used, NYC skyline, anyone know where I can find it ?"}, {"text": "what&#39;s the difference with this and the ks8000"}, {"text": "Sweet mines a 65 inch Panasonic plasma 3-D Smart TV the color is insane I love it I love Panasonic and sony and yes I love Samsung"}, {"text": "4K is every vlogger&#39;s nightmare."}, {"text": "You probably have input lag because you have &quot;Game Mode&quot; off."}, {"text": "thesis tv or x8500d"}, {"text": "Price? 7000€?"}, {"text": "the problem is that in a year&#39;s time it will look like a portable vr glasses too me make more sense your totally immersed in the world thanks good video"}, {"text": "I made the mistake of looking at Samsung&#39;s 110 inch first, now this t.v. looks small 😐😟😖"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=5m08s\">5:08</a> what game ?"}, {"text": "Bcoz PS4 Pro ..so i come and look around~"}, {"text": "He not that tall lol."}, {"text": "I just got a lg oled e6 55inch and my syber vapor extrem be here next week with a gtx 1080 superclock in it connecting Xbox one elite controller that&#39;s  a 4k experience not bad for 6000$"}, {"text": "holy shit"}, {"text": "4k @ 30 is no better than 1080 @ 30.<br />60fps!!!"}, {"text": "don&#39;t understand why this guy doesn&#39;t have more subs :("}, {"text": "Dmitri hurry up and make a comedy channel"}, {"text": "LG OLED for me. By the time I have the money saved they should be more affordable."}, {"text": "Hey,<br />Great Video.<br />i would like ur review and comments on a Sony (X935D 4K HDR with Android TV). <br />Thank you.."}, {"text": "why does it look better than real life lol"}, {"text": "This is actually not that great anymore. It&#39;s an old model and doesn&#39;t have HDR. You can get a 60inch HDR samsung TV, much better than this one just for £900."}, {"text": "omg, the guy has a nvidia shield, kkkk"}, {"text": "hang it on the wall and have the sweetest home ever!"}, {"text": "Dare pro total female solution."}, {"text": "No HDR...crap!"}, {"text": "the things you buy when you get your paycheck"}, {"text": "Unique three capable"}, {"text": "In case the reviewer doesnt know<br />Samsung SUHD = Cadmium Free Quantum Dots TV and not you standard LED TV."}, {"text": "having a sony 4k 55&quot;, and the smart bit being a bit disappointing, we managed to get an app Kodi, which when configured correctly, through videos on youtube, is just a life save with the smart stuff, also netflix has some 4k content, some looks worthy, others, not so much"}, {"text": "Man seriously whats your job ? 😂"}, {"text": "project cars？？"}, {"text": "So which is better LCD LED plasma ips TFT OLED tvs/4k tvs????????????"}, {"text": "u have a great TV bro But get a proper TV stand. Its like water and Oil."}, {"text": "oh yeah well fuck Samsung you made me do this. time to pull out my oled65c6p model tv. curved oled hdr fucking 65inch bad ass top of the live tv out there. eat that Samsung. lol"}, {"text": "plan on getting a 65&quot; myself soon.  nice."}, {"text": "Alguien sabe como se llama el ultimo juego ?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m56s\">0:56</a> When you finally can afford your own place and buy things your parents wouldn&#39;t let you get."}, {"text": "if you love gaming and other entertainment check out cerebral Cortech reviews, subscribe!"}, {"text": "Why am i watching this?? i have 5 bucks in my bank....."}, {"text": "What&#39;s the name of that racing game you&#39;ve played ?? Please tell me... I&#39;m very interested in games (Don&#39;t mind)"}, {"text": "1080p on a good 4k panel looks fine and is so tight to 4k native its hardly worth arguing <br /><br />im sick of uneducated idiots calling this stretching its not strectched its a 4to 1 scale and good upscale tech being used"}, {"text": "Input Lag 36.9 ms = useless for pc gaming"}, {"text": "and play 1024x768 on CS Go hahaha"}, {"text": "Samsung is the best. I have a 60&quot; Samsung beast in my bedroom."}, {"text": "Aye I see transistor in steam library, I click like"}, {"text": "I no can afford dis .i have i3 and gtx 950 i play game too, not just you stuck up canadian rich boy"}, {"text": "what is the song at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m21s\">1:21</a>?"}, {"text": "i have the newer model of this TV. TV is serious."}, {"text": "whats that racing game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=07m05s\">07:05</a>"}, {"text": "Man, I bet you had the mother of all headaches by being so close to the screen! I know because I did the same thing!"}, {"text": "Now we use 1+2&#39;s instead of bananas for scale... interesting..."}, {"text": "Looks like Jerry needs to upgrade"}, {"text": "At <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m04s\">1:04</a> if you notice the black clips on the bottom of the TV box, those are meant to be taken out so you can slide the box off of the TV. You don&#39;t have to take it out from the top of the box, that&#39;s so much more difficult. :s"}, {"text": "I bought a 55 Samsung 4k UHD curved tv for 799. By far the best value Ive seen on the market."}, {"text": "Ive got this exact model in 48 inch, its a beauty trust me."}, {"text": "which race game does he play?"}, {"text": "Just need $5000"}, {"text": "Can I play games on Samsung UE40D5500RW with GTX960 in my PC or will I burn my graphic card?;d"}, {"text": "That TV should be more than 60hz, but its great"}, {"text": "I really have big struggles if i should buy bf1 for xbox or pc cause of the hz cause 60fps is quiet laggy compared playing on a 144hz monitor😭😭"}, {"text": "Anyone else here have a 1080p, 65 inch, Panasonic Plasma TV, that does 60 Hz?"}, {"text": "I have a bigger  one haha"}, {"text": "To be honest this review did not enable the TV&#39;s full potential. It has a Game Mode setting that for some reason is not in the usual preset Picture Mode settings. IDK why Samsung did this but it makes for a great gaming TV once this feature is activated.  <a href=\"https://www.youtube.com/watch?v=Elt-QXEU73c\">https://www.youtube.com/watch?v=Elt-QXEU73c</a>"}, {"text": "what is the name of the game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m05s\">6:05</a>"}, {"text": "I would love to game on a 4K TV but for me the input lag is a deal-breaker"}, {"text": "Where is the gaming experience?"}, {"text": "what a weird video, I&#39;ve had aw 65 for years and prefer gaming on a smaller tv ,their is such thing as too big. love mine for 3d movies"}, {"text": "paid"}, {"text": "on what gaming console are you playing"}, {"text": "The first thing I did when I got a 4k screen is play Half Life 2"}, {"text": "CONSUL TARDS SO JELLY RIGHT NOW!!!             LMOA!!!!"}, {"text": "I have a 70&quot; tv in the smallest living room ever"}, {"text": "Cool but not for gaming, to much eye traveling for shooters"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m07s\">0:07</a> Got to love the music from Kerbal Space Program."}, {"text": "great review dude! If only all reviews were this informative :)"}, {"text": "that&#39;s awesome man....$$"}, {"text": "I bought a vizio 58&quot; 4K tv returned it got a 60&quot; 4K Samsung tv and it sucked. Pink line on the side going down the middle with a bunch of dead pixels on each corner.  Returned it bought a vizio 65&quot; 4K tv love it. Vizio d class has the best input lag rate compared to any mother 4K tv."}, {"text": "Put the tv in game mode"}, {"text": "No 21:9?<br /><br />No party!<br /><br />😂😂😂"}, {"text": "Отличный телек и отличный английский!!!! В общем и канал крутой.<br /><br />Долго живешь в штатах?"}, {"text": "I have the new version. it&#39;s my baby"}, {"text": "Whats the reason of the input lag?"}, {"text": "I HAVE THAT TV. its awesome for gaming"}, {"text": "Y&#39;all wanna know about 8 inch gaming huh?"}, {"text": "gonna go blind if watch with this lol"}, {"text": "True The Js8500 Is a great TV A most Have if You want a really great quality picture ans good stability , and its even better than the new ks8000."}, {"text": "Thanks. It would have been nice if you had measured the input lag too. As I feel that under 25ms is cool for casual couch gaming."}, {"text": "-) for Works &amp; Entertainment ....its Fantastic <br /># beyond new era of Samsung Technology"}, {"text": "Even though these TV&#39;s are beautiful, I would personally rather be a little patient and add on a little more money towards an OLED TV, in fact you can now get 1080p for the same price as a LED TV which will still look better than a 4K LED TV"}, {"text": "Łazy to check but how much refresh rates is it ?"}, {"text": "A resident evil there wow"}, {"text": "이게 한국에서 만든거다 새끼들아 땅 작다고 무시하지 말자"}, {"text": "Rather have a Vizio P series."}, {"text": "The un65ju7500 has better input lag (actually the best of any 4k tv on the market), and its cheaper, yet image quality is barely any different. <br />You can improve input lag by ensuring that game mode is set to on. Also if you change the input type to PC you can see improvements there."}, {"text": "That intro music reminded me of an old game of mine. :P :)"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=5m46s\">5:46</a> that is not gta v that is gta 99999999999<br /><br /><br /><br /><br /><br /><br /><br /><br />oh my bad sorry"}, {"text": "if i were you,i see a doctor.talking to yourself is not healthy"}, {"text": "I bought this but a bravia TV and I must say gaming is epic"}, {"text": "drug money bitch."}, {"text": "very cool"}, {"text": "Yikes. Lag city"}, {"text": "I see no difference"}, {"text": "You know what&#39;s really insane?  Using a great projector with a screen 100-130 inches.  Makes 65&quot; seem itty bitty."}, {"text": "It seems when tvs get so large, you get input lag no matter what"}, {"text": "gaming mode on tv lol thats a joke<br /><br />thats why you get a gaming monitor"}, {"text": "that is clear as fuck man...I can see the detail of the Samsung picture, thru his camera thru my cell phone screen that amazing.."}, {"text": "Bro which camera do you use for recording the video."}, {"text": "Buy VR, throw this shit out of the window."}, {"text": "what a stupidity...this money could have been spent elsewhere I mean WHAT is the point when console gaming canNot work at higher than 1080p resolution??? whats the point really?"}, {"text": "Is this a monitor or a TV?"}, {"text": "The thin bezels are nuts"}, {"text": "We&#39;re gonna need a bigger credenza"}, {"text": "Yea,great tv but Samsung 4K ultra HD 65&quot; tv still to expensive cost in US $4000-5000 dollars only at 60 Hz not even 120 Hz."}, {"text": "Does it have the HDR or HTM or whatever its called coz apparently only 3 tv&#39;s from 2015 had it? <br />Its like a new speedy latency thing."}, {"text": "Whats the music used in the intro?"}, {"text": "Wow it looks so clear like it would on a smaller monitor even at 65 inches. How much did that PC tower cost you and where can I get one? I will want to get that TV some day but I been lacking a good PC for a while now. I do have a good 40&quot; LED Samsung TV that was 4mil:1 Contract ratio 5 years ago. It looked like how 4K looks to other TVs when I first got it so I feel like I don&#39;t need that updated yet but will when I get a good PC first. Samsungs are so good but do you think LGs are better now or is it just the OLED that makes it look better?"}, {"text": "On all samsung 4k tv&#39;s you must set the input device in device type to pc. It deactivates all image processing and gets you the best response time (better than game mode)"}, {"text": "Lol. Unless you are gaming a few meters away from it, those extra pixels are pointless"}, {"text": "go a 28&quot; 1ms response time....better than that pos."}, {"text": "I have a full hd 100&quot; projector, I win :P"}, {"text": "Дим, это самый лучший телевизор по качеству в 65 дюймах?)"}, {"text": "I would prefer a Sony over samsung with a PS4 is all I need."}, {"text": "Nice. I&#39;m planning to get the 75&quot; LG model, just for the better HDR/Dolby support."}, {"text": "HC PC players bitch to much about TV&#39;s vs Monitor&#39;s.... like come on the difference of 15ms isnt going to make you any better @ gaming lol. <br /><br />Im a PC player and i play on my TV with an Xbox One Controller &amp; its so much nicer than sitting at a stupid desk playing on a little 24&quot; screen."}, {"text": "I would rather have a 20-24&quot; 4k monitor than a TV, but maybe that&#39;s just me."}, {"text": "Are you german?"}, {"text": "I just realised you kinda look like Chris pratt"}, {"text": "that day when we get vantablack blacks"}, {"text": "فيديو ممتاز"}, {"text": "Ooh yeah luv it&amp; 4k is here to stay! My Sony took me  like two weeks to get used to the new incredible  picture style, colors, definition etc. of 4K!! It&#39;s kinda like looking at real life ppl. but just with a sm bezel frame on the edge!! 👌🏽😛😍 Enjoy!!"}, {"text": "input lag ? i don&#39;t even get that with my 42&quot; LG."}, {"text": "need HDR these days"}, {"text": "If I had one I&#39;d marry it and have sex with it<br /><br /><br /><br /><br />Maybe I shouldn&#39;t buy one then..."}, {"text": "One thing I don&#39;t like about it: reflection. It&#39;s so damn reflective that it&#39;s distracting."}, {"text": "dream gaming setup"}, {"text": "Dang, that thing&#39;s already scratched up."}, {"text": "Nice, you actually got the one with HDR and good contrast. Not the cheap one."}, {"text": "Dude buy a Sony. Sony puts a lot of time into their tvs specifically with gaming in mind, and their motion rate is way smoother."}, {"text": "big TV suck for gaming anything over 55 is horrid. and 55 itself has problems. 40in is solid."}, {"text": "vizios are better for gaming. low input lag is very important."}, {"text": "HL2 in 30FPS.<br />You could have at least upgraded"}, {"text": "input lag in racing games oh hell no!<br />my braking and acceleration points would be messed up 😂"}, {"text": "samsung that is it"}, {"text": "eye candy"}, {"text": "Gosh..."}, {"text": "I like how Samsung uses its beautiful curves and edges in their design language across all their products"}, {"text": "Background music at the beginning reminds me of when I was lost in space trying to get back to Kerbal and realized that I deployed my parachute during my decent while burning up and you know the rest..."}, {"text": "what is the game after hl2"}, {"text": "Have the 55&quot; version of this TV and it&#39;s beatuifull ! Run GTA and Metal Gear at 4K with low input lag. For FPS the lag is noticable and can be disturbing. For PS4 you HAVE to turn on the game to reduce the lag otherwise it feel laggy."}, {"text": "It aint OLED n it aint curved, so I dont want."}, {"text": "I have the 40in ju7100 (lower end model), and games are totally playable. Change input name to PC and turn on UHD color. rtings says this tv&#39;s PC input lag is around 36.9ms. Some people are more sensitive to input lag than others. I have no issues getting kills in battlefield 4."}, {"text": "I have a 65&quot; 4K Curve Tv. I love it but I rarely ever game on it. Ever since I started gaming on a monitor I struggle to game on a screen bigger than 28&quot; but I do mainly play FPS games"}, {"text": "Exactly.....real big ass screen, i don&#39;t see why people game on some small uberspeced monitor...."}, {"text": "Input lag....for such an expensive set up. Anyway around this?"}, {"text": "chris pratt"}, {"text": "does it have hdr and ultra hd premium then."}, {"text": "funny intro, looks like a nice tv."}, {"text": "So thin but awesome quality"}, {"text": "input lag on Samsung UE55JS8500 is only 22ms in [Game] mode"}, {"text": "holy shit the tv stand looks like a windshield wiper nice!"}, {"text": "how much"}, {"text": "Korean monitor manufacturer Wasabimango produces 55&quot; monitor supporting FreeSync. I have it and I&#39;M very enjoying it. No stuttering, no tearing, no lagging. You can feel fast keyboard &amp; mouse response even in V-Sync mode too."}, {"text": "I have a PC and consoles hooked up to my projector. Screen is about 90&quot;, 1080p 60Hz. Not 4K but still looks awesome."}, {"text": "Does anyone know what&#39;s the racing game he&#39;s playing? Thanks"}, {"text": "what is the name of the game <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m13s\">7:13</a> ?"}, {"text": "wow date that was  really  wenrd jof%build"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m15s\">7:15</a> I initially thought those were physical objects in front of the TV"}, {"text": "how  mush  it cost"}, {"text": "I need a 70&quot; 4k curved UHD OLED that i can mount on a wall"}, {"text": "ur networth"}, {"text": "this tv and xbox scorpio.... life"}, {"text": "What&#39;s the racing game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m04s\">6:04</a>?"}, {"text": "nice table"}, {"text": "Wow. SO many guys that look exactly the same in one video. Crazy. It&#39;s like you&#39;re the same guy portraying yourself as different personalities. Hey and that TV only costs the same amount as a descent, used car :D."}, {"text": "If only I could afford it :("}, {"text": "Ok, let&#39;s say I buy a console, the XBOX One S for example, what if I play those games that are mostly in 1080p on a 4K TV screen? Will it will look blurry?"}, {"text": "The only issue I have with buying a 4K TV is finding one that doesn&#39;t have bad input lag and response times."}, {"text": "lol, I got a 55es projector. But it&#39;s only 1080p, which is annoying me and the cost for the lamp just insane~"}, {"text": "I went to B&amp;H Photo and Video, the: &quot;Samsung 4K SUHD UN65JS9000 Series Curved Smart TV&quot; has no glass reflection. Its perfect."}, {"text": "Hmmm..since this TV Model has a glass panel on it, what about the glare and reflections off the TV. Don&#39;t you find that annoying?"}, {"text": "Almost at 1mil subscribers. keep &#39;em coming."}, {"text": "GTA5 needs 21:9. Put this 16:9 shitheap in the bin ffs."}, {"text": "Should of went with Oled instead, so much better."}, {"text": "I&#39;ve been gaming at 4k 60fps since July 2015. PC gaming at 4k 60 fps is the only truly native /interactive 4k experience out there. AND I&#39;ve been gaming on a PC in my living room for years and I love it! No reason you shouldn&#39;t game a 4k if you own a 4ktv and a gaming PC!<br /><br /> Only some YouTube videos (butterflies &amp; nature) and original Netflix and amazon videos are 4k content. But they&#39;re videos /movies only. Gaming on PC has EVERYTHING in 4k 60 fps! Assuming you built a desktop to handle it :-)"}, {"text": "give me some money for this plz man"}, {"text": "I just bought a 43 inch Samsung LED Smart tv for my living room gaming"}, {"text": "Dmitri deserves 1m subs, go hardware canucks!!"}, {"text": "I&#39;ve had a 55&quot; 4K OLED since around the time this video was made, it&#39;s awesome!  <br /><br />Things I have learned over the years about gaming on TVs (I&#39;ve been doing it since 2006):<br />1.  Try to find a DVI/PC Mode.  My 40&quot; LED Samsung looked terrible until I found an option to rename the HDMI 1 input to &quot;PC&quot;, this gave perfect 1:1 scaling and the picture was crisp.  In these modes you either can&#39;t use enhancements like 100Hz or the picture becomes very ugly again.  Game mode is supposed to do this but I never got 1:1 scaling.  <br /><br />The other bad thing about this was there was no PC mode on the other 3 HDMI ports so to get 1:1 scaling on all of my HDMI devices I had to get a Hi-Fi receiver that had 4 HDMI ports and output it only to the HDMI 1 port on the TV.  Of course now that I have a 4K TV I need to upgrade again because it is not HDCP 2.2 compliant.<br /><br />2.  HDMI standards must be matched on all of your devices, including your video card (see my first point above).  Some TVs do have DisplayPort (mine doesn&#39;t) but these don&#39;t have the HDCP handshake between your devices so if you plan on watching 4K Blurays in the future you&#39;ll need to run them through a compatible HDMI port.  My TV only has HDMI 2.0, not 2.0a or above, so I can only view HDR content through the USB port or via direct streaming (not an option where I live with my internet speeds).  It&#39;s ironic that the HDCP standard will force me to watch 4K HDR content with pirated movies!<br /><br />As well as the problem with my amplifier not being HDCP 2.2 compliant my GTX 770 only has HDMI 1.4 so I&#39;m not getting a true 4K signal at 60Hz even though both devices report to me that I am.  This is another reason why I am upgrading to a GTX 1080 very soon which has HDMI 2.0b.<br /><br />3.  Just because a TV says it can do 200 or 100 Hz does not mean it will output these framerates with PC games, you&#39;re limited to 60Hz.  I don&#39;t know why this is the case, probably something to do with the image processors and the HDMI standard.  The LG OLED I have has a response time of 0.02ms (no, that&#39;s not a typo!) so it has nothing to do with the screen technology either."}, {"text": "Awesome. What&#39;s the name of racing game you&#39;re playing?"}, {"text": "and it&#39;s LED"}, {"text": "I just bought a 65inch..panasonic..ultra HD 4k TV 120htz.       why do sent mines look that&#39;s clear...and is there a way to lower the hertz"}, {"text": "Lmao the response time is probably cancer. Any tv over like 50 inches is terrible, also add the 4k and that thing is terrible for gaming. It looks nice, especially for movies or Tv but gaming that thing must be terrible"}, {"text": "What&#39;s the input lag in this tv ? Cuz one time I got one high end n wasn&#39;t really good for games cuz of the lag then got 1080P it had a little bit better lag"}, {"text": "so when are you giving that tv away 😉😉"}, {"text": "how do you watch stuff in 4k and what kind of camera are you using its great"}, {"text": "tvs are shit to play fps, the imput lag is so hi compared to a pmonitor, evem the worst ones"}, {"text": "Money better spent on an OLED."}, {"text": "Look at that nasty back light bleed on the top right."}, {"text": "0-1536arangeofnoit}"}, {"text": "Does television supports desktop?"}, {"text": "Hey man, what&#39;s the game you play after Half Life 2? I want that tv but I need a 4k capable pc first"}, {"text": "The biggest screens I ever saw in my life"}, {"text": "Meh, I&#39;m not impressed. At certain points in the video, I can see the pixels with like that little outline around each one. That looks horrible and is why I hate gaming on Tvs."}, {"text": "What is the price?"}, {"text": "PRESUMIDO"}, {"text": "you could get a 65 inch tv, or you could get a short throw 1080p projector and get a 150 inch image"}, {"text": "what is it&#39;s pixel&#39;s per inch?"}, {"text": "A bit too glossy for my taste"}, {"text": "😱"}, {"text": "ehhh I still choose a monitor over any tv and 65 inch is to big... 27 to 32 is good enough"}, {"text": "STAR-LORD!!!!!!!!!!!!"}, {"text": "I&#39;m seriously upset with your subscriber count! There should be so much more!!"}, {"text": "gr8 vid"}, {"text": "I bought this tv thinking it would be good for gaming until I found out Xbox One doesn&#39;t support 4K 😅.  There is input lag even on game mode so I guess I&#39;ll be returning it for a plasma."}, {"text": "DREAMS"}, {"text": "Is that fallout shelter that you play on your phone and tab"}, {"text": "i play on 100&quot; screan from an fhd epson 6600. <br />and to play dirt rally with a race room seat,and g27 all of this project on my screan. is very cool also."}, {"text": "Grats on the 65&quot;!  I game on a 55&quot; samsung suhd 4k as my primary, and 2 40&quot; 1080p monitors as my mirrors or sides.  Most games I just play on the single monitor but its nice for racing and space games having the sides.  I use a racing car seat on rails with my keyboard resting on a stand i have that I can place my steering wheel on as well.  My primary game is World of Warcraft which plays 4k great but just on one monitor.  I am doing all that with 980 vid cards and am very anxious to buy 1080s the moment they become available to purchase.  I also just wanted to say you need some great speakers to go with that setup.  I use my b&amp;w speakers as my monitor stands.  The center channel puts the tv at a perfect height for me.  One thing about large monitor gaming is that I think it makes for a superior gaming experience for 3rd person games and I enjoy my fps games on it, but I have never felt quite as good at shooting fast and accurately as on a 24-28&quot; monitor.  Maybe its just less eye movement.  I do play within 4.5 feet of my 4k though."}, {"text": "what racing game was that??"}, {"text": "really like you got a samsung!! thumbs up!!"}, {"text": "<b>2016&#39;s</b> Vizio 4k uhd hdr P Series is probably the way to go but if you&#39;re looking to save $$ then 2015s M Series.<br /><br />TCL is dropping their X1, not sure how that&#39;ll turn out in pricing or specs but it has 288 Active Led Zones similar to Vizio&#39;s high end $5,000 sets maybe for a fraction if the price."}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m14s\">6:14</a>  i tought  WTF  HOW , WHEN did he cack the   TV , and than...oohh it&#39;s the  winshield  of the car xD ;)) lel"}, {"text": "Pity he couldn&#39;t use that money to get better furniture and make his place look nice LOL ;)<br />TV bigger than his living room :P"}, {"text": "we have this TV, bought it in December and now we got a free samsung galaxy s6"}, {"text": "When I have a 72&quot; 4K... Lol"}, {"text": "Bro in order for me to show you what video gaming is really  about I&#39;d have to drag you to my TV"}, {"text": "what racing game was that?"}, {"text": "4k sucks I got 12k :)"}, {"text": "The glare was really major"}, {"text": "look someone is living my dream!"}, {"text": "What camera you use to record this video? :) <br />My next tv will be 65&quot; and i play games on ps4, i hope will be ok..."}, {"text": "super video"}, {"text": "anyone play ps4 games onda this tv?"}, {"text": "4k only go for SONY"}, {"text": "Yeah lots of inches but where&#39;s G Sync and 144hz"}, {"text": "I miss the refresh rate info can someone Fill Me In?"}, {"text": "You kids are spoilt these days"}, {"text": "still prefer a 26&quot; tv for gaming"}, {"text": "Holy fu#k I want this."}, {"text": "i mostly play games, so i&#39;ll stick to 1440p, 144hz, freesync for now. not going back to 60hz even if it&#39;s 8k"}, {"text": "And costs 6000$ in India"}, {"text": "these TVs r down to a little over a grand now brand new  ...I sell them"}, {"text": "Five inches more and that would be the size of my television"}, {"text": "you can use PC mode in Samsung TVs which i use for my"}, {"text": "I have the same set.. and its awesome!"}, {"text": "OH SHIT!!!! My name is Dimitri too!!!!!!!"}, {"text": "U seem to put a lot of trust in that makeshift table aka &quot;two stools and a piece of plywood&quot; not safe for that tv."}, {"text": "amigo q modelo es dime por favor por favor... Respóndeme apenas puedas"}, {"text": "I play on an 80&quot;. People just shake t heir head when they see it, then sit and watch in envy."}, {"text": "for a minute there I thought you were Chris pratt."}, {"text": "Ultra Fucking High Definition"}, {"text": "OLED or nothing!"}, {"text": "Debe ser una experiencia asombrosa."}, {"text": "Got got a 44 inch 4K tv for 500 pounds, now I feel like such a peasant."}, {"text": "A review about Samsung SUHD, boring"}, {"text": "Suhd tv?! Suh dude tv?!? Ohh yeaaahhh"}, {"text": "i need thaaat tv nooow"}, {"text": "I still regularly use a crt TV lol"}, {"text": "I&#39;ll consider a new 4k big screen when there&#39;s no input lag for games..."}, {"text": "what a looser he is"}, {"text": "Nice start to the video, &quot;let me show you what real living room gaming&quot;"}, {"text": "Kerbal Space music ?"}, {"text": "+HardwareCanucks If you go to Menu &gt; System &gt; General, you can enable &quot;Game Mode&quot;, which will completely eliminate the input lag you&#39;ve mentioned. I also own a Samsung Smart TV and getting rid of the lag is as simple as doing that. I hope this tip helps you! Peace out!"}, {"text": "hi whats the wallpaper on the pc??"}, {"text": "uncharted 4 at 4K would be amazing."}, {"text": "lol gloss finish? fail"}, {"text": "i think im the only person who isnt a resolution snob these days, im fine with 1080p hd gaming, my little gtx960 is fine till i upgrade to a 980 ti strix in the future :( but god damn that telly looked nice, mines only 40&#39;&#39; at my flat"}, {"text": "That TV&#39;s images look amazing even on youtube&#39;s 1080p. I&#39;m sure it will look super amazing in 4k. Great video!"}, {"text": "who cares about games just show real 4k videos"}, {"text": "49 ultra is good too have fun bro)"}, {"text": "WOW, imagine God of War or Uncharted on that!"}, {"text": "I wonder what&#39;s your tv mode when you play PC game <br />Some of the gaming mode of tv could possibly cause input lag, I can&#39;t help to think have you ever tried PC mode; but that doesn&#39;t said PC MODE would able to solve all problem, it could also needs to setting refresh rate into 59hz on PC setting ( don&#39;t ask me why, it&#39;s some times commonly happen on AMD graphic card)<br />I would rally love to see if you have any try out to solve that input lag!"}, {"text": "im using as a pc monitor in my room a curved 40-inch 4k samsung TV with 1200 PQI and its really beautiful. apart from the high cost I wouldn&#39;t get a 65 inch cuz I&#39;d have to sit so far away from it but that size is really perfect for the living room. lots of scaling issues on 4k though. some game&#39;s text and windows apps look really small so it would be impossible to play and do lots of stuff on windows with the 65 inch tv. but great TV regardless, gratz!"}, {"text": "That moment when you thought you passed 70km"}, {"text": "That&#39;s nothing compared to the one I have...."}, {"text": "Isn&#39;t UHD slightly lower resolution than 4K?"}, {"text": "meh... samsung tvs do nothing to me. I have a XBR 65 X930C. Shits on that samsung. and i sit 4 feet away. what did that shit cost? 1,500.00? my sony with digi audio was over 3,500.00 and worth every penny."}, {"text": "Hey man,Just a question for a friend of mine. He&#39;s deciding between a JS8500 (55 inch) and a LG EC9300 OLED (55 inch) also not 4k but 1080p, which TV would you say provides the better picture quality? Cleary the LG wins the black levels hands down, but what about the overall picture? He&#39;ll be using it for pc gaming, but also Xbox One, PS4 and whatever Nintendo comes with."}, {"text": "Lol 4k TV is obselete Try gaming on a 5k Dell UP2715k Monitor."}, {"text": "Dose it support 1440p from gaming PC&#39;S?"}, {"text": "This is the only brand i hate most!lol"}, {"text": "Thousands of dollars worth of tv, on tens of dollars worth of tv stand. Smh"}, {"text": "Im always amazed at how detailed the image on the TV looked<br />Then I remember Im watching it on a 1080p monitor... And it must look sooo much better..."}, {"text": "would this be a good tv for an xbox one ?"}, {"text": "Did you enable game mode in tv? It disables all picture processing from tv and reduces lag to almost nothing."}, {"text": "How is this insane gaming? I have an 80&quot;inch 4k TV. It&#39;s no big deal! Now if it was over 100&quot;inches..."}, {"text": "half life?! you&#39;re a legend!"}, {"text": "40 &quot; best"}, {"text": "Meh, my tv is better!"}, {"text": "what&#39;s this racing game he was playing?"}, {"text": "I just don&#39;t get why can&#39;t people call things with their right name?!? This TV is NOT a 4K it&#39;s an UHD TV. 4K is a cinema resolution!"}, {"text": "another example of a good TV placed in a shity acoustic room"}, {"text": "why u have dat tv in dat small living room u americans just want t bigger 4 no reason at all so ahead in some things but living in stoneage in others"}, {"text": "great video"}, {"text": "But not 1 ms response time?"}, {"text": "There are ways to calibrate lag bro "}, {"text": "And I am just sitting here with my 135 inch projector. :) <br />Playing games on like a Mini IMAX ! :D"}, {"text": "You did great fckin job on video dude, but my point is may get 60 fps on hdmi connection ? anyone could help me ? :D"}, {"text": "It really depends on what  you play, single player very cool, multiplayer...not so much. There still is a big response time in tvs, so not really recommend for gaming. Another issue is with connection issues, many tvs do not have the required input performance to take all the data from a video card. I would go for a ultra wide gaming monitor (34&quot;-35&quot;). For me, the best option at the moment. Great tv by the way ^^"}, {"text": "What rally game is it?"}, {"text": "buys 4K TV connects XBONE to it....... ( many of my friends )"}, {"text": "Samsung sucks !"}, {"text": "mate if You have roomspace go for projector... nothing can beat with wow factor/price ratio. I have played on 65 panasonic plasma VT60 which is great, but i bought myself a nice Benq w1070 with 110 matt grey screen and... i was blown away! SIZE DOES MATTER ;) Also Benq w1070 has low input lag (around 30ms) so it is great for gaming. Now saving money to move on something like sony vpl-hw65es with dynamic iris etc :)"}, {"text": "1500$ 980ti sli setup + 500$ on monitor and accessories is much better deal for me other than just a single 65inch tv"}, {"text": "wow you look exactly like chris pratt"}, {"text": "side by side you can see the pixels in a 1080p tv when standing at point blank looking at it. a 4k tv you can stand point blank and stare right at it and its still crystal clear and you won&#39;t even make out the pixels like the 1080p tvs."}, {"text": "love my 65 plasma VT60 Panasonic. But this one is just gorgeous"}, {"text": "OMG TV!!! <br />I LOVE TV!!!"}, {"text": "I use my 65inch tv for everything and love it but my living room is a lot bigger so the tv doesn&#39;t look as big as it would in a smaller room."}, {"text": "amazing"}, {"text": "compare my 80&quot; 240hz uhd tv"}, {"text": "Can someone tell me if i install two gtx 970 then willi have 8gb of ram?"}, {"text": "D 8000 series was thinner , I have all the series from the start , in different dimensions I haven&#39;t use JS I have the JU now and its amazing.Don&#39;t forget to Close Ecco on these new series the last 3 years Ecco sensor brightness and ecco movement is always on . So don&#39;t forget to disable them. Also you don&#39;t need to disable them on Game or PC mode."}, {"text": "The input lag kills it for me man."}, {"text": "u have fucking bigger like from me.. because u have ONEPLUS TWO, and u have fuckig nice TV... :( i send greeting from Slovakia.. i never have money for your things :("}, {"text": "I HAVE THE SAME WALLPAPER OMGAAAAA"}, {"text": "which is the racing game?"}, {"text": "Sony for life!!  This TV is super nice though :)"}, {"text": "Only 65&quot;, meh.."}, {"text": "Pays 8 grand for a tv... But pays 500 for rent"}, {"text": "Hehe I play with a 21 inch computer monitor"}, {"text": "gaming on a 150&quot; projector, and stream games to my 60&quot; 4k samsung tv with the steam link. there is no chance at all i could game on a 24&quot; monitor again unless i had some binoculars"}, {"text": "55 4K Sony is not so Bad for me...but this one is great"}, {"text": "+HardwareCanucks what Camera do you use to record ?? Great Quality !!!!"}, {"text": "Size doesn&#39;t matter."}, {"text": "4k only makes far away images more detailed, to the human eye, otherwise you won&#39;t notice much so let&#39;s not pretend it&#39;s THAT amazing. Also, 65&quot; isn&#39;t that big so don&#39;t blow a load. But that&#39;s my only qualms with what you&#39;ve said. Otherwise good review. Does my opinion matter? No, but you read it anyway so fuck you. <br />About the TV... That brushed chrome looked scratched to hell from shipping. Unless it was used, I&#39;d never buy it for that reason alone."}, {"text": "try a 120in 4k projector"}, {"text": ":&#39;("}, {"text": "do u have screen tearing issues when playing games above 60fps with this tv?"}, {"text": "god i cant wait till 4k becomes norm.. i used to think 1080p was enough... but christfuck 4k is like a window"}, {"text": "such visual treat to behold this Samsung 4K TV"}, {"text": "Is this guy really using 3 stools to support this 65 inch 4k Samsung TV!? <br />I know he probably made sure it was secure with that plywood underneath but i definitely wouldn&#39;t do this."}, {"text": "Ive got the 9000 model whoop whoop!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"text": "You should label your input as being a PC on the tv in order to get rid of any input lag. Every tv-manufacturers &quot;game mode&quot; doesn&#39;t bypass the image processing that creates around 33-66 ms input lag, but telling your tv there is a PC connected to it will do just that. At least it does on my 55&quot; LG from 2011. I don&#39;t know how much lag I got but it&#39;s alot less than using &#39;game mode&#39; so less than 10 ms."}, {"text": "To small, You need 100-inch TV  :D. And the Smasung Stand is so UGLY :O"}, {"text": "65 inch... lol, i have projector with 136 inches screen ;)."}, {"text": "silk misic 😍"}, {"text": "input lag ?"}, {"text": "Hi Dmitry, thank you for this video, and I have one question.<br />Which camera use? The 4k video look amazing."}, {"text": "Did you use one preset for all the video, desktop, photo and gaming? Beacuse most TVs have many image options and it&#39;s kinda annoying to find the correct for each situation, I think it&#39;s better to have just one setting to rule them all or auto detect. What do you use and what are your thoughts? Thanks."}, {"text": "I have a 79:)"}, {"text": "&gt; 65 inch 4k tv<br /><br />&gt;half life 2"}, {"text": "how blind are you to need a 65&quot; TV? or are you making up for something?"}, {"text": "Today&#39;s &quot;Word of the day&quot; is.. Compensation Can you say it with me? LOL"}, {"text": "This is a Samsung Commercial."}, {"text": "I&#39;m still rocking my 120hz Mitsubishi 73&quot; DLP. Picked it up on Craigslist almost 3 years ago for $300 and I&#39;m spoiled now...anything smaller looks obscene to me now lol."}, {"text": "i have a 65 inch in my living room"}, {"text": "what a beast...what a beauty..."}, {"text": "Wait until next year. 4K will be obsolete as 8K comes to the market. Now, if only there was some programs to watch!"}, {"text": "@hardwarecanucks what kind of camera did you use to shoot this video man? it looks great"}, {"text": "nice plywood stand on stools. Ass."}, {"text": "What game was he playing at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m15s\">7:15</a>!!??"}, {"text": "RIP EYES."}, {"text": "Is this OLED or LED?"}, {"text": "you have to set the TV to Game mode if you havent already to achieve an extremely lower input lag."}, {"text": "I have played on 65&quot; tv for like 5 years already (consoles and pc connected to it). And it really feels small after you get used to it."}, {"text": "If I have to see one more Carly Fiorina add I&#39;m going to pass out."}, {"text": "Just bought this bad boy as well. Looking forward to setting it up by end of the week."}, {"text": "how bad that response lag from have a huge tv"}, {"text": "I&#39;m sitting here in my cinema I just bought on a ultra highendmegawidescreen screen with a resolution of 10k and playing it all from my Macbook Pro because Macbook Pro is amazing and better than any windows shit because it uses ressources much better.<br />I can play candy crush in glorious 30 fps which are actually better than 60 fps because they are more cinematic"}, {"text": "Got ya beat buddy,  Sony 4k projector. Up to 500+ inches. Dropped a little over $6000 on that MONSTeR. Took me over 2 years to save up for it but hey.... Its Impossible to play without an erection. When 1st seen, womens panties  fall to the floor."}, {"text": "I drooled."}, {"text": "the tv is bigger than apex"}, {"text": "i love that thanks"}, {"text": "What About Porn?"}, {"text": "For ps4 and Xbox one gamers stick with a 1080p tv.  I bought a 4k Samsung thinking that games will look better and I was wrong. I end up taking it back and save $400. I bought the Sony C300 series and it looks beautiful"}, {"text": "tf is this a commercial?"}, {"text": "4K @ 65 inch = 67 ppi<br />1080p @ 21.5 inch = 104 ppi, looks much sharper ;) and needs less GPU Power.<br /><br />Sry for my bad english"}, {"text": "you need a bigger tv stand it looks funny having the tv bigger."}, {"text": "Hey ppl, whats the racing game?"}, {"text": "that probably has display latency of like a half a second"}, {"text": "why would you ever play any PC games on a TV? do you enjoy terrible input lag"}, {"text": "just a question if double the screen size from 32 to 65 is this like watching 2k at 32 inches ?"}, {"text": "I want that exact TV!  Love Samsung!"}, {"text": "I game in a 75&quot; Samsung...luv it..."}, {"text": "Surprise Mother Fuck <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m11s\">1:11</a>"}, {"text": "240hz still better."}, {"text": "when he started with small screens and only went up by a couple of inches at a time i was like o shit this is going to take awhile lol"}, {"text": "Doesn&#39;t hold a candle to my 100 inch projector. Still very awesome!"}, {"text": "i hate u cause i dont have this"}, {"text": "vizio p series, I have no lag.  don&#39;t even have to use gaming mode and the tv to reach real 120hz at 1080p"}, {"text": "opens $8000 television and puts it in a $20 Ikea table"}, {"text": "only good with footbal games tbh, get me in motion sickness"}, {"text": "it&#39;s not worth spending too much cash for a 4k. All gaming consoles are only capable for 1080p and not 4k and there is not to much 4k content yet and will not be till 2017 or 2018. so what I did was bought a Sony 1080p and saved about $500"}, {"text": "WOW"}, {"text": "4K SUCSK! HD SUCKS! 2010&#39;S IS THE WORST DECADE EVER! TAKE ME BACK TO THE 00&#39;S UP TO 2006"}, {"text": "You have small hands man..."}, {"text": "Yes, but what is the latency on this thing... ?"}, {"text": "I didnt impress with the big tv. But, I impress the big gun you hold. I really want pc like that but... 💸💸💸💸💸"}, {"text": "fantastic device, too bad  todays devices aren&#39;t sustainable, if it stops working after ur warranty is expired it&#39;s very hard to find parts depending on model or professionals to fix these LED Tv/ monitors"}, {"text": "4K is nice, But never worth the amount you have to shell out on a gaming unit to properly handle it.<br />I&#39;ve had 4K monitors &amp; TV&#39;s, It nothing mind blowing.. In a way 1080p once was coming from standard definition.<br />Unless you have cash to literally burn, I would&#39;t go out of your way at all.. But if you just want a 4K TV anyway (And they are much cheaper now) Go for it why not.<br /><br />One word of caution: If you buying a 4K TV for PC gaming, Make sure that set is capable of chroma 4:4:4 through the HDMI 2.0 !<br />And that the GPU has HDMI 2.0 ."}, {"text": "nice table"}, {"text": "What&#39;s the config of you PC? And how much you paid him?"}, {"text": "Hey, i have one question<br /><br />Why you used your pc connnect in tv for play GTA5, and another games? why you dont used SHIELD to make straming games? Shield just do it 1080p streaming? i see you play in 4k pc games right?<br /><br />Tks, nice channel, rgs from Brazil"}, {"text": "which game is this at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m15s\">6:15</a> ???????"}, {"text": "The opening scene, a brief summary of every 12 year old who just started gaming"}, {"text": "mywAh but amsomebody dosent have money for 4k"}, {"text": "chris pratt?"}, {"text": "great tv and video.<br />i never liked gamemode on any tv, normaly it changes the colorsscheme and there is no way to change it.<br />what is the latency on this tv?"}, {"text": "This is insane"}, {"text": "that&#39;s so cute. I think I will stick with my 120&quot; projector nevertheless :)"}, {"text": "Who watched this on 4K?"}, {"text": "which is the racing game he played"}, {"text": "If i plug my 360 xbox in to this will i get for k, i have a scart lead to plug in do i need that to make it work for k. Ive been using 6k for my playstation so i need atlese for k for it to look good in my room."}, {"text": "Future of gaming? I would say that is VR."}, {"text": "HardwareCanucks   what was the game did you play at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=05m05s\">05:05</a> please ???"}, {"text": "in my opinion oculus rift is better"}, {"text": "I&#39;ve got the 9500 version, It&#39;s amazing"}, {"text": "Gaming on TV?<br />Naaaaaaaahhhh? Big nah nah!"}, {"text": "the support sucks"}, {"text": "Get a Mychoice 65&quot; tv for gaming it&#39;s the best"}, {"text": "no joke that is an orange county living room"}, {"text": "looks like theon grayjoy"}, {"text": "you need something of a hand size beside the telly, for visual comparison (if you know what i mean). other than that, the video is pro.<br />i am gaming myself on 42inch 60hz tv, and in terms of mouse aiming (g502) the games controls responsiveness and feel are varying greatly, i am not sure if tv is making a difference. same for driving games."}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m28s\">0:28</a> Idk why but you really remind me of Jack Black, haha"}, {"text": "36.9ms input lag no thanks..."}, {"text": "I have the 55&quot;"}, {"text": "Money, Money<br />Life&#39;s A Bitch,If u are not &quot;Rich&quot;."}, {"text": "Your TVmay be also 8K, but games are not in UHD. So it&#39;s useless for gaming (until now)."}, {"text": "So stupid hope your not playing fps on that"}, {"text": "plz anyone tell me about phone shown at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m12s\">0:12</a>"}, {"text": "Big wow. The way forward is HD Projection. Flagship Epson 1080P LCD with all the bells and whistles with a 120 Inch electric screen. 3 grand.....done! Simple to set up and blows this set up out the water."}, {"text": "Whats this commercial?"}, {"text": "just came here to see that halflife 2 gameplay.."}, {"text": "awesome! i have the series 9 65js9500 ^^   i use it on my desk for gaming/films/music production.  its...  awesome!!!!!!"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=02m37s\">02:37</a> are those marks?"}, {"text": "I don&#39;t like that system game, I like PlayStation 4 it&#39;s more stronger than Nvidia, now I saw in the video that you can change the resolution, that helped me a lot because I wasn&#39;t sure it will play on 4K so I&#39;ll buy a SONY or Samsung TV, thanks for the review"}, {"text": "Will they ever make these in a matte style so reflections won&#39;t be an issue?"}, {"text": "INSANE LAGGING on 65-inch 4K TV!!! ... i bet you wonder why you lose online"}, {"text": "is he playing dirt?"}, {"text": "lol i got 92 inch. projectors all the way!"}, {"text": "It&#39;s amazing TV. I bought Philips 7909 49&quot; 4k and my is 1000 times worst then Your. Good choice!"}, {"text": "How close do u sit to the tv? I mean in general not just 4k content. So 1080p gaming/blu-ray and also sd content."}, {"text": "How did you get such a high resolution with an HDMI wire? I thought you couldn&#39;t get higher than 1080p? Awesome TV btw! Just got the 9000, love that damn TV."}, {"text": "Я слышу твой акцент)"}, {"text": "so cool"}, {"text": "Oh great internet! Auto Quality to 4k when I only have a 1080p TV for a monitor!"}, {"text": "how does 4k work with hdmi. i think it only works with display port ???"}, {"text": "i cant understand when companies use 4k and gaming together... i fooled for this ones. bought 4k samsung 28&quot; &quot;gaming&quot; monitor which is 60hz lol"}, {"text": "Dat intro"}, {"text": "it sounds like runescape music in the background."}, {"text": "Dude! You went on vacation in Panama! I live right there where you shot! Let me know if you come back down! We will geek out!"}, {"text": "Life is good"}, {"text": "It&#39;s gonna look like 800x600 with that large screen"}, {"text": "the sony x850c has 1080 true 120hz. it has  input lag of 37ms what do you think of that? do you think that will be fast enough to play fps  also any thoughts for 3d gaming?"}, {"text": "What is the car game he is playing?"}, {"text": "For me input lag is a big problem, I wouldn&#39;t want that. Most of the games I play wouldn&#39;t be a problem but I play a few that are time sensitive and competitive and this would ruin it. Also my GTX 980 was expensive and just one wouldn&#39;t be enough, I could never afford another one. I will probably get a cheaper TV to use as a TV and then for gaming, I will get a VR headset :)"}, {"text": "very beautiful. love to have that tv.:-)"}, {"text": "YESS now i can play on my4k tv i got the same tv"}, {"text": "thank you for showing how good it is to have the first equipment, this TV is a dream for gamers"}, {"text": "Buys 4k TV to play half life 2"}, {"text": "As far as I know, SUHD TVs aren&#39;t good for gaming due to the input lag. A Full HD TV is enough for console gaming and Monitors for PC gaming."}, {"text": "I got 7&quot; phone, but when I put it up to my face its big!"}, {"text": "nice tv ......the reflection sucks"}, {"text": "What is the box thing which has USB3.0 ports beside the tv in <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=2m22s\">2:22</a>??"}, {"text": "Meh... it&#39;s looks smaller than my monitor."}, {"text": "only people impressed by a 65&quot; TV are people that don&#39;t own a 70&quot; and above.  Sorry but I own a 70&quot; so this looks like garbage to me."}, {"text": "Cool to watch this on a 42&quot; YouTube app window... Like 30cm big."}, {"text": "I thought this model came with 240hz instead of the 60hz mentioned? is that not the case?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m20s\">6:20</a> ~ VOICE CRACK LOL!"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m19s\">6:19</a> ~ Voice Crack!!!! LOL!"}, {"text": "is that you chris pratt?"}, {"text": "Awesome review I don&#39;t see anything wrong with bigger I game on my 72 inch tv and I don&#39;t see any lag at all and it handles perfect although like you said those games and consoles them selves aren&#39;t made for such high resolution"}, {"text": "i have the same tv"}, {"text": "Oled displays are better !"}, {"text": "Wait, wait, wait... can you wall mount it? How would that look if that mini-connect cable is too short?"}, {"text": "make sure you have a hi speed HDMI cable"}, {"text": "What is the compatible graphics card of this specs:g2020(2.90ghz)4g ram ddr3 ? Pls reply."}, {"text": "I have a 55 inch Philips with Ambilight in the living room, I hooked up my pc just to see how it would handle the 4K resolution (I have a GTX 980Ti)... Awesome! Project Cars, Assetto Corsa, Dirt Rally, World of Tanks, GTA V, The Witcher 3, Fallout 4... incredible! Btw where did you get that wallpaper? :P"}, {"text": "Awesome Man"}, {"text": "Just tried my pc on my 3dtv, Wow cant believe how shit it looks, Even when i use dsr to upscale to 4K it looks incredibly bad."}, {"text": "mine in my room tho, and i got a 75in 4k tv in the living room, ha."}, {"text": "i got a 50in 4k tv lol im in the boat too"}, {"text": "nice review as always"}, {"text": "It&#39;s so beautiful. At some point it stops being a TV and becomes more like a portal.<br /><br />I would break it. I would walk into it and break it. I&#39;ll stick with my 24&quot; 1080p. It&#39;s just safer for everyone."}, {"text": "what racing game were you playing?"}, {"text": "is it me or does the 4k display look more beautiful than the display im watching on?"}, {"text": "Can I use this 65inch tv as monitor?Will the text look good or blurry?Does watching youtube 480p video full screen in PC mode look blurry? Thanks"}, {"text": "Can&#39;t afford tv table, buys $2000 tv."}, {"text": "Great Review. Fantastic hardware. Thx 4 that.<br />I invite You to watch my channel too Bro :-)"}, {"text": "and curved sound bar"}, {"text": "i got it"}, {"text": "i wish my tv was 20&quot; bigger :&#39;("}, {"text": "Honestly this would be badass but I sit at a desk with my 27&#39; Asus ROG Swift PG279Q 165Hz, 1440p, 4ms, ips, g-sync monitor and with my Graphics card I can change my resolution all the way up to 5120 x 2880, SOOOO with that 65-inch screen if you used a high end computer you could enable DSR (Dynamic Super Resolution) and play games at 5120 x 2880 resolution and it would look absolutely badass."}, {"text": "What camera are you using?"}, {"text": "Dmitri. I just check you video with 44100.00 hz 2ch 32 bit float audio. on a HD 598SD. Now I need a dac. coming soon.! Guys you have to check it in 4k with these configuration. Love the part on the start!"}, {"text": "wow"}, {"text": "so lame..."}, {"text": "What racing game is that?"}, {"text": "Very cringing intro."}, {"text": "There is nothing INSANE about Gaming on 65 inch, If people like this maybe I should post a vid of my 127 inch screen with 4K projector."}, {"text": "my poor heart can&#39;t take it anymore :&#39;("}, {"text": "Samsung blahhhhhhh <br />Fuck it<br />Sony is good 👌"}, {"text": "é a melhor que ja vi tenho uma nâo a nada igual 4k a unica tv que voçe deve comprar"}, {"text": "This guy has every cool stuff, it becomes really boring."}, {"text": ":&#39;("}, {"text": "id gladly replay half life 1 and 2 on a 65 inch TV haha"}, {"text": "The Samsung UHD tv line, has a lot of input lag :/ Have a 48 inch UHD myself, and the problem is huge, when you play GTA or other shootings games. <br />If you want the best experience, then go for Sony. <a href=\"http://CNET.COM\">CNET.COM</a>, made a review and Sony blows away the competition. I should have known that, before buying my Samsung TV :i ... Although the resolution, is crazy GOOD... :)"}, {"text": "may i know whats racing game in this video?"}, {"text": "1080p is still the best for gaming"}, {"text": "4k at 60Hz?!??!!?!?!?!<br />wow im in the future guys ;p<br /><br />i can&#39;t imagine what it&#39;s like to watch 4k video at 60 fps... probably epic XD"}, {"text": "that response time tho..."}, {"text": "At the beginning a wondered why KSp started :D<br />then i realized, its the video"}, {"text": "notice the table that the tv was on. that explains, he is dead broke by buying that. and that table of an abomination is going to fail you with a small bump with your feet accidentally."}, {"text": "What a nice and crisp video, to be able to see all the dust particles on the floor."}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m55s\">1:55</a> When i see the same monitor with the same background as me."}, {"text": "When you got a 90in TV(SHARP LC-90LE657 Aquos) and you see someone going &quot;AHHHHHHHH&quot; at a 65in, your just like &quot;meh&quot;"}, {"text": "Wow you wealthy son of biatch! Nice vid."}, {"text": "(•_•) <br />∫\\ \\___( •_•)<br />_∫∫ _∫∫ɯ \\ \\<br />The fuck are you looking at?<br />Keep scrolling down !"}, {"text": "star lord it&#39;s you?"}, {"text": "That&#39;s one awesome gaming 4K TV. I love my 55 inch for console gaming. But love my PC rig the best for gaming. I love gaming that&#39;s that! It&#39;s good for my mental health. Peace!"}, {"text": "what was the first racing game he was playing  pls help me"}, {"text": "can someone send me this ?"}, {"text": "Input lag. The only reason that will probably stop me from getting a large TV for gaming. I played Tekken on a huge TV like this, and the hits happened one second after i pressed the button. While i was the best from the people playing from my friends, i lost because of this. Really annoying."}, {"text": "Tried using the 4K 40&quot; JU7500 as a gaming monitor and it just wasn&#39;t up to it like I had hoped. I really wanted it to work as it&#39;s capable of 4:4:4 chroma but the input lag was noticeably worse then regular monitors and the pixel response time is awful. Same issue with the JU6500 and JU6700 so I went back to using my $400 43&quot; 4K Vizio as a monitor. A bonus is the blacks on the Vizio destroy the Samsung&#39;s due to the FALD backlighting which only the $3,500+ JS9500 has. Btw, to me thin = bad. Basically thin means no full array backlighting and most likely cheapo edge lit which manufacturers love to exploit peoples love for &quot;thin&quot; as it saves them big bucks while charging more for less. Notice their flagship the JS9500 isn&#39;t nearly as thin."}, {"text": "I bought the Samsung UN65JU7500 4k instead, a bit cheaper but an awesome TV for gaming. It has around 19ms input lag and looks great even though it has to upscale the picture when I play PS4"}, {"text": "ENJOY MAN ;)"}, {"text": "i have a 55 inch curved 4k tv and 5.1 surround sound system in my bedroom<br />gaming and movies are awesome lol"}, {"text": "Pablo Escobar reviews a 4K tv"}, {"text": "The fucking 4K TV has more definition than real life what the fuck or it looks a lot better than whatever camera and lighting this guy is using to recording jesus."}, {"text": "too much glossy ... I want matte finish anti glare display"}, {"text": "that TV is so reflective it&#39;s as bad as an old CRT"}, {"text": "Oh I want all of your gadgets so bad..."}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=5m37s\">5:37</a> I really thought it was a man standing between the CPU and the TV."}, {"text": "damn that&#39;s alot of money RIP"}, {"text": "Where did you find your desktop background picture? It&#39;s amazing. <b>-</b>"}, {"text": "This guy should dress up as starlord or owen grady to fancy dress parties."}, {"text": "Good video - thanks !"}, {"text": "Ramen pc @ <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m50s\">6:50</a>"}, {"text": "fucking beautiful!"}, {"text": "do you think a 65 inch HDTV would fit in the trunk of a Ford Fusion with the back seats folded down?"}, {"text": "That computer.... what are the specs on it? It&#39;s beautiful lol"}, {"text": "man that laugh at beginning of video was terrific...  reminded me of laff-a-lampic cartoon from years ago which had a dog cartoon laughing exactly the same way"}, {"text": "i have already been playing fps on a 1080p 40 inch for two years now and the input delay is there but im fine with it, so is this tv worse input delay or same?btw for medical reasons i cant sit at a desk so got no choice but use a tv"}, {"text": "and you&#39;ll have so much lag its be crazy"}, {"text": "C&#39;mon. Top Notch. phobic vigorous   !!!"}, {"text": "why not just go to the 88 inch samsung 4k tv."}, {"text": "Quiero ese mismo jajaj.. yo tengo un smart tv 3d de 46&quot; para jugar.. pero este de 65&quot; es un cine en casa.. me encanto.. lo quiero"}, {"text": "Nice setup, but I prefer to spend my money on the Oculus Rift CV1. When it will become available of course..."}, {"text": "I came here for <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m00s\">1:00</a>."}, {"text": "That moment when you walk into your friends house and they have a Xbox 360 hooked up to a 4k T.V."}, {"text": "nice"}, {"text": "65 inches ? you call that gaming.......i&#39;m gaming on 140&#39;&#39; projector screen"}, {"text": "I have an 55&quot; UHD Screen from Samsung, the problem is that it only supports up to 30 Hz, even in WQHD. Only FHD and lower supports 60 Hz. Is still funny to play on it, but seriously i prefer my 144 Hz 27&quot; WQHD Monitor, it is so much smoother which is for me a very important aspect for gaming :)"}, {"text": "should have tried Quake 1 upscaled"}, {"text": "whats that racing game he&#39;s playing at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m05s\">6:05</a>?<br /><br />Cheers"}, {"text": "ah man! wish to have one of those! but too expensive to me bro"}, {"text": "Did you turnoff the smooth feature on the picture menu? That got rid of the lag on mine."}, {"text": "Fell like the tv is a REfurb. Also the latency tho...."}, {"text": "&quot;Let me show you what living room gaming is like&quot; <b>pulles out TV</b> <br /><br />&quot;Rly dood?&quot;  <b>walks into home cinema</b>"}, {"text": "I think 1440p is the sweet spot for today&#39;s hardware."}, {"text": "Wow, a TV that looks sharper than real life, congrats! Now why don&#39;t you calibrate the TV and see how it truly looks like, and you&#39;ll be disappointed."}, {"text": "Nah... in the future they need to build console into a tv or pc :) that would be realy future :)"}, {"text": "Not back-lit, it&#39;s edge lit. Just so no one is miss led"}, {"text": "label the HDMI as PC in the source"}, {"text": "never knew matt damon does tech reviews"}, {"text": "COOL man!"}, {"text": "damn...even the likes are at 4k On this video! lol"}, {"text": "Omg so nice"}, {"text": "I won&#39;t be buying a 4k TV until they can be had affordably at 50+ inches and 120+ hz.  $1000 or less."}, {"text": "Which game was the racing game @<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m05s\">6:05</a> and <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m05s\">7:05</a>?"}, {"text": "just 65&quot;, sell that paperweight and get a HD projector and enjoy 120&quot;"}, {"text": "their tv&#39;s were better built last year these new ones are booboo. ill stick with sony for tvs"}, {"text": "TV Goals"}, {"text": "You should try it on the 40 inch 4K monitor that is available. I think philips makes it.<br /><br />It&#39;s a monitor intended for gaming, not a TV."}, {"text": "how much money will cost to buy this beast?"}, {"text": "75 inch...... I beat you XD"}, {"text": "YOU lucky canuck!!!!!!"}, {"text": "How about the 75 inch X910C :)"}, {"text": "samsung is sucks"}, {"text": "How can i make this  video load faster? I have fast internet and a very fast custom built computer but it takes forever to load it in 4k o.o? 95 download 15 upload, Radeon 290x8gb color devil"}, {"text": "and I thought my technology was legit. this is the next level."}, {"text": "That stand is hideous! It is always prominent and Samsung wasted an opportunity to integrate a sound bar into the stand."}, {"text": "awesome man!!!!!"}, {"text": "hardware cucks"}, {"text": "Too small, get one of 90&quot; and then we´ll talk.... =)"}, {"text": "Meh 65&quot; TV&#39;s arent that impressive anymore. It&#39;s almost becoming the new standard."}, {"text": "love that tv stand,were can I buy that at?"}, {"text": "consumerism yeah!!. i love it"}, {"text": "is there ANY games that are in 4k even ??"}, {"text": "Yeah and it probably has like 20 ms of latency. Real gamers know 1ms monitors are the way to go"}, {"text": "I swear he looks like Chris Pratt"}, {"text": "What racing game is that?"}, {"text": "Just bought a 79&quot; LG UHD TV... im set!"}, {"text": "why n0 test of  PS4 or XBoXonE?"}, {"text": "No DP seriously?"}, {"text": "i have the 48 inch on this tv an it is top of the line"}, {"text": "Where did you buy the mini table under the monitor please reply."}, {"text": "can u do an old game upscaling or bad content like 240p youtbbe , i want how upscaling work on these."}, {"text": "Just bought this tv yesterday. Its fantastic!"}, {"text": "this tv is dope"}, {"text": "Maybe I&#39;ll make a gaming video with my 70 inch 4K Sony XBR. :P"}, {"text": "So ah I&#39;d there a port for the antenna cable? To you know watch normal television with your television?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m57s\">0:57</a> I like that reaction. It felt so genuine."}, {"text": "could I have one please ?"}, {"text": "Why? It&#39;s Only A TV, Why Do You Need This Because I Have A 4K 3D LED TV Which Is 58&quot; and It Is.. Well... Just As Good."}, {"text": "And how is the witcher 3 on that screen? :D on pc and full out ultra settings??"}, {"text": "that tv screen so good i thought i was watching green screen footage"}, {"text": "With all that money and you didn&#39;t buy a 4k OLED? smhfamilymandeusenpaitbqfh"}, {"text": "nice... but I got a 90 inc"}, {"text": "I feel like... having a penis size contest with this guy would be so fun.. I mean in no- homo brofabulous kind of way."}, {"text": "Is that Tiago Splitter lol?"}, {"text": "swedish people are known for talking to them selves, what dimitri doesn&#39;t realise is only he can see the other dimitri&#39;s in this video"}, {"text": "What racing game was that?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m07s\">7:07</a> which game is this?"}, {"text": "Great review! Thanks for this mate!"}, {"text": "That Robot game, what game is that?"}, {"text": "Can&#39;t afford a real couch, buys $2,000 tv."}, {"text": "Just got a  55inch 1080p tv and 24&quot; 1080p Monitor for my gaming rig. I&#39;m not about to go out and buy a 4k tv."}, {"text": "One thing you may have missed, if you hook it up to HMDI 2 (DVI), you have the option to enable 4:4:4 color settings.  Just a heads up."}, {"text": "Worth noting the SUHD represents Quantom dot Technology, Samsung likes to call it nano crytals for brighter colours. LG calls it colour prime and Sony calls it Triminlous. It&#39;s also HDR ready..."}, {"text": "why is there input lag?"}, {"text": "Pusi kurac"}, {"text": "Just a 8500? not even a 9000 let alone an OLED"}, {"text": "what racing game was he playing?"}, {"text": "What&#39;s the name of rally game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m15s\">6:15</a>minutes?"}, {"text": "You can get around the lag by renaming the hdmi input to PC"}, {"text": "samsungs tv stands are just getting uglier and uglier..."}, {"text": "Does someone know what is the game at 7.10?"}, {"text": "thsi is the the best tv right now in thre market"}, {"text": "Which driving game is this?"}, {"text": "that box is as tall as him, put him in the box and ship him to samsung lol no im just playing"}, {"text": "nice tv..."}, {"text": "in 10years, 4k tv will be just a normal tv..."}, {"text": "UN65JS8500 is not that good. i would have went with the sony 65x950c. way better color and is thinner than an iphone."}, {"text": "which Rally game is that please ?"}, {"text": "So he can afford a $2,000 TV but not a stand or speakers ?Lmfao"}, {"text": "i want this tv si much ....."}, {"text": "thumbs up if you tried 4k in order to try to see the 4k tv on the video lol"}, {"text": "What racing game was he playing?"}, {"text": "I got the same one its epic ;D"}, {"text": "But my eyes are only 1080p"}, {"text": "Age of consoles are over lmao. They were just used as a crossover to wait for PCs to be advanced enough to run games."}, {"text": "Too bad the response time kills it for games."}, {"text": "A WQHD monitor is still superior to this. I would even take a 1080p monitor over a 4k TV for games."}, {"text": "wouah wouak!!! i want, i want"}, {"text": "I use a 4k 65&quot; screen for my primary monitor, mostly because it&#39;s way easier on my eyes for reading text. But of course the best aspect is gaming on this thing. Playing racing sims with a racing wheel right up close to it is so immersive. One really important thing if you&#39;re considering gaming on a TV: Test it for latency in the store first. Most tvs have a &quot;game mode&quot; for reduced latency, but even so the latency varies hugely between models. I tried out 8 or so models when I was buying mine, and all but one were usable for fps / mouse driven games. Most tvs are designed for console use, and latency with a controller is far less noticeable than when using a mouse.<br /><br /><br />The way I tested latency was just an informal method where I plugged in my laptop, set the tv to game mode, and moved the mouse around. Any significant latency is very apparent when using the mouse in windows."}, {"text": "What concole is thst?"}, {"text": "Ass"}, {"text": "At some angles, he looks like Chris Pratt."}, {"text": "What&#39;s the 1st person Racing game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m06s\">6:06</a> called?"}, {"text": "vacuum the floor is what ive learnt from this video"}, {"text": "It&#39;s a nice product. But you know boys? Just wait for the Oculus Rift for true gaming. 180 degrees viewing, thats the ultimate size of display you can get."}, {"text": "you need a banana for scale"}, {"text": "LG55EC9300 &gt;<br />:p"}, {"text": "nice tv i have the samsung55 4k i would love to play my xbox one in 4k"}, {"text": "does he own shoes?"}, {"text": "How can you buy a tv you know won&#39;t have input lag?"}, {"text": "were does this screen (the one with the fujifilm camera) come from? <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m30s\">6:30</a><br /><br />thx"}, {"text": "i would of gone with the LG OLED 4K....much better picture with color"}, {"text": "What camera you are using to record this vid ???"}, {"text": "I really like your videos (y) good job :)"}, {"text": "and my friends thought I was crazy gaming on my 52&quot; Sony"}, {"text": "isn&#39;t this TV edge lit?"}, {"text": "can&#39;t stand when people use the term &#39;daily driver&#39; for electronics"}, {"text": "this tv is on a really good sale price at best buy right now!!"}, {"text": "Pleas do a video on vizios new m seriz model more specikly the vizio m60 c3."}, {"text": "give me your headphones bitch"}, {"text": "INPUT LAAAAG"}, {"text": "pron"}, {"text": "Vizio M series 4k TVs will be on sale Black Friday."}, {"text": "U r damn rich"}, {"text": "My living room gaming experience ended (had 55&quot; + good big 5.1 sound) when I discovered the magistral superiority of 21:9 ultrawide gaming a couple years ago. The living room is now only a movie thing or PS4 thing. Will never go back to playing PC games in 16:9. Now I only need the money to get a gsync 21:9 1440p display."}, {"text": "Hi. What&#39;s the name of the game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=5m07s\">5:07</a> with that robot?"}, {"text": "what&#39;s the name of the case at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m24s\">7:24</a>?"}, {"text": "man you live in heaven ;)"}, {"text": "Is this tv running at 30 or 60 hz. I know your other video had 30 at 4k."}, {"text": "I think it&#39;s too much, this stuff better for movies like batman, 27 monitor for gaming with 4k more than enough + u can see textures"}, {"text": "what do you do?"}, {"text": "Bro, you don&#39;t sound like a canuck, change the channel name!"}, {"text": "Love your beast computer too."}, {"text": "Gaming on super big screen is that fun..."}, {"text": "I am a big fan of Samsung. They are making great TV&#39;s, and Cameras. This TV is prime evidence that the Koreans are the new fully quality Japanese for the 21st century. I want one. I happen to be buying a computer that would do fine with that TV."}, {"text": "this song is a rip off from the game called: KERBAL SPACE PROGRAM<br />some lawyers shut this down pls or make him change the song"}, {"text": "i remember when you had a hd tv you were the shit"}, {"text": "This guy reminds me of Chris Pratt (Incase you don&#39;t know who that is he stars as Star lord aka peter queil in the 2014 movie Guardians Of The Galaxy)."}, {"text": "OLED is the future.  Enough with these crappie lcds"}, {"text": "Am I the only one who thinks he looks like Jesse Plemons ?"}, {"text": "What was the game he was playing at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m13s\">6:13</a>? Looks amazing!"}, {"text": "i use the 65&quot; 4K SUHD 65JS9000"}, {"text": "You look like Gunnar Nelsons brother."}, {"text": "Swear he sounds like wladimir klitscko lol"}, {"text": "Oh, this 4K looks so sharp on my 320p phone screen.. really, better than the screen itself."}, {"text": "I know this is completely off topic but you really look like Chris Pratt!"}, {"text": "waiting for console peasants to watch this because its a shame they try to buy this for their xbox or ps4 and only playing it at 720p/1080p haha"}, {"text": "This is why I bought a 40 inch 4k monitor. no input lag 60hz display port and hdmi 2.0"}, {"text": "That intro gets the &quot;Dam Good &quot; award !"}, {"text": "If you are from Canada why do you have that weird european foreigner accent?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m25s\">0:25</a> You REALLY love that wallpaper bro, lol."}, {"text": "low budget russian chris pratt"}, {"text": "WHAT GAME IS THAT ON <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m09s\">7:09</a>? Must torrent now."}, {"text": "You call that gaming? 120&quot; living room gaming :) with a projekctor, where the input lag is 28ms, so its good for gaming. tho i would not recommend fps games, i think the sweetspor for it is 24-27 inch and close viewing distance for is... idk why, but its easyer to see throw... gta on 120+ tho maan, epic! have a follow up video with projectors if possible pls :P"}, {"text": "Great review,great presentation,bravo !!!!!!!!!!!"}, {"text": "WOW, the best review of TV)"}, {"text": "Ohmaaahgerd."}, {"text": "i prefer my 120&quot; proyector buddy... imagine to see The Vanishing of Ethan Carter in my system..."}, {"text": "damn the quality in this video is unbelievable!!"}, {"text": "well you can do it the other way, build a win 10 pc that under 500 dollar and it can beat xbox one. and you can get a steam box and streaming it to the tv. and you only have to move the steam box to any other tv that&#39;s in your house. What he did just made a xbox to a pc. so now xbox had become pc."}, {"text": "I have previous year model and without 4k content it&#39;s pretty Damn avg and for gaming it doesn&#39;t look that good either"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=2m46s\">2:46</a> That&#39;s the sexiest computer display I&#39;ve seen lol. (I know it&#39;s a TV, just saying that)"}, {"text": "SUHD are all quantum dot displays which give a higher colour gamut and play HDR. They look much better Quantum Dots are not a gimmick."}, {"text": "lmao imagine CSGO with that"}, {"text": "Ugh, I hate a brushed metal finish on anything! Metal should look smooth and pure, like... well, like liquid metal!"}, {"text": "iam fine with my 24&#39; BenQ"}, {"text": "i have this same tv and it really is amazing for gaming. Waiting for nvidia&#39;s next gpu lineup to come out before i buy a full fledged gaming pc"}, {"text": "Whar u do?"}, {"text": "You look like an idiot.  And sound like one, too."}, {"text": "Fucking thing wobbles wayy too much."}, {"text": "Eh. Still has lower PPI than my 21.5&quot; 1080p screen."}, {"text": "noticable Input lag even in game mode ? hmmm.  I`ve been PC gaming for about 5 years on large TVs, first a 50 inch LG Plasma ( 720p ) &amp; now a 55&quot; LED LG ( 1080p &amp; in Game Mode ) and I`ve yet to notice any input lag problems so I can play any games that I like.  I`m guessing that at the moment 4K is the problem then perhaps due to upscaling or due to the extra rendering time needed ? either way I  can`t see myself interested in 4K gaming for a long time yet . . . .."}, {"text": "Dmitry how tall r u? on the box we see that the tv is roughly 163 cm, so ur like 170?"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m07s\">7:07</a> - what game is it ?"}, {"text": "it support full chroma 4:4:4? at 4k 60hz?"}, {"text": "guys, can we please never make glossy screens again? ever."}, {"text": "Viva Piñata!"}, {"text": "is the one connect mini included??"}, {"text": "such a poor TV, and cheap plastic. Poor Dimming"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m16s\">7:16</a> what amp/dac do you use with your Hd 800&#39;s ?"}, {"text": "I wish this tv was 21:9, thanks, great review"}, {"text": "So you wouldn&#39;t recommend this tv for playing Black Ops 3 or Halo 5 online on Xbox One?  I really want this tv but you talking about input lag has me a little scared now.  Maybe the input lag won&#39;t be as big on those games on Xbox One?  Would love to hear your opinion on this...."}, {"text": "I still think 4K is pointless. There isn&#39;t enough content and trying to stream 4K is nearly impossible. You&#39;re talking about upscaling 1080p content more than actual 4K content. I still believe that 1080p @ 60fps is better than 4K. It would be nice if the rest of technology would catch up so we can enjoy a true 4K experience, but the monitors are the only thing that is affordable or readily available."}, {"text": "I can&#39;t be the only one that had to check if their KSP had randomly opened at the beginning. .."}, {"text": "Awesome!"}, {"text": "I want a 65-inch 4K CRT TV! :D"}, {"text": "does anyone wanna buy a kidney?"}, {"text": "4K gaming on a PC is never worth the money. I&#39;ve been there done that, Sold everything to claw my money back.. <br />£1600 my system cost me, over £1000 of that was on the graphics cards alone! And that&#39;s bare minimum you will need to spend, Obviously you can go anything higher depending on brand and models of other stuff you choose.<br />Yes 4K looks great no doubt, But you forget about it after a while when gaming.. And in the end makes you think.. I can game perfectly well on much less! No need to give so much money away to those greedy companies.<br />I&#39;m back to 1080p and only 32 inches.. Am a really happy gamer still with more money to spend on better and more important things."}, {"text": "Nice. OMG &quot;Not Money&quot; :("}, {"text": "it&#39;s widely reported that the 8500 has worse input lag compared to the curved s9000- that TV has about as little input lag as it&#39;s possible to have"}, {"text": "did you use the game mode ?.-.. doesn&#39;t sound like it."}, {"text": "FALLOUT SHELTER !!!! but it&#39;s laggy on my xperia Z1..."}, {"text": "We all know how high end tv are beautifull but who can really afford a 4000$ tv. Should show us 1500$-2500$ tv would be much appreciated if they are any good if not we gonna wait for a good buy at a good price."}, {"text": "U r Russian"}, {"text": "perfect intro! keep up the good work!"}, {"text": "you sure you were noticing input lag from the controller and not from the tv itself? it takes some time for the TV&#39;s to proccess the picture, especially when they have to change resolution (downscale/upscale it) and if it was not on gaming mode, it could be more noticeable than the controller lag."}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=0m50s\">0:50</a>  Dat lifting form"}, {"text": "Was that wireless Xbox One controller being used on a PC?"}, {"text": "review was OK,but reading thru the comments is aweful. almost no one here know shitt about 4k and repeated regurgitated crap in question of lag.most 4k TVs are in 40s and low 30s. gsync monitors have mid 20s  so lag in both monitor and 4k TV are neck and neck.any lag under 50 is not noticed even in fps. especially not low 30s. if the  reviewer experienced lag its more then likely his computer or equipment. BTW the evolution box that comes with new Samsung 4k TVs are at hdmi 2.1 so my 240 refresh has been challenged with gears of war ultimate edition PC leak and bf4. both I got 211fps in 4k.<br /><br />but 8500 is a nice TV great for gaming. its lack of experience and understanding of technology is problem with gamers."}, {"text": "what racing game is he playing?"}, {"text": "Yep, I&#39;m jealous."}, {"text": "Nice review, but what about 3D contents on this tv?"}, {"text": "How did you use a shield controller on a pc game , did you just stream it ?"}, {"text": "Bro! Your cinematography skill and style is incredible. In my opinion you over shadow a lot of the top tech YouTubers with these kinds of videos. Not only was the video quality insane, but it was a quality review. Keep it up! Something for me to aspire to for my own tech videos."}, {"text": "holy fuck its huge."}, {"text": "nice intro..!"}, {"text": "Dmitry, you know you could just gamestream with the shield, rather than moving the pc?"}, {"text": "This TV looks amazing, but the input lag is a true turn off for me."}, {"text": "All ur videos r fuckin amazing!!!"}, {"text": "4k tv (any) have to much lag input at the moment. It&#39;s a no-no game experience. If you wonna play on a big screen and dont wonna that lag feel pick up a good (very good) 1080p tv. And with very good i dont mean samsung good :P Also you will not need a uber rig to push the pixel around."}, {"text": "what&#39;s the name of the racing game @ <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m16s\">6:16</a>"}, {"text": "looks like a review model?  has some scratches..."}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=5m23s\">5:23</a> So badass."}, {"text": "2expensive4u"}, {"text": "4K picture looks better than real life lol"}, {"text": "what game is that at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m07s\">7:07</a>?"}, {"text": "immediately saw the mini &quot;one connect&quot; hub thing and thought, this thing will add more inputlag, which is exactly what gamers tend to keep the most distance away from, question is how much? do you have a figure of what we are looking at Dimitri? Also, what&#39;s the name of the racing game displayed @<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m15s\">6:15</a>? THanks so much =D"}, {"text": "It&#39;s 4000 dollars. That&#39;s quite a bit, might have to wait."}, {"text": "Where can I find the awesome wallpaper you&#39;re using on your pc?"}, {"text": "I bought a 48&quot;, 4k Samsung TV, and I can say that the technology is not ready for serious gamers playing fps and rpg games, the lag was made it impossible for me to enjoy my usual gaming session.  Anyway, I sent it back and got a 43&quot; full HD sony TV, and I am more than pleased with it, maybe in a few years 4k will get better when it comes to lag and response time?"}, {"text": "Excellent intro Dimitri. Thumbs up for the most entertaining, informational and professional unboxing content. Long live hardware canucks."}, {"text": "X100T review incoming? Or is that an old video?"}, {"text": "No displayport no party"}, {"text": "I can see the 4K with my 1080p monitor :P"}, {"text": "When you click on the Video you can see, the are playing HL3!"}, {"text": "Whats the game you played at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m10s\">7:10</a>?"}, {"text": "good"}, {"text": "There Are 40ish&quot; 4k Actual Monitors with around 10 ms or lower lagg.&gt; links below...how is the input lagg for gaming on this tv?... last i heard its like 60-80 ms which is like 9-12 frames.. btw your going to want PC mode not gaming... I own a Samsung... Pc mode is way better<br /><a href=\"http://www.ebay.com/sch/i.html?LH_PrefLoc=0&amp;Screen%2520Size=31%2522%2520and%2520Larger&amp;_nkw=monitor&amp;_dcat=80053&amp;_fcid=1&amp;_sop=1&amp;_stpos=55902&amp;_trksid=m194&amp;ssPageName=STRK:MEFSRCHX:SRCH\">http://www.ebay.com/sch/i.html?LH_PrefLoc=0&amp;Screen%2520Size=31%2522%2520and%2520Larger&amp;_nkw=monitor&amp;_dcat=80053&amp;_fcid=1&amp;_sop=1&amp;_stpos=55902&amp;_trksid=m194&amp;ssPageName=STRK:MEFSRCHX:SRCH</a>"}, {"text": "What Racing Game was that?"}, {"text": "What Racing Game was that?"}, {"text": "RIP WALLETS"}, {"text": "I&#39;m sorry, but 2500,- is still to much money for a TV"}, {"text": "Beautiful tv! Nice job HWC and nice product Samsung"}, {"text": "Its my tv! I got the curved one tho...<br />He is right 4k youtube vids are friggen amazing, I have found Blu Ray movies are a little grainy and HD tv is ok standard def looks like shit..."}, {"text": "I have a question for anyone. I prefer to game on a large screen. I have a good custom built PC hooked up to a newer 50 in 1080p Samsung tv via HDMI 1.4 Why does all the content I watch on You Tube look so crappy? Gameplay videos look decent but nowhere near 1080 quality. And live action or non video game footage looks horrible.... Absolutely horrible. <br /><br /> Netflix and HBO look decent but not as good as if I was watching them on a PlayStation or bluray player. <br /><br /> I use Firefox and have the latest Flash if that matters. Any advice would be great. Thank you!"}, {"text": "aaaaah, at half the cost of LG&#39;s oled, if you&#39;re in the price range, this is budget .-."}, {"text": "A tv screen is not a monitor, but still good for casual games or console"}, {"text": "That intro was gold dude! Gold I say! Gold!"}, {"text": "I loved that little jump Dimitri!"}, {"text": "Great Review, Dude HardwareCanucks That hair though so awesome"}, {"text": "If Reddit Santa sends me one, I wouldn&#39;t say no :D"}, {"text": "Samsungs are REALLY bad for gaming. Sony is the only way to go."}, {"text": "I have samsung js8500 65&quot; suhd tv and gtx 980ti sli. I am feeling input lag while playing in 4k but zero lag in 1080p. Can anybody verify having the same issue with any 4k tv or even provide an explanation for this?"}, {"text": "I really miss the end pros and cons screen of reviews on this channel.<br />That being said, how many future kids would I have to give up to have this? I actually wouldn&#39;t doubt that it would cost more than $7,500 here in Canada."}, {"text": "Like the review and that Samsung TV looked awesome but at $2,500 usd! (And that has a $1,500 usd reduced price at Amazon which makes this TV a $4,000 usd at retail) Ouch! <br />That is a ridiculous price gulp for anyone."}, {"text": "Shitty 60Hz"}, {"text": "this intro is damn funny XD lol!!"}, {"text": "And I&#39;m here with 1680x1050"}, {"text": "And I&#39;m here with 1680x1050"}, {"text": "4K resolution = 4K dollar"}, {"text": "The stand is ugly as hell."}, {"text": "Just out of curiosity, did you get the TV for free?"}, {"text": "3999$ is a pretty hefty number, even though at amazon it&#39;s on sale for 2498$.  Ugh $_$"}, {"text": "isnt suhd used for quantum dot tvs"}, {"text": "isnt suhd used for quantum dot tvs"}, {"text": "Unit 206 eh?  Dmitry I&#39;m coming over with pizza ;)"}, {"text": "You should realy review the silent base 600 from bequiet!. I would love to see a review for that."}, {"text": "I need help! Everyone! Dmitri<br />I have this product in my mind: a small hub which you can plug your USB and audio devices into, (your keyboard/mouse/headsets) and it transfers the signal through bluetooth to the computer. This way you use have all your wired peripheral even when your rig is sitting under your TV. Couple this with a mini lap desk and you will have yourself an amazing living room PC gaming experience. However, my search for such a product has not returned anything. Do you guys know whether this is already available? Or does no company make such thing yet?"}, {"text": "I really like this review! I personally game on a TV with my pc, but I would like to know exactly what the input lag is on this model.  Mine is 22ms input lag and I wonder how this stacks up. Great video,  BTW."}, {"text": "Awesome video! Especially dat intro!"}, {"text": "Just do it !"}, {"text": "Does the S in SUHD TV stand for Samsung or what?"}, {"text": "Great video as always man! I absolutely love all the camera angles and time/effort you put into all of your videos, i loved the intro having humor added to it which i think more of your videos should have implemented. That&#39;s about it bro, keep it up. Your one of my favorites not necessarily for the content (which is awesome) but for the videos you produce, top noch and very well made!"}, {"text": "Dimitri is starting to lose his mind. Go out and get some sun bro. You work too hard."}, {"text": "The video was shot so well I couldn&#39;t tell if i was looking at a screen cap or a physical shot. nicely done!"}, {"text": "buen video, yo tengo un Sony 4K 55 pulgadas y juego 4k Mortal Kombat , The Witcher 3 y se ven espectaculares, con cero inputlag. No todo es monitor . Saludos Dimitri."}, {"text": "What&#39;s the game at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m10s\">6:10</a>?"}, {"text": "Investing in lavalier mics would net you a worthwhile return in perceived content quality."}, {"text": "You never intodruced your twin brother to us."}, {"text": "Nice tv stand! lol"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=1m11s\">1:11</a> those candles again :]"}, {"text": "How did you watch 4k youtube on your TV , ive tried useing the Youtube app on samsung tv and it doesnt seem 4k to me ... always looks 1080p however when i use 4k video from usb  it looks stunning"}, {"text": "I was going to ask in the previous vid, what the amazingly cool tv in the background was !"}, {"text": "You really need a better mic for general use. Your voice-over mic is great but it&#39;s a really jarring transition when you are on camera. The echo really takes away from the high-quality images you are creating."}, {"text": "Very nice dude! Thanks"}, {"text": "i have the 55&quot; version of this tv and i love it! jusy wish my WCed setup were lighter to carry to the tv."}, {"text": "That shirt change!  <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=00m33s\">00:33</a>-<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=00m34s\">00:34</a>! THE PERSPECTIVE!"}, {"text": "This living room gaming I could only see myself playing Mortal Kombat with someone or something like that, nothing else. Other things simply mouse and keyboard and monitor. Specially for FPS games."}, {"text": "all i would get for living room gaming is not a cheap nvidia shield, but a xtoc mini pc with GTX 960 or 970 with 1080P or 1440P upscaled or hey go with a cheap steam machine"}, {"text": "You guys always have such great content.. Keep up the good work, absolutely the best as far as tech stuff goes."}, {"text": "dammit the intro music made me think i had ksp running in the background XD"}, {"text": "WANT"}, {"text": "giveaway?"}, {"text": "I&#39;m gaming on a 55 inch 4K tv in my bedroom using Big Picture mode using a custom build Steam box. It&#39;s a glorious experience. Between the TV, the Steam box and the Steam Controller I rarely touch the desktop and the PS4 is pretty much ignored."}, {"text": "how much is that huge tv omg!!?"}, {"text": "So when using a 4k TV has a monitor, is there anyway to split it up to four 1080 virtual monitors? I know you could snap windows to whatever sizes, but I&#39;d imagine that would get pretty annoying. Where I work I have like 14 monitors, and the bezels and gaps drive me nuts. Two or three 4k TVs would be perfect."}, {"text": "You savage lmao"}, {"text": "like your intros jajajjajaja"}, {"text": "Ide like to see a review of some 4k projectors. though the size of your living room might not allow that."}, {"text": "Not sure why but some of the edges of the TV look dirty not knocking your cleanliness, but looks like scuff marks."}, {"text": "Took you long enough :)"}, {"text": "where are you from?"}, {"text": "great quality vid the picture on the tv looks amazing"}, {"text": "This TV white balance is so accurate !!!!"}, {"text": "He must be having a ...kerbal day"}, {"text": "oled gsync 144hz monitor is wat we need"}, {"text": "Dat intro.."}, {"text": "KSP...hm"}, {"text": "that tv is massive.. love the expression on your face.. review was awesome. and the price of this as huge as the screen size."}, {"text": "What the hell even. xD"}, {"text": "whats ur nationality?"}, {"text": "Your laugh when you opened the box... It made my day! Remembers me of my childhood when unpacking presents. ;) Wish I could come over to your house and game on this beast!"}, {"text": "damn bro already scratching the TV :/ lol"}, {"text": "My 4K tv is getting delivered tomorrow. I&#39;m excited."}, {"text": "<b>*heavy breathing*</b>"}, {"text": "I&#39;m gonna be all over 4K in my living room this Black Friday. They&#39;re talking about 4K panels dropping to somewhere around $800 to start in the 60&quot; size."}, {"text": "as  soon as all tv shows and movies are in 4k i`ll buy one , for now its just useless."}, {"text": "that ksp music tho"}, {"text": "LG sure has a lot of money, they already gave out 20+ units.  5000 dollars each"}, {"text": "i actually thought those videos were like commercial videos..you&#39;re the best"}, {"text": "hey dimitri hopefully you can answer my question:<br /><br />is it worth getting a 4k tv if your gaming @1080p? does it look horrible compared to native 1080p tv? I want a 4k tv for movies Netflix ect I can do 4k on some games with my 970 but not all, is it worth it?"}, {"text": "Dude.. soot-spewing candles right next to the screen, great idea."}, {"text": "That KSP music ;d"}, {"text": "why didn&#39;t you just get the 55 or 65 in 4K &gt; 240hz model? 60 Hz is old news now, dinosaur."}, {"text": "Samsung is awesome and gettingthe SUHD is even. better."}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m16s\">7:16</a> tripped me soo hard XD"}, {"text": "lg have better tvs sorry but lgs are better"}, {"text": "Big TV&#39;s in small bedrooms is what gaming is all about ;)"}, {"text": "KEEP DOING INTRO&#39;S LIKE THIS!!"}, {"text": "That feeling you get when you fully understand how great 4k gaming looks."}, {"text": "Dirt Rally FTW"}, {"text": "I want that wallpaper!!! <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=7m42s\">7:42</a>"}, {"text": "what phone do you use dimitri?"}, {"text": "why is it glossy?"}, {"text": "Intro = Cringe"}, {"text": "Linus wears sandals and socks, Dmitry does barefeet, who&#39;s more manly?"}, {"text": "Can anyone tell me what racing game he was playing at <a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=6m14s\">6:14</a>"}, {"text": "Put on some shoes you filthy animal!"}, {"text": "Half - Life 2 in the thumbnail :)"}, {"text": "Which is this game (<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=5m09s\">5:09</a>)"}, {"text": "Bleeping when you say the length XD Freakin&#39; hilarious!"}, {"text": "This is so beautiful, I need to get a TV isntead of doing everything on a 22&quot; monitor."}, {"text": "woah, 4k is just stunning. I really can&#39;t wait for 4k content to become more available."}, {"text": "$2,497.99 for this TV DANG!!!!"}, {"text": ";_;"}, {"text": "First use a smart tv from samsung is like having the xbox one kinect spying what you do .<br />Second i think is better for gaming in 4k a monitor like the 40&quot; ones from korea that have reviews at tek syndacate.<br />For the price too but its just me XD."}, {"text": "As a ksp player I was a bit confused at first"}, {"text": "How do you connect the PC to the TV?"}, {"text": "What racing game is that?"}, {"text": "Where can I find your Desktop Background? Looks Amazing :D"}, {"text": "That intro deserved a like..."}, {"text": "PWM??????????????"}, {"text": "Lg 4K OLED is better :)"}, {"text": "Did my Kerbals escape the limits of the upper atmosphere and enter space? Nope, just the Dimitry&#39;s intro."}, {"text": "Living room? this shit is going to my bed room xD"}, {"text": "Is that the Kerbal Space program deep space music I can hear?"}, {"text": "Rtings give this:<br />Input Lag: 23.2 ms<br />With Interpolation: 145.5 ms<br />Outside Game Mode: 154.6 ms<br /> PC mode has a higher input lag of 56.6 ms"}, {"text": "ps4 does 1080p for 95% of games"}, {"text": "lol i have samsung 4k 55inch smart tv is awesome and this better"}, {"text": "Who cares about how depth a flat TV is. Anyway, the base or wall mount will make a the depth irrelevant, even a 5 cms... Personnaly, I miss plasma TV, up-to-now, I haven&#39;t found a technology that beats a decent plasma.<br /><br />And why is there a smart hub and apps. I don&#39;t think it&#39;s worth paying for that... And it&#39;s a feature that adds at least a hundreds bucks..."}, {"text": "Going full Dimitri with this video."}, {"text": "another beautiful video, from you"}, {"text": "ahahah best intro"}, {"text": "What&#39;s the name of the racing game?"}, {"text": "woah, I&#39;m pretty early"}, {"text": "I wonder if we will ever get a 4k 120hertz. . do they make a 4k 120hertz monitor?"}, {"text": "Dmitry is not skipping leg days, always ready for the beach :D"}, {"text": "Great review. But you forgot to mention that the S-UHD part stands for the TV&#39;s ability to display HDR content in the  DCI color space, rather than rec. 709 color space on most displays."}, {"text": "Yeah, it&#39;s only $2,500<br />No big deal.<br />Twice the price of my entire rig.<br />Not that bad."}, {"text": "Kerbal music"}, {"text": "Why would anyone play on this? I have a 50 in her and even that is too big to play adequately. Apart from sports and racing games nothing is gonna play good on it."}, {"text": "link for overview of your pc is not in description"}, {"text": "<a href=\"http://www.youtube.com/watch?v=IKyaNyYS5Is&amp;t=4m55s\">4:55</a> BURN !! FELL THAT BURN !"}, {"text": "I had no idea he was so short. Nice to know that he is easy to kidnap."}, {"text": "I like potatoes"}, {"text": "i love the unserious intro and that the rest of the video is really well made."}, {"text": "I cried a little on the inside seeing the scratches."}, {"text": "It has the same stand from that 4k monitor"}, {"text": "second"}, {"text": "65 views"}]