[{"text": "Thank you for the amazing video like this, Jane. Appreciate"}, {"text": "Thanks for the great job."}, {"text": "آرزو داشتم از نوجوانی بتونم باپیانو بنوازم...تشکر از اجرای زیباتون"}, {"text": "А что делать тем у кого пальцы не пролезают между черными клавишами?"}, {"text": "Hi Jane,  I love this track as many of your fans do. I have shown my 7 years old daughter who is learning how to play piano along side with me, she decided tonight to learn this one after listening to it many time. So I only just started with her. Thank you very much for effort of making this slow motion."}, {"text": "C&#39;est très jolie Jane , bravo !"}, {"text": "Fake Crippled dog theme"}, {"text": "Perfect merci"}, {"text": "jane, would you show skaters waltz tutorial....thx"}, {"text": "nice.......thanks you"}, {"text": "Hi Jane, yes, by looking at the sight lessons like this, I have learnt the techniques of hands and fingers movement, even I am very good at typing using  10 fingers, it is still very different from the piano keys and the computer keys. <br />Thank you for making my dream of how to play piano comes true."}, {"text": "Thank you for slow motion tutorial this song, Jane. It is one of the song in my list to learn how to play next year plan. I will put my head in with music notes, it is a big challenge for me.  There is something about you and your piano, once I heard it (even many times by different pinanists) I recognised your piano right away. Don&#39;t know why, may be my six senses tell me so as when I am writing this comment, I was working on my training and stop to check and I was right it was you!"}, {"text": "Спасибо за такую хорошую мелодию! Я быстро научилась играть! Хотя рисую я намного лучше чем играю на пианино.🤗"}, {"text": "Superstar"}, {"text": "Thank you, Jane. It nice♡"}, {"text": "Thanks Jane.. You are fantastic ( Rogério from São Paulo _ Brazil )"}, {"text": "Can you send me the sheets ??? Please i can give you my e mail i cant find the notes"}, {"text": "Thank you ever so much Jane! Thanks to you we learn a lot of classical сompositions! Now I can play Shubert`s serenade"}, {"text": "Thanks for playing this song jane, wish you success in the future with tour special talent in music"}, {"text": "This song falls under which grade of piano? Also could you tell me how to find the grade of the song if we want to find out. Like I am an amateur but I love this song, hence, before trying to play it, is there any way to find under which grade does the song falls?"}, {"text": "Beautiful"}, {"text": "Thank you so much!"}, {"text": "perfect!wow!"}, {"text": "perfect!wow!"}, {"text": "perfect!wow!"}, {"text": "Jane my pleasure  discovering your videos . Really thanks. Im 62 and starting to learn piano. You are my  inspiration."}, {"text": "오오 겨울연가!!"}, {"text": "Hello Dear Jane : Merry Christmas and all the dreams : forever and ever. Tkanks for all I have learn - Renata"}, {"text": "hello<br />i&#39;m from vietnamese<br />i learn piano through your videos.<br />thank you alot."}, {"text": "I love it ❤❤❤👍"}, {"text": "with pedal?"}, {"text": "Slowly getting how to play this song; there is so much emotion involved and that&#39;s what makes this truly beautiful! Thank you for sharing this tutorial :)"}, {"text": "Are you guys listening out there?<br /><br />Jane has asked us all for a $1 contribution to help a young penniless young man to buy a digital piano to help him developing his extraordinary skills so he does not have to pay rents to work on classical works he treasures.<br />We all know what we all ow to Jane’s daily dedication for making tutorials for tastes and all levels of piano music.<br />The figures can’t lie : 112 656 subscribers  74 093 753 views… That tells a lot. Doesn’t it?<br /><br />Dozens of us have requested tutorials from Jane and where very pleased when she duly delivered them.<br />Many have expressed their thanks. Meaning many of us owe much much more than $1 worth of gratitude to Jane.<br />Any objection?<br />So please guys, now is the time to show your gratitude to Jane. The money is not going to fill Jane’s wallet. Instead, it will help a very deserving young man to perfect his skills the same way many of you are lucky enough to do with the piano you owe.<br />No act generosity there. This is will only show your gratitude to Jane.<br /><br /><br />GoFundMe page: &quot;HELP SEAN GET A PRACTICE PIANO&quot;<br /><br /><a href=\"https://www.gofundme.com/cffmp-help-s..\">https://www.gofundme.com/cffmp-help-s..</a>.<br /><br />Many thanks in advance."}, {"text": "So sweet!!! Thank you, Jane"}, {"text": "beautiful your hands looks like the 50s but your legs looks like 20s"}, {"text": "Pretty"}, {"text": "Absolutely beautiful"}, {"text": "wow..my first time hearing this song.👍 Ur videos are very awesome."}, {"text": "잘하네요"}, {"text": "əla"}, {"text": "can you play detective conan music please ..and you&#39;r so cool"}, {"text": "Beautiful piece. very moving... it surprises me how a melody very simple ( like Enya&#39;s Watermark piece) can move the soul."}, {"text": "This song sounds an awful lot like Faure&#39;s Pavane... Almost plagiarism..."}, {"text": "Please let me note"}, {"text": "Obrigado."}, {"text": "omg omg omg i love this song and i will try to learn it using this vedio sooon i hope<br />great job!"}, {"text": "좋아요^^"}, {"text": "Jane,  die Pianistin mit den schönsten Händen, die ich gesehen habe... Dies habe ich Ihnen schon vor längerer Zeit geschrieben, und jetzt sehe ich hier immer noch mein Foto und auch Ihre Antwort! Das ist nicht zu Fassen, Vielen, vielen Dank, daß Sie es nicht einfach abgewischt haben. Ich wünsche Ihnen viel Erfolg und Gesundheit!"}, {"text": "hi jane, i have a questions :S, what does the notes on 6-9 measures from the last page mean?? O.o i have never seen those notes ??  the ones that have like a small note above it (one tone above the note)"}, {"text": "em mới có 11 tuổi nhg em thấy rất hay"}, {"text": "hay"}, {"text": "tbh tho I learn piano a lot from your tutorials, you&#39;re my sensei hahah. do you have fb or instagram page? or fan page?"}, {"text": "😭😭😭😭😭😢😢😢😢"}, {"text": "good"}, {"text": "You love piano"}, {"text": "Tình cảm, ngọt ngào"}, {"text": "з великими нігтями на фортепіано не можна грати але ви гарно граєте я ту пісню зараз теж грю у 4 класі"}, {"text": "hello, can anyone say what is the name of the track played in the hidden object games called the secret garden.?"}, {"text": "Uwaah, your hands are skinny! o.0"}, {"text": "as always Jane you are the best ,thank you so much"}, {"text": "amo esa canción me lleva a un momento donde despedía al ser más amoroso de este mundo MI FATHER"}, {"text": "does anyone know who sings the song ??"}, {"text": "Без подобно,но все же скрипки не хватает."}, {"text": "my absolute favourite melody, but i can just play the half of that"}, {"text": "Hi Jane, you play very well. I am just wondering if u have the piano sheet. If yes, do u mind sharing? Thank you!"}, {"text": "wow it is a cool music ,it is really very calme and has a lot of feelings ,it is really wonderful,fantastic .I like it so much !!!!"}, {"text": "Спасибо! Мелодия красивая и очень простая..."}, {"text": "in 24 sec you instead С use Eb note? it&#39;s mistake or intend?)"}, {"text": "it would help a lot if you would put the letter notes on screen :) xo"}, {"text": "Where can I find the sheet music for this piece?"}, {"text": "ahh what a nice ok lets play together"}, {"text": "where are you from , Master ?"}, {"text": "Thanks a lot for posting your videos for free."}, {"text": "СПАСИБО  ОГРОМНОЕ!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"text": "Can you play phontom of the opera or notre dame de paris on piano?"}, {"text": "dat C :D"}, {"text": "Thank you for your videos Jane :) I&#39;m going back to music after a long hiatus thanks to you! (Learnt piano at 7, stopped at 15 and I&#39;m 19 now hahaha) You play so beautifully, applaud your generosity in making these videos. Just thank you so much!! :)"}, {"text": "Nice"}, {"text": "Dear Jane, my english ist very very poor, do you understand german? Kann ich Ihnen vielleicht eine e-mail schicken um alles das, was ich Ihnen gerne sagen möchte zu erklären?"}, {"text": "Bravo, Jane, die schönsten Hände einer Pianistin, schade, daß Sie sehr wenig spielen Gershwin, Duke Ellington and Cole Porter -  und zwar im Tempo..."}, {"text": "Wow ...great performance.. I like it"}, {"text": "I see you sometime and trying to learn this music,like very much this Song.Thanks"}, {"text": "i love this song . it is very good !!!!!!"}, {"text": "Like this pianiste.thanks"}, {"text": "You Put A Kiss On My Soul."}, {"text": "Like"}, {"text": "beautiful tutorial, follow you as usual for years!"}, {"text": "Jane u don&#39;t know how much u inspired me from all Ur lessons.. Godbless u!!"}, {"text": "hello Jane, could you note me the chords? I want to play on organ keyboard... the first I know are: Am Dm G7 F Dm E7....but the end i don&#39;t know"}, {"text": "Best lesson thanks"}, {"text": "thank you!! :)"}, {"text": "Sitting at coffee shop, enjoying my drink and your beautiful music...thank you"}, {"text": "Thank you Jane !"}, {"text": "me das la partitura para  mi presentacion porfavor las nesecito urgente"}, {"text": "Прекрасно!Я в восторге,вы талантливый человек!"}, {"text": "Was searching for my favorite song, found it, searched a piano tutorial for it, ofcourse jane has one :) Thanks a lot! :D"}, {"text": "I love this song very much."}, {"text": "So greatt :)))"}, {"text": "U are playing piano unbelievably as if real soul exists in the piano.."}, {"text": "I love your channel! You have all of the best piano songs and tutorials!"}, {"text": "Thank you so much! These tutorials are the best:)"}, {"text": "this is really beautiful it looks almost luke cryung this is reality a great talent."}, {"text": "Mil gracias :))"}, {"text": "What a lady!  Knows very advanced math.  Knows music. I wonder have you ever written music yourself?"}, {"text": "Gracias por este tutorial. Saludos desde Gran Canaria ;)"}, {"text": "i love this and am learning it because of you. you sight-read it beautifully so don&#39;t say sorry. amazing thanks jane :)"}, {"text": "интересные руки"}, {"text": "Who composed this song?"}, {"text": "Hello Jane<br />I sometimes read the comments and sometimes it saddens me to see some of the silly comments, because people like you are very special.<br /> In this world we all need to look after and nurture people like you .<br /><br />I would like to find the sheet music from your web page but have bother (that&#39;s why I looked at so many comments to see if there was a link).<br /><br />Your page is extensive can you please explain how to find sheet music.<br />I also want to say Thank you and if you have a private way I can contact you. I would like to send you a gift from New Zealand to say Thank you."}, {"text": "You are amazing. You got me playing the piano again. This is the best tutorial I have ever seen. Thank you and keep up the amazing work."}, {"text": "Great!"}, {"text": "I am Very impressed with your videos. I Recently returned to studying and playing the piano and your videos help me. Thankyou  "}, {"text": "Rải tay trái đẹp quá, ngón tay dài dành cho đàn piano."}, {"text": "Ｉ  like this song and thank you very much!"}, {"text": "please post a video playing &quot;you by karen carpenters&quot;  i&#39;m from the Philippines and I want to play it to my mom "}, {"text": "Thanks so much for such great effort of u jane :)"}, {"text": "Hello Jane. I am new to acquiring sheet music and am a little lost online. Is there any sites to purchase music that you would recommend? Are ones like Music notes, Sheet Music Plus and Scribd legit? They don&#39;t seem to be. Thanks in advance."}, {"text": "Can you send me the piano sheet ? i love this song..thanks"}, {"text": "<br />wonderful !!!!"}, {"text": "I love you jane :) thanks for this. "}, {"text": "Devo admitir que aos poucos vou aprendendo a soltar melhor os meus dedos pelas as teclas. Deparei-me com o postar dos teus belos vídeo e estou aprendendo aos poucos com a bela dedicação de cada música aqui postado por ti...<br />Obrigado Jane porque contigo estou a me deleitar por cada  música que tocam os teus dedos.<br />E acima de tudo pela a tua paciência em apresentar de forma bem compassada cada nota musical. Trazendo assim os ensinamentos para quem gosta de tocar.<br />Continue com essa dedicação e que Deus possa te iluminar.<br />Obrigado."}, {"text": "Thank you so much for the effort u did to teach me this :) ^^<br /> and definitely ur fingers r so magical , along with the sensation .."}, {"text": "Thank you so much. You are most wonderful for doing this.......... but I am sure your husband tells you this everyday! :)"}, {"text": "love it, you are amazing!"}, {"text": "&lt;3 how you play the song! :) Keep up the great work! &lt;3"}, {"text": "Hello, it&#39;s very beautiful. Do you you where i can find this partition for piano ?<br />I have tried but the partitions I have founded are not as beautiful as yours."}, {"text": "what kind of your midi keyboard is used ? please, tell me sis. "}, {"text": "I cannot stress enough how much I love your tutorials.. I absolutely LOVE The Secret Garden and Pan&#39;s Labyrinth tutorials! <br />Thank you for giving me the hope and inspiration to continue playing piano! "}, {"text": "Very very nice! Thank you for slow execution . This  way is helping me particulary for left hand"}, {"text": "Thank you! Very beautiful!"}, {"text": "Chuyen day cac loai nhac cu,nhac cong,thu am sang tac nhac lien he 01283499 814﻿"}, {"text": "beautiful, really beautiful, thanks for your tutorial !"}, {"text": "My God, that’s awesome, but so hard for me :("}, {"text": "You play verry well."}, {"text": "so great! :)"}, {"text": "OMG. Jane is female that her hand look like a man..."}, {"text": "мне проще в до мажоре ее играть, и вообще мелодия на столько мелодичная что со снятием не возникает проблем "}, {"text": "Việt Nam đây!"}, {"text": "Could you upload &quot;Canon in D&quot;. I love your vids :D"}, {"text": "This is so romantic.     Lovely for your husband to hear you play.   "}, {"text": "@HealingOnew curious after reading about their tremendous popularity, watched a few after making tutorials. enjoyed them :)"}, {"text": "great! btw,do you love to watching korean drama ?"}, {"text": "Ypu are great at playing the piano! At what grade can a person play this?"}, {"text": "Hey when are you uploading a part two to prelude in gminor ? \n"}, {"text": "click the webpage link in the description"}, {"text": "Are there any sheets?"}, {"text": "thank you!"}, {"text": "А)(уенно!"}, {"text": "thanks :)"}, {"text": "great ~!"}, {"text": "спасибо ;)"}, {"text": "норм\n"}, {"text": "Hi! You&#39;re really good!! Can you make a tutorial on both of the songs Byul by Kim Ah Joong and Return by Lee Seung Gi? Pretty please!! Hope you can help! :D"}, {"text": "you can. practice practice :)"}, {"text": "I want to learn \ngood good\n"}, {"text": "THANKS :)))"}, {"text": "YOU ARE THE BEST"}, {"text": ":)  thanks for writing."}, {"text": "Amo essa musica. ♥"}, {"text": "i agree :)"}, {"text": "such a wonderful melody!\n"}, {"text": "see webpage"}, {"text": "Sheet please avishai135@gmail.com"}, {"text": "thanks for writing, glad the piece inspired you. hope you get back to playing."}, {"text": "Thanks for sharing your talent. I haven&#39;t played piano for years, but would love to get back to it again and play this music."}, {"text": "yes, wonderful piece of music. thank you for your praise. your English is perfectly understandable. thank you for writing :)"}, {"text": "Hay quá à hihi !! ^^"}, {"text": "hello :)"}, {"text": "xin chào bạn người Việt !!!"}, {"text": "hi I have not found one for piano: (\nto make the soil around the piano? I&#39;ll be very grateful if you could"}, {"text": "ok I&#39;ll look for the ground when I find I send, thanks :)"}, {"text": "I assumed it was you who sent sheets. that is a piano accompaniment for violin. Did you want just the accompaniment? it is possible to adjust the score to piano solo format, but more work. Better if you can find a piano solo version."}, {"text": "you will need to﻿ send sheets. request instructions are on my website."}, {"text": "Far Away by Nickelback? :)"}, {"text": "you will need to send sheets. request instructions are on my website."}, {"text": "poeme secret garden could do? please"}, {"text": ":)"}, {"text": "That&#39;s great !!"}, {"text": "np. thanks for trying to help out! :)"}, {"text": "please see my comment below re sheetmusic"}, {"text": "good job! :)"}, {"text": "Thanks to your video, I can play this song now"}, {"text": "khó thật chứ . tập mãi mà chẳng xong . cứ vào điệp khúc là rối tung cả lên . hix\n"}, {"text": "very sad song"}, {"text": "To everyone looking for the sheetmusic: I added a link to the song webpage today."}, {"text": "Tay phải đi dễ mà tay trái đi khó ghê mãi không xong"}, {"text": "i answered you just now :)"}, {"text": "sorry misspelled first, see that&#39;s how secure i am in these special videos."}, {"text": "you are so hardworking. i&#39;m a familiar commenter, in every video i&#39;m going to ask why you&#39;re name is bbdhrggl for a sure responce. remember, i&#39;ll always be you&#39;re number 1 fan and the firs one to actually have you in my dream! not to be creepy..."}, {"text": ":)"}, {"text": "素敵な曲ですね。心に染みました。\n"}, {"text": "Oh sorry I saw your comments now ;)"}, {"text": "Please, where can I get the sheet music for this? I have searched everywere. It&#39;s soo beauiful :,)"}, {"text": "you&#39;re welcome. I am glad a viewer requested this piece, thus introducing it to many of us, including myself."}, {"text": "Thank you so much for this depressing yet beautiful song... Even without violin, the piece is still perfect! \n"}, {"text": "yes"}, {"text": "Nice song"}, {"text": "you&#39;re welcome. I love this song too."}, {"text": "Thank you for uploading this video! I love this song!"}, {"text": "you&#39;re welcome :)"}, {"text": "hay lắm ạ ^^ thanks"}, {"text": "thank you. please see &quot;requests&quot; page on my website re Renaud piece."}, {"text": "j&#39;aime beaucoup votre musique et j&#39;ai un souhait celui que vous puissiez me jouer la musique de la chanson mistral gagnant du très grand chanteur Renaud........"}, {"text": "it is my guess that one with 4 yrs serious playing can learn this easily"}, {"text": "omg is sounds amazing im so going to learn it and what does it mean level 4 ?"}, {"text": "hay qua\n"}, {"text": "ноты plizz\n"}, {"text": "hayatmda ilk defa piano dinledm ama harikaymış, sıkıcı zannediydum"}, {"text": ":)"}, {"text": "so nice\nlove this music"}, {"text": "i like...Но со скрпикой еще лучше ..."}, {"text": "thank you. hug back :)"}, {"text": "Gros bisou de la part de la France et un immense talent ! Cette musique est si belle :&#39;( \n\nBig hug from France ! And wonderful job with a wonderful pianist =D"}, {"text": "You&#39;re welcome. glad you like it."}, {"text": "thanks for this video ^^ i very like it"}, {"text": "oh no! :)"}, {"text": "haach.....my heart is bleeding at this song"}, {"text": "Hay\n"}, {"text": "Я согласен :)"}, {"text": "Очень красиво."}, {"text": ":)"}, {"text": "i like\r\n"}, {"text": "you will need to send me the sheetmusic. request instructions are on website (description link). good luck."}, {"text": "please read comments re sheetmusic below or on webpage (description link)"}, {"text": "Hello!!! Great play!!\nDid you find a sheet music for this wondrful song??? If yes, can you please send it to my e-mail?? &quot; mariachondrogianni@hotmail.gr&quot;\nthanks you in advance"}, {"text": "ah... some music ;)"}, {"text": "yes, music is a gift of life :)"}, {"text": "đây là nhạc giạo của quà tặng cuộc sống đấy các bạn ạ\n\n"}, {"text": "focus on my finger movement, and use your ears. try the first few notes (slow part starts 3:51) to see whether you can imitate. our mirror neurons allow us to copy motion. give yours some exercise   :)"}, {"text": "anasını sıkım çok duygusal"}, {"text": "and, thanks for the compliment :)"}, {"text": "there was, but Piano-Pal was only able to find a violin/piano book. that&#39;s the closest match."}, {"text": "you play perfectly! wonderful!\nis there music sheet for this? thank you!"}, {"text": "Had to be. Requester had sent them to me."}, {"text": "So there is no sheets for that?! :("}, {"text": "Thanks. Like your logo!!!"}, {"text": "wow, what a story!  this is a beautiful song. good luck learning it."}, {"text": "there is, but all of us are having trouble locating it."}, {"text": "Thanks for writing. Your English is good. You express yourself well. :)"}, {"text": "Finding sheetmusic has become a problem for this piece. The requester send it from Egypt. Followup in vain. Piano-Pal, the small company matching sheets to my tutorials, found versions in violin-piano. She&#39;s still investigating."}, {"text": "best song , i love it ....\n"}, {"text": "thanks (:"}, {"text": "Your videos&#39;r very helpful (:"}, {"text": "tried a long time ago, in vain."}, {"text": "thanks for writing. the small company that is matching sheets to my tutorials was only able to find a book with violin and piano. But the notes -  the violin part for the RH combined with the piano LH bass, are almost the same as the piano solo score (sent from Egypt). "}, {"text": "hey,thank u for making a piano tutorial,really nice job and u are talented indeed.could u please tell me where can i get the piano sheets?"}, {"text": "not sure what you mean. this piece was requested, the person sent me the sheetmusic, I printed it, and then played it right away. you can too when you get better at reading music. that&#39;s why I encourage all of you to read music. don&#39;t forget to practice scales and arpeggios every day also  :)"}, {"text": "You&#39;re welcome..  I&#39;m a math teacher :)"}, {"text": "Thanks a lot! :* I did sing the first part!! :DD I have a question: Are you a piano teacher? If yes, you are so amazing! :)"}, {"text": "thank you. this is a beautiful song. one of my favorite requests of these 3 years :)"}, {"text": "You are an amazing piano player!!! That song make me cry :(. Im trying to sing that, I have the sheet but that is too hard for me."}, {"text": "BAI NAY HAY WA!!!!!!!!"}, {"text": "o okay i got it thanks\n"}, {"text": "try to focus on my finger movement, and use your ears too. good luck."}, {"text": "thank you, that&#39;s sweet :)"}, {"text": "You are an amazing piano player!!!!! when i get older i want to be just like you"}, {"text": "thanks, I do not understand your question though. do you mean in general, or in this piece?"}, {"text": "which notes are flat and sharp?\ngreat tutorial\n"}, {"text": "yes, super efficient small company piano-pal managed to match sheets to this tutorial. the link in the description will lead you to it."}, {"text": "I like song !!"}, {"text": "unlike me, you have natural talent. saw only 1 upload. have 2?"}, {"text": "i can only give you the info. please see webpage."}, {"text": "Esses videos de song from a secret garden todos sao bonitos"}, {"text": "the front﻿ line soundtrack..! like an enchanted forest"}, {"text": "ra magariaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"}, {"text": "you are?"}, {"text": "Bodoh"}, {"text": "omg, thank you! you&#39;re welcome! re hachiko, please see &quot;requests&quot; page on my website :)"}, {"text": "you are  the  best!!!Thank you a lot!!!I love your covers!))Please show us how to play hachiko!))))thanks!!!"}, {"text": "ohm!.! do you have sheet can you pass me the link please "}, {"text": "that&#39;s not much of an accomplishment, ha ha"}, {"text": "I can do better than this haha"}, {"text": "3 have requested this. i&#39;ll do it."}, {"text": "hi, can you do a tutorial for this song  \nit&#39;s called fragile heart by richard clayderman  \n\nthank you"}, {"text": "Just beautiful :) How did you learn ? c:"}, {"text": "1:30 to 1:33 amazing hand, i couldn&#39;t play that part like you :("}, {"text": "oh my. thanks!"}, {"text": "Chào, bạn có thể chia sẻ tôi tờ nhạc này không,hy vọng bạn trả lời sớm nhất cảm ơn.\n"}, {"text": "try some easier songs first?"}, {"text": "sheetmusic info is on the webpage"}, {"text": "i need a slower tutorial :("}, {"text": "Do you have the sheet music for this? If you do, could you send it to me? I&#39;d be happy, this song is very beautiful, you played it well. ^^"}, {"text": "Hi,. Your tutorials have really helped me with finger positioning:). Keep them coming. "}, {"text": "sorry, i have so many requests I have to stop taking new ones for a while. keep practicing to read music, soon you will not need tutorials :)"}, {"text": "can i request a song? :) the title of the song is Ni Shi Wo De Yi Di Lei - Alec Su :)\n"}, {"text": "You are playing beyond excellent... beautiful!\nAnd you have gorgeous, elegant hands :)"}, {"text": "Great video! I love this song but I could not find it. Could you give me this sheet or help me to find the link? Thank you very much."}, {"text": "those who make requests must send me the sheets"}, {"text": "how did u obtain the sheet music for this piece?"}, {"text": "Восхитительнная музыка приятная."}, {"text": "Thanks for sharing!"}, {"text": "very good ! "}, {"text": "like!"}, {"text": "thanks for your kind words. I don&#39;t have any original works."}, {"text": "ps. I&#39;ve noticed your wedding ring.   What a lucky husband you must have.  To come home and relax to you playing your piano.  Amazing.  Thanks for Sharing.  tech78121"}, {"text": "I second, what LovelyMoonGirl says..  U have an ear and a heart, thankyou for sharing,  keep it up,   by the way, if you play like this, can I hear something original, similar to this? maybe an original in this key?  Please, answer my comment with another video..  Thank You, tech7821"}, {"text": "There&#39;s a difference between using your talent to help others and showing off. "}, {"text": "Great! I just started to learn this song. I knew this from my piano teacher. Nice song :)"}, {"text": "thank you. have fun learning this beautiful piece :)"}, {"text": "this is nice =) "}, {"text": "я балдею"}, {"text": "and, someday you will realize that those who can to show off, never show off :)"}, {"text": "showing off what? lol  did you get to the slow part? my tutorials are for those who play by ear, or follow the sheetmusic, and need only occasional reference"}, {"text": "This is not tutorial!!!  This is just showing off."}, {"text": "Hay"}, {"text": "Cat video"}, {"text": "like very now\n"}, {"text": "please go my website and read the request page :)"}, {"text": "pleaseeee can you make tutorial of this nothing i&#39;ve ever known spirit stallion of the cimarronNothing I&#39;ve Ever Known  slow version please please please"}, {"text": "pleaseeee can you make tutorial of this nothing i&#39;ve ever known spirit stallion of the cimarronNothing I&#39;ve Ever Known  slow version please please please"}, {"text": "you&#39;re welcome. there used to be a 10-minute time limit."}, {"text": "if it was a bit slower than it would be easy to understand...but thanks"}, {"text": "Request from Vietnam. ^^ Such a beautiful song\nThank u so much. Love ya &lt;3...\n\n(From Vietnam with love)"}, {"text": "How old are you?? I love how you play!"}, {"text": "thank&#39;s you so much ^^"}, {"text": "don&#39;t be sad, be happy that I exercise more than you, so can eat a lot and stay thin :)"}, {"text": "Song From A Secret Garden﻿"}, {"text": "nice!"}, {"text": "the name of the song is in quotes. good luck finding the sheetmusic. "}, {"text": "this is amazing &lt;3 can you please tell me the name of that music piece or send me a link where i can find the music sheet of this song. thank you !!!\n"}, {"text": "you&#39;re doing gr8 and I liked it a lot ;) thums up ! but there is one thing, try to play it a bit slower, the same as the original one; then it would be awesome good luck\n"}, {"text": "а можна ноти?"}, {"text": "the part of the video title that is in quotes"}, {"text": "what the tittle of this piano song ?"}, {"text": "thanks, placed a rug pad under it :)"}, {"text": "hm, ok, maybe a piece of cardboard under it or something could fix the vibrations."}, {"text": "it&#39;s the pole lamp next to the piano"}, {"text": "It&#39;s a beautiful piece. Though I have to comment on the vibrating piano wire in the background :/"}, {"text": "i hope the two who dislike this coudn&#39;t find the secret garden"}, {"text": "you have lovely piano hands"}, {"text": "do a &#39;nocturne&#39; by secret garden please :)"}, {"text": "I have the sheet if you still need it.\n"}, {"text": "@emilianodeleonardi sorry, no. i don&#39;t keep the scores due to copyright issues"}, {"text": "@haphaphap10  The songiscalled &quot;The things you are to me &quot;by Elaine paige"}, {"text": "@TheTonyVo người yêu cầu từ Việt Nam, không hiểu lấy đâu ra khuông nhạc được ?"}, {"text": "Việt Nam hả?"}, {"text": "muy buena interpretacion\n"}, {"text": "@haphaphap10 I was confused too. that&#39;s why I used quotation marks: the part in quotes is the title :)"}, {"text": "@zhuzhu0816 sorry"}, {"text": "@bbdhrggl Or do you still have it ? can you send me by email ? thank you in advance"}, {"text": "From Vietnam with love ^^~!"}, {"text": "@zhuzhu0816 sorry, I don&#39;t know where the requester got it."}, {"text": "Hello, do you have the music sheet somewhere online ? I only found a different version, but I try to learn by following ur version..."}, {"text": "@GWZernest @byurkin sorry, I do not sent out scores. will remove your comments w/ email addresses."}, {"text": "Очень красивая музыка , завидую тем кто может сам исполнять её"}, {"text": "Rolf Løvland is amazing :)"}, {"text": "omg.. I searched soo long for this song ! I love you for making a tutorial for this! &lt;3 thanks a looot! "}, {"text": "@osartawi check my website?"}, {"text": "@osartawi wait list will last into﻿ next year... when you do make the request, pls include the pdf score :)"}, {"text": "I will Jane, thank you so much. Im practising now on the Song from a Secret Garden. Thank you, I almost can play it, you are such a good teacher!! My hero !!"}, {"text": "@sonjasonate list will last into next year... when you do make the request, pls include the pdf score :)"}, {"text": "Hi Jane, thank you again, I hope when the request list is a bit shorter, you will make a tutorial of Serenade to Spring. \r\nYou are the best! I love your tutorials, thank you!"}, {"text": "Man this is not helping :&quot;(\naaah i wish i can play it !"}, {"text": "thank you so much for this tutorial, the song is so beautiful, and you are playing it beautiful, it made me cry. Thank you so much Jane. \r\nKind regards, Sonja (The Netherlands)"}, {"text": "Good. I can also play it. Its so great and emotional."}, {"text": "@bbdhrggl I already have for three months ago I think:)"}, {"text": "@Khallonr1 please follow request instructions (link will be in profle) when I resume taking requests next year -- am too backed up"}, {"text": "Hi:) nice tutorial! I want to play Nocturne from Secret Garden. It would be nice if you can make a tutorial to that song too:)"}, {"text": "Very﻿ beautiful song !!"}, {"text": "@UmairahCookies ok. thank you"}, {"text": "@UmairahCookies sorry. I don&#39;t send sheets. copyright issues."}, {"text": "@bbdhrggl can you give me this music sheet?\n"}, {"text": "Thank you for the tutorial  i love it!"}, {"text": "I have long searched for this song, thank you) I love your tutorials))"}, {"text": "Where the hell is the thumbs-up buttton if you need one... Great tutorial, has been really helpful for me, thanks!"}, {"text": "@iolithe sorry, i discard the scores once the tutorial is done due to copyright problems"}, {"text": "It makes cry people... and i think when you&#39;re playing, you are able to transmit something to people.. thanks a lot"}, {"text": "@olivesgregory yes, use the pedal, but to enhance, not blur the beauty"}, {"text": "did you play this piece with pedals? thanks"}, {"text": "@AlexYoonable you&#39;re welcome. I do not understand vietnamese. the google translator comes in handy :)"}, {"text": "thanks a lot &lt;3\nbtw, u can understand vietnamese, cant u ?"}, {"text": "Can you send me the sheet or midi file? Thnx for such a beaultiful song."}, {"text": "Have you tried playing this with a violin, it sounds beautiful... Anyway, I just started playing the piano a year ago and your tutorials have been very helpful, I especially like this song, THANK YOU !!! (although I probably should start learning how to read notes) :D..\n"}, {"text": "@bbdhrggl Exactly this is just a tutorial on the original of the song."}, {"text": "@MusicLover11325 I see. thanks. but improvising is done by the individual who is playing it. it is a spur of the moment thing. once in print, it is no longer improvision."}, {"text": "@bbdhrggl  What darknoll44 meant was he wanted the sophisticated version where people improvised with more chords and swifter moves."}, {"text": "@MysTeri0usMatT7 Hey my friend  :)   incessant requests means hit-or-miss, even for those who follow instructions on website"}, {"text": "@dajzatung  yes, the joy of learning never ends"}, {"text": "cung hay day nhung cung bt thoy haha"}, {"text": "LOVE IT!!!"}, {"text": "Can you send﻿ me the music sheet . :(( \n"}, {"text": "You play it very beautifully! "}, {"text": "O.o i have a different version than this one.. lol."}, {"text": "Thank u very much for slowing the music down.Its easy to take down notes and I understand it better.It&#39;s my favorite music,hopefully I can learn to play like u HA,HA,I WISH. I bought a used electronic keyboard but can&#39;t afford to take piano lessons.I&#39;m 58 and I always wanted to learn piano but couldn&#39;t afford it when I was younger,So u made it possible for me,I finally got my wish and u made it happen.Thanks a lot for making it easy  for me to learn at my age. \nTHANKS TO U MY WISH CAME TRUE  :-)"}, {"text": "@murasunshining I&#39;m in so much copyright trouble they might cancel my channel. Buying sheets might prevent that from happening. :)"}, {"text": "Can you send me the music sheet in person? I&#39;ve been looking for the music sheet for this song but I can&#39;t find it :("}, {"text": "@phuongquyet sorry, i can&#39;t send out copyrighted sheetmusic. yt has cited me for numerous copyright violations already, and I am constantly filing disputes to keep my channel going. perhaps if ppl buys sheets this wouldn&#39;t happen? after all, this tutorial is free"}, {"text": "@darknoll44 what hard version? and don&#39;t use foul language to comment on my videos, okay? :)"}, {"text": "WTF...wheres the hard version!? I want the hard one....but nice tutoriall....ughhh."}, {"text": "These Hands are the most beautiful piano hands i ve ever seen on youtube... its a great pleasure to see this hands playing.... these hands are for the piano ... Thank you"}, {"text": "this is the most beautiful song ive ever heard in my life"}, {"text": "wow. u make me easier 2 find this song.. muahahah"}, {"text": "@lavamaster530 sorry, i don&#39;t have the hardware"}, {"text": "think you could make a MIDI file of it for synthesia?"}, {"text": "can you give me the sheet, please? Thank you so much."}, {"text": "@DearPaxton what a nice first song!  :) congrats"}, {"text": "I just learned how to play this :) Its the first song I have learned on piano officially. :)"}, {"text": "I love this piece heard it last May! I practiced and learned this despite my busy schedule.. I just love your tutorials! I actually had difficulty at first but naah... it didn&#39;t bother me.... I still continued! its just soo beautiful and emotional! Thank you once againYyour dedication on music is seriously amazing! ^_^"}, {"text": "@kkeezziiaa2 sorry, I can&#39;t send sheets. copyright."}, {"text": "THANK YOU SOO SOO SOO SOO MUCH\nTHIS HELPS ME A LOT \nI ALSO LIKE YOUR COMME AMOUR TUTORIAL \n"}, {"text": "I love ur playing ... and ur AWESOME and I&#39;m trying to learn from u .. and u are my teacher when I practice ^____^ ... I&#39;m soooooo glad that u r making all these videos .....\r\noh yeah and I have a problem cuz I have two different versions of the sheets and I don&#39;t know which one that u are using :( and there is some difference between the tow versions :("}, {"text": "@bbdhrggl nice response =)"}, {"text": "OMG! Thank you so much! Your playing is very good, and I can finally play this song! This was very helpful! Thank you!"}, {"text": "OMG this is song was like always playing in the korean drama i was watching.."}, {"text": "wow!!! i love it"}, {"text": "@pianopam1 the person who made the request sent it to me. but I do not resend these."}, {"text": "Beautiful piece of music beautifully played, Nicely done."}, {"text": "a job very well done. you&#39;re a good artist since you share you&#39;re talent to everyone here on youtube."}, {"text": "@Afguser1212 The defect is yours -- don&#39;t blame the teacher if the student doesn&#39;t learn to read music. F for you. Bye bye."}, {"text": "@96lolly &quot;Song from a Secret Garden&quot; is the name of the song. It confused me too."}, {"text": "what song is trhat i want to learn to play that song?\r\n"}, {"text": "Wait a minute,this is from Vietnam??"}, {"text": "@TheChocolatelover95 perhaps try easier songs and come back to this later? Check my monkey site song list. easier songs are marked with a star*"}, {"text": "it looks so complicated for a beginner like me &lt;/3"}, {"text": "@shadowxmaria youTube user paglaruan has an excellent video for beginners on reading music. Once you understand it, it&#39;s a matter of practice. Give it a try? :)"}, {"text": "@shadowxmaria I can&#39;t see them either. I would need the sheetmusic in front of me. Are you learning to read music?"}, {"text": "I just try and it does work!  I love it...much appreciated!  THANKS!"}, {"text": "@justcatastrophe \r\n\r\nI had the score almost just like hers.  but she played much better!"}, {"text": "@bbdhrggl i shall go now. haha"}, {"text": "i heard this song from somewhere! but i have no idea from what!"}, {"text": "Can you play the song &quot;Cho Nhau Mot Loi Rieng&quot;. It is an absolutely good Vietnamese. Somebody on youtube played it, but it is hard to see how she could play it. Man, I&#39;m addicted to that song."}, {"text": "the person who made the request sent me the score. I do not forward these. please help each other."}, {"text": "beautiful!"}, {"text": "The title is the name. It is confusing."}, {"text": "the name of this song.... please"}, {"text": "no problem!  :)"}, {"text": "oops! I&#39;m sorry :( forgive me :("}, {"text": "visit my monkeys re how to make requests?"}, {"text": "thank you very much :) i&#39;m from Viet Nam :)\ncould you make a tutorial of Rang wo ai ni (Let me love you), OST Mars, please? I really like that song :)"}, {"text": "Than you so much :D! I nearly finich this song   :D! \nLove your lesson :D!"}, {"text": "Many Thanks from Vietnam , we love it so much"}, {"text": "niceeee ! *.*"}, {"text": "Thank you for introducing this song to me. It is beautiful."}, {"text": "wonderful, i love this song, thank you for sharing.... :)"}, {"text": "bbdhrggl &gt; channel &gt; profile &gt; requests"}, {"text": "how do we request a song???"}, {"text": "Beautiful ! Thanx alot :)"}]