[{"text": "Well, imposter syndrome just increased exponentially."}, {"text": "Awesome! God like coding skills!"}, {"text": "Damn this just affirms how fucken stupid i am. I could never solve this."}, {"text": "How many problems are you solving per day ? Like in your practice routine"}, {"text": "@Errichto Can you tell me what delta in rows/columns mean?? I have no idea what concept u r using..."}, {"text": "Do you think C++ is a requirement if you are serious about competitive programming? For example, is it possible to win a tournament using python?"}, {"text": "Can u do it for codeforces contest too"}, {"text": "U code faster than maggi 😂"}, {"text": "Wait a minute, so for the second problem you at first got time of 52ms, then improved your solution and got 68ms? ;)"}, {"text": "Maybe consider creating a Udemy course for improving algorithmic skills."}, {"text": "<a href=\"https://www.youtube.com/watch?v=6kaRxT7pI4I&amp;t=0m50s\">0:50</a> &quot;can we do something smarter?&quot;<br /><br />-no<br /><br />&quot;yes we can&quot;"}, {"text": "doing the lord&#39;s work over there"}, {"text": "Really liked this! Went on and did the problems on leetcode"}, {"text": "The questions and solutions are quite overwhelming for me.......can you tell  what to do to build such logic?"}, {"text": "you are amazing, bro! hope to continue making great videos, and provide explanation as detailed as in this video!"}, {"text": "You seem to be the only high level competitive programmer who makes such videos. Thank you, man"}, {"text": "nice format"}, {"text": "What is your favorite language to leet code and why?"}, {"text": "I don&#39;t know I am making sense or not.  <br />But If you would solve problems which are popular, I mean in reference to leetcode, that would be more useful for everyone. As all the three problems was like 50 people liked 10 people disliked.<br />I am sure  there must be some fair reasons like those were already on youtube or those might be easy."}, {"text": "Wow"}, {"text": "This is really great format, if you can teach the thought process to approach these problems, that&#39;s what counts, it will be legendary."}, {"text": "You are doing nice job dude, we appreciate it very much just keep up the good work and ignore the comments by people about your video quality and all, no one in youtube makes video like you make with such dedication in CP."}, {"text": "Great lectures! Very helpful! offtop: What does Errichto mean?"}, {"text": "So happy to see you think through these problems and letting us know that it’s okay not to have the most concise solution. I sometimes get tripped up by the most upvoted solution on Leetcode, but do not find it to be the most intuitive during our first try at an algorithm design. Thanks 🙏"}, {"text": "Could you do some problems but in Javascript?Thanks."}, {"text": "Great video and an important technique described in the dynamic programming problem (optimisation using prefix sums). You can solve this problem: <a href=\"https://codeforces.com/contest/1077/problem/F2\">https://codeforces.com/contest/1077/problem/F2</a><br />for practicing this technique"}, {"text": "&quot;Apologies I don&#39;t understand!&quot;"}, {"text": "i think seperate video would be better and some more proper explination is required."}, {"text": "You are obviously a great coder...but quality of your videos are very poor...If you could improve that, i guess u would gain a lot more viewers."}, {"text": "Hi errichto! Amazing videos"}, {"text": "Only if I was even 1% of your intelligence.  🙏🙏"}, {"text": "Love all the explanations, they are incredibly helpful. Errichto is a mathematical/counting lord in my eyes.<br />Hope to see more diverse/abstract topics in the future.<br /><br />Thanks again for everything :)"}, {"text": "That third problem &quot;Maximum Equal Frequency&quot; was originally asked in Codeforces DIV2 as problem B. I don&#39;t remember exactly which round it was. The editorial also came with the same solution as you."}, {"text": "could you use other language such as phython?"}, {"text": "I enjoy you walking through the problem and writing the code piece by piece. The only criticism I have is that you speak very fast. Your brain is moving faster than your mouth. I understand that.<br /><br />I&#39;ll just listen to you on .75 speed."}, {"text": "These were contest problems from last week. Can you live stream leetcode contests? Neal wu, scott wu, uwi, kjmp and other pros also participate."}, {"text": "Love your videos Errichto.Thanks for posting"}, {"text": "The quality of videos becomes cool every day (like passing coding parts fastly, explaining the idea in several words and etc...)"}, {"text": "Your videos are very helpful! Do you suggest studying about the programming language properly before starting to solve problems? And also, can you make a video about introduction to competitive programming, explaining some basics about languages, code style, etc?!"}, {"text": "Relax errichto no need to hurry up.<br />Give the time for people to understand,  it will also make your video longer."}, {"text": "It was the first time I used software to draw on the screen over the statement/code instead of opening Paint or OneNote. Did you like it?"}, {"text": "Please take some more time to discuss your intuition behind a problem. That would be a great help 😊"}, {"text": "first here"}]