[{"text": "Plz ingredients quantity and names show tha sacreen"}, {"text": "Gemma: there’s no way that this doesn’t taste good<br />Me:🤣😂😂just wait until I try to make it"}, {"text": "So bad👎"}, {"text": "This is Amazing. I must do this."}, {"text": "What type of blender do you have? I have a Vitamix and nutribullet pro."}, {"text": "I really love your videos and I really want to make all"}, {"text": "I love cherry , banana 😍"}, {"text": "Sour Cherry ice cream please"}, {"text": "When I grow up.. I&#39;m gonna try all of these."}, {"text": "Her face when she drinks it"}, {"text": "Gemma again I would like to say you are the GOD OF COOKING.."}, {"text": "what are the mersure ments for the strawberries and cream milkshake?"}, {"text": "I make smoothies. They are delicious but no milk and yogurt."}, {"text": "Thank you so much for sharing your recipes with us!! Your ingredients and methods are so easy to follow and also everything tastes so good!! Your my inspiration 💕 I’ve made many of your cakes and treats 😊 and I get a lot of positive feedback 🤗"}, {"text": "Thank you for being a chef"}, {"text": "<b><i>frozen hot chocolate</i></b>"}, {"text": "I sign up for Bigger Bolder Baking."}, {"text": "Hi gemma..<br />Nice milkshakes you&#39;re making💜just wanted to ask if i can substitute the ice-cream with cold whipping cream or not?"}, {"text": "What ice cream u use it?vanilla is it?"}, {"text": "The banana pudding and s’mores one looks amazing"}, {"text": "I really want to make your homemade phish food ice cream"}, {"text": "Are you using vanilla flavoured ice cream?"}, {"text": "Wow now I can make my own instead of buying it!"}, {"text": "Nycc diii bt tel m Howw wee make wipped creamm.."}, {"text": "Awesome as usual💫"}, {"text": "great video and those all flavor are delicious"}, {"text": "can you make a <br />hazelnut nutella one then make a<br /> orange tootsie roll  then make a<br /> french frie one <br />cause french fries taste great with vanilla icescream be sure the french fries are cooked call me crazy i made all three"}, {"text": "Got a new recipe<br />Make banana pudding milkshake in the morning have a sip and think i have got some extra time and i can have a nap place the milkshake in the freezer and nap too hard wake up. Oh i am late and rush for work come back tired and forget about it. At night while watching movie crave for ice cream and open the freezer and remember about the shake taste the frozen delight and be amazed!!"}, {"text": "So, did you use ice cube to mixed it ?? Thanx"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WzMo5mMn0gY&amp;t=0m45s\">0:45</a><br />No offence but🤓<br />when she said &quot;out of style&quot;❤<br />            All I thought about was Taylor Swift&#39;s &#39;Style&#39;. 🙂<br />                 😂😂(LOL!)😂😂<br />( Swiftie and <b>Bold Baker forever</b> )"}, {"text": "Omg I remember watching these videos!<br /> 2019?<br /> Love bigger bolder baking💗💗💗"}, {"text": "Hi Gemma may I know what the name of your blender????, Thank you very much your tips 🇮🇩🇮🇩🇮🇩👍"}, {"text": "Are there any milkshakes without ice cream??!!"}, {"text": "Yummy..Yummy😍💟💟💗"}, {"text": "Hindi me btao to mja aaye"}, {"text": "I can’t have this stuff cause it’s crazy sweet, I always feel like I need a full glass of ice water right after two sips. Anyways maybe it’s just me who enjoys more healthy and tasty desserts and drinks"}, {"text": "what about a mint and choc milkshake or a passionfruit milkshake?"}, {"text": "I can&#39;t wait to make this soon.."}, {"text": "Ever tried making chocolate bar milk shakes as there awesome in uk x"}, {"text": "In UK we have milk shake chocolate powder lol so technically that was not a hot chocolate milk shake it was just a normal chocolate milk shake but still it looked nice and tasty 😊"}, {"text": "Would it be cold if it doesn&#39;t have ice?would it be ok if i put ice with it while it is on the blender? Cause We&#39;re going to make this on our school food bazaar hope it would ne good and not much pricey.."}, {"text": "@Gemma <br />can you use yoghurt instead of ice cream"}, {"text": "Some kinda mint"}, {"text": "I Loved frozen chocolate milkshake"}, {"text": "How can i make whipped cream using fresh cream because that&#39;s the only kind available here? Please help🥛"}, {"text": "I missed you"}, {"text": "fantastic"}, {"text": "First tip: never watch this when you are on a diet. I&#39;m crying right now 😭😭😭"}, {"text": "Hi I love your Youtube. Show question. How can get one of that red blender. You use on your show thanks"}, {"text": "😙HOT CHOCOLATE"}, {"text": "Buy oreos and crunch them up in the milkshake."}, {"text": "I love all the four"}, {"text": "Milkshakes are too sweet!!!!"}, {"text": "This isn&#39;t cooking!!! I like cooking but these are MILKSHAKES!!!!!!!!!!!!!!!!!!! I HATE MILKSHAKES!!!!!!!"}, {"text": "BORING!!!!!!!!!!"}, {"text": "Wow Gemma. All five of those milkshakes look very delicious. There&#39;s no doubt that they are also very refreshing."}, {"text": "Mam can you please share link of different smoothie recepies pls.."}, {"text": "I don&#39;t like sweets but I love baking.. looking forward for more yummy and easy recipes Ms. Gemma!<br />Thank you! :)"}, {"text": "Wow! It&#39;s very easy and it looks pretty good.. wanna try it some other time! <br />Thanks a lot Ms. Gemma!"}, {"text": "Can you make a kulfi <br />milkshake"}, {"text": "Wow"}, {"text": "Frozen<br />Hot<br />Chockolate"}, {"text": "Please ice cream free millkshakes"}, {"text": "Those looks so gooood..... love your attitude :)"}, {"text": "I&#39;m new to your channel but really you nailed it Maam Gemma"}, {"text": "I want u to make an Amazing cold coffee in ur style! Will just love it! 😍"}, {"text": "Can you do more milkshakes video"}, {"text": "حرام شفافا كتير زغار وسنانا كتير كبار حرام <br />بعدين عملت بلظبط لوصفة متل ما عملتا وما حدا الي Yami yami 😢ولا"}, {"text": "woow nice and simple"}, {"text": "Plss make strawberry cheesecake milkshake😊"}, {"text": "I found this European white chocolate hot chocolate powder, do you think that would work for the frozen hot chocolate one?"}, {"text": "Hello ma&#39;am. What kind of milk will I put? Pls reply pls"}, {"text": "I really enjoy watching ur videos it would  be more helpful if you let me know  what company what sort of the blender machine  You are using if possible provide the link from where i can buy this ."}, {"text": "What kind of Icecream do you use, the flavoured ones or non flavoured?"}, {"text": "I love all the recipes they are wonderful 😋😋😋😋😍🤤😘😍😉"}, {"text": "Twist and shout anyone?          :’’’’("}, {"text": "Please also provide details of the ingredients!"}, {"text": "Tasty 😘"}, {"text": "Amazing ..am flat"}, {"text": "Oh Gemma...!! you are so sweet!!😍and do you remember my lava cake without eggs recipe request??"}, {"text": "Thumbs up 👍"}, {"text": "Gemma u now the banana milkshake when I make it it is yellow and when u make it it is white I really want mine to be white to!!!!!I&#39;m stuck with yellow noooooo😕🙃"}, {"text": "Hi plz help me which milk should I use. Is there any specific milk to use milkshake plz plz help me"}, {"text": "Hi, is there a especific ice cream flavor you used or recommend me to use?"}, {"text": "Hey! My mouths watering badly"}, {"text": "am a new subscriber for ur channal i love ur all videos its help me moree thnk uuu....more videos expectinggg .love frm kerala india☺"}, {"text": "if we dont toast marshmellows ......then what..."}, {"text": "I hope you&#39;re making a part 3 this coming summer"}, {"text": "I would like to see mango, green apple, avacado, lichi, tender coconut milkshake recipes"}, {"text": "What type of blender do you use?"}, {"text": "Hey Gemma, do you know of an Indian substitute for vanilla wafers? We don’t get anything known as vanilla wafers in the stores here."}, {"text": "I love it!!!!"}, {"text": "Ilove watching all your video miss gemma😊"}, {"text": "Is it possible to mix mangoe into milk?"}, {"text": "delicious but will definitely get fat"}, {"text": "How much ice cream do we have to add with the milk?"}, {"text": "Her taste of background music is horrible"}, {"text": "Gemma, your channel is amazing! Great recipes and you present them so very lovely. Thank you so much for sharing your talent with the world. Wish you all the best! Love from Sarajevo, Bosnia and Herzegovina."}, {"text": "As I am your new subscriber I will request to make  blue berry milkshake"}, {"text": "I love the way you react to tastes, like you&#39;re caught off gaurd by how good everything is."}, {"text": "Thank you for video"}, {"text": "Thanks"}, {"text": "I love your milshakes  help me make it"}, {"text": "Hi! Awesome video, and i have a follow up question. I have a high speed blender (with smoothie mode as well) but whenever i try milkshakes, they end up too liquid and not thick at all, even if i use barely any milk and mostly icecream. What am i doing wrong?"}, {"text": "Hi Gemma, do you have any good savory recipes with celery?"}, {"text": "Hi I am your big fan and like your videos ❤❤"}, {"text": "Hi Gemma if I’ll not find vanilla wafer in my country for banana pudding milkshake thn what’s the substitute for that, will wait for your reply , Thanks Simran"}, {"text": "i made a milkshake with homade ice cream!🍦"}, {"text": "Why hasn’t she made frozen hot chocolate ice cream"}, {"text": "which is more important, the marshmallow or chocolate <br />i&#39;m marshmallow"}, {"text": "I like  her recipe very much and they are very simple to. And nice too"}, {"text": "I like  her recipe very much and they are very simple to. And nice too"}, {"text": "I like  her recipe very much and they are very simple to. And nice too"}, {"text": "Can you make milk powder if possible please!!!!!"}, {"text": "Sorry capucino&#39;s lovers"}, {"text": "Delicious. Is it possible I can see other flavors   of fruits such as pineapple and more. I am a capucino&#39;s I want to see a recipie"}, {"text": "Could you please make chocolate milkshakes."}, {"text": "hi gemma i first came to your website in youtube on 25/9/17 and the first ideo i saw was no machine icecream so can you show how to make a rajbhog icecream"}, {"text": "They are the best milkshakes ever i love them"}, {"text": "these are so much better than the ones made by McDonald&#39;s"}, {"text": "I love your milkshake video"}, {"text": "I love all your videos I watch them over and over again :-) :-) :-) :-)"}, {"text": "Frozen hot chocolate?!?! Oxymoron!!!!"}, {"text": "i wish i could have them all as many times as i wanted and dont get fat AT ALL 0_0  lol<br />good work Gemma &lt;3"}, {"text": "I am 10 and i love to cook and bake"}, {"text": "That smore milkshake is BIG and BOLD😍😍"}, {"text": "good milkshake good night"}, {"text": "delicious"}, {"text": "Nigga what"}, {"text": "Can you make a Japanese inspired parfait?"}, {"text": "Can you do more frappuccinos?"}, {"text": "Am 13 n I love cooking but I also love funfetti milkshake"}, {"text": "awesome"}, {"text": "pls make butterbeer!!!!!!!!"}, {"text": "Gemma u r fantastic ur milkshake and ice cream recipe are just superpe  I LOVE  IT 👌😋"}, {"text": "Do they bring all the boys to the yard"}, {"text": "I wonder if she had to puke offscreen after eating something..."}, {"text": "My husband is lactose intolerant. Can you make milkshakes without real ice cream or yogurt? Maybe like an almond or coconut milk?"}, {"text": "I love your videos 😍😍"}, {"text": "can u make mint n chocolate milkshake!❤"}, {"text": "I&#39;ve never eaten a s&#39;more"}, {"text": "<a href=\"https://www.youtube.com/watch?v=WzMo5mMn0gY&amp;t=4m23s\">4:23</a> 🤦🏻‍♂️🤦🏻‍♂️"}, {"text": "Highlights <br /><a href=\"http://www.youtube.com/results?search_query=%235-\">#5-</a> &quot;Or you can use store bought &quot; in Gemma&#39;s disapproving voice"}, {"text": "Caramel chocolate swirl"}, {"text": "please make a Unicorn Frappuccino!"}, {"text": "hi gemma!! great video! keep up the great work!!"}, {"text": "instead of Nillas.. can I use Eggnog? it looks like an eggnog"}, {"text": "Cinnamon milkshake"}, {"text": "sister I saw another youtube id of your name.thats may be copy video of your link"}, {"text": "is it just me are does she remind you of jacksepticeye and not just because she&#39;s Irish but she funny and energetic"}, {"text": "Gemma you didn&#39;t call the lids hats in this video 😢"}, {"text": "I would love a chocolate chip milkshake!!!"}, {"text": "Next milkshake recipe episode,will you make a strawberry cheesecake one? Thanks!"}, {"text": "My name is Rishima"}, {"text": "Hi Miss Stafford I am a nine year old girl.I love cooking and I love your recipes too.I&#39;ve tried some of them.I love making Mocha Frappuccino it&#39;s my favourite recipe."}, {"text": "Gemma could you possibly do a new ice cream video containing super man ice cream I love it"}, {"text": "Hey! it wold be amazing if you could do a recipe of cinnamon sticks with cream cheese dip like the cinnabon ones! it&#39;s really hard to get where i live and they are my mom&#39;s favorite! Thanks for such amazing stuff &lt;3"}, {"text": "Excellent!!"}, {"text": "Same"}, {"text": "can you make ferreo rocher milkshake please😊😊😊"}, {"text": "hi Gemma<br />please please please give me ur email id"}, {"text": "Hi Gemma  First time here . Just subscribed to your channel. Decided to try something simple and  made the cherry one It turned out awesome. Cant wait to try more. I would love to see some key lime or maple nut or peaches if you have not already done them"}, {"text": "can u also make a video on smoothies:)"}, {"text": "what blender is that?"}, {"text": "Gemma you are God-send!<br />also I adore how you call the lids hats💖"}, {"text": "Gemma you are God-send!<br />also I adore how you call the lids hats💖"}, {"text": "Gemma you are God-send!<br />also I adore how you call the lids hats💖"}, {"text": "I absolutely love the enthusiasm as well as the creativity and like how Gemma transformed desserts into milkshakes. so beautifully talented and creative"}, {"text": "Wat about phish food milkshake"}, {"text": "Could please please please show us how to make the hot chocolate powder😊"}, {"text": "I would Love to see a tiramisu milkshake"}, {"text": ".please do a horchata milkshake or a cinnamon toast crunch one please"}, {"text": "hey Gemma can u make a banoffee pie milkshake"}, {"text": "Hey Gemma I love your videos! I&#39;ve specifically loved your cinnabuns, but your mug pizzas are great as well. I&#39;m about to make one of your recipes today ( its a big study day cause I&#39;m in grade 7) but I was even on a TV show for baking once. Anyway thank you so much and keep making your vids😀"}, {"text": "😍😍😍❤️❤️❤️"}, {"text": "the smore would be my favourite."}, {"text": "These milkshakes are incredible. My summer is going to be better now, thanks to you Gemma ❤. I am going to try all of these. I cant wait till i try the smores one and the chocolate one.Luv it.You will make my day if you reply to me . I love your videos very much. ❤❤❤"}, {"text": "what are the measurements?"}, {"text": "Hi! I wanted to ask a basic question. What all do you add to your whipped cream dressing?"}, {"text": "pls do a few recipes for ramadhan. my family is bored with the same samosas i make all the time.😭"}, {"text": "I always put a scoop of ice cream inside my hot chocolate so that would be good."}, {"text": "Can we make a Duncan&#39;s Donut milkshake with glazed donuts or cake donuts please"}, {"text": "love your recipes. could you make <b>mcfloat next .</b>     <del>PLZ</del> please!!!!!!!!"}, {"text": "chocolate lasagna"}, {"text": "Where do you live"}, {"text": "I have tried out bananna puddingand the frozen hot choclate milkshakes😁. They are some of the best milkshakes that I have ever tried!"}, {"text": "I want to know how to make caramel toffee"}, {"text": "Hi Gemma. Can  you teach us how to make hot chocolate powder at home."}, {"text": "my milkshakes are not thick😫😫"}, {"text": "What are the measurements of  milk..??"}, {"text": "You seemed way happier and jumpier in this video, that&#39;s what milkshakes do I guess !"}, {"text": "hot chocolate powder and unsweetened cocoa powder is the same?"}, {"text": "Digestive biscuits sound like one of those pseudo-health things that came out of the Edwardian era. Like cocain cough drops and stomach help sodas."}, {"text": "Frozen milk word very well in milkshakes. Makes a milkshake more healthy than that ice cream shake."}, {"text": "wow! I am shocked! how can anyone be so creative!"}, {"text": "What If you don&#39;t have a liquidiser or a blender can you use a nutri bullet ? ♥️"}, {"text": "can you do a apple and blackberry smoothie ?"}, {"text": "can u make a bubble tea?"}, {"text": "apple crumble can u make a milkshake with it pls pls pls I love you ur the best♥♥"}, {"text": "Lmao Gemma&#39;s so savage &quot;ima throw some of these in because I can&quot; XD"}, {"text": "Hey, Gemma! These look SO good- I just want to eat it out of the screen! Could you do a bran recipe! Thanks, Molly"}, {"text": "That feeling when you try to keep your body in form for summer, but uh oh Gemma put out milkshake video... see ya summer..."}, {"text": "liza and irka"}, {"text": "how did u make that homemade sauce?"}, {"text": "Is it possible to make a cookie dough milkshake?"}, {"text": "can u make a malt ball shake or a funfetti cake shake"}, {"text": "can you make nutella milkshakes"}, {"text": ""}, {"text": "Next week Thursday cold coffee<br />"}, {"text": "Hey can you make vegan marshmallows? Please!"}, {"text": "p/s: don&#39;t watch when you&#39;re hungry 😑😑😑ohhhh.. i really really really need milk shake now cause today is sunny day!"}, {"text": "&quot;Frozen hot chocolate&quot;<br />lol... so chocolate...?"}, {"text": "my question is can I use any ice cream 2make a milkshake?these looks good&amp;delish.love ur vids."}, {"text": "for the strawberries and cream shake how much milk and ice cream do I add? it looks like a scoop of ice cream and a cup of milk not sure."}, {"text": "im making the frozen hot chocolate tomorrow"}, {"text": "oh yum oh yum"}, {"text": "Hey Gemma, I&#39;d love it if you did a Ramadan special for your muslim subbiesss!! Would love to see your meal ideas for this month for us."}, {"text": "Can you make a fathers day snacks it&#39;s almost fathers day Ps:can you make it before father&#39;s day please"}, {"text": "could you also make healthy smoothies. that would be great."}, {"text": "hi Gemma ur different kind of shakes video r v. delicious. thanks"}, {"text": "How can you have FROZEN HOT chocolate"}, {"text": "hello Gemma! I absolutely LOVE your videos!! would you ever consider experimenting with Boba milk tea?? I think it&#39;d be so fun to see what kind of flavors you&#39;d put together :)"}, {"text": "Those look even better than Dairy Queen&#39;s blizzards 💟"}, {"text": "Yum!!  Key lime pie milkshake please!"}, {"text": "what kind of blender do you use? All these milkshakes are the bomb, i like the strawberry and smors one."}, {"text": "hi gemma what about shortbread milkshake it will be yummy and will have nice texture 🍘🍘🍘🙏😸"}, {"text": "do u guys know the merrel twins<br />if u know u will know the pudding truck the vanilla waffers remind me of th merrell twins"}, {"text": "Gemma your sugar levels could reach all the way to the moon."}, {"text": "if you don&#39;t mind I have an ice cream request,  reses flavor ice cream..  I love your work!!!  ♥"}, {"text": "lady, please also tell us the quantity of the ingredients. 😭😭😭"}, {"text": "does the milk have sugar in it?"}, {"text": "Your videos are amazing please do some traditional indian and pakistani meals in a mug i will be waiting for these recipes!"}, {"text": "gemma could u make a smore flapptiono from Starbucks?"}, {"text": "after frozen yogurt I love this video"}, {"text": "after frozen yogurt I love this video"}, {"text": "yummmmmmy😝💋💝💝💖💖"}, {"text": "Is it just me or is whipped cream on a milk shake really weird?"}, {"text": "Ha ha &quot;because I can...&quot;"}, {"text": "Can&#39;t get better than this!"}, {"text": "Hi Gemma,love your videos! Can you make another doggie treat like cookies or others? Thanks!"}, {"text": "Needed to add vanilla pudding mix to the banana pudding shake 😍 that&#39;s how I used to make it"}, {"text": "If you have a cookbook<br />I would love to buy it😊😊"}, {"text": "Yum!"}, {"text": "I want to try the s&#39;mores one but, me is too lazy, and me does not have ice cream and meylk ^-^"}, {"text": "Been going through alot... But you made my day bright<br />Going to make these. Ty for your videos, huge fan,"}, {"text": "Omg this is so easy and delicios too!!!"}, {"text": "Hi would it possible for you to make apple chips/crisps it would a great snack!!"}, {"text": "hey gemma I love your videos I made lots of your foods and snacks I love it"}, {"text": "I love the classic Strawberries and Cream, so yummi recipe, thank you Gemma!"}, {"text": "I hope you make a cookies using microwave"}, {"text": "oh goodness they are looked so good"}, {"text": "use what mascies??????"}, {"text": "awsome they all look delicious!! I love your recipes!! God bless you!!"}, {"text": "watching this after shane dawsons giant milkshakes😂😂😋"}, {"text": "Can I use french vanilla ice cream instead for all these recipes?"}, {"text": "hi Gemma please make Indian snacks :) :) ;)<br />Maybe some twist on gulab jamuns, samosas <br />something like that<br />I&#39;m waiting for the video<br />good luck<br />👍👌 and subscribed "}, {"text": "You should do one brownie milk shake"}, {"text": "I am a super fan if Gemma- the Queen of bigger and better  could ❤ my comment and also reply to me it would make my day🌞"}, {"text": "Edible flowers video?"}, {"text": "These look wonderful!! I&#39;ll definitely try them 😋😋"}, {"text": "you should have done a chocolate drizzle on  top of the smore shake :)"}, {"text": "can you do satay with peanut sauce , a heavenly dish"}, {"text": "I love how most of ur ingredients are homemade"}, {"text": "Love the banana pudding &amp; strawberries &amp; cream shake. Definitely gonna make these for the fam &amp; myself. Delicious (:"}, {"text": "How about cold coffee<br />"}, {"text": "Gemma need to be on TV worldwide"}, {"text": "Omg you replied!!😮"}, {"text": "love your recepies Gemma😍😍😍😍😍"}, {"text": "which cream flover u used?"}, {"text": "Please please please do Baskin Robbins&#39; flavored homemade ice creamㅠㅠ"}, {"text": "Gemma can you make tator tots?"}, {"text": "Hello miss Gemma Stafford can you make a recipe of shakes using Usana nutrimeal , usana whey protein,  usana fibergy ,."}, {"text": "Its obvious that she doesn&#39;t actually drink any milkshake  :P  <br />Anyone else notice this or is that just me?????"}, {"text": "gemma u should have a series of lowfat and healthy food for people on a diet. its impossible to resist those milkshakes btw 😍😍"}, {"text": "omg toasted marshmallows are just genius!!! S&#39;mores are my fave fave fave!!! &lt;3"}, {"text": "Gemma can you make samosas? they are good and I want to know the recipe and I think you can make the best samosas."}, {"text": "HI!!! thanks for answering.....N I&#39;m sorry I meant colab not colander"}, {"text": "What if we add the marshmallows to the hot chocolate milkshake??? Hmmm"}, {"text": "Ku ri am nue?"}, {"text": "Hey Gemma, can you make shakes from Apple and mango? Also a death-by-chocolate ice-cream?"}, {"text": "you should do a symphony bar milkshake ( the ones with almonds and toffee) 😊"}, {"text": "amazing Gemma, as always"}, {"text": "MARSHMALLAWS"}, {"text": "These all look so yummy!!💕"}, {"text": "Gemma, my husband &amp; I had the Frozen Hot Chocolate Shake with out lunch today. We had BLT&#39;s with potato chips &amp; our delicious, wonderful, YUMMY Shake. It was an awesome combination. One little note, I make my own mix for for hot chocolate, so we used that, it was Great! We can&#39;t wait to try more of your other shakes. Thanks Gemma!!!"}, {"text": "I love you<br />cause like usually when i watch cooking videos n stuff if i try to make them they fail so i stopped doing it i just watch it to watch it<br />but like u have exact measurements and u go through it step by step and all ur recipes r simple and delicious and ur so inspiring omg"}, {"text": "I love your recipes! i´m going to try them all!! :)"}, {"text": "How about a Oreo hot choclate."}, {"text": "It kinda grinds my gears when cooking channels say &quot;So good!&quot; or &quot;Delicious&quot; to there own creations. Of course you&#39;re gonna think it&#39;s good. I don&#39;t know yet, so I can&#39;t say it yet."}, {"text": "Need to try these!  It&#39;s been 27°C for the last couple of days in the UK and these look delicious."}, {"text": "do you have a tutorial on hit chocolate powder?"}, {"text": "hi gemma i am ashika i am a13 years old girl i have being loving ur videos and i am an indian i loved ur kulfi icecream and i suggest u to try more indian desserts what about some original kulfi i am sure u r gonna love it"}, {"text": "Gemma I absolutely LOVE you!!! Not only do you have the absolute best recipes ever and you have made them so simple and easy to make but you have the such a wonderful bubbly personality. I can&#39;t wait to try all of these milkshakes especially the frozen hot chocolate, I think I&#39;ll add a few miniature toasted marshmallows to use a garnish as well since I love marshmallows on my hot chocolate 💖💖💖💖 Can&#39;t wait for your new bread series starting June 4th 💙💙💙"}, {"text": "Hello , miss gemma your recipes are so goooood . can you show  how to make mango milkshake"}, {"text": "These look so yummy.... definitely trying them out today!!!<br />Thanks for providing us with AMAZING recipes!!"}, {"text": "Thank you for this trending video. I was just wondering what milkshake I should make, saw this video in my trending tab, and thought, &quot;Perfect timing.&quot; This video should help narrow things down."}, {"text": "Gemma can u make some easy sweets that only requires 2ingredients i want to make it for somebody who is really close and special to me plzzz"}, {"text": "You seem so happy and positive! Great video :)  can&#39;t wait to make this now!"}, {"text": "Could you please do a lemon milkshake?:)"}, {"text": "These all look so darn yummy!! Don&#39;t know which I like more!! 🥛🥛🤝🤝"}, {"text": "I just love you dear 😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘 you re the best"}, {"text": "The banana pudding one looks very tasty! What would be an acceptable sub for the wafer cookies? We don&#39;t get them here so unsure of taste or texture."}, {"text": "I luv ur recipe gemma 😄"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23Notificationsquad\">#Notificationsquad</a> 💙💙🍧🎂🍦<br /><br /><br />gemma you have amazing recipes and they&#39;re suppper easy to make.... My mom and I bond over your videos. I love that You even make vegetarian friendly recipes. you are the best and you are my dream come true( I wanna be a chef when I grow up😊😊)"}, {"text": "New theory: Gemma is actually a part-time psychic who can read my mind. She bases her video ideas on what I want to eat at the moment lol"}, {"text": "I would blend the hot chocolate powder with chocolate ice cream with the sauce on edges. awesome stuff"}, {"text": "how can u forget our milkshake its mint chocolate chip yum and love from india"}, {"text": "Gemma; Milkshake glass with garnish<br />Me; A plastic cup from my dads work"}, {"text": "Funfetti milkshake!"}, {"text": "Microwave cookies 🍪😊"}, {"text": "These look so incredibly delicious! Strawberry cheese cake or cookies and cream would also be great! Have a wonderful weekend!"}, {"text": "🤑😀😀"}, {"text": "our you can make homemade oreo"}, {"text": "hi gemma can yoy make a terimrso ice cerm ??😀"}, {"text": "oh my god so good ! I will obviously try this. I don&#39;t know why people unlike delicious videos ."}, {"text": "Hi Gemma, could you do some sort of candy bar milkshake? :)"}, {"text": "+GemmaStafford can we make this without ice cream?"}, {"text": "I wanna see Birthday cake milkshake🎂🎂🥛🥛"}, {"text": "She is so much more different than before"}, {"text": "What is hot chocolate powder?"}, {"text": "Gemma, help! My mother has developed an allergy to chocolate and tea, and she&#39;s really depressed. Can you give me good chocolate substitutes to make things yummy?"}, {"text": "Here hot chocolate powder is not avaliable can you plz teach how to  make hot chocolate powder"}, {"text": "Hi. I absolutely adore your videos, and you too blushingly. Why didn&#39;t you just use crumbs of the actual baked cookies for the cherry pie milkshake?"}, {"text": "Hey!Gemma you are on the trending page congratulations dear......I❤️U and it would make me day if you would reply just like you always do❤️❤️!!"}, {"text": "Where can we find the hot chocolate powder?"}, {"text": "can u please make mango lime milkshake.??"}, {"text": "smores*"}, {"text": "Can do a video for key lime pie?"}, {"text": "can u make belgium dark choclte flavour ice cream,black current icecream, capuccino ice cream,coffe ice cream ,mixed fruit ice cream please???"}, {"text": "If I don&#39;t have frozen fruit can I use some ice???"}, {"text": "this the type of shit i like seeing on the trending tab"}, {"text": "my fav dessert snores never thought that you will turn it in a milkshake mind blowing thanks gemma"}, {"text": "The first video that I watched of yours was your milkshakes you made last time and that was the time I subscribed to your channel...."}, {"text": "Love Your recipes😍Pls do a giveaway......I wonder if i was your neighbour😍😍"}, {"text": "Hey gemma !! I absolutely love ur channel ......N also n u plzzz do a colander with cupcake jemma"}, {"text": "I was raised in Massachusetts, and Milk and ice cream blended is called a frappe. Milk and syrup blended is called a milkshake. We had wide frappe straws, as you could get double thick frappes, and still can."}, {"text": "yum"}, {"text": "Gemma can u make a chocolate cake pops in order of my birthday🍩🍫🍰🎂☕"}, {"text": "Such a over board"}, {"text": "gemma,could upload a video on substitutes for.Butter"}, {"text": "please do vegan receipts"}, {"text": "These would be perfect right now! Great video as always 😄"}, {"text": "Yummmmmmmmmmmmmmmmm!!!!!!!!!!!!!!!! Xoxo 😘"}, {"text": "It&#39;s amazing to see your channel grow, Gemma! :)"}, {"text": "And make more ice cream or smothies flavored blueberry or raspberry"}, {"text": "Gemma can you make a ice cream flavored blueberrys plzzz Gemma"}, {"text": "You r such a amazing ❤️<br />You make my life n cooking so easy .... even every housewife like me get so many compliments just because of your quick n easy recipes 😘😘😘😘"}, {"text": "wowwwwweeeeee..<br />handshakes and milkshakes,,<br />hugggss and  kissessssssss"}, {"text": "Mango milkshake please"}, {"text": "yummmmy"}, {"text": "That&#39;s not how u make a good milkshake. U need vanilla syrup"}, {"text": "I loved these one <br />You know me Gemma , I had commented you on marshmallow fluff I am that 11 year old girl <br />😊😍😙"}, {"text": "Fantastic"}, {"text": "hello Miss Gemma.  Veri.  nice recipe of. 5.  milk shakes. thank. you  very. much"}, {"text": "hello Miss Gemma.  Veri.  nice recipe of. 5.  milk shakes. thank. you  very. much"}, {"text": "Hi Gemma,<br />U r so unique and beautiful luv ur videos"}, {"text": "Who else is feeling thirsty while watching this?"}, {"text": "We live it, it&#39;s delicious a milkshake!!! Regards our channel!!!"}, {"text": "These are amazing Gemma!!!Loved the smores one!!^_^"}, {"text": "I decided I will marry a woman with a Irish accent"}, {"text": "Only problem with video recipes is that whenever you try them they turn out nothing like the videos! 🙁"}, {"text": "Coffee milk shake from Clinton Bakery in NYC! The best!"}, {"text": "&quot;Look how T H I C C that is&quot; 😩"}, {"text": "why am I watching this I&#39;m lactose intolerant"}, {"text": "My milkshakes brings all the boys to the yard"}, {"text": "Gemma, you are a woman after my own heart! I absolutely LOVE anything banana! All the other flavors look awesome too, but you really hit it out of the park with the banana shake! Thanks for all your great ideas. BTW my husband&#39;s favorite ice cream dessert is a tin roof sundae. Do you think you can come up with a sundae for that?"}, {"text": "Can you make Creamsicle&#39;s? Orange and chocolate covered if so"}, {"text": "I am gonna try it right now!! Gemma you make cooking so much more enjoyable!"}, {"text": "You&#39;re using whole milk right?"}, {"text": "Quick and easy ... I love it n I will definitely try it. Gemma, u look so matured and different today."}, {"text": "Hello Gemma, can we use fresh fruits for shakes??"}, {"text": "I made the frozen hot chocolate one it turned out yummmmm..."}, {"text": "I would love to know where you got your blender. Love all of your videos and made some of your homemade ice cream. My husband thought it was store bought😊"}, {"text": "Red velvet"}, {"text": "The s&#39;mores one thooooo"}, {"text": "I was wondering if you can use a food processor to make these?"}, {"text": "The banana pudding one looks so good"}, {"text": "Kulfi ice cream milkshake! To really push it over the edge!!!<br />Other suggestions:<br />Matcha green tea<br />Tiramisu <br />(You can tell I&#39;m pulling these straight from your most recent No Machine Ice Cream video 😉😉)"}, {"text": "I liked all of them!!"}, {"text": "I love my milk shakes with a milky flavor... so I&#39;m wondering maybe a tres leche milkshake or flan flavor?  oh and my favorite icecream Rocky road"}, {"text": "Wow, you made it on Trending!<br /><br />Guess you could say your milkshakes brought all the boys to the yard."}, {"text": "Those look so good!<br />I love your accent.<br />I don&#39;t know why I just do.<br />This is the 1st video I watch from you.<br />I will now try to make these soon!<br />Thanks!<br />I&#39;m just gonna watch some more of you videos.<br />You may find me again.<br />edit:one question.<br />do i have to used frozen bananas?<br />or can i just stick a few icecubes in the blender?<br />i know its gonna be a little less sweet.<br />but im assuming its fine."}, {"text": "i would like to try this but too bad i&#39;m on a diet.....the good thing is that i lost 14 lbs in 2 months :)"}, {"text": "The cringe at the smores part about the honey.... I would rather put chocolate on the rim than honey. 🙄😂 I WOULD NEVER SHARE THE SMORES TOOOOOO!"}, {"text": "it&#39;s probably just me but ever since I&#39;ve been watching your videos I always say &quot;oh yum&quot; help mee I&#39;m addicted! hahah"}, {"text": "👍💗👍💗"}, {"text": "Can u make a About me tag"}, {"text": "you are seriously so freaking creative. i love all of your videos and try each of them. LOVEEE YOU GEMMA!"}, {"text": "Can you make freeze pops??"}, {"text": "&quot;What could be better than a whole dessert blended up into a drink&quot;<br /><br /><br /><br /><br /><br /><br /><br /><br />Idk , the end of poverty, Isis stopping, fairness in the world.. I could just go on .."}, {"text": "I would love to see a coconut milkshake! when i was younger we used to go to a milkshake bar once or twice a year and my favourite was their coconut milkshake but ive never been able to recreate it."}, {"text": "can you do a an ice cream recipe to do black cherry ice cream?? its my dad&#39;s favorite and i can&#39;t get them where i live, , please can you show how to do it :)"}, {"text": "Or maybe do a MAPLE SYRUP milk shake"}, {"text": "OMG😮"}, {"text": "Gemma u can also do a peppermint milkshake/smoothe"}, {"text": "wow! just very timely for my toddler who doesn&#39;t like to drink milk... better with flavors! big thanks gemma! 😘"}, {"text": "can you use a food processor instead of a blender"}, {"text": "I&#39;m disappointed their isn&#39;t already a comment about her milkshakes bringing boys to the yard.."}, {"text": "Could you make homemade Nilla Wafers?"}, {"text": "my favorite milkshake would have to be either home made shamrock shake or just mint chocolate chip or chocolate now I need to make milkshakes ugh"}, {"text": "your video is on #46 on trending  :D"}, {"text": "I&#39;m a 6th grader and love to make desserts!!!!! And I think you ( Gemma) makes the most adorable and tasty desserts ever!"}, {"text": "These all look and sound AMAZING!!!! x"}, {"text": "harsh true. 🙂🙂 I hate whipped cream"}, {"text": "Help me get one like for my 14th birthday!!"}, {"text": "Hi gemma i love your videos very much and i also love cooking can u make homemade smore&#39;s french macarons (i sonetimes get my recipe from you😀)"}, {"text": "I ❤️ loved the strawberry 🍓 and cream it is delicious"}, {"text": "I don&#39;t know what I would do without this channel tbh"}, {"text": "gemma ,Awesome recipe ,but can u bring up more starbucks flavours ,they were really awesome ,I tried all of them and the results were amazing .....and these milkshakes also seems delicious ,I would tried these too"}, {"text": "Your accent makes me feel loved and safe."}, {"text": "Why am I always late I have notifications on??? Maybe I need to subscribe with more accounts?"}, {"text": "My favourite part is when she was baking."}, {"text": "Hi!!! I was hoping you can make icecream with ube, a purple yam jam. It&#39;s from my country, the Philippines. Thank you!!!"}, {"text": "what happens when it doesnt look right🤔🤔"}, {"text": "These look amazing! Would love to see a birthday cake inspired milkshake"}, {"text": "Salted caramel pretzel milkshake! Mint white chocolate! These are some good flavors. I hope you make them. Include my name if you do thanks"}, {"text": "You know, Gemma, if you really want it to taste like hot chocolate you should add marshmallows or marshmallow fluff somehow. I just love hot chocolate with marshmallows! I&#39;m definitely going to be trying these recipes! How about a peach cobbler milkshake? "}, {"text": "gemma can you make a flavored zebra cheesecake ? i don&#39;t know if you had made it but i like the idea and i know you are amazing at baking"}, {"text": "I can&#39;t wait to make these.  Thank you. 😉"}, {"text": "No way"}, {"text": "Whoooo 47 trending congrats gemna!!"}, {"text": "Gemma your video is trending!!!"}, {"text": "i loveee.....all..."}, {"text": "The strawberries and cream looks like Angel delight lol"}, {"text": "hi gemma can you show how to make those biscuits that u added in banana milk shake??"}, {"text": "They look so good, I wish I could have one!"}, {"text": "you are so unique and inspiring, i love your recipes!"}, {"text": "thanks for replying gemma !"}, {"text": "can u make cheesecake milkshake?"}, {"text": "&quot;oh yum! Oh yum!&quot;"}, {"text": "Don&#39;t you mean.....<br /><br /><br /><br /><br /><br />The s&#39;more the merrier?<br />I apologise for nothing"}, {"text": "I&#39;d love to be your daughter so after you&#39;re filming videos I can eat/drink the yummi things you made."}, {"text": "#44 on trending, well done gemma. love you xxx"}, {"text": "Why do you always wear that shirt??"}, {"text": "can you replace the hot chocolate powder with cocoa powder"}, {"text": "who else thinks the banana pudding one looked better with the overflow?❤"}, {"text": "chocolate banana  I get only this in summer"}, {"text": "Hi Gemma  I would really like u to make a fudge brownie milk shake<br />                      (PLEASE)    😊🎂😀🙂☺😉😆"}, {"text": "hey , can u do a video about foods for ramadan , it is like a  holiday it goes on for a month so can you do a video about ramadan food if you did thank you so so much and i LOVE your videos ❤️"}, {"text": "Hi gemma you are so creative and pretty"}, {"text": "gemma Stafford can you make steak and cheese dip ❤❤❤❤❤❤ I love your videos"}, {"text": "can u show how to make hot chocolate power"}, {"text": "I feel like the hot chocolate one should have been #5. It was the least creative of all of them; not sure what people were expecting when they voted it #1 (easily could have just used chocolate ice cream to get the same thing). The other four were great, especially the s&#39;mores milkshake."}, {"text": "THIS. IS. AMAZING."}, {"text": "would it be possible to make a savory milkshake? something like pumpkin/squash, tomato...idk..seems like a fun challenge. maybe instead of ice cream use frozen Greek yogurt?"}, {"text": "for the frozen hot chocolate I would&#39;ve added a few mini marshmallows to take it a step further. either way good job"}, {"text": "make dips for chips<br />please"}, {"text": "can you make a Butterscotch milkshake?!"}, {"text": "i would love for you to do  a cinnamon toast crunch milkshake and a nutella milkshake <br />thankyou god bless <br />debby duarte"}, {"text": "Vegan milkshakes? Plz?"}, {"text": "Gemma, all of them are SO SO SO CUTE! You&#39;re amazing!"}, {"text": "Well, I, lactose intolerant and unable to consume fruit, am dying a little on the inside now..."}, {"text": "Hi! What can I add to the ice cream and milk if I want to make a classic chocolate milkshake? ❤️"}, {"text": "I love milkshakes! I can&#39;t wait to try out these recipes! Thanks, Gemma!"}, {"text": "can you make a peppermint milkshake?!"}, {"text": "can you make a pumpkin milkshake?"}, {"text": "I really thought I would see a caramel or a peanut smoothie so I&#39;m going to recommend snickers smotthie"}, {"text": "haha gemma just a little bit of grated chocolate just to push it over the edge (literally push it over the edge) 😘"}, {"text": "these look amazing especially the strawberry and cream, and the smores HEAVENLY!"}, {"text": "My milkshake brings all the boys to the yard"}, {"text": "oh my gosh! it was so funny when you were putting the wipped cream on the smores one i saw you wanted to add more but you stpped because it was gonna overflow! Almost made me laugh. im surprised it didnt overflow!!!"}, {"text": "Remake The S&#39;mores Frappé From Starbucks Please 😍😋"}, {"text": "Mm Mm yummy."}, {"text": "hi Gemma can you mayby make a scandinavian special video where you make deserts from scandinavia please.👍"}, {"text": "Do a lemon cheesecake"}, {"text": "seriously, why are americans obsessed with marshmallows?"}, {"text": "very nice.....<br />I loved the marshmallow one and starawbery milkshake....🤗🤗😘😘😃😃"}, {"text": "Wow ! Another awesome recipes 🙌🏻"}, {"text": "I would love to see floral recipes, like the BIA Coffee lavender and rose cakes or drinks. :3"}, {"text": "YAY! The video has arrived! I have been excited and waiting for this video since you replied to my comment! Yay I love ur vids Gemma! You could also make a cookie flavour milkshake or a birthday cake Oreo flavour milkshake!"}, {"text": "Smoothie recipes would make a good video"}, {"text": "How about Red Velvet Cake or Lemon Meringue Pie, Root Beer? These look so good Gemma!"}, {"text": "make an ice cream sandwich (how to assemble+choco wafer) and maybe some variation (different flavors)"}, {"text": "NOW the ONLY problem after making some of these is: CLEANING the darn blender when your done. XD"}, {"text": "i love yr recipes gemma.... keep gng! let&#39;s get her to 2 million..."}, {"text": "can you make extreme milkshake??🌸🌸🌸"}, {"text": "hey Gemma!<br />loved this video!!<br />keep it up!<br />pls name the song that you play in the starting in every video...<br />lovelove<br />somya😘"}, {"text": "i made mango milkshake today .. need to try all of these now !!"}, {"text": "I wish I could taste it all. Great job 👍😄"}, {"text": "Can i use Hersheys cocoa powder for the number one? is that for hot chocolate? cuz i don&#39;t really know"}, {"text": "Gemma, adopt me!!!<br />you are so awesome. <br />Love from Kenya 🌹"}, {"text": "Amazing..I really want to try one 😍"}, {"text": "Thanks for sharing these delicious recipes and I love that they&#39;re perfect for the summer!"}, {"text": "Can you please do some non dairy milkshakes? I&#39;ve tried to do them myself but i didn&#39;t get it quite right.."}, {"text": "please don&#39;t buy honey from grocery stores, they treat bees terribly and we need to save them :( support local bee keepers 💞🐝"}, {"text": "<a href=\"http://www.youtube.com/results?search_query=%23Gemma\">#Gemma</a> any other alternative for hot chocolate powder"}, {"text": "yum!"}, {"text": "i really dont know please tell me what is the difference btween smoothies and milkshake"}, {"text": "gemma pls make cinnabon cake and caramel cake"}, {"text": "how can we make homemade hot chocolate powder"}, {"text": "Ah the perfect thing for a hot day like today 🥛🍦"}, {"text": "you are amazing Gemma can I get a recipe for easy chocolate brownie"}, {"text": "Oh yummy! I love the glasses you served the milkshakes in they&#39;re so iconic. 💛"}, {"text": "ya ya"}, {"text": "gemma plz make oreo truffle with cream cheese plzzzzzzzz"}, {"text": "I love when she says &quot;oh yumm&quot;"}, {"text": "I am really excited to try the frozen hot chocolate!!!I love it in the winters and can&#39;t wait to also have in summers!!"}, {"text": "can we substitute the nila wafers with any other cookie as we dont have them over here.."}, {"text": "plz cakes from around the world  (veg )"}, {"text": "plz make cocktails or mocktails...btw nice video!! looks soooo YUMMM"}, {"text": "I love milkshakes!!! I hope to try these recipes when I have a chance."}, {"text": "Plz make some ice tea recipes  ready for summer ?"}, {"text": "this is an amazing idea"}, {"text": "I always get her and cupcake Jemma confused"}, {"text": "birthday cake or funfetti or brownie"}, {"text": "hello Gemma I love your recipes can u  make a video on popsicles"}, {"text": "Oh god........ These r looking super delicious....... Will soon them a try😀👍👍👍"}, {"text": "Thanks Gemma u make things so easier for me love u"}, {"text": "Neeeed 😩😩😩 sucks when you avoid dairy!"}, {"text": "MashAllah"}, {"text": "Hi Gemma. Do you think you be able to DIY Ben and Jerry&#39;s Midnight Snack? It was my favorite flavour."}, {"text": "i really want to know how to make the black ice cream cone.could u make a video about that please?❤"}, {"text": "So, I used one of your mug cookie recipes the other night when I was in need of a quick sweet fix. It was perfect. I also bought some treats from Naturebox that you had suggested and they were amazing. Because of that, I&#39;m subscribed now! My husband loves banana pudding, so I may have to give that milkshake a try soon."}, {"text": "I love your Videos! The recipes are totaly easy and yummy!  Thank you! 😊😁👍"}, {"text": "Thanks gemma for this video. It&#39;s amazing. ❤"}, {"text": "I love pineapple.  So will you make an outrageously delicious pineapple shake?"}, {"text": "plz .. could you give me a solution ? <br />I have a lot of banana in my kitchen and I want to get them all in one work <br />what should I do ??"}, {"text": "Gemma, i feel so happy to be your subscriber.Because of you i started baking.Now i feel so proud of myself.Thank you dear"}, {"text": "Can you do a video on how to make slush"}, {"text": "I like the idea u save the best for the last Gemma!too good !have a great day!love ya☺👍"}, {"text": "Yummy"}, {"text": "I&#39;m definitely loving all of your recipes. I love you, Gemma! Hugs from the Philippines. :)"}, {"text": "رائعة مذهلة حلو جدا شكرا لك"}, {"text": "The camera&#39;s selective focus gives me a headache."}, {"text": "WHO IS THAT DOG ON THE FRIDGE DOOR TELL THAT BABY A GIRL FROM INDIA SENT LOADS OF LOVE AND KISSES AND HUGS AND LOVE. So much love."}, {"text": "&quot;Oh Yum&quot; and I know it&#39;s genuine. I&#39;m going to do this!"}, {"text": "they loooook really delicious. gotta tryyyy them. btw im gonna make your churro recipe!"}, {"text": "you&#39;re a saint Gemma"}, {"text": "Thank You Jemma Stafford 😊"}, {"text": "Plz make cookies x"}, {"text": "Me on a diet<br />oh that looks yummy but it&#39;s not healthy😢<br /><b>Grabs all ingredients and blender</b>"}, {"text": "omg all are really awesome ones..yummy too...such a creativity..<br />can&#39;t think of any other flavours 😁"}, {"text": "How can people dislike these yummy shakes...🙅<br />N e ways Gemma m definitely gonna try all f ths...<br />I desperately need ths kinda pretty shakes coz here it&#39;s super duper hot...🙇🙇 so thank you so much for ur hard work n the yumm surprise.<br />Lots of Love<br />Your fan from India<br />Jyotika Sah."}, {"text": "Can u show some breakfast without oven plsssssssssssss plssss reply"}, {"text": "Hi Gemma I just wanted to tell you I tried the sweet potato microwave snack and the oatmeal 5min cookies and both recipes turned really good 😊 <br />Thanks for your videos 💕"}, {"text": "hey Gemma I luv all your recipes you are a wonderful chef 😊😊<br /><br />Can i replace the strawberry with mango in the strawberry cream milk shake. plz do reply me. lots of love to you😘😘"}, {"text": "Gemma I need your bread series now MY HEAD IS HURTING BECAUSE I AM SO IMPATIENT"}, {"text": "omg I wanna have all of them 👆😋😋...thanks Gemma love u😘"}, {"text": "It&#39;s my birthday!❤😊"}, {"text": "do you have any indian recipes with your amazing twist??"}, {"text": "thank you Gemma😊, your recipes are always awesome and also it everytime helps me<br />Thank you once again😊😊"}, {"text": "great video!!!!!!! cant wait to try them out!!!!!!!"}, {"text": "Love it! I tried the s&#39;mores milkshake and it was YUMMY! Can you make a Nepali Drink with mango called lassi?"}, {"text": "i really enjoy to recreate your recipies ,is always awesome thank you!!!!!"}, {"text": "It&#39;s an absolute delight watching ur videos ! <br />May ur channel continue to flourish :)"}, {"text": "hi can u make popsicles.and whats ur naxt video about.pls reply"}, {"text": "can you please do a video on healthy and easy smoothie recipes? :) <br />i love your videos!"}, {"text": "Oiii...<br />Olhando seus vídeos veio a lembrança de Tatá Werneck ou Talita Werneck...atriz comédia aqui do Brasil! <br />Sou sua fã...adora suas receitas e a sua simpatia...parabéns!👏👏👏👏👏"}, {"text": "can you make Japanese desserts please"}, {"text": "Gemma, I&#39;d say your yard is full of boys now, HAHAHA :)"}, {"text": "yummy milk shakes Gemma"}, {"text": "Can u make willy wonka chocolate, like if u agree"}, {"text": "I love your videos so much Gemma! The recipes were absolutely amazing :) you&#39;re such a humorous and lovely person❤️"}, {"text": "I love your recipes"}, {"text": "could you do smoothie bowl recipies that are affordable as I can&#39;t really afford loads of expensive ingredients x"}, {"text": "Who ends up eating all of that?"}, {"text": "Yum I can&#39;t wait to try these!"}, {"text": "yummy  yummy😜 love your videos Gemma sending lots of love from India❤❤👍"}, {"text": "the shakes in glasses doesn&#39;t go down even when she takes two sips ! when I drink... it&#39;s all opposite !"}, {"text": "wtf is banana pudding - says all of ireland"}, {"text": "Yummy!  I will try these for sure.  If not all then I would at least try one for sure!  Yay. Thanks Gemma 😊👍💕"}, {"text": "I like your videos very much ☺"}, {"text": "Yours is summer,mine is rainy:( but i love to make this even when it rains thanks Gemma Love you:)"}, {"text": "Hello <br />From Pakistan"}, {"text": "can u make a badam milkshake"}, {"text": "I always love your intro music. whats the title gemma?"}, {"text": "what blender do you use?"}, {"text": "love love love all the easy creation Gemma!! 😍😍😍😍😍😍 just asking whether u are going to do a vlog someday? may help to open up knowing who you are even more! 😗"}, {"text": "Hi Gemma! That&#39;s looks tasty!"}, {"text": "early"}, {"text": "Could u try do a funfetti milkshake?"}, {"text": "caramel pecan..............yum"}, {"text": "Really man? You gotta upload this right before I finally resolved to start cutting? lol Well, I guess one extra day of unhealthy bulking could work looool"}, {"text": "wow these milkshakes looks so amazing I can&#39;t wait to try them 😍 thank you for the recipes"}, {"text": "I love your recipies and your enthusiasm so much!! 🎉💖"}, {"text": "gemma u &amp;  your recipes are too awesome... <br />I will surely try those milkshakes...<br />Thanx for this video<br />Luv u"}, {"text": "love ur videos like these milkshakes"}, {"text": "how to make a Pikachu cake from pokemon go 😋"}, {"text": "&quot; My milkshake brings all the boys to yard n they&#39;re like it&#39;s better than urs &quot; I&#39;m sorry that somehow just pops up in my mind...."}, {"text": "hey gemma ur awssum 👌👍god bless you💖<br />hey could you make breads with different fillings?"}, {"text": "its too easy.tnx gemma"}, {"text": "Homemade hot chocolate powder tutorial ??"}, {"text": "Can I just drink the milkshakes from the screen?? UGHHH, SO DELICIOUS AND IM STUCK IN COLLEGE. p/s: wish me goodluck i have finals tmrw."}, {"text": "What happens to all the food after the fact? lol"}, {"text": "who else likes before watching the video because you already know that the video is so nice? only me okay"}, {"text": "can u try orange milkshake or mixed berry milkshake"}, {"text": "Wow! what a thick milkshakes I have ever seen and and I can&#39;t express my feelings by speaking and can u make blueberry milkshakes please😢😢"}, {"text": "You make cooking and baking look so effortless! You&#39;re awesome 😊"}, {"text": "any milk free shakes"}, {"text": "<a href=\"http://www.youtube.com/watch?v=WzMo5mMn0gY&amp;t=6m31s\">6:31</a> -- V (Kim Taehyung) needs to try this. :3<br />Hope all of you A.R.M.Y.s are having a good day~"}, {"text": ":&#39;) Ha, the entire time I&#39;m focusing more on that blender than the milkshakes. I want that blender, omg. I&#39;m sure it&#39;s way more than I can afford though."}, {"text": "MMMMMMM ! it looks very yummy yummy Gemma you make so yummy recipes"}, {"text": "I&#39;m definitely planning to make this tomorrow for my cousins birthday"}, {"text": "Can you please make a lotus biscoff milkshake or ice-cream?"}, {"text": "plzzzz reply to meee ilysm"}, {"text": "awesome I am going to try some of them when I have free time"}, {"text": "I love your videos!!! Milkshakes are my fave!"}, {"text": "i never though of that i would love make it in summer my home area awful hot during summer.  i think it prefect for me to make milkshakes awww"}, {"text": "can u do a peanut butter and chocolate one or can u even make freak shakes"}, {"text": "Hello"}, {"text": "one flavor missing chocolate peppermint milkshake"}, {"text": "Yum"}, {"text": "the banana pudding milkshake had me drooling all over The place. can you do one with peanut butter and chocolate next"}, {"text": "Hi Jemma so want to make these"}, {"text": "love u!!"}, {"text": "running to the kitchen to get a glass of frozen hot chocolate"}, {"text": "Your milkshakes brings everyone to the yard lol they look fantastic, I love milkshakes and fries too lol😍"}, {"text": "I don&#39;t like biscuits blitzed in my milkshake cause I find the texture very unappealing! Is it just me?"}, {"text": "milkshakes wanna try this soon"}, {"text": "I&#39;m kinda early"}, {"text": "I think Gemma will reply to this...Love from the philippines hihihi 😀"}, {"text": "Looks sooooo good 😋"}, {"text": "Hi Gemma! Do you think you can make a lemon dessert?"}, {"text": "hello gemma...can u do capucinno types please"}, {"text": "OMG was waiting for this so long!! thank you Gemma. I love your videos."}, {"text": "Gemma,you,your recipes and your smile make my day! 💕Lots of love from India and please make cucumber cake someday 💞 Here in Goa we make it with jaggery and coconut and semolina and it tastes awesome! I am sure you will make it over the top too in your style.Love u loads!"}, {"text": "Why no background music?? btw, i love ur recipes ☺"}, {"text": "Yeah, I love the video but... I noticed that you didn&#39;t taste those for real.. Those classes were just as full than before you &quot;tasted&quot;. And your way to drink was somehow... Just unreal. When someone drinks milkshake with a straw, It does not look like that. You really did not taste them, did you? Only the banana one just a little little bit (it seemed to be accident), and there was even sound what should not come if you really drink it out of straw. I don&#39;t want to be rude or anything, I&#39;m just little worried. Is everything okay? I mean, really. :s I love your channel!"}, {"text": "nutella milkshake pls"}, {"text": "hey gemma! ur recipies and videos r amazing and the ingredients r readily available at all homes...loved the ice cream recipies, neva seen such an easy and tasty ice cream recipe!!!<br />Love frm India :) :)"}, {"text": "Never ceases to amaze, Miss Gemma! You should really collab with Yolanda from How to Cake It, or Rosanna Pansino! :)"}, {"text": "Gamma you look beautiful"}, {"text": "Another great video since summer is here I&#39;m definitely going to make these 💜"}, {"text": "chocolate one :)"}, {"text": "Gemma ... these milkshake look  even more beautiful than you ! great job"}, {"text": "I can&#39;t wait to try them😍"}, {"text": "I&#39;ve requested this before, but white chocolate macadamia nut ice cream or milkshake would be soooo good!"}, {"text": "Me: Can you make everything! ??<br />Gemma: I will definitely add it to my list... !!"}, {"text": "do you drink all these shakrs by yourself or does you husband help ?"}, {"text": "Hi love you gemma"}, {"text": "So beautiful and I can imagine making this after exams.Lysm😘😘😘"}, {"text": "gemma plxxz also make fast food like burgers.. plzxz... I want u to make cheese burger... Will u add it to ur list? ?"}, {"text": "hey Gemma,, thaaaaanks for the video !! I am in love with banana pudding so why not to try banana pudding milkshake !! it looks yummy 👌 today is my birthday so this video is a great gift 😜"}, {"text": "The way u say &quot;Oh Yum&quot; makes me fall in luv with u even more😂😍 If a chef like u would notice me tht would be gr8. Love u Gemma!! Keep gng!! Lets make it 2 million!!"}, {"text": "I worked so hard for my summer body but I am making that Banana Pudding one today."}, {"text": "Hi Gemma! I&#39;m a BIG fan of yours from India  ....<br />can you PLEASE  make baked fries and molten lava cookies.!!PLEASE!!!!!!"}, {"text": "Gemma this is a right video for me I did p.e for the whole after noon and sadly my teacher left but it&#39;s nearly the holiday"}, {"text": "luv ittt"}, {"text": "can you show how to make different types of chicken curries?"}, {"text": "I luv the chocolate one.... I hve tried it before!!!..."}, {"text": "nice"}, {"text": "The banana pudding milkshake looks INSANE! :)"}, {"text": "wow,i love cherries the most and cherry pie milkshake!!!!yummy"}, {"text": "BANANA PUDDING 😍😍😍😍Gemma do you have a second channel ???"}, {"text": "я люблю тебя! ты лучший блогер!"}, {"text": "мой лайк 100"}, {"text": "thank you so much Gemma for this refreshing video.....I can&#39;t wait to begin my bolder baking as now I&#39;m free from college......love you so much ❤❤"}, {"text": "gonna make the hot chocolate one, im going to buy a vanilla ice cream tomorrow! thanks for the recipes!!😁😁"}, {"text": "I wanted these from such a long time ....thank you so much!"}, {"text": "i am goonaaa try tham sooo bad"}, {"text": "It&#39;s like a biscuit extravaganza"}, {"text": "it looks so yummy gemma amazing milkshakes"}, {"text": "I adore these!!!!!"}, {"text": "When are uploading the video where you are gonna make a delicious Strawberry milk popsicle?......Just waiting for that!"}, {"text": "hello Gemma.....I know I&#39;ve not been active because of my tired college routine but now I&#39;m  back again I hope u haven&#39;t forget me..... BTW thank you so much for this refreshing video gotta try this one....I can&#39;t wait to begin my bolder baking 🙂 Love u Soo much ❤"}, {"text": "Please make non dairy milkshakes or vegan"}, {"text": "Milkshakes are always wayy to sweet for me. But these don&#39;t look way to sweet at all. I&#39;ll give these a try for sure. :))) Can you do a tropical milkshake."}, {"text": "I LOVE it when you come out of character and show us your personality! Please do it more! Like when you talk to camera guy 😅"}, {"text": "I&#39;m so happy you did frozen hot chocolate! it&#39;s one of my favorites in the winter but now I can have it in the summer too!"}, {"text": "gemma u r amazing .... love these milkshakes and also ...wishing for  white chocolate lava cake😘 in future"}, {"text": "The I do everything! Because I can!!!!!"}, {"text": "45 views and 99 likes?????  how is this possible? ?"}, {"text": "I&#39;m so early! I&#39;m Irish too! I saw this just after I decided to make a milkshake! Great timing!"}, {"text": "they look stunning Gemma...thanks for sharing.... love you..."}, {"text": "I leave in the Philippines"}, {"text": "could you please show how to make ice cream at home, thank you"}, {"text": "Happy Bold Baking Thursday! I hope you enjoy my new milkshake flavors. Get the recipes here: <a href=\"http://bit.ly/TopMilkshakeRecipes\">http://bit.ly/TopMilkshakeRecipes</a>. And make sure to SHARE more of your Milkshake requests in the comments below. PLUS, tune in this Sunday at <a href=\"http://www.youtube.com/watch?v=WzMo5mMn0gY&amp;t=8m30s\">8:30</a>am Pacific Time for a special announcement video. :)"}, {"text": "Can I get a like for no reason at all?"}, {"text": "Hi gemma notice me pls. I love baking like you and I love all your tips and tricks"}, {"text": "love it gemma😉😉"}, {"text": "!!!!!!yummy!!!!!!. having the strawberry shake right now. wat a coincidence"}, {"text": "when are you posting a popsicle video"}, {"text": "Your such an bold artist and you know how to make food look cute<br /><br />U should definitely try edible arts"}, {"text": "Wish I had one of these, it&#39;s so wam today"}, {"text": "I&#39;m inspired by you miss gemma I&#39;m a 14 year old boy and I love cooking"}, {"text": "Wow only 44 views!!! im so early!!!!"}, {"text": "Your such an bold artist and you know how to make food look cute<br /><br />U should definitely try edible arts"}, {"text": "Hi, Gemma. Those milkshakes look beautiful like you. I can&#39;t wait for your No Bake Orange Créme Cheesecake. What do you love about milkshakes? Have a good day, Gemma. Keep the recipes coming, sweetie. 🌹💖💖💖"}, {"text": "i Love It !!thanks Gemma for the recipes... warm hug from INDONESIA"}, {"text": "I have never tapped on a video so fast"}, {"text": "hi beautiful that is the good one"}, {"text": "That&#39;s exactly what I need today 😍"}, {"text": "you are amazing x"}, {"text": "I&#39;ve been looking forward to this video since I saw it on your instagram"}, {"text": "wow"}, {"text": "gemma you r awesome but can u pls do a gummy bear ice creame pls pls pls"}, {"text": "Comments = 2 actual comments = 5 <br />YouTubes broken"}, {"text": "pls teach us to make cake in an oven toaster, I love your channel miss gemma I think it&#39;s the best"}, {"text": "IM EARLY YAY"}, {"text": "YAY! I was just about to make milkshakes! Super Early Squad(9th)"}, {"text": "I&#39;ll try out them tomorrow :)"}, {"text": "Yay!"}, {"text": "45th view"}, {"text": "Amazing Gemma! Your so brilliant in baking. Love from the Philippines! can this be made with a hand blender?"}, {"text": "I hope you make Ube Halaya and Leche Flan in the near future, Gemma!! Loved your milkshake recipes!! Sending you love and prayers from the Philippines!! ❤"}, {"text": "gemma can u make some savoury mug cakes pls!"}, {"text": "I&#39;m so earlyy 💕"}, {"text": "hellooooooo"}, {"text": "every time you see this comment, comment the time"}, {"text": "Hi Gemma!"}, {"text": "I&#39;ve seen them on your Insta Story!!  The Banana Pudding Milkshake and the Smore&#39;s one have to be DECADENT.<br />Can&#39;t look forward to do them.<br />As always you and your recipes are FABOULOUS ❤"}, {"text": "here"}, {"text": "5 th"}, {"text": "nice"}, {"text": "xxx so nice"}, {"text": "Hi Gemma! Thanks for the video!!"}, {"text": "I love it"}, {"text": "First: Love you Gemma❤️❤️<br />Could you do a carrot cake with some kind of twist?"}]