[{"text": "Hi Bold Bakers! Comment below with your questions about my 1st Bigger Bolder Baking Cookbook? And please Pre-Order Now <a href=\"http://bit.ly/OrderBBBCookbook\">http://bit.ly/OrderBBBCookbook</a>"}, {"text": "Realy i love you beacause always your job is great thank you very much"}, {"text": "Thank you..for being born!!!"}, {"text": "Wow, Gemma, I still remember your first video, cinnemon roles. I watched it while I was a freshman at university. Now I&#39;m near graduation, my baking has improved and I&#39;m so happy to see you getting your own cookbook! Great job! Keep good work up!"}, {"text": "Does it also come in a version with grams, milliliters,...?"}, {"text": "Next recipe: Crazy mug cake dough!!"}, {"text": "Awww so proud of you!"}, {"text": "Mouth watering😋😋"}, {"text": "Please make an ebook version that can be read on android phones and laptops"}, {"text": "I hope you share me how to use icing and cover it in cakes hehe 😁"}, {"text": "I&#39;m so happy to hear this! You&#39;re recipes are wonderful, and always turn out beautifully. How&#39;s the cookbook laid out? Is it a bit of everything you do on you tube? 💕💕😀"}, {"text": "I just love each and every recipe of yours !!! ❤😍"}, {"text": "Ordering it right nowww!!!!<br />love you and your recipes"}, {"text": "Hi!, your channel is nice<br />that looks nice.<br />Keep Sharing"}, {"text": "Hey can you please make a date ice cream? I love how they taste. I love your video btw 💟"}, {"text": "Hi Gemma please do you have non-bake receipes in your cookbook?"}, {"text": "So glad to hear about the cookbook.   It will  be an absolutely must-have!<br /><br />BTW I have to LOL when I go to type Bigger Bolder Baking in YouTube&#39;s search engine and the first suggestion to pop up is always &quot;Bigger Buttocks Workout&quot;.    It&#39;s as if they know me."}, {"text": "I don’t always buy a cookbook but when I do, it’s gonna be your book, Gemma."}, {"text": "waiting for u to do this video"}, {"text": "always love u gemmaaa"}, {"text": "Looking forward to it! Yay!"}, {"text": "Gemma, I’m so proud of you! You have grown and have come such a long way, and of course you have, after having all those amazing recipes! I already know that the cookbook is going to be amazing! I hope you keep growing and reach even higher levels of success! And Thank You for selflessly sharing such wonderful recipes with us! ❤️"}, {"text": "So long since I&#39;ve watched your videos! I remember, about a few months ago, I used to always binge watch your videos (7-8 months ago).<br />I am so happy for you! I bought Rosanna Pansino&#39;s cookbook and hope to buy yours soon! ♥️ ♥️"}, {"text": "Love you Gemma,we are crazy about your ice-creams...many kisses from Greece and congratulations for your book!"}, {"text": "Gemma, I’m so happy for you and the whole Bigger Bolder Baking. If your book becomes available in the Philippines, I will definitely buy it. Hope you’ll have a book signing in the future, That will be a dream come true. Congratulations Gemma! I’m so proud of you..."}, {"text": "Congratulations on the book. Your recipes look like work of art not just recipes. Awesome."}, {"text": "Could you please do a video on homemade ice cream rolls, would love to be able to try them at home?"}, {"text": "Congratulations for Your New Venture Your Book . God bless you dear all the very best to u. 👍👍👏👏💞💝"}, {"text": "I never bought a cook book from any YouTube but I&#39;m sure I&#39;m buying yours..👊❤❤😍🥰"}, {"text": "Just preordered my copy! I can’t wait to see all the bigger bolder delicious treats I can bake once it comes! 😋"}, {"text": "Congratulations Gemma👍❤👌❤"}, {"text": "U r my inspiration of being a professional chef...i am just 10 yrs old"}, {"text": "i want one! &amp; i want to work with you even without pay 😊"}, {"text": "Nice one Gemma! Congrats! 🤩"}, {"text": "I hope your cookbook becomes a success"}, {"text": "These desserts are so fancy and super duper gorgeous !!!!!!!!!!!!!!!!!!!"}, {"text": "I just love you and your channel. I have learned so much from you. Thank you Gemma! Looking forward to seeing your book here in Australia. Well done💕😋😍💕"}, {"text": "That looks great! Congratulations! 🎂🎈 Will the book be available in The Netherlands? I&#39;d love to have it in my collection!! ❤️❤️❤️"}, {"text": "Baked the best ever chocolate cake for my birthday and it was UNREAL!! Pre ordered you book now and I&#39;m definitely trying more recipes. Thanks ❤"}, {"text": "Good luck with your cookbook. You deserve it!"}, {"text": "Can&#39;t wait to get my hands on this legendary book! So excited😁"}, {"text": "Goooooooooo, Gemma!!!!!!!! So so so happy to see this! I&#39;ve been sending you cookbook vibes 🇮🇪 Thank you for teaching us to be bigger, bolder bakers in such an easy, fun way! Congratulations!! The next thing I hope you do is an actual TV show!! Best to you!!"}, {"text": "🙀🙀😻😻"}, {"text": "Congratulations gemma🤗😍😊"}, {"text": "This is best book"}, {"text": "Will this be an Ebook or audible?-"}, {"text": "No I think of Southern ladies can make it better especially when it comes to a pecan pie on the South women can make it better"}, {"text": "You should do colab with Rosanna Pansino"}, {"text": "Gorgeous photography!"}, {"text": "Hi Gem-ma!<br />I am thrilled to see and be a part of(albeit tiny! ) part of your success!  I can&#39;t wait until you announce your television debut! <br />--dear Food Network and/or Cook TV, please be advised that Bigger Bolder Baker star Gem ma,  should be your next new talent premiere!!"}, {"text": "Good luck!!!!"}, {"text": "Looks so good!! 👍👍👍"}, {"text": "Interested to know what are people&#39;s favourite recipe if yours???"}, {"text": "Thank you so much for sharing Gemma and congratulations!"}, {"text": "I&#39;ve been following over the years! And you&#39;re worthy of every recognition you get! True Talent here! ❤️❤️❤️"}, {"text": "Love your show and recipes🍰🍪🍕.  Would it be possible to pre-order a signed copy of your book? Congratulations on it😍"}, {"text": "Ur confidence for this baking comes out in this beautiful art form. Congratulations Gemma. Keep going👍"}, {"text": "I love baking. Jemma, you have given me the courage to bake on a daily basis. Thank you. I can&#39;t wait to get the book. I just wish that it was on Audible so that I could hear your lovely lilt giving me instruction."}, {"text": "When does your cookbook come out, &amp; how much? Thanks so much for your videos"}, {"text": "Will I find any sugarfree or diabetic friendly recipes in there."}, {"text": "All those things you’ve made look so amazing!!!"}, {"text": "WOW !!! Can&#39;t wait for it!!! &lt;3"}, {"text": "Congrats Gemma and the BBB team on your first cookbook!!! I&#39;m so happy and proud to be a bold baker :)"}, {"text": "You are the reason that made me and make others cook with confidence, thank you from the heart"}, {"text": "I thought you said Bacon😎"}, {"text": "I want your book! Your recipe&#39;s are made for people like me who have terrible ovens lol. It just never fails whereas other recipes were made for professional ovens with circulating air and so on and so forth."}, {"text": "Congratulations Gemma, wishing you great success with this book and all your future endeavours!!"}, {"text": "Will the cookbook have your awesome pancake recipes?"}, {"text": "Congratulations!! 😁🎉💙"}, {"text": "Congratulations!"}, {"text": "Thank you so much Gemma for inspiring everyone 🥰"}, {"text": "Hi Gemma! Thank you for giving us a peek inside, but now I am feeling I can&#39;t wait until September!🙆‍♀️ oh Gemma it all looks so gorgeous!! &amp; Delicious 😍. You described your philosophy in such a lovely way, but I must say it gave me a warm feeling when you said you were the head of a baking community 👩‍🍳. PS- I couldn&#39;t wait , ordered my niece Sevda a copy along with chef hat &amp; apron . She is only 5, but she has the passion! &amp; she is Big and Bold 🤗❤💚❤"}, {"text": "Congratulations"}, {"text": "I would love to buy your first ever cookbook"}, {"text": "Is delivery of your cookbook possible t India ? I saw it on Amazon but is delivery available to India"}, {"text": "SO SO SO PROUD AND SO EXCITED ❤️❤️❤️❤️❤️❤️"}, {"text": "Thank you for sharing all your great recipes ....love them ♥️"}, {"text": "Hi Gemma ....☺️"}, {"text": "I keep meaning to buy two or three differently-sized offset spatulas.  Occasionally I&#39;ll see them, like in the video, then totally forget!"}, {"text": "Nice"}, {"text": "Doesn&#39;t that cake look so good, Gemma? I&#39;m literally licking the screen, cuz it&#39;s that good. 😝😝😝"}, {"text": "Is this book available in Pakistan ???"}, {"text": "Congrats Gemma... Wish you great success with your book... <b>awesome</b>"}, {"text": "Gemma congratulations on your first cookbook, if the trailer seems so awesome then the actual book will be hella awesome!!! I can’t wait to make everything from your book!!! You’re literally my favorite and I don’t know if there is any recipe I made which wasn’t of yours. Thank you for giving delicious recipes and thank you for this glorious cookbook!!!!!!!!!!"}, {"text": "Congratulations to you for book.👍👍👍👍👌👌👌"}, {"text": "You should make pavlova!"}, {"text": "Amazing"}, {"text": "So proud of you💖💖👍"}, {"text": "I&#39;ve been watching this channel since 2014 and I&#39;m so happy for your first book! I&#39;m really proud to be part of this community!"}, {"text": "So proud of you! <br />Congratulations!!!!!!!"}, {"text": "I&#39;m so excited and ready for this cookbook. Thanks so much!"}, {"text": "I will ask my mum to order a copy. Can you post to Northern Ireland? Thank you"}, {"text": "Power to you Gemma. Every member of community is happy for you. Love from a &#39;&#39;beginning to be a bold baker&#39;. ❤❤"}, {"text": "Nailed,  ooops"}, {"text": "Hmmmm... Great and Delicious Recipes!! Thank you for sharing it to us... God bless you more and again Congratulations for your First ever Cookbook!! 😘 - Louven"}, {"text": "I need this book"}, {"text": "There&#39;s not a recipe that I&#39;ve ever made of yours that wasn&#39;t the bomb....I think you have nail every one that I&#39;ve ever made!"}, {"text": "Hey hun, first I want to congratulate you for you new cookbook, I know it&#39;s gonna be a hit. In addition, I want to thank you for creating such amazing recipes for us, just made your best-ever chocolate cake and it was oh so good. I wish you and your channel more success in the coming days and keep going!"}, {"text": "Are there eggless options in the book Gemma?"}, {"text": "Plz make mayonnaise and also congrats for launching (probably) the cook book"}, {"text": "I can’t wait I already have a copy pre-ordered!!!!"}, {"text": "Yum looks delicious buying your cookbook soon my comment is still there on instagram anymore videos with liv i miss her videos tell waffles i love him soooooooooo much and i say hi to him love dogs cant wait to pat waffles while am in usa in September tell waffles he is my friend drooling over my samsung galaxy j4 love your videos making me hungry Thanks Ramya"}, {"text": "💖💖💖💖💖💖💟💟💟💟💟💟💟"}, {"text": "Gemma, I am so happy and proud of you :) You deserve it and more! Congratulations♥"}, {"text": "I can add one to the list:<br />3 ingredient no bake nutella marshmallow pie.<br />Crust: Graham crackers + marshmallows.<br />Filling: Nutella and marshmallows.<br />Topping roastered marshmallows."}, {"text": "I&#39;m so excited for this! More power to you Gemma 😁❤️"}, {"text": "Thank you so much for sharing all of your recipes and thanks for making it so simple. Lots of hugs for you Gemma 😘"}, {"text": "Love your baking tips thanks alot princess...you are a queen of baking... be happy always from pakistan"}, {"text": "Beautiful video 🌟🌟🌟🌟🌟"}]